{
    "pageid": 27617,
    "ns": 0,
    "title": "198 (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{MessageBox \n| Message = \nThis page is dedicated to the group of mutants who set up residence on the Xavier Institute.<br>\nFor the list of all powered and depowered mutants see [[Decimation]] page.<br>\nFor the list of [[Homo superior|mutants]] cataloged by the US government, see [[:Category:Post-M-Day Mutants (The 198)|\"The 198\"]].\n}}\n\n{{Marvel Database:Team Template\n| Image                   = 198 (Earth-616) from Civil War X-Men Vol 1 4 0001.jpg\n| Name                    = The 198\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Xavier's School for Gifted Youngsters|Xavier Institute]], [[Salem Center]], [[Westchester County]], [[New York (State)|New York]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Thomas Jones (Earth-616)|Alchemy]], [[Philippa Sontag (Earth-616)|Arclight]], [[Beautiful Dreamer (Morlock) (Earth-616)|Beautiful Dreamer]], [[Caliban (Earth-616)|Caliban]], [[Han, Chang, Lin, Sun, and Ho Tao-Yu (Earth-616)|Collective Man]], [[Lillian Crawley (Earth-616)|Diamond Lil]], [[Manuel de la Rocha (Earth-616)|Empath]], [[Erg (Earth-616)|Erg]], [[Fever Pitch (Earth-616)|Fever Pitch]],  [[John Zander (Earth-616)|Jazz]], [[Johnny Dee (Earth-616)|Johnny Dee]], [[Leech (Earth-616)|Leech]], [[Lorelei Travis (Earth-616)|Lorelei]], [[Amara Aquilla (Earth-616)|Magma]], [[Maximus Jensen (Earth-616)|Mammomax]], [[Absolon Mercator (Earth-616)|Mister M]], [[Inez Temple (Earth-616)|Outlaw]], [[Peter Quinn (Earth-616)|Peepers]], [[Sack (Earth-616)|Sack]], [[John Greycrow (Earth-616)|Scalphunter]], [[Sally Blevins (Earth-616)|Skids]], [[Mortimer Toynbee (Earth-616)|Toad]], as well as several unidentified/unidentifiable mutants.\n\n| Allies                  = \n| Enemies                 = [[Office of National Emergency (Earth-616)|O*N*E]],  [[Sentinel Squad O*N*E (Earth-616)|Sentinel Squad O*N*E]], [[Demetrius Lazer (Earth-616)|General Lazer]], [[Purifiers (Earth-616)|Purifiers]], [[Purity (Earth-616)|Purity]], [[Johnny Dee (Earth-616)|Johnny Dee]], [[Sapien League (Earth-616)|Sapien League]]\n\n| Origin                  = A group of [[Homo superior|mutants]] retaining their powers after the results of [[Decimation|M-Day]] and gathered in the [[Xavier Institute]].\n| PlaceOfFormation        = [[Xavier's School for Gifted Youngsters]]\n| PlaceOfDissolution      = \n| Creators                = David Hine; Jim Muniz\n| First                   = X-Men: The 198 #1\n| Last                    = Civil War: X-Men #4\n\n| HistoryText             = \n===Formation===\nAfter altering reality so Mutants were the dominant race on Earth, the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] then changed reality once again, this time attempting to rid the world of the mutant gene. Nearly 90% of the world's mutants lost their powers overnight. \n\nWith few mutants left after M-Day, [[Scott Summers (Earth-616)|Cyclops]] opened the Xavier Institute to any mutant who needed refuge in that most difficult time. [[Sentinel Squad O*N*E (Earth-616)|Sentinel Squad O*N*E]] was formally activated by the [[President]] and dispatched to the Xavier Institute to monitor the remaining mutants. They got into a brief quarrel with the X-Men but stopped after [[Emma Frost (Earth-616)|Emma Frost]] revealed the Sentinel units were piloted. The two groups then joined forces when the mutant-hating fanatical group known as the [[Sapien League (Earth-616)|Sapien League]] attacked the Mansion. The Squad remained stationed outside of the Xavier Institute to monitor the status of the mutants living there.\n\nThe first few mutants to arrive were [[Maximus Jensen (Earth-616)|Mammomax]], [[Erg (Earth-616)|Erg]], [[Peter Quinn (Earth-616)|Peepers]], and [[Inez Temple (Earth-616)|Outlaw]]. Shortly, the group grew to include [[Mortimer Toynbee (Earth-616)|Toad]], [[Lorelei Travis (Earth-616)|Lorelei Travis]], [[Johnny Dee (Earth-616)|Johnny Dee]], [[Sack (Earth-616)|Sack]], [[Fever Pitch (Earth-616)|Fever Pitch]], [[John Zander (Earth-616)|Jazz]], [[Xi'an Coy Manh (Earth-616)|Karma]], [[Sally Blevins (Earth-616)|Skids]], [[Philippa Sontag (Earth-616)|Arclight]], [[Caliban (Earth-616)|Caliban]] and [[Leech (Earth-616)|Leech]], [[Han, Chang, Lin, Sun, and Ho Tao-Yu (Earth-616)|Collective Man]], [[Lillian Crawley (Earth-616)|Diamond Lil]], [[Beautiful Dreamer (Morlock) (Earth-616)|Beautiful Dreamer]], and [[Manuel de la Rocha (Earth-616)|Empath]], among many others. \n\nThey were forced to live in tents as most of the mansion had been destroyed in the battles between the Sentinels and the Sapien League. Many, if not all residents, did not like the Sentinels guarding over them and the lack of direction. They soon named themselves the '198', in reference to the supposed total amount of remaining mutants on the planet according to [[Cerebra (Mutant Detector)|Cerebra]], and raised a flag with that number on it. \n\n===Mr. M===\nWhen the powerful mutant [[Absolon Mercator (Earth-616)|Mr. M]] arrived to the Institute, he took out a Sentinel because it had come close to stepping on a rare caterpillar. Later, Mr. M displayed his amazing powers by regrowing out Lorelei's hair. The X-Men and the O*N*E* Squad were both uncomfortable with him and were unsure how to approach the matter. When Erg attempted to leave the grounds, a battle ensued, only to be ended by Mr. M.\n\nSome feared that they would have to stay there a long time when [[Valerie Cooper (Earth-616)|Valerie Cooper]] revealed plans to build more permanent facilities. When some demanded to leave, Cooper wouldn't allow it, but instead allowed them to go around a nearby town on the condition that they would wear electronic tags for tracking purposes. When Mammomax was ridiculed by a human he tried to attack, but his tag shocked him. The 198 were upset that the tags were capable of harming them.\n\nMeanwhile, Jazz was trying to buy some drugs when Johnny Dee used his mutant power to strangled his small Jazz doll, choking the real Jazz to death. When the 198 learned of Jazz's death, they blamed the tags and started a riot. The situation quickly grew out of control and Mr. M and Lorelei decided to leave and invited all 198 members to join them. The Sentinels could only watch as they left. \n\nWhen the Sentinels and the X-Men followed them to a nearby island, Mr. M proved himself more than a threat to both of them. When [[John Greycrow (Earth-616)|Scalphunter]] threatened [[Henry McCoy (Earth-616)|Beast]], Lorelei tried to stop him, only for him to hit her. That was when Mr. M lost it. Meanwhile, [[Demetrius Lazer (Earth-616)|General Lazer]] agreed to allow Johnny Dee to deal with the threat. Johnny Dee used his Leech doll to cancel Mr. M's power. When Mr. M was down, Dee used his Magma doll to incinerate Mr. M. Later, when Lorelei and Leech watched over Mr. M's coffin, he seemed to evolve, giving the 198 hope.\n\n===Apocalypse===\n[[En Sabah Nur (Earth-616)|Apocalypse]] soon came and offered the 198 salvation, to their curiosity. When [[Shiro Yoshida (Earth-616)|Famine]] attacked, making all of the hungry, Apocalypse claimed his elixir could heal them. Apocalypse took down the Sentinels as they drank his elixir. But when the elixir was destroyed during the battle, Apocalypse left. The 198 continued to live at the institute for a while longer witnessing the attacks of [[William Stryker (Earth-616)|William Stryker]] and the [[Children of the Vault (Earth-616)|Children of the Vault]]. \n\n===Civil War===\nSoon another riot broke out, this time led by Caliban and Erg. It was discovered to be distraction for [[Neena Thurman (Earth-616)|Domino]] and [[Gaveedra Seven (Mojoverse)|Shatterstar]] to free the 198. Roughly half escaped with Domino on an aircraft and went to an abandoned SHIELD base. Iron Man placed [[Lucas Bishop (Earth-1191)|Bishop]] in charge of finding the 198. \n\nThe X-Men concluded that if the 198 were found, there would be fatalities. The X-Men discovered where the base was, but Domino wouldn't let them in. Meanwhile, General Lazer gave Johnny Dee a sample of Cyclops' DNA, and with it they discovered where the X-Men and the 198 were located. General Lazer forced Johnny Dee to make Cyclops attack Bishop to prove that mutants were dangerous. When the 198 tried to help, he forced some 198 members to attack. Johnny Dee reached his limit, however, as he could only control one doll at a time. \n\nWhen Val Cooper learned of Lazer's plan, she arrested him. However, she was too late, and he set off some weapons that would go off soon in the SHIELD base. When she interrogated him, he realized too late that Johnny had made a doll of him, and Johnny killed him. With the help of [[Anthony Stark (Earth-616)|Iron Man]] and [[Carol Danvers (Earth-616)|Ms. Marvel]], the X-Men managed to get in and rescue the 198 and the weapons exploded. Leech stopped Cyclops' power from going ballistic, Johnny Dee was arrested, and the 198 were given total amnesty, to come and go wherever they choose.\n\n===Aftermath===\nMost of the 198 [[Manifest Destiny|relocated]] to [[San Francisco]] with the X-Men, then later to [[Utopia (X-Men Base)|Utopia]] after [[Utopia (Event)|San Francisco riots]].\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each teammates' arsenal\n\n| Notes                   = \n\n| Trivia                  =  \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "27617"
}