{
    "pageid": 9145,
    "ns": 0,
    "title": "All-Winners Squad (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = All-Winners Squad (Earth-616) from All Winners Comics 70th Anniversary Special Vol 1 1 0001.jpg\n\n| ImageSize               = 250px\n| Name                     = All-Winners Squad\n| Aliases                  = [[Invaders]]{{r|Captain America Annual #6}}\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[United States of America]]; [[England]], [[United Kingdom]], [[Europe]].\n\n| Leaders                 = Formerly [[William Nasland (Earth-616)|Captain America (Nasland)]]\n| CurrentMembers          = \n| FormerMembers           = \n[[William Nasland (Earth-616)|Captain America (Nasland)]], [[Fred Davis Jr. (Earth-616)|Bucky (Davis)]], [[Namor McKenzie (Earth-616)|Sub-Mariner]], [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]], [[Madeline Joyce (Earth-616)|Miss America]], [[Robert Frank (Earth-616)|Whizzer]], [[Louise Grant (Earth-616)|Blonde Phantom]], [[Jeffrey Mace (Earth-616)|Captain America (Mace)]]\n| Allies                  = [[Thomas Halloway (Earth-616)|Angel]], [[Roger Aubrey (Earth-616)|Destroyer]], [[Brian Falsworth (Earth-616)|Union Jack]], [[Elizabeth \"Betsy\" Ross (Earth-616)|Golden Girl]], [[Mary Morgan (Earth-616)|Miss Patriot]]\n| Enemies                 = [[Simon Meke (Earth-616)|Isbisa]], [[Future Man (Earth-TRN698)|Future Man]], [[Madame Death (Earth-616)|Madame Death]], [[Aleksey Lebedev (Earth-616)|Red Guardian]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Bill Finger; Syd Shores\n| First                   = All Winners Comics #19\n| First2                  = {{g|Historically}}<br>{{sld|What If? #4}}{{g|Chronologically}}\n| Last                    = All Winners Comics 70th Anniversary Special #1\n\n| HistoryText             = ===Origins===\n\nThe All-Winners Squad derives its origins to the period following the end of [[World War II]], and the defeat of [[National Socialist German Workers Party (Earth-616)|Nazis]] and [[Imperial Japan (Earth-616)|Imperial Japan]] in 1945. [[Harry Truman (Earth-616)|President Harry Truman]] had decided to keep the [[Invaders (WWII) (Earth-616)|Invaders]] active, recruiting the second [[William Nasland (Earth-616)|Captain America]], [[Fred Davis Jr. (Earth-616)|Bucky]], [[Namor McKenzie (Earth-616)|Sub-Mariner]], [[Jim Hammond (Earth-616)|Human Torch]], and [[Thomas Raymond (Earth-616)|Toro]], as well as [[Robert Frank (Earth-616)|Whizzer]] and [[Madeline Joyce (Earth-616)|Miss America]] from the [[Liberty Legion (WWII) (Earth-616)|Liberty Legion]] which had recently disbanded.{{r|What If? #4}} They operated with government liaison [[Elizabeth \"Betsy\" Ross (Earth-616)|Betty Ross]].{{r|Captain America: Patriot #1}}\n\n===1946===\n\nOn one of their earliest missions, the All-Winners Squad were gathered by the Torch and alerted of a threat by a villain calling himself [[Simon Meke (Earth-616)|Isbisa]], who had crafted a number of crimes based on the different ages of men. He also created disunity in the team by planting a letter that made it appear that the Sub-Mariner was working with him, causing a rift between the team and the Torch to work solo for the first time in many years. Each team member tackled the various crimes, succeeding in stopping Isbisa's subordinates unaware that this was all a means of distracting the team in order for Isibsa to steal an atomic bomb. However, the All-Winners Squad soon deduced Isbisa's ultimate plan and tracked him down to the facility where the plans were being kept and easily captured the villain and turned him over to the authorities.{{r|All Winners Comics #19}}{{r|Giant-Size Avengers #1}}\n\nIn '''July of 1946''' the All-Winners Squad were dispatched to Boston for the 11th Congressional Race. There they soon found that the Human Torch's creator [[Phineas Horton (Earth-616)|Phineas Horton]] had created a new android dubbed [[Adam II (Earth-616)|Adam II]]. However, unlike the Human Torch, Adam II sought to conquer the world and plotted to replace Presidential hopeful [[John F. Kennedy (Earth-616)|John F. Kennedy]] with an android replacement. The All-Winners Squad was joined by the [[Jeffrey Mace (Earth-616)|Patriot]], who was covering the event in his civilian identity of reporter Jeff Mace. During the battle, Captain America was killed by some of Adam II's androids and the Patriot took his place and helped the All-Winners Squad destroy Adam II.{{r|What If? #4}} Taken in by the government for questioning, Mace was convinced to carry on as Captain America and act as the teams leader.{{r|Captain America: Patriot #1}}\n\nBy this time, Miss America had taken it upon herself to help keep the team popular in the eyes of the public. She commissioned out the groups likeness to comic book artist Otto Binder for an All-Winners Squad comic book about their adventures, and helped foster gossip in the papers about a potential romance between her and Captain America, even though she was really engaged to the Whizzer. The group also struggled to get alone, with Namor being highly critical of Mace taking over Captain America's role as he fought alongside the [[Steven Rogers (Earth-616)|original]] during World War II.{{r|All Winners Comics 70th Anniversary Special #1}}\n\nThe group next faced a threat from [[Future Man (Earth-TRN698)|Future Man]] a time traveller from the year One Million AD who had come back in time to wipe out the human race of the 20th Century so that his people could leave their dead world of the future and find a new home on an Earth that still was teeming with life. Future Man recruited the aid of female crime boss [[Madame Death (Earth-616)|Madame Death]] and plotted to wipe out the populations of each continent. Learning of this plot, the All-Winners Squad split up into teams to defend each continent, foiling each of Future Man's plots along the way. The entire group then attacked Future Man's ship and it was sent hurtling back in time a million years into the past in the aftermath of the battle.{{r|All Winners Comics #21}}{{r|Giant-Size Avengers #1}} The group hit more turbulence when the Whizzer finally confronted Miss America about his feelings about her \"romance\" with Captain America, when the group was suddenly attacked by what appeared to be zombified American soldiers who died in the war, among them the apparent reanimated corpses of the original Captain America and [[James Buchanan Barnes (Earth-616)|Bucky]]. The zombie heroes tried to convince the current Cap and Bucky that they could exchange their lives to live again. Still uncomfortable with is role as leader of the All-Winners Squad, Jeff almost accepted when the Human Torch realized it was all a trick. Destroying the impostors, the heroes soon found that they were created by Madame Death, who returned from the distant past to get revenge against the All-Winners Squad after Future Man died of an ancient disease. During the course of the battle, Madame Death detonated her hover platform, destroying the All-Winners Squad base, and striking herself with a lethal piece of shrapnel. With the battle over, the team then had to consider a new headquarters. Jeff Mace suggesting that they take up residence within the [[Baxter Building]].{{r|All Winners Comics 70th Anniversary Special #1}}\n\nIn the summer of that year, the All-Winners Squad was briefly joined by [[Louise Grant (Earth-616)|Blonde Phantom]]. When the FBI learned of a plot to steal \"Rosebud\" an atomic bomb that was being shipped out of Las Vegas, the All-Winners Squad was sent out to prevent it from being stolen. They failed to stop mobster Dutch Rosenblatt from stealing the bomb as he was being assisted by a time travelling [[Jennifer Walters (Earth-616)|She-Hulk]] and [[Wanda Mason (Earth-616)|Wanda Mason]] (The Blonde Phantom's daughter from the future). She-Hulk easily trounced the All-Winners Squad and they escaped with the bomb, but were unaware that the Blonde Phantom had climbed aboard their truck. The heroine forced the truck to crash, but She-Hulk knocked out Blonde Phantom and Dutch Rosenblatt then stashed the atomic bomb so she could recover it when she returned to her present.{{r|Sensational She-Hulk #22}} Following this adventure, Blonde Phantom apparently quit the team.\n\nIn '''September 1946''' the team were sent to England to prevent atomic scientist Dr. Klaus Fuschs from being captured by Russian operatives led by the [[Aleksey Lebedev (Earth-616)|Red Guardian]] who soon figured out that the Captain America he was fighting against was not the original hero. Despite this, the All-Winners Squad succeeded in keeping Fuschs out of Russian hands and forced the Russian operatives to retreat. Upon their return to the United States, Captain America addressed the press regarding their recent adventure. Hearing this report was Jeff's old reporter friend [[Mary Morgan (Earth-616)|Mary Morgan]] who had also become the costumed crime fighter Miss Patriot. She then came to visit Jeff at the All-Winners Squad's temporary headquarters. Having too many drinks she offended Jeff by asking to be his new Bucky and he threw her out before she could tell him that their old friend [[Jack Casey (Earth-616)|Jack Casey]] had died recently. When Captain America learned the truth, he wanted to attend the funeral. However, revelations that Jack was discharged from the military due to his homosexuality put the government in the position to deny allowing Captain America to go for fear of the image it would portray. The All-Winners then supported Jeff's decision to attend the funeral and deliver the eulogy in his old Patriot costume. When the funeral was over, the public reaction put an end to the Patriot's career. Afterword, Jeff had the Torch burn his costume. The Sub-Mariner's harsh recriminations about how Jeff ruined his legacy as the Patriot landed the undersea monarch with a punch to the jaw.{{r|Captain America: Patriot #2}}\n\n===1947–1950===\n\nMost of the All-Winners Squad's later exploits are unknown. In '''August 1947''' the group battled Communist agents posing as \"Little Green Men\". The group also shared a mission with [[Brian Falsworth (Earth-616)|Union Jack]], [[Roger Aubrey (Earth-616)|Destroyer]], and [[Thomas Halloway (Earth-616)|Angel]], inspiring the trio to eventually form the [[V-Battalion (Earth-616)|V-Battalion]] a few years later.{{r|Citizen V and the V-Battalion #1}}\n\nIn '''August 1948''' construction on their new Baxter Building headquarters was in full swing. The group was starting to grow together, although the Sub-Mariner still had his differences with Jeff Mace in his role as Captain America. The group spent a day at the Baxter Building celebrating Jeff Mace's birthday. Later that night Bucky was gunned down while he and Captain America were on a solo mission together.{{r|Captain America: Patriot #2}} The All-Winners Squad came to Captain America's side as doctors performed surgery on Bucky. They all offered to help Cap capture the person responsible for shooting Bucky, by Captain America insisted on having 24 hours to capture the shooter alone, worrying the team, who suspected that Captain America knew who shot his partner. Eventually Captain America, with the aid of Betsy Ross (in her costumed identity of Golden Girl) captured the shooter, a criminal named [[Lavender (Earth-616)| Lavender]]. After the battle, Captain America then decided to leave the group to work solo again with Golden Girl as his new partner while Bucky recovered from his injuries. The revelation shocked the group, however the Sub-Mariner had grown to respect Jeff and finally considered him worth the title of Captain America.{{r|Captain America: Patriot #3}}\n\nShortly after Captain America and Bucky left the team, the other members of the All-Winners Squad drifted apart. The Human Torch was sprayed with Solution X-R by Soviet spies and buried in the Nevada desert for a number of years, forcing Toro to retire from heroics.{{r|Young Men Vol 1 #24}} While the Sub-Mariner was stripped of his memories when [[Atlantis]] was attacked by [[Paul Destine (Earth-616)|Destiny]].{{r|Sub-Mariner #1}} Miss America and the Whizzer eventually retired from super-heroics to become government agents.{{r|Giant-Size Avengers #1}}\n\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n\n| Trivia                  = \n| Links                   = [http://www.reocities.com/jjnevins/aws.html]\n}}\n[[Category:Allied Organizations]]"
                }
            }
        }
    ],
    "page_id": "9145"
}