{
    "pageid": 2903,
    "ns": 0,
    "title": "Alpha Flight (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Alpha Flight Vol 4 6 Textless.jpg\n| ImageSize               = 300\n| Name                    = [[Alpha Flight]]\n| Aliases                 = Alphans{{r|Alpha Flight Vol 1 12}}, [[Flight (Earth-616)|The Flight]]\n| Distinguish1            = Alpha Flight\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Alpha Flight Base Camp, Saint Elias Mountains [[Canada]]; Formerly [[Department H (Toronto)]], [[Ontario]], Canada; [[Department H (Ottawa)]], Ontario, Canada; [[Mansion Alpha]], [[British Columbia]], Canada; [[Maison Alpha]], [[Edmonton]], [[Alberta]], Canada\n\n| Leaders                 = [[James Hudson (Earth-616)|Guardian (Hudson)]]; formerly [[Heather McNeil(Earth-616)|Guardian (McNeil)]], [[James Hudson (Clone) (Earth-616)|Guardian (clone)]]\n| CurrentMembers          = [[James Hudson (Earth-616)|Guardian (Hudson)]], [[Marrina Smallwood (Earth-616)|Marrina]], [[Jean-Paul Beaubier (Earth-616)|Northstar]], [[Eugene Judd (Earth-616)|Puck (Judd)]], [[Michael Twoyoungmen (Earth-616)|Shaman]], [[Narya (Earth-616)|Snowbird]], [[Elizabeth Twoyoungmen (Earth-616)|Talisman]]\n| FormerMembers           = [[Jeanne-Marie Beaubier (Earth-616)|Aurora]], [[Roger Bochs (Earth-616)|Box (Bochs)]], [[Madison Jeffries (Earth-616)|Box (Jeffries)]], [[Rutherford Princeton III (Earth-616)|Centennial]], [[Lillian Crawley (Earth-616)|Diamond Lil]], [[Charles Moss (Earth-616)|Earthmover]], [[Adrian Corbo (Earth-616)|Flex]], [[Lilli Stephens (Earth-616)|Ghost Girl]], [[Goblyn (Earth-616)|Goblyn]], [[Louis Sadler, Jr. (Earth-616)|Major Mapleleaf (Sadler, Jr.)]], [[Bernie Lachenay (Earth-616)|Manbot]], [[Mar (Earth-616)|Mar]], [[Arlette Truffaut (Earth-616)|Murmur]], [[Jane Thorne (Earth-616)|Nemesis (Thorne)]], [[Amelia Weatherly (Earth-616)|Nemesis (Weatherly)]], [[Kara Killgrave (Earth-616)|Persuasion]], [[Zuzha Yu (Earth-616)|Puck (Yu)]], [[Jared Corbo (Earth-616)|Radius]], [[Sasquatch (Beast) (Earth-616)|Sasquatch (Beast)]], [[Walter Langkowski (Earth-616)|Sasquatch (Walt Langkowski)]], [[Shiro Yoshida (Earth-616)|Sunfire]], [[Heather McNeil (Earth-616)|Vindicator (McNeil)]], [[James Hudson (Clone) (Earth-616)|Vindicator (Clone)]], [[Kyle Gibney (Earth-616)|Wild Child]], [[Colin Hume (Earth-616)|Windshear]], [[Ananym (Earth-616)|Witchfire]], [[James Howlett (Earth-616)|Wolverine]], [[Wyre (Earth-616)|Wyre]], [[Yukotujakzurjimozoata (Earth-616)|Yukon Jack]]\n| Allies                  = [[Beta Flight (Earth-616)|Beta Flight]], [[Gamma Flight (Earth-616)|Gamma Flight]], [[Omega Flight (Heroes) (Earth-616)|Omega Flight (Heroes)]], [[Flight (Earth-616)|The Flight]], [[X-Men (Earth-616)|X-Men]], [[Avengers (Earth-616)|Avengers]]\n| Enemies                 = [[Alpha Strike (Earth-616)|Alpha Strike]], [[Eshu (Earth-616)|Master of the World]], [[Omega Flight (Jaxon) (Earth-616)|Omega Flight (Jaxon)]], [[Omega Flight (Master) (Earth-616)|Omega Flight (Master)]], [[Llan (Earth-616)|Llan the Sorcerer]], [[Dreamqueen (Earth-616)|Dreamqueen]]\n\n| Origin                  = Formed by the Canadian government as a super-human response unit.\n| PlaceOfFormation        = [[Ottawa]]\n| PlaceOfDissolution      =\n| Creators                = Chris Claremont; John Byrne\n| First                   = X-Men Vol 1 120\n| Last                    = \n\n| Overview             = '''Alpha Flight'''{{r|X-Men Vol 1 120}} is the a [[Canada]]'s premier team of superheroes, which was organized under the auspices of the Canadian government's [[Department H (Earth-616)|Department H]]. After the passing of the [[Super-Powers Registration Act]] at Parliament.{{r|Alpha Flight #120}} The terms of the act entailed the government employment of all super-powered individuals, including [[Homo superior|Mutants]]. They are the top level of a three-tiered program; New recruits join [[Gamma Flight (Earth-616)|Gamma Flight]] the next level up join [[Beta Flight (Earth-616)|Beta Flight]]. The active members in the field who where tasked with dealing with any threats to the nation were in Alpha Flight.{{r|Alpha Flight #130}}\n\n| HistoryText             = \n===Origin===\nRoughly ten years ago, [[James Hudson (Earth-616)|James MacDonald Hudson]], an engineer, resigned for the Am-Can Petro-Chemical Company in [[Canada]] when he learned that a special super-powered suit he had built for the company for use in geological exploration was going to be used by the [[United States Of America|United States]] military instead. [[Heather McNeil (Earth-616)|Heather McNeil]], the executive secretary to Hudson's immediate superior, [[Jerome Jaxon (Earth-616)|Jerome Jaxon]], also resigned from the company. McNeil arranged for herself and Hudson to meet with officials of the Canadian government, who heard their story and settled with Am-Can for any damaged incurred when Hudson stole his prototype psycho-cybernetic helmet when he left the company. Hudson was then invited by the Canadian prime minister to participate in the creation of Department H, a top secret research and development agency within the Canadian Ministry of Defense.{{r|Alpha Flight #3}} Soon afterwards, Hudson married McNeil, and within the next few years, Hudson had recruited the mutant called [[James Howlett (Earth-616)|Wolverine]] as one of the Department's special agents.{{r|Alpha Flight #33|34}}\n\nReading a newspaper account of how [[Reed Richards (Earth-616)|Reed Richards]] and three of his friends became the [[Fantastic Four (Earth-616)|Fantastic Four]] inspired James Hudson to create a team of superhumanly powerful agents to go on missions for the Canadian government. Wolverine aided Hudson in the initial phases of the creation of the team, which would be called the [[Flight (Earth-616)|Flight]]. The Flight initially consisted of Wolverine, [[Jodi Furman (Earth-616)|Stitch]], [[Saint Elmo (Earth-616)|Saint Elmo]], [[Narya (Earth-616)|Snowbird]], [[Alexander Thorne (Earth-616)|Smart Alec]], and [[Sean Benard (Earth-616)|Sean Benard]] who became known as Groundhog after donning an early prototype of Hudson's super-suit. [[Walter Langkowski (Earth-616)|Walter Langkowski]] and Hudson acted as the support crew. The first mission pitted them against criminals led by [[Elihas Starr (Earth-616)|Egghead]] who planned to launch a nuclear missile into [[New York City]]. While the rest of the Flight battled the super-villains, Smart Alec attempted to disarm the missile, but ultimately failed forcing Saint Elmo to sacrifice himself to destroy the missile. The failure greatly disheartened Groundhog, who left very soon after the mission.{{r|Alpha Flight Special Vol 2 #1}}\n\nThe failure of the original Flight led to a massive reorganizing of procedure for the team. The standard procedure for recruits for Alpha Flight became that they would begin as members of a training team called Gamma Flight. Upon successfully completing their initial training, recruits would move into a transitional team, Beta Flight, to receive more advanced training. Those who proved to be successes in Beta Flight as well would finally join Alpha Flight, the team of agents who would participate in major missions.{{r|Alpha Flight #1}}\n\nWolverine eventually left Department H for his own reasons and joined the mutant heroes of the [[X-Men (Earth-616)|X-Men]]. Hudson continued to develop his super-powered suit, and it eventually became the costume that he himself wore as a member of Alpha Flight and reluctantly became the leader of Alpha Flight after Wolverine's resignation. Stitch's fate has ultimately never been revealed, and Smart Alec would be demoted down to [[Omega Flight (Jaxon) (Earth-616)|Gamma Flight]].\n\n[[File:Alpha Flight (Earth-616) from Wolverine Vol 2 171 0001.jpg|thumb|left|Alpha Flight: ([[Jeanne-Marie Beaubier (Earth-616)|Aurora]], [[Narya (Earth-616)|Snowbird]], [[James Hudson (Earth-616)|Guardian]], [[Eugene Judd (Earth-616)|Puck]], [[Michael Twoyoungmen (Earth-616)|Shaman]], [[Walter Langkowski (Earth-616)|Sasquatch]]]]\nAlpha Flight had eventually grown to six members: Hudson (as Vindicator), [[Michael Twoyoungmen (Earth-616)|Shaman]], Sasquatch, [[Jeanne-Marie Beaubier (Earth-616)|Aurora]], [[Jean-Paul Beaubier (Earth-616)|Northstar]], and Snowbird. One of their first recorded missions was to attempt to recapture the expatriate Wolverine, although they allowed him to continue his membership with the X-Men.{{r|X-Men #120|121}}\n\nSoon afterward, however, the entire Alpha Flight program and Department H was disbanded by the Canadian government for financial reasons.{{r|X-Men #140}} However, Canada was invaded by the [[Great Beasts (Earth-616)|Great Beasts]]. [[Tundra (Earth-616)|Tundra]], and the six members banded together with Beta Flight members [[Eugene Judd (Earth-616)|Puck]] and [[Marrina Smallwood (Earth-616)|Marrina]] to defeat the Beasts. The eight elected to continue acting as a team, although the majority of the members infrequently undertook the same mission, as the various members lived in different parts of Canada.{{r|Alpha Flight #1}}\n\nJames Hudson seemingly died in the course of Alpha Flight's first major battle with a group called [[Omega Flight (Jaxon) (Earth-616)|Omega Flight]].{{r|Alpha Flight #12}} Alpha Flight continued as a team with Heather acting in her husband's place as leader.{{r|Alpha Flight #13}} In time, Heather adopted her own costumed identity. From then on, membership fluctuated occasionally.{{r|Alpha Flight #32}} Other members would be inducted to the team as it continued, such as [[Elizabeth Twoyoungmen (Earth-616)|Talisman]], [[Roger Bochs (Earth-616)|Box]], and [[Madison Jeffries (Earth-616)|Madison Jeffries]], with others would leave for various personal reasons, such as Northstar and Snowbird.{{r|Alpha Flight #13|50}}\n\nThe Canadian government later resumed its funding of Alpha Flight, establishing for the team a headquarters on [[Tamarind Island]] off [[British Columbia]].{{r|Alpha Flight #29}} Over time, the relations between the government and the team grew strained. Canadian intelligence agent and Alpha Flight liaison [[Gary Cody (Earth-616)|Gary Cody]] searched for a way to keep Alpha Flight in line. He resurrected the being known as [[William Nowlan (Earth-616)|Bedlam]], who was created by Hudson in an early Department H program to create superhuman beings. Bedlam killed Cody and destroyed much of Department H before violently confronting Alpha Flight. Alpha Flight eventually thwarted the villain and his agents, but the team was nearly decimated.{{r|Alpha Flight #51|53}} In recuperating, the team found itself hopping from planet to planet and even dimension to dimension. When they finally returned to their reality, the team nearly caused an international incident in [[China]]. Alpha Flight effectively disbanded after this.{{r|Alpha Flight #54|61}}\n\nIn Alpha Flight's disappearance, the government created a new Gamma Flight to replace the team. The two teams clashed, and Alpha Flight was forced to stand trial. Ultimately, Alpha Flight rejected the government's support and decided to operate independently once more. Gamma Flight continued as the government-sponsored team, and the two teams eventually met again to fight the evil [[Llan (Earth-616)|Llan the Sorcerer]]. Gamma Flight was nearly destroyed in the final battle, but Llan was defeated.{{r|Alpha Flight #67|86}} Afterward, Alpha Flight was again reinstated as Canada's official superhero group, with members of Gamma and Alpha Flights reshuffling into various levels of Beta and Alpha Flight, as per Hudson's original vision of recruitment.{{r|Alpha Flight #87|90}}{{r|Alpha Flight #95}}\n\nSuperhuman registration came to Canada, under the influence of the Master of the World in a civilian identity, restricting Alpha Flight's ability to operate.{{r|Alpha Flight #118|120}} They eventually came head-to-head with the Master and his Antiguard, a newly resurrected version of James MacDonald Hudson. The Master was defeated, but Alpha Flight and Department H were left in disarray afterwards.{{r|Alpha Flight #128|130}}\n\nLater, Department H was reinstated by the Canadian government at unprecedented levels of funding. The Department sponsored many institutions, including an orphanage called [[Hull House]]. It also formed a new Alpha Flight, with an inexplicably teenaged version of [[James Hudson (Clone) (Earth-616)|Guardian]] leading the team.{{r|Alpha Flight Vol 2 #1}} In reality, Department H was involved in many clandestine and criminal activities, unknown to Alpha Flight. [[Jeremy Clarke (Earth-616)|General Clarke]] was the administrative head of Department H, who operated a hidden agenda and employed brainwashing techniques and Epsilon Flight guards to apprehend and coerce suspected traitors within Alpha Flight. It is unclear whether he had the official sanction of the Canadian government. Eventually, Clarke was opposed by Alpha Flight, but died a hero when Zodiac invaded Department H, so his crimes were never prosecuted.{{r|Alpha Flight Vol 2 #12}}\n\nClarke was replaced by [[Mr. Gentry (Earth-616)|Mr. Gentry]] at the request of the mysterious [[Director X (Department H) (Earth-616)|Director X]]. Although Gentry sought to change Department H for the better, banning all \"black projects\" and enforcing a kinder, friendlier attitude, he was still subject to the Director, whose true agenda remains unrevealed. Gentry believed the Department's primary focus should not just be Alpha Flight, but the people who make up Alpha Flight.{{r|Alpha Flight Vol 2 #13|14}}\n\nThe teenaged Guardian was eventually revealed to be a clone. The true Hudson was ultimately revived by the original Sasquatch, and the two formed their own version of Alpha Flight to confront Department H. The two versions of Alpha Flight soon reconciled and joined together as one.{{r|Alpha Flight Vol 2 #18|20}}\n\nWolverine subsequently helped the reformed team against the weapon-making terrorists of [[Advanced Idea Mechanics (Earth-616)|Advanced Idea Mechanics]], during which the team regained a former member in Snowbird, but lost the younger Guardian who sacrificed his life to ensure the team’s freedom.{{r|Wolverine Vol 2 #142|143}} Alpha Flight returned the favor by helping Wolverine defeat the cannibalistic sorcerer [[Jean-Pierre Beaubier (Earth-616)|Mauvais]].{{r|Wolverine Vol 2 #172}} Wolverine also briefly served as mentor to a new member, [[Charles Moss (Earth-616)|Earthmover]], who was being groomed to replace Shaman on the team.{{r|Wolverine Vol 2 #179|180}}\n\nAlpha Flight’s next challenge was of a very personal nature when Hudson was attacked and seemingly killed by an insane scientist who sought Heather’s affections for his own. Hudson survived thanks to the mutant healing abilities of the X-Men’s [[Warren Worthington III (Earth-616)|Angel]] and Heather gave birth to a [[Claire Hudson (Earth-616)|baby girl]].{{r|X-Men Unlimited #45}}\n\nThe team were later charged with retrieving all the young mutants from the X-Men’s home at the [[Xavier's School for Gifted Youngsters|Xavier Institute]], as the Attorney General's office, the Governor of [[Connecticut (State)|Connecticut]], and the Canadian government had deemed the school unsafe for children to inhabit. This led to a clash with the X-Men, which was quickly halted after the young mutant named [[Samuel Paré (Earth-616)|Sammy]] agreed to accompany the Canadian heroes home.{{r|Uncanny X-Men #421|422}} \n\nAfter the race of alien beings known as the [[Plodex]] targeted Alpha Flight and captured most of the team, Sasquatch set out to gather a new team of novice Canadian heroes to rescue them. Sasquatch offered membership to [[Yukotujakzurjimozoata (Earth-616)|Yukon Jack]] (king of a hidden civilization) and [[Zuzha Yu (Earth-616)|Zuzha Yu]] (daughter of Puck), but they both turned him down. Despite reviving [[Isabel St. Ives (Earth-616)|Nemesis]] from suspended animation and awakening [[Rutherford Princeton III (Earth-616)|Centennial's]] long-dormant powers, neither of them wanted to join either. Eventually tricking them all into becoming a part of the team, and joined by the new [[Louis Sadler, Jr. (Earth-616)|Major Mapleleaf]], son of the WW2 [[Louis Sadler, Sr. (Earth-616)|hero of the same name]], Sasquatch prepared them for a battle with the Plodex, who were responsible for the disappearance of the prior members. Discovering that the Plodex ship was full of unhatched eggs, the group hit a moral snag; although the Plodex were a warlike race, many members felt they still deserved a chance to change. The infighting stopped when the prior Alpha Flight decided to take the Plodex back to their home planet and raise them themselves. Sasquatch's group, along with a young Plodex named [[Mar (Earth-616)|Mar]] who stayed behind, were left to defend Canada. While out on a date Mapleleaf and Puck were attacked by wax duplicates of dozens of heroes, controlled by the [[Laurent Levessaur (Earth-616)|Manimator]], who Puck easily defeated with a left hook.{{r|Alpha Flight Vol 3 #1|8}} \n\n[[File:Michael Pointer (Earth-616) and Alpha Flight (Earth-616) from New Avengers Vol 1 16 0001.png|left|thumb|Alpha Flight decimated by the Collective]]\nFollowing a struggle with a mind-controlled [[Big Hero Six (Earth-616)|Big Hero 6]], events spiraled out of control when the team tried to use time travel to save former enemy [[Gardner Monroe (Earth-616)|Flashback]], whose future self had been killed in a previous battle. A series of efforts resulted in history being rewritten for the worse with each change they made. Sasquatch was ultimately able to enlist the past Shaman's help in stabilizing the timeline and save Flashback. This also brought a time displaced [[Alpha Flight (Earth-3514)|Alpha Flight]] from the past to the present. Soon after, Centennial and Nemesis apparently perished, Mar and Yukon Jack left, and Puck and Major Mapleleaf went to reserve status.{{r|Alpha Flight Vol 3 #9|12}}\n\nAlpha Flight sought to impede the progress of the supremely empowered [[Michael Pointer (Earth-616)|Michael Pointer]], but were decimated by his multitude of powers.{{r|New Avengers #16}}\n\nDuring the ''[[Chaos War]]'', Guardian, Vindicator, Shaman, and Marrina Smallwood returned from the dead after [[Amatsu-Mikaboshi (Earth-616)|Amatsu-Mikaboshi's]] victory in the death realms. They reunited with Aurora, Northstar, Sasquatch, and Snowbird when the Great Beasts appeared on Earth. They fight the Great Beasts until Amatsu-Mikaboshi appears and impales the Great Beasts.{{r|Chaos War: Alpha Flight Vol 1 1}}\n\nDuring ''[[Fear Itself]]'', Alpha Flight was shown protecting Canada from [[Attuma (Earth-616)|Attuma]] (in the form of [[Nerkkod (Earth-616)|Nerkkod: Breaker of Oceans]]). While Sasquatch, Shaman, and Vindicator was saving people, Guardian saved a news helicopter shot down by Nerkkod. As Aurora and Marrina Smallwood arrived to help fight Nerkkod, the female TV reporter from the helicopter commented to the viewers that Northstar wasn't with the team. After providing rescue efforts for the victims of the attack, Guardian managed to drive Nerkkod out of Canada by dumping him off the coast of Cape Race. Alpha Flight returned to their headquarters where they were betrayed by Gary Cody and his Unity Party. To make matters worse, Vindicator sided with Gary Cody.{{r|Alpha Flight Vol 4 1}} Six weeks earlier, Guardian and Vindicator had been unable to reclaim custody of their child Claire. Marrina was dehydrated, the gamma energy was drained from Sasquatch reducing him to Walter Langkowski, and the Unity Party had taken down Aurora and Snowbird as well. When Vindicator was bringing Guardian to the Box Units to be imprisoned, she was ambushed by Puck. After knocking out Vindicator, Puck told Guardian that he had just returned to life after his fight with [[Hadad (Earth-616)|Ba'al]].{{r|Alpha Flight Vol 4 2}}\n\nAt Parliament Hill, Walter was informed by Agent [[Jeff Brown (Earth-616)|Jeff Brown]] that the concussions he had when playing football would cause him to act less human the next time he changed back into Sasquatch and that he must achieve unity. Marrina pretended to give in to the Unity Party so she could break free. She managed to knock out Jeff and free Walter while Guardian freed Snowbird. Northstar and Puck found Marrina as Alpha Flight escaped. Alpha Flight soon learned that Gary Cody and his Unity Party were secret fascists.{{r|Alpha Flight Vol 4 3}} In order to find out where the Unity Party had taken [[Kyle Jinadu (Earth-616)|Kyle Jinadu]], Northstar abducted a Department H operative and used aerial torture in order to get the information out of him. After reclaiming Claire from her cousin, Vindicator assembled [[Alpha Strike (Earth-616)|Alpha Strike]] -- consisting of [[Kara Killgrave (Earth-616)|Persuasion]], [[Ranark (Earth-616)|Ranark]], a [[Georges Baptiste (Earth-616)|Wendigo]], and a brainwashed [[Citadel (Earth-616)|Citadel]] -- in order to spread the campaign of the Unity Party and to defeat Alpha Flight. In an undisclosed location, a captive Kyle Jinadu is confronted by the [[Eshu (Earth-616)|Master of the World]] where he revealed that he was behind the Unity Party, the formation of Alpha Strike, and what he did to Department H.{{r|Alpha Flight Vol 4 4}} Alpha Flight then robed a treasury in order to fund a resistance against the Unity Party. While in an isolated area in [[Yukon]] with a resistance, Alpha Flight enlisted [[Anthony Masters (Earth-616)|Taskmaster]] to help train the members of the resistance. Guardian, Sasquatch, and Shaman hatched a plan involving Aurora's bad personality.{{r|Alpha Flight Vol 4 5}} As Aurora's personality caused her to become unstable to herself and Alpha Flight, the Master of the World talked with Claire telling her about the Plodex. Alpha Flight managed to rescue Kyle Jinadu and they ran into Wolverine.{{r|Alpha Flight Vol 4 6}}\n\nWhile on a beach in [[Ontario]] with Claire, Vindicator was visited by Wolverine who stated that the people in the United States are starting to be concerned about the Unity Party's actions, and seeing Vindicator call the rest of Alpha Flight traitors caused him to investigate. Wolverine managed to find Alpha Flight and learn of their revolution against the Unity Party. Wolverine agreed to help Alpha Flight and the resistance just as Alpha Strike attacked. During Alpha Flight's battle with Alpha Strike, Alpha Flight managed to capture Persuasion as the component of a cure for the Unity Process. Alpha Flight, Taskmaster, and Wolverine were prepared to take Canada back as Master of the World comes out of hiding.{{r|Alpha Flight Vol 4 7}} The Master of the World began his attack on Parliament Hill with Agent Jeff Brown and Claire present on his spaceship. He even killed Gary Cody upon him serving his purpose. Guardian continued to fight Vindicator as she orders Alpha Strike to free Persuasion and destroy the machine that she was connected to. Alpha Flight managed to defeat Alpha Strike. Despite being under Master of the World's mind-control, Vindicator helped Alpha Flight fight Master of the World when he threatened to kill Claire. After the machine Alpha Flight made successfully freed the people from Master of the World's mental control, Master of the World was killed in battle. Vindicator flew off with Claire as the rest of Alpha Flight celebrated their victory with the Unity Party abolished.{{r|Alpha Flight Vol 4 8}}\n\nWhen the false [[Mayapan (Earth-616)|Mayan Gods]] returned to Earth, Alpha Flight assisted [[Red Hulk (Thaddeus Ross)|Red Hulk]] in fighting them.{{r|Hulk Vol 2 54}} One of the battles with the Mayan Gods ends up putting Aurora, Snowbird, and Sasquatch into comas. They were sent to Gamma Base and put into stasis tanks to recover. The recovery was quickened with the use of a magical totem and the three were all able to join their teammates and the Red Hulk in battling and defeating the returned Mayan Gods.{{r|Hulk Vol 2 52|57}}\n\n| Equipment               = * '''[[Guardian's Battle-suit]]'''\n| Transportation          = * '''[[Alpha Flight Omnijet]]'''\n| Weapons                 = Each team members' arsenal\n| Notes                   = \n| Trivia                  = \n| Links                   = \n* [http://www.alphaflight.net Alpha Flight.net]\n*[http://uncannyxmen.net/groups/alpha-flight Profile of the team in Uncanny X-Men.net] Detailed membership list and history of the team. \n}}\n[[Category:Alpha Flight]]\n[[Category:Department H Projects]]\n[[Category:Canadian Organizations]]"
                }
            }
        }
    ],
    "page_id": "2903"
}