{
    "pageid": 31012,
    "ns": 0,
    "title": "Ani-Mates (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "\n{{Marvel Database:Team Template\n| Image                   = Ani-Mates (Earth-616) from New Mutants Vol 1 58 0001.jpg\n| Name                    = Ani-Mates\n| Aliases                 = \n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Paradise (Island)|Paradise]]\n\n| Leaders                 = [[Bird-Brain (Earth-616)|Bird-Brain]]; Formerly [[Ani-Mator (Earth-616)|Ani-Mator]] (creator)\n| CurrentMembers          = [[Bolivar (Earth-616)|Bolivar]], [[Bufo (Earth-616)|Bufo]]\n| FormerMembers           = \n| Allies                  = [[Virusplague (Earth-616)|Virusplague]], [[New Mutants (Earth-616)|New Mutants]], [[Condor (Bird People) (Earth-616)|Condor]]\n| Enemies                 = [[Mutant Liberation Front (Earth-616)|Mutant Liberation Front]], formerly [[Virusplague (Earth-616)|Virusplague]], [[New Mutants (Earth-616)|New Mutants]] (under [[Virusplague (Earth-616)|Virusplague]]'s influence)\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Louise Simonson; Bret Blevins\n| First                   = New Mutants #58\n| Last                    = New Mutants Vol 3 40\n\n| HistoryText             = The Ani-Mates were created by the mad scientist [[Ani-Mator (Earth-616)|Frederick Animus]]. The Ani-Mator was hired by the anti-mutant organization the [[Right]] to study mutation, but he used their money to buy a private island he called [[Paradise (Island)|Paradise]] where he made a race of animal men. The Ani-Mates were produced in lettered batches, those the Ani-Mator deemed flawed were destroyed. He treated the Ani-Mates cruelly, withholding food, making them go through deadly mazes, and killing those he found lacking or just felt like killing. There was a special whistle the Ani-Mator used to control his creations.\n\n===New Mutants===\nOne of the Ani-Mates managed to escape eventually ending up with the [[New Mutants (Earth-616)|New Mutants]] who named him Bird-Brain. After spending some time with the New Mutants he led them to Paradise and his fellow Ani-Mates. The Ani-Mates were distrustful of Bird-Brain because he was associating with humans who they thought of as bringers of pain. Bird-Brain tried to convince them of the New Mutants good intentions, but before he could succeed the Ani-Mator who had been watching via hidden cameras used the whistle to send the Ani-Mates to his maze. The New Mutants decided to go through the maze themselves and encountered death traps as well as some larger Ani-Mates that ended up capturing them.\n\nThe Ani-Mator had looked up the New Mutants on his computer which puzzled the Right's leader Cameron Hodge who decided to investigate. Bringing his troops with him he discovered the Ani-Mator's subterfuge and in the ensuing confusion the New Mutants were able to escape. A fight then broke out between the New Mutants, the Right and the Ani-Mates. Bird-Brain was able to convince the Ani-Mates to side with the New Mutants and they managed to force the Right off the island. Hodge decided to drop some bombs on the island destroying it, but just then a giant octopus Ani-Mate reached up and grabbed his plane destroying it. After this the Ani-Mator was banished to [[Limbo (Demonic)]] and the Ani-Mates were allowed to choose their own path.{{r|New Mutants #58|60}}\n\n===Mutant Liberation Front===\nLater, the [[Mutant Liberation Front (Earth-616)|Mutant Liberation Front]] briefly took over their island and terrorized the Ani-Mates before leaving.{{r|X-Force Annual #3}}\n\n===Condor===\nEven later [[Condor (Bird People) (Earth-616)|Condor]] came to the island as an actual condor and Bird-Brain used the equipment left by the Ani-Mator to restore him to his more human form.{{r|Nova Vol 2 #2|5}}\n\n===[[Virusplague (Earth-616)|Virusplague]]===\nThe Ani-Mates lived peacefully on the island, free from the outside world’s interference. However, their seclusion would also be a curse, as all the biological creatures and plants on the island started to get sick and no one was around to help them. The whole island was dying and the plague sent the Ani-Mates into a delirious state. When the New Mutants arrived Bird-Brain spotted the group and attacked them, injuring many of them with his razor-sharp talons.\n\nAfter Warlock caged Bird-Brain, they found Ani-Mator's lab where they found that all the inhabits were infected by a virus that was designed to rebuild the Ani-Mator from available genetic material. They were soon attacked by a planet-like creature resembling Ani-Mator. They were absorbed into the creature, but with the help of Cypher and Warlock, they defeated the creature. After the cure, Cypher reprogrammed the virus to watched over the Ani-Mates.{{r|New Mutants Vol 3 #38|#40}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Ani-Mator Experiment]]\n[[Category:Human/Animal Hybrids]]"
                }
            }
        }
    ],
    "page_id": "31012"
}