{
    "pageid": 1032004,
    "ns": 0,
    "title": "Anti-Symbiote Task Force (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = [[Symbiote Task Force|Anti-Symbiote Task Force]]\n| Image                   = \n| Name                    = Anti-Symbiote Task Force{{r|Venom Vol 4 7}}\n| EditorialNames          = \n| Aliases                 = Symbiote Task Force,{{r|Venom Vol 3 5}} Anti-Carnage Task Force{{r|Carnage Vol 2 8}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Claire Dixon (Earth-616)|Claire Dixon]]; formerly [[Edward Brock (Earth-616)|Eddie Brock]]\n| CurrentMembers          = [[Claire Dixon (Earth-616)|Claire Dixon]], Agent MacNeill, numerous unnamed members\n| FormerMembers           = [[Edward Brock (Earth-616)|Toxin (Eddie Brock)]], [[Manuela Calderon (Earth-616)|Manny Calderon]], [[MacDonald Gargan (Earth-616)|Scorpion (Mac Gargan)]]\n| Allies                  = {{m|Federal Bureau of Investigation|FBI}},  [[Jubulile van Scotter (Earth-616)|Jubulile van Scotter]], [[Midnight Sons (Earth-616)|Children of Midnight]]\n| Enemies                 = [[Cletus Kasady (Earth-616)|Carnage]], [[Chthon (Earth-616)|Chthon]], [[Cult of Knull (Earth-616)|Cult of Knull]], [[Darkholders (Earth-616)|Cult of the Darkhold]], [[Edward Brock (Earth-616)|Venom (Eddie Brock)]], [[Lee Price (Earth-616)|Venom (Lee Price)]], \n\n| Origin                  = FBI Task Force created to hunt down Carnage and other symbiotes\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gerry Conway; Mike Perkins\n| First                   = Carnage Vol 2 1\n\n| HistoryText             = \n\n===Origins===\n\nThe Anti-Symbiote Task Force was a division of the [[Federal Bureau of Investigation (Earth-616)|FBI]] established in the wake of [[Cletus Kasady (Earth-616)|Carnage]]'s [[Carnage, U.S.A. Vol 1|attack]] on [[Doverton]], [[Colorado (State)|Colorado]].{{r|Scream: Curse of Carnage Vol 1 5}} Helmed by Special Agent [[Claire Dixon (Earth-616)|Claire Dixon]], the Anti-Symbiote Task Force was dispatched in order to hunt down Carnage, as well as deal with other [[Symbiotes|symbiote]]-related threats.{{r|Carnage Vol 2 1}}\n\nTracking Carnage's movements for two years,{{r|Carnage Vol 2 13}} the task force also spent several weeks monitoring the symbiote-augmented antihero [[Edward Brock (Earth-616)|Eddie Brock]], host of the [[Toxin (Symbiote) (Earth-616)|Toxin symbiote]] and former host of the [[Venom (Symbiote) (Earth-616)|Venom symbiote]], and succeeded in capturing him while he was acting as a vigilante in [[Philadelphia (Pennsylvania)|Philadelphia]]. Brock was subsequently injected with heavy doses of [[Symbiote Inhibitor]] and forcibly conscripted by the task-force with Claire as his handler, intending to use him as a last-resort weapon against Carnage.{{r|Carnage Vol 2 1}}\n\n===Hunt for Carnage===\n\nUpon learning that [[Grey Ridge Investments (Earth-616)|Grey Ridge Investments]] had hired [[Manuela Calderon (Earth-616)|Manny Calderon]] - the sole survivor of Cletus Kasady's first killing spree - as a security consultant due to her military expertise, Agent Dixon arranged with Grey Ridge's managing director [[Barry Gleason (Earth-616)|Barry Gleason]] to set a trap to capture or kill Carnage. In addition to the numerous FBI agents assigned to assist her, Agent Dixon also recruited [[John Jonah Jameson III (Earth-616)|Colonel John Jameson]] due to his [[Godstone|ability]] to transform into a [[Man-Wolves|werewolf-like monster]].{{r|Carnage Vol 2 1}} \n\nThe task force's first attempt to capture or kill Carnage ended in failure due to Gleason - who was secretly a member of the [[Darkholders (Earth-616)|Cult of the Darkhold]] - betraying them. Carnage slaughtered most of the task force's agents before being plunged into the depths of the mine by a cave-in. Gleason escorted Carnage to [[Chthonic Temple|an ancient temple]] in the mine's depths, where the Cult of the Darkhold attempted to sacrifice him to revive the eldritch god [[Chthon (Earth-616)|Chthon]]. Kasady and [[Carnage (Symbiote) (Earth-616)|his symbiote]] were augmented by the eldritch tome known as the ''[[Darkhold]]'' and escaped despite Dixon collapsing the mine.{{r|{{cl|Carnage Vol 2 2}} - {{cl|Carnage Vol 2 5|5}}}}\n\nAs a result of the catastrophic failure, Agent Dixon was reprimanded and scapegoated by her superiors, and the task force was officially disbanded. However, Agent Dixon was approached by [[Victoria Montesi (Earth-616)|Victoria Montesi]] - a high-ranking member of a monster-hunting organization called the [[Midnight Sons (Earth-616)|Children of Midnight]], who offered to hire and privately fund the task force in order to stop Carnage and the Cult of the Darkhold from awakening Chthon. Dixon, Calderon, and Jameson accepted Montesi's proposal; and on Calderon's insistance raided a secret FBI prison compound to recruit Brock and Toxin.{{r|Carnage Vol 2 7}}\n\nThe Anti-Symbiote Task Force tracked Carnage to [[Jakarta]], [[Indonesia]], and discovered he had turned on the Darkhold Cult and hijacked a freighter called the ''Caspian Sea''. Pursuing the ship in a chartered yacht, the task force battled a horde of [[Human-Symbiote Hybrids]] created by Carnage's experiments with his augmented powers. While Jameson and Montesi's assistant [[Yuvraj Singh (Earth-616)|Yuvraj Singh]] rigged the ship to explode, Agent Dixon was separated from the group and captured by Carnage,{{r|Carnage Vol 2 9}} who bonded her to [[Raze (Symbiote) (Earth-616)|a ''Darkhold''-augmented symbiote]] spawned from his own. With Agent Dixon - now called Raze - forced to obey Carnage's commands, the task force fell under Montesi's command. Raze and Carnage were presumed deceased when the ship exploded,{{r|Carnage Vol 2 10}} but the latter was revealed to have survived when the task force came across a South African girl named [[Jubulile van Scotter (Earth-616)|Jubulile van Scotter]] - who had also been infected with a ''Darkhold''-augmented [[Character Index/Unnamed Symbiotes#Jubulile van Scotter's Symbiote|offshoot of Carnage's symbiote]].{{r|Carnage Vol 2 6}}\n\nUsing Jubulile's new psychic link to Carnage, the Anti-Symbiote Task Force tracked Carnage to the [[Chthonic Island]] in the [[Timor Sea]], secretly followed by Raze - who revealed herself to rescue Carnage from the [[Broodlings of Chthon]].{{r|Carnage Vol 2 11|12}} Following Carnage and Raze to the [[Temple of Chthon]] at the island's core, the task force was unable to stop Carnage from summoning Chthon.{{r|Carnage Vol 2 14}} Absorbing the Toxin and Raze symbiotes into her own, Jubulile was able to banish Chthon back to [[K'lay]] - his extradimensional domain - though the symbiotes seemingly perished as a result.{{r|Carnage Vol 2 15}} Freed from Carnage's control, Dixon sacrificed herself to protect her team from his wrath, dying in Eddie Brock's arms. With Carnage now in custody, Jubulilie, Manuela, Jameson, and Montesi went their separate ways.{{r|Carnage Vol 2 16}} Eddie Brock remained the sole active member of the task force, officially joining the FBI and unsuccessfully attempting to recruit new members.<!--{{r|Venom Vol 3 5}}-->\n\n===Hunting Venom===\n\nAs the de-facto leader of the Anti-Symbiote Task Force, Eddie was brought in when [[Lee Price (Earth-616)|a new Venom]] appeared and began using his former symbiote for evil.{{r|Venom Vol 3 5}} Having grown dissatisfied with his fellow agents disparaging and mistrusting him, Eddie defected from the FBI and reclaimed the Venom symbiote, resuming his career as a vigilante.{{r|Venom Vol 3 6}}\n\nClaire Dixon was resurrected by the eldritch magic of the ''Darkhold'', returning to the FBI and resuming leadership of the Taskforce; keeping tabs on Eddie Brock following his return to being Venom. When it was discovered that the Venom symbiote was about to reproduce, she recruited [[MacDonald Gargan (Earth-616)|the Scorpion]] to become the newborn symbiote's host due to his prior experience as the Venom symbiote's host and his membership in [[Norman Osborn (Earth-616)|Norman Osborn]]'s [[Thunderbolts (Earth-616)|Thunderbolts]] and [[Dark Avengers (Earth-616)|Dark Avengers]]. Dixon assembled a team of agents armed with energy weapons to subdue and capture Venom, ordering them not to kill Eddie out of respect for their brief partnership. When Venom was captured, his symbiote attempted to escape and bond to Dixon, but Eddie was outfitted with a control collar before it could do so.{{r|Venom Vol 1 164}} Venom was freed by [[Jessica Drew (Earth-616)|Spider-Woman]], and Dixon was forced to incapacitate the Scorpion to stop him from killing Eddie. Upon being told that [[Sleeper (Symbiote) (Earth-616)|the symbiote's spawn]] was stillborn, Dixon apologized to Eddie for his loss before fainting from a concussion, and after regaining consciousness returned to the FBI.{{r|Venom Vol 1 165}}\n\n===Later Activities===\n\nIn the wake of Venom defeating [[Grendel (Symbiote) (Earth-616)|an ancient symbiote-dragon]], an extraction team working for [[Reed Richards (Earth-1610)|the Maker]] impersonated members of the Anti-Symbiote Task Force in order to acquire [[Carnage IV (Symbiote) (Earth-616)|a surviving sample]] of the symbiote-dragon.{{r|Venom Vol 4 7}}\n\nFollowing Carnage being reanimated using the sample of the symbiote-dragon, assuming leadership of [[Cult of Knull (Earth-616)|a symbiote-worshipping cult]], and launching [[Absolute Carnage|a massive attack with a horde of symbiote-infected minions]], the Anti-Symbiote Task Force was dispatched to claim jurisdiction from local authorities and deal with the cleanup; laying claim to the apparent corpse of [[Big Mother (Symbiote) (Earth-616)|an ancient crimson symbiote]].{{r|Scream: Curse of Carnage Vol 1 5}}\n\n| Equipment               = [[Symbiote Inhibitor|Symbiote suppressant drugs]] and control shock collars.\n| Transportation          = \n| Weapons                 = Sonic rifles and energy guns.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Symbiote-Enhanced Organizations]]"
                }
            }
        }
    ],
    "page_id": "1032004"
}