{
    "pageid": 559487,
    "ns": 0,
    "title": "Apache Nation",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Apache Nation from Apache Kid Vol 1 2 001.jpg\n| Name                    = Apache Nation\n| Aliases                 = Apaches\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Arizona (State)|Arizona]], [[New Mexico (State)|New Mexico]], [[Oklahoma (State)|Oklahoma]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Al Hartley\n| First                   = Black Rider #11\n\n| Overview                = The Apache Nation were a tribe of Native Americans who have long lived in regions of the states of [[Arizona (State)|Arizona]], [[New Mexico (State)|New Mexico]] and [[Oklahoma (State)|Oklahoma]]. Archaeological evidence suggests that they have been living in the area as early as 1000 AD.<ref>[[Wikipedia:Apache|Wikipedia]]</ref>\n\nPresumably the history of the Apache Nation on [[Earth-616]] mirrors that of the real world. \n| History                 = \n===Earth-616===\nWith the colonization of the Untied States by European settlers caused great changes among the Apache people. They were often working with or against settlers that were expanding in their region. Often fighting with or against such western heroes as the [[Matthew Masters (Earth-616)|Black Rider]], [[Blaine Colt (Earth-616)|Kid Colt]], and others, depending on their needs at the time. In later years many tribe strove for peace in order to prevent further bloodshed, but some renegade factions of the Apache waged war against the white settlers.\n\nMany of encounters between the Apaches and the various gun-slinging heroes of the Old West were adapted into dime store novels, as such the depictions may not be historically accurate,{{r|Blaze of Glory #1}} however they stand as the only records available of this time period.\n\n====Red Hawk's Tribe====\nOne of the most famous tribes of Apache during the days of the American Frontier was the one led by chief [[Red Hawk (Apache Chief) (Earth-616)|Red Hawk]] near Fort Madison. The tribe is known for the creation of the hero known as the [[Aloysius Kare (Earth-616)|Apache Kid]]. Many accounts state that the Apache Kid was really a white settler named Alan Krandal who was captured by Red Hawk and his people slaughtered their wagon train. Red Hawk aspired to train the boy in the ways of the Apache in order to use him as a spy against the settlers. Krandal learned the ways of the Apache and developed an alter ego of roving cowboy Aloysius Kare. However, Apache Kid came to realize that both Apache and white man were capable of good and evil and became determined to fight for peace between the two factions.{{r|Two Gun Western #5}}{{r|Apache Kid #2}} However these accounts have been proven to be only partially correct if not outright wrong. Apache Kid was in reality Aloysius Dazzi Kare, the son of a white father and an Apache mother. His mother was a member of the Chokonen Apache tribe. As an adult during the 1870s, the Apache Kid fought for peace between Apaches and the American settlers, having decided that the Apache needed to preserve their way of life, but also learn to live with the newcomers who were there to stay.{{r|Apache Skies #1}} That said, the following accounts of Red Hawk's tribe are likely fictions based on actual events.\n\nRed Hawk's tribe was poised to attack the US Army outpost at Fort Madison, and sent the Apache Kid to spy on the fort in his guise of Aloysius Kare. However, the jealous [[Brown Toad (Earth-616)|Brown Toad]] and arms dealer Fannin sought to alert the fort hoping to profit from the coming war -- Brown Toad hoping that Red Hawk and Apache Kid be killed so he could become leader of the tribe, and Fannin from selling the Apaches guns. Apache Kid discovered that the fort was run by his childhood friend [[Bill Gregory (Earth-616)|Captain Bill Gregory]] and was locked up. However, the Apache Kid managed to escape and caused a grass fire that kept the US Army at bay long enough for Red Hawk and his tribe to relocate to avoid a conflict.{{r|Two Gun Western #5}}\n\nRed Hawk's tribe was briefly blighted by the sale of weapons and alcohol by the [[Harry Snedly (Earth-616)|Wolf]] until he was stopped by the Apache Kid. The tribe was latter visited by Grey Wolf and his tribe of [[Comanche Nation (Earth-616)|Comanches]] who attempted to pressure Red Hawk into joining in his war against the United States Army posted at [[Fort Madison]]. The Apache Kid beat Grey Wolf in battle, ending the pressure to go into war.{{r|Apache Kid #2}} Red Hawk's tribe dealt with dangers from within by way of [[Running Moose (Earth-616)|Running Moose]], a warrior who was jealous of the Apache Kid. Running Moose once briefly took control of the tribe, when he framed Apache Kid for a crime. When Running Moose demanded that the Kid be arrested, Red Hawk refused and Running Moose managed to usurp control of the tribe an imprison Red Hawk. The Apache Kid managed to reveal Running Moose's plot which led to Red Hawk being restored to power.{{r|Two Gun Western #9}} The Apaches later assisted the army at Fort Madison round up Wyatt Kune's outlaws hiding out in Rustler's Canyon.{{r|Wild Western #17}} [[Black Cougar (Earth-616)|Black Cougar]] a warrior who Red Hawk exiled year earlier soon returned to terrorize the tribe until he was slain by the Apache Kid.{{r|Apache Kid #8}} When Red Hawk refused to join Bald Eagle's war against the soldiers at Fort Madison, the Apaches were taken prisoner but eventually broke free and helped the soldiers defended their allies.{{r|Two Gun Western #10}} They later assisted the army in capturing Gunner Simmons and his gang. Soon after a drought affected the tribe, warrior Big Thunder inflamed dissatisfaction with Red Hawk's ability to stop it by calling on the gods for rain. Big Thunder then tried to enact an old tribal law that would call for the tribal leader to be burned at the stake as a sacrifice to the gods. Red Hawk's niece [[White Swan (Earth-616)|White Swan]] offered herself in her place, foiling Big Thunder's plans. When the Apache Kid tried to save her he too was put at the stake. However, Red Hawk apparently was able to appeal to the gods and cause it to rain. Big Thunder was punished for his attempt to take command of the tribe.{{r|Apache Kid #9}}\n\nRed Hawk's tribe was briefly imprisoned by the renegade tribe of Blackeagles led by Tall Beaver who were raiding the area. They were freed by the Apache Kid and stopped the Blackeagles with the help of the US Army.{{r|Apache Kid #10}} When Red Hawk later fell ill, Tall Elk attempted to use this to eliminate Red Hawk and the Apache Kid by tricking the tribe into thinking the gods wished the Apache Kid to be sacrificed to save Red Hawk's life. This plot was exposed by the Apache Kid and Red Hawk was cured of his illness by a doctor.{{r|Two Gun Western #12}} Red Hawk's tribe was briefly usurped by the fanatical Dragon Face who sought to sacrifice people to his gods until he was stopped by the Apache Kid, and Red Hawk was restored to power.{{r|Apache Kid #11}} Red Hawk's tribe was briefly duped by fraud calling himself [[Poison Arrow (Earth-616)|Poison Arrow]] who claimed that he was the voice of the gods, who attempted to pit the Apaches against the white settlers in their region. His manipulations were exposed by the Apache Kid and the Apaches returned once more to peace. Soon after the Apaches were antagonized by the Cayuga tribe once again, until the Apache Kid once again defeated their leader Flying Cloud.{{r|Apache Kid #13}} When Red Hawk later fell ill the Apache totems -- seen as signals from the gods -- changed, prompting Red Horse to lead the Apaches to war against the US Army and their enemies the Cohos. The Apache Kid instead diverted their attention to outlaws trying to raid Fort Madison, apparently appeasing the gods, and Red Hawk soon recovered.{{r|Apache Kid #14}} The Croyo tribe later approached the Apaches and asked Red Hawk for permission to pass their Apache land to go to war against the soldiers at Fort Madison. When Red Hawk refused, the Apache Kid defeated their leader Yellow Feather in order to stop the potential bloodshed. The Apaches were later almost wiped out when arms dealer Rod Barron had outlaws pose as Apaches to steal weapons being delivered to the army, but this plot was exposed by the Apache Kid was well.{{r|Apache Kid #15}}\n\nRed Hawk's Apaches were once again targeted by white man's greed when an outlaw named Buzz and his gang began setting fires to drive the Apaches off their oil rich land in the hopes of goading them into war with Fort Madison. The Apache Kid also exposed this plot and the Apaches once more refrained from going to war. The Apaches later faced starvation when rancher Warner Grant refused to let anyone cross his land, cutting Red Hawk and his tribe from their ancestral hunting ground, however Grant had a change of heart after the Apache Kid saved his life. Red Hawk was later forced to exile Swift Buffalo from the tribe over disagreements over maintaining peace with the white settlers on their land. Swift Buffalo later led a group of renegade Native Americans on an attack on Fort Madison but stopped when the Apache Kid saved his son Little White Pine.{{r|Apache Kid #16}} Soon after war between the Apaches and the Cohos almost erupted, once more over if peace between the local tribes and white settlers should be maintained, but the conflict was thwarted when the Apache Kid defeated the Coho's chief Flaming Arrow in combat. Red Hawk was briefly removed as leader of the tribe when he was decreed too old to defend his people. However the Apache Kid orchestrated a battle between himself and his father that Red Hawk won and was re-installed as leader of the tribe.{{r|Apache Kid #17}}\n\nThe Apaches later agreed to pretend to go to war in order to flush out a trapped named Peters who was attempting to learn the location of the Apaches hunting grounds. The tribe was later convinced by the Apache Kid to go to war against Swift Buffalo and his tribe of [[Sioux (Earth-616)|Sioux]] warriors. However when both Red Hawk and the Apache Kid were defeated in combat, the Apaches lost faith in Red Hawk and joined with Swift Buffalo and his Sioux. However this proved to be short lived when the Apache Kid and Red Hawk both broke free and the Kid defeated Swift Buffalo in single combat, winning back Red Hawk's position as leader of the tribe. Not long after this the Apaches faced a drought that was apparently punishment from the gods. However the Apache Kid saved the tribe from starvation by braving the so-called \"River of No Return\", which either by miracle or coincidence caused it to rain the much needed water.{{r|Apache Kid #18}} The Apaches were later convinced into going on the warpath by a traitor among their ranks: Flying Eagle, a warrior who sought to have his entire tribe wiped out in war with the United States Army so that he and wealthy fur trader Mr. Jennings could reap the benefit of the Apache hunting grounds. However the war was called off when the Apache Kid exposed this betrayal.{{r|Apache Kid #19}}\n\n====Other Tribes====\nA tribe of Apaches near Fort McVey, Arizona were attacked by outlaws hired by [[Major Tyrell (Earth-616)|Major Tyrell]] who hoped to instigate a battle so that he could live out the glory of a major victory. However, the [[Matthew Masters (Earth-616)|Black Rider]] intervened, exposing the plot and showing by the soldiers at Fort McVey and the Apaches that Major Tyrell was mentally ill. In the end, Major Tyrell led a charge to attack the Apaches and soon found himself racing into battle alone and was killed in a swarm of Apache arrows. Following Tyrell's death, relations between the Apache and the soldiers returned to normal.{{r|Black Rider #11}}\n\nThe Chiricahua tribe of Apaches in the state of Texas, led by Cochiese were framed for the murder of settlers in the Apache Springs area. This brought the Texas Rangers including the [[David Laramee (Earth-616)|Arizona Kid]], who the Chiricahuas captured and held prisoner until the Arizona Kid used his skills to win their freedom. They then expose the real killer, local rancher Carl Butler, clearing the Apaches of any wrongdoing and ensuring peace in the area.{{r|Arizona Kid #1}} Another tribe led by Eagle-Eye was a friend of the Arizona Kid. When the Kid had to deal with the English hunter named Reginald Farnol, who treated everyone he met with contempt, the Arizona Kid got Eagle-Eye and his people to stage a fake kidnapping of his friend [[Nan Macklin (Earth-616)|Nan Macklin]] in order to show to others that Farnol was a coward.{{r|Arizona Kid #2}} Another tribe, was usurped by the warrior named Big Bear who wanted to start a war against area settlers until he too was stopped by the Arizona Kid.{{r|Arizona Kid #3}} An Apache tribe led by Big Bear went on the warpath against the people of Klamath Falls. This tribe was also opposed by the Texas Rangers. When Big Bear kidnapped Nan Macklin, the Arizona Kid defeated Big Bear in combat winning her freedom and ending the war.{{r|Arizona Kid #4}}\n\nA tribe led by Dead Turtle purchased guns from an arms dealer named Wreck Lasker, who was manipulating them into a war against Ed Bates gang so he could claim the silver their tribe discovered after an earthquake. This plan was stopped thanks to the intervention of the Black Rider.{{r|Two Gun Western #14}} Another group of Apaches were betrayed by one of their own, named Black Lance, who worked for an outlaw named Mantee. He and Mantee attempted to start a war between the Apaches and local settlers. This plan was foiled by Kid Colt. Yet another tribe outside of Caliber City attempted to reclaim their land taken by settlers by purchasing firearms. The tribe was stopped by the [[Lance Temple (Texas Kid) (Earth-616)|Texas Kid]] and his allies [[Emilio Diaz (Earth-616)|Emilio Diaz]] and [[Red Hawk (Texas Kid Ally) (Earth-616)|Red Hawk]] who wiped out the tribe using cannons they found in an old Spanish fort.{{r|Wild Western #23}}\n\nAnother tribe of Apaches used turquoise to make their arrowheads, when a group of outlaws discovered this they began slaughtering the tribe in order to steal the valuable mineral. The tribe initially accused Kid Colt for the killings, but Kid Colt survived their tortures he proved his innocence and the tribe gave him their Arrow of Vengeance to eliminate those responsible.{{r|Kid Colt Outlaw #25}} Later a band of outlaws supplied a group of Apaches who used them to attack a rival tribe of [[Puebloan Peoples (Earth-616)|Pueblos]]. However this invasion was thwarted thanks to Kid Colt and the [[Manidoog]] god known as the [[Black Ogre (Earth-616)|Black Ogre]].{{r|Wild Western #27}} A group of renegade Apaches outside Caliber City later attempted to frame a rival Comanche tribe for attacks on white settlers. This plot was stopped by the [[Lance Temple (Outlaw Kid) (Earth-616)|Outlaw Kid]] and his allies.{{r|Outlaw Kid #2}} Later a gang of renegade Apaches were tricked by the Albino -- a bounty hunter with albinism who disguised himself as a Native American -- into attacking a nearby fort so he could collect on the bounties the attacks made, however his plot was exposed by the Two-Gun Kid.{{r|Two-Gun Kid #21}} Undercover US Marshal [[Matt Slade (Earth-616)|Kid Slade]] foiled two attempts by unscrupulous arms dealers to provides guns to renegade factions. The first was in stopping Eric Bard from selling guns to Todecka and his Apache gang.{{r|Matt Slade, Gunfighter #4}} The other was with his friends in the Apache tribe led by Cochise. With the assistance of Cochise's son Fonata, he was able to capture Apache renegade Pinto who was attacking stage coaches in the region.{{r|Kid Slade, Gunfighter #6}}\n\n====20th Century====\nAn Apache named Roanhorse was part of the [[United States Army (Earth-616)|United States Army]] during the [[Korean War]] and was part of [[Dog Company (Earth-616)|Dog Company]] fighting alongside [[Henry Casey (Earth-616)|Combat Casey]] and [[Penny Pennington (Earth-616)|Penny Pennington]].{{r|Combat Casey #33}}\n\n====Modern Age====\nThe Apache people still exist to this day, many of them living in reservations, there have been many notable members of the Apache people who have gained superhuman powers through scientific or magical means.\n\n====[[Camp Verde|Camp Verde Reservation]]====\nThe Camp Verde Apache reservation is notable for being the birthplace of the [[Homo superior|mutant]] brothers [[John Proudstar (Earth-616)|John]] and [[James Proudstar (Earth-616)|James Proudstar]], both were gifted with superhuman strength and enhanced agility. John was recruited into [[Charles Xavier (Earth-616)|Charles Xavier]]'s third team of [[X-Men (Earth-616)|X-Men]],{{r|Giant-Size X-Men #1}} although he died on an early mission.{{r|X-Men #95}} James eventually joined [[Emma Frost (Earth-616)|Emma Frost]]'s [[Hellions (Earth-616)|Hellions]], a group affiliated with the [[Hellfire Club (Earth-616)|Hellfire Club]].{{r|New Mutants #16}}\n\nMeanwhile, the Apaches at Camp Verde were experimented on as part of a secret project called Project: Stepladder by [[Edwin Martynec (Earth-616)|Martin Edwards]] who was secretly in league with the mutant terrorist [[Nathan Summers (Stryfe) (Earth-4935)|Stryfe]], that saw the entire tribe wiped out.{{r|X-Force #73}} The slaughter of the Apaches at Camp Verde was framed on the Hellfire Club prompting James Proudstar to join [[Nathan Summers (Earth-616)|Cable]]'s [[New Mutants (Earth-616)|New Mutants]], who later became [[X-Force (Earth-616)|X-Force]].{{r|New Mutants #99}} As Warpath, James was a long standing X-Force but is presently a member of the X-Men and had a tenure as part of [[James Howlett (Earth-616)|Wolverine]]'s [[X-Force (Strike Team) (Earth-616)|X-Force]].{{r|X-Force Vol 3 1}}\n\nThe people of Camp Verde, including John Proudstar were resurrected by [[Vampires|vampire]] [[Eliphas (Earth-616)|Eli Bard]] using the [[Techno-Organic Virus|Transmode Virus]] for his mistress [[Selene Gallio (Earth-616)|Selene]] who sought to attain godhood.{{r|X-Force Vol 3 10}} Eventually Selene was defeated by X-Force and John and his people once more returned to their eternal rest.{{r|X-Force Vol 3 25}} During the [[Chaos War]] John Proudstar was once more briefly resurrected{{r|Chaos War: X-Men #1}} but returned to the afterlife after the defeat of the [[Amatsu-Mikaboshi (Earth-616)|Chaos King]].{{r|Chaos War: X-Men #2}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = * [[:Category:Apache|Characters who are Apache]].\n** [[Apache Nation/Expanded Membership|Expanded Membership]] of [[Earth-616]]\n}}\n[[Category:Historical Organizations]]\n[[Category:Native American Tribes]]\n[[Category:Western Characters]]"
                }
            }
        }
    ],
    "page_id": "559487"
}