{
    "pageid": 627725,
    "ns": 0,
    "title": "Arapaho People (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Arapaho People (Earth-616) from Wild Western Vol 1 21 0001.jpg\n| Name                    = Arapaho People\n| Aliases                 = Arapaho\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Preston Hardwick (Earth-616)|Gunhawk]], [[Arrowhead (Earth-616)|Arrowhead]]\n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Colorado (State)|Colorado]], [[Oklahoma (State)|Oklahoma]], [[Wyoming (State)|Wyoming]], [[Nebraska (State)|Nebraska]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Wild Western #21 \n\n| History                 = \n===Overview===\nThe Arapaho People are a tribe of Native Americans who reside in the states of Colorado, Oklahoma, Wyoming, and Nebraska. Presumably, their history on [[Earth-616]] is similar to that of their real world counterparts.\n\n===American Frontier===\nDuring the days of the American Frontier, the Arapaho people had various encounters with the heroes of the era, as either friend or foe depending on the circumstances.\n\nWhen a tribe of Arapahos were framed for a series of stagecoach robberies near the town of Hanging Rock, a race war was looming over the area. However, the gunslinging hero known as the [[Preston Hardwick (Earth-616)|Gunhawk]] investigated the attacks and deduced that the Arapahos were really being framed by a local banker named Mathers who had set up the scheme in order to cash in on the insurance money he placed on the coach shipments. Gunhawk slew Mathers and cleared the Arapaho people of any wrongdoing.{{r|Wild Western #21}}\n\nSometime later, a group of Arapahos along the plains of Wyoming were hired on by the US Army to be scouts. This group was attacked and a few of their numbers killed by the racist marshal of the town of Drumville named Ross Marney. An outright massacre was prevented by trapper and trader [[Andy Crockett (Earth-616)|Andy Crockett]] and the US Army.{{r|Arrowhead #2}}\n\n===Modern Age===\nThe Arapaho people still exist to this day.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Native American Tribes]]"
                }
            }
        }
    ],
    "page_id": "627725"
}