{
    "pageid": 1595541,
    "ns": 0,
    "title": "Army of the Devil (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Army of the Devil (Earth-616) from Miles Morales Spider-Man Annual Vol 1 1 001.jpg\n| Name                    = Army of the Devil\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             = \n| Allies                  = [[Red Owl (Earth-616)|Red Owl]]\n| Enemies                 = [[Red Owl (Earth-616)|Red Owl]]\n\n| Origin                  = \n| Status                  = Active\n| Reality                 = Earth-616\n| BaseOfOperations        = \n| PlaceOfFormation        = [[Baghdad]], [[Iraq]]\n| PlaceOfDissolution      = \n\n| Creators                = Saladin Ahmed; Luca Maresca\n| First                   = Miles Morales: Spider-Man Annual Vol 1 1\n\n| History                 = The Army of the Devil was the name given to a horde of a thousand monsters which attacked [[Baghdad]] fifteen hundred years in the past. The horde consisted of creatures such as demons, ghuls and cyklops. Tearing through the streets, they sowed chaos and ate people's babies. The monsters ran rampant until a wizard named [[Red Owl (Earth-616)|Red Owl]] stepped in. He used magic to banish the creatures, binding them to ordinary objects such as a necklace, a bowl, and a doll, and sealed them away in a cave. Jelaous of the attention the wizard had earned from the populance he saved, the caliph betrayed him and ordered his execution, accusing Red Owl of being in league with demons. At the moment of his death, Red Owl sent the cursed artifacts scattering across the Earth in revenge, each ensorcelled with the spirit of a monster. On that day, a family pledged to find the thousand cursed items and seal them away. This duty was passed down through generations, with the latest bearer of such responsibility being [[Fadi Fadlalah (Earth-616)|Fadi Fadlalah]].{{r|Miles Morales: Spider-Man Annual Vol 1 1}}\n\nAs the super hero Amulet, Fadi encountered and banished two monsters on separate occasions while living in [[Jersey City]] with the help of local hero [[Kamala Khan (Earth-616)|Ms. Marvel]].{{r|Magnificent Ms. Marvel Vol 1 13}}{{r|Magnificent Ms. Marvel Vol 1 16}} After tracking down a cyklops in [[Red Hook]], [[Brooklyn]], Amulet joined forces with [[Miles Morales (Earth-1610)|Spider-Man]] to banish it. While making acquaintances with Spider-Man, another creature under the command of a worshipper of Red Owl accidentally abducted the Web-Slinger instead of Amulet. Amulet followed the creature and destroyed the artifact binded to it, banishing it. The cultist announced the return of Red Owl, and set himself ablaze.{{r|Miles Morales: Spider-Man Annual Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1595541"
}