{
    "pageid": 1325687,
    "ns": 0,
    "title": "Atlantean Navy (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Atlantean_Navy_from_Fantastic_Four_Vol_5_5.png\n| Name                    = Atlantean Royal Navy{{r|Defenders Vol 1 84}}\n| Aliases                 = Imperial Fleet,{{r|Black Panther Vol 3 28}} Atlantean Navy,{{r|Black Panther Vol 3 27|29}}\n\n| Leaders                 = [[Namor McKenzie (Earth-616)|Namor]]\n| CurrentMembers          = \n| FormerMembers           = [[Attuma (Earth-616)|Attuma]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Atlantean Royal Family (Earth-616)|Atlantean Royal Family]], [[Atlantean Army (Earth-616)|Atlantean Army]]\n| Enemies                 = \n\n| Origin                  = [[Atlantis]]\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Atlantis]]\n| PlaceOfFormation        = [[Atlantis]]\n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Fantastic Four Annual Vol 1 1\n\n| History                 = \n===Overview===\nThe Atlantean Navy is the service which possesses the Atlantean warships and possibly its submersible aircraft. It's warships vary in size with some being as large or larger than the surface warships of surface dwellers (though none have been seen yet that are as large as super carriers). In design they vary from vessels shaped as marine life (e.g. manta ray-like or shark-like) to those of far more conventional designs. In the early part of the latter 20th century, the fleet was so powerful it was able to launch attacks against multiple targets throughout the world and threaten human civilization. Within a few decades, it had declined to such a level than even allied with the Lemurians and Deviants, Atlantean commanders acknowledged that it's ability to wage war against the American east coast was limited. \n\n===Modern Era===\nThe first time the Atlantean fleet was used against the surface world in the modern era was when Namor declared war surface dwellers and his forces launched attacks throughout the world. The fleet transported the [[Atlantean Army (Earth-616)|Atlantean army]] to [[New York City]].{{r|Fantastic Four Annual Vol 1 1}} Later Atlantean warships would be used in another campaign against NY City, first under the command of Namor and then under [[Max Eisenhardt (Earth-616)|Magneto's]] control.{{r|Fantastic Four Vol 1 102|104}}\n\nThe Atlantean Navy was later tricked by the High Evolutionary into attacking [[Deviants (Homo descendus)|Deviant]] [[Lemuria (Pacific Ocean)|Lemuria]], and when he detonated a genetic bomb, they joined forces with the Lemurians and attacked his base.{{r|Avengers Annual Vol 1 17}} The Atlantean fleet later transported the army to the American West Coast, as part of the Atlantean-Lemurian-Deviant alliance against the surface world.{{r|Web of Spider-Man Annual Vol 1 5}}\n\nDuring a crisis involving [[Wakanda]] and Deviant Lemuria, Wakandan warships appeared over Deviant Lemuria to deter any military action against Wakanda.{{r|Black Panther Vol 3 27}} [[Namor McKenzie (Earth-616)|Namor]] sent the Atlantean fleet which positioned itself around the Wakandan blockade. If the Wakandans fired, they would be forced to defend Deviant Lemuria. The Wakandans heard the Deviant missile silos opening, therefore they fired on the Atlantean ships, disabling their weapons. Then they fired on the Deviant missile silos.{{r|Black Panther Vol 3 28}}\n\nIt was the [[Ulysses Klaw (Earth-616)|Klaw]] that made it look as if the Deviants were launching their missiles, resulting in a war between Wakanda and the Deviants & Atlantis. The Atlantean invasion force attacked Wakanda, resulting in further bloodshed. To prevent war from escalating, Namor ordered his fleet to withdraw after discussing the issue with the [[T'Challa (Earth-616)|Black Panther]].{{r|Black Panther Vol 3 29}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = Missiles,{{r|Avengers Annual Vol 1 17}} submersible combat aircraft,{{r|Web of Spider-Man Annual Vol 1 5}}, submersible warships,{{r|Defenders Vol 1 84}}{{r|Black Panther Vol 3 27|29}}{{r|Avengers Annual Vol 1 17}}\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Atlantean Organizations]]"
                }
            }
        }
    ],
    "page_id": "1325687"
}