{
    "pageid": 335407,
    "ns": 0,
    "title": "Avengers (Heroes Reborn) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Avengers Vol 2 11.jpg\n| ImageSize               = 250px\n| Name                    = Avengers\n| Aliases                 = Earths Mightiest Heroes\n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Avengers Mansion]], [[New York City]], [[New York (State)|NY]]; formerly [[Avengers Island]]\n\n| Leaders                 = Formerly [[Steven Rogers (Earth-616)|Captain America]], \n| CurrentMembers          = \n| FormerMembers           = [[Henry Pym (Earth-616)|Ant-Man]]; [[Steven Rogers (Earth-616)|Captain America]]; [[Clinton Barton (Earth-616)|Hawkeye]]; [[Patsy Walker (Heroes Reborn) (Earth-616)|Hellcat]]; [[Anthony Stark (Earth-616)|Iron Man]]; [[Wanda Maximoff (Earth-616)|Scarlet Witch]]; [[Swordsman (Heroes Reborn) (Earth-616)|Swordsman]]; [[Thor Odinson (Heroes Reborn) (Earth-616)|Thor]] (Franklin Richards construct, deceased); [[Thor Odinson (Earth-616)|Thor]] (Earth-616 native), [[Vision (Earth-616)|Vision]]; [[Janet Van Dyne (Earth-616)|Wasp]]\n| Allies                  = [[Nicholas Fury (Heroes Reborn) (Earth-616)|Nick Fury]], [[Fantastic Four (Earth-616)|Fantastic Four]] \n| Enemies                 = [[Bruce Banner (Earth-616)|Hulk]],  [[Lethal Legion (Heroes Reborn) (Earth-616)|Lethal Legion]], [[Masters of Evil (Heroes Reborn) (Earth-616)|Masters of Evil]], [[Loki Laufeyson (Heroes Reborn) (Earth-616)|Loki]], [[Amora (Heroes Reborn) (Earth-616)|Enchantress]], [[Advanced Idea Mechanics (Heroes Reborn) (Earth-616)|A.I.M]], [[Nathaniel Richards (Heroes Reborn) (Earth-616)|Kang]], [[Galactus (Heroes Reborn) (Earth-616)|Galactus]], [[Heralds of Galactus (Heroes Reborn) (Earth-616)|Heralds of Galactus]], [[Victor von Doom (Earth-616)|Doctor Doom]], [[Skrulls]]\n\n| Origin                  = Formed by the [[Nicholas Fury (LMD, Heroes Reborn) (Earth-616)|Nicky Fury LMD]] to combat super-powered threats that might endanger the world.\n| PlaceOfFormation        = [[Avengers Island]], [[New York City]], [[New York (State)|NY]] on Counter-Earth\n| PlaceOfDissolution      = [[New York City]], [[New York (State)|NY]] \n| Creators                = Rob Liefeld; Jim Valentino; Chap Yaep \n| First                   = Avengers Vol 2 1\n| Last                    = Heroes Reborn: The Return Vol 1 4\n\n| HistoryText             = \n\n===Onslaught===\nDuring the [[Onslaught (Event)|Onslaught]] event, a group of heroes seemingly sacrificed their lives in order to try and stop the menace. Among the heroes were members of the [[Avengers (Earth-616)|Avengers]], Earth's mightiest heroes. Of the members who sacrificed their lives were [[Steven Rogers (Earth-616)|Captain America]], [[Anthony Stark (Earth-96020)|Iron Man]] of [[Earth-96020]], [[T'Challa (Earth-616)|Black Panther]], [[Wanda Maximoff (Earth-616)|Scarlet Witch]], [[Namor McKenzie (Earth-616)|Namor]], [[Janet Van Dyne (Earth-616)|Wasp]] (then mutated into a butterfly like form), [[Henry Pym (Earth-616)|Giant-Man]], [[Vision (Earth-616)|Vision]], [[Clinton Barton (Earth-616)|Hawkeye]], [[Crystalia Amaquelin (Earth-616)|Crystal]] and [[Thor Odinson (Earth-616)|Thor]]. They would sacrifice their lives along with the [[Fantastic Four (Earth-616)|Fantastic Four]], [[Bruce Banner (Earth-616)|Bruce Banner]] (then separated from the Hulk) and (forcibly) [[Victor von Doom (Earth-616)|Dr. Doom]]. They would not truly die however, as [[Franklin Richards (Earth-616)|Franklin Richards]] son of [[Reed Richards (Earth-616)|Reed]] and [[Susan Storm (Earth-616)|Sue Richards]] of the Fantastic Four shunted them all off to a pocket dimension with a duplicate of Earth (later dubbed [[Counter-Earth (Heroes Reborn)|Counter-Earth]] where they relived new \"reborn\" lives based on the ones that they previously lived.{{r|Onslaught Marvel Universe Vol 1 1}}\n\n===Before the Avengers===\nOf all the Avengers \"reborn\", both Captain America and [[Namor McKenzie (Earth-616)|Namor]] would live similar adventures during [[World War II]], clashing with foes such as [[Johann Shmidt (Heroes Reborn) (Earth-616)|Red Skull]] and [[Heinrich Zemo (Heroes Reborn) (Earth-616)|Baron Zemo]]{{r|Fantastic Four Vol 2 3}}. Following the war, Captain America was be \"deactivated\" seemingly over disagreements over [[Harry Truman (Heroes Reborn) (Earth-616)|President Truman]]'s decision to drop the atomic bomb on [[Japan]], and Namor returned to rule over [[Atlantis]]. Cap then spent the passing decades being reprogrammed by [[Strategic Hazard Intervention Espionage Logistics Directorate (Heroes Reborn) (Earth-616)|SHIELD]] to participate in various US backed conflicts and spending time in between either in suspended animation or living assumed lives{{r|Captain America Vol 2 3}}{{r|Captain America Vol 2 7}}. The full truth about this time is unknown thanks in part by supposed misinformation provided by a Life Model Decoy posing as Nick Fury, and [[Nicholas Fury (Heroes Reborn) (Earth-616)|Fury]] himself.{{r|Captain America Vol 2 12}} Namor did not join the Avengers on Counter-Earth, however did encounter the group on two occasions following their formation.\n\nFuture Avengers [[Anthony Stark (Earth-616)|Tony Stark]] and [[Henry Pym (Earth-616)|Henry Pym]] were be members of the [[Knights of the Atomic Round Table (Earth-616)|Knights of the Atomic Round Table]] with fellow Metro College students Reed Richards, Bruce Banner, Victor von Doom and [[Conner O'Reilly (Heroes Reborn) (Earth-616)|Connor \"Rebel\" O'Reilly]].{{r|Fantastic Four Vol 2 5}}\n\nA precursor to the Avengers was a group of super-powered and/or technologically advanced mercenaries. Among their numbers tapped were [[Clinton Barton (Earth-616)|Hawkeye]], the [[Eric Williams (Heroes Reborn) (Earth-616)|Grim Reaper]] and [[Patsy Walker (Heroes Reborn) (Earth-616)|Hellcat]]. The end result of their last mission together before the official forming of the Avengers took place in [[Argentina]]. The end result of that mission and what Hawkeye, Grim Reaper and Hellcat were doing for SHIELD remains unrevealed.{{r|Avengers Vol 2 7}} It was later revealed that the Grim Reaper had died, if he died during this mission remains unrevealed.{{r|Avengers Vol 2 9}}\n\nThe Falcon and Crystal were not be active members in the Counter-Earth reality. Falcon was reborn as pilot in the USAF, and Crystal remained living among Counter-Earth's version of the [[Inhumans (Inhomo supremis)#Heroes Reborn - Counter-Earth|Inhumans]].\n\n===Earth's Mightiest Heroes: Reborn===\nOn this new world, the Avengers were be formed in a vastly different way than their formation on [[Earth-616]]. On this world, the spy agency known as SHIELD formed the Avengers in order to answer threats from a insurgence of super-powered beings that were appearing on the planet. The group was be provided technology from [[Stark Industries|Stark International]], then owned by emotionless business man Tony Stark{{r|The Stark of [[Earth-96020]] would be merged with his [[Earth-616]] counterpart, who at the time was time displaced/deceased when he was reborn}}. Stark was later be \"reborn\" into his role of Iron Man, and joined the group the Avengers at a later date, however their entire operation was co-funded and had technology provided by Stark himself{{r|Iron Man Vol 2 5}}.\n\nFollowing Captain America's reactivation by [[Abraham Wilson (Heroes Reborn) (Earth-616)|Abraham Wilson]] and his involvement in defeating the Red Skull and [[Master Man (Heroes Reborn) (Earth-616)|Master Man]]'s plot to launch a nuclear strike on America, a [[Nicholas Fury (LMD, Heroes Reborn) (Earth-616)|LMD of Nick Fury]] (posing as the real [[Nicholas Fury (Heroes Reborn) (Earth-616)|Fury]] who was replaced by a covert and racist government organization{{r|Captain America Vol 2 11}}) pegged Captain America to join the Avengers{{r|Captain America Vol 2 3}}. Although Cap was assisted by his new partner [[Rebecca Barnes (Heroes Reborn) (Earth-616)|Bucky]] and Samuel \"Falcon\" Wilson (empowered by Cap's own Super-Soldier serum), neither would join the Avengers, both ending up working for SHIELD instead.\n\nAlong with Captain America, the first official roster of the Counter-Earth Avengers included: the [[Wanda Maximoff (Earth-616)|Scarlet Witch]], who lived in [[Salem Center]] with her adoptive mother and mystical teacher [[Agatha Harkness (Heroes Reborn) (Earth-616)|Agatha Harkness]]; the mysterious [[Swordsman (Heroes Reborn) (Earth-616)|Swordsman]], Hellcat, Hawkeye, and Henry Pym's android creation the Vision. Joining the Avengers as support staff was be Pym himself, his girlfriend Janet van Dyne and Pym's lab assistant the self upgrading robot named [[Ultron (Heroes Reborn) (Earth-616)|Ultron]]. They were also be monitored by government agents [[Henry Gyrich (Heroes Reborn) (Earth-616)|Henry Gyrich]] and Sellars.\n\nTheir gathering would attract the attention of [[Loki Laufeyson (Heroes Reborn) (Earth-616)|Loki]], a being created on Counter-Earth that believed himself to be the Loki of Earth-616. Knowing of the Avengers \"reborn\" status, Loki attempted send the group to revive his brother [[Thor Odinson (Heroes Reborn) (Earth-616)|Thor]] (who also was a Franklin Richards created construct) when his frozen body was discovered in [[Norway]] by archeologist [[Donald Blake (Heroes Reborn) (Earth-616)|Donald Blake]]. Freeing Thor from his icy tomb, the Avengers were forced to battle him when Loki tricked Thor into attacking them. However, Thor would eventually remember his brothers trickster ways and the Scarlet Witch would use her hex powers to banish Loki away, sending him to seek an alliance with the [[Amora (Heroes Reborn) (Earth-616)|Enchantress]]. Thor then joined the Avengers, however his barbarian ways would constantly come to odds to the Avenger's more noble ways.{{r|Avengers Vol 2 1}}\n\nThe Avengers next came under siege from the 30th century time traveler [[Nathaniel Richards (Heroes Reborn) (Earth-616)|Kang the Conqueror]] who had come to the Avengers time to best the Earth's mightiest heroes as an act of love toward his lover [[Mantis (Heroes Reborn) (Earth-616)|Mantis]]. During the opening attack Kang captured the Avengers, taking Captain America's shield, Thor's hammer, Hawkeye's bow and arrows, Swordsman's sword, and the Vision as trophies{{r|Avengers Vol 2 2}}. Thor's connection to his hammer ultimately led to the Avengers getting freed, and defeating Kang, forcing him to retreat. In the aftermath of the battle, the Vision was heavily damaged and, unknown to the Avengers, Agatha Harkness and her familiar [[Ebony (Heroes Reborn) (Earth-616)|Ebony]] were incapacitated and replaced by Loki and the Enchantress.{{r|Avengers Vol 2 3}}\n\nCaptain America and Thor were then dispatched by SHIELD to assist the newly form [[Fantastic Four (Earth-616)|Fantastic Four]] in battling Namor, who had been manipulated by [[Krang (Heroes Reborn) (Earth-616)|Warlord Krang]] into attacking the surface world. Namor would stop his attack due to his previous partnership with Captain America and the gathered heroes then foiled Krang's plot.{{r|Fantastic Four Vol 2 3}} During this time, [[Hydra (Heroes Reborn) (Earth-616)|Hydra]] targeted Stark Industries, their attack leading up to both Stark being injured and dawning a suit of [[Prometheum Armor]] to become Iron Man, and Bruce Banner being bombarded with gamma radiation turning him into the super-powerful Hulk{{r|Iron Man Vol 2 1}}. In their initial clash, the Hulk escaped prompting a manhunt for the creature initiated by SHIELD.{{r|Iron Man Vol 2 2}}\n\nThe Hulk, searching for Bruce Banner (unaware that he himself was really Banner) was then tricked by Loki into attacking [[Avengers Island]], clashing with Captain America, Swordsman, Hellcat, and Hawkeye. Meanwhile, Ultron began assisting Hank Pym (dawning a suit of \"Ant-Man\" armor allowing him to shrink down to size) in attempting to repair the Vision, and the Enchantress (posing as Agatha Harkness) enthraled the Scarlet Witch into joining her. The battle with the Hulk faired poorly, with Hawkeye and Swordsman being seriously injured and Hellcat and Captain America incapacitated until Thor arrived to battle the monster{{r|Avengers Vol 2 4}}. The resulting clash between the Hulk and Thor led to Thor's defeat at the gamma spawned monsters hands and the gamma core on Avengers Island being breached, threatening to destroy the entire eastern United States.{{r|Avengers Vol 2 5}}\n\n===Industrial Revolution===\nThe Hulk then reverted back to his Bruce Banner identity and fled the scene,{{r|Fantastic Four Vol 2 6}} prompting him to seek the assistance of his old college friend Reed Richards at the [[Baxter Building]]. The aftermath of the battle also attracted the attention of Iron Man who then forced his way past SHIELD (using fail safes in their Stark provided equipment to forcing them to allow his cooperation). With Hellcat, Hawkeye, and Swordsman evacuated Captain America and Thor joined the Fantastic Four, Banner and Iron Man in trying to repair the breach, until suddenly Banner transformed back into the Hulk once more{{r|Avengers Vol 2 6}}. Calming the Hulk, the heroes then helped convince the Hulk to repair the damage. In the aftermath of the battle, the Hulk effected an escape and Avengers Island would be a ruined mess{{r|Iron Man Vol 2 6}}. The group then accepted Iron Man (and Stark financial backing) to break free from SHIELD as an group independent from the government.{{r|Captain America Vol 2 6}}\n\n===Age of Loki===\nWith Avengers Island destroyed, Iron Man had the Avengers move into a new [[Avengers Mansion|mansion headquarters]]. In collecting all the Stark owned technology from SHIELD given to the Avengers, Iron Man was denied being given the Vision's inert body as it was built by Pym while he was working for SHIELD. As Pym continued his attempt to repair the Vision (now abandoned by Ultron), the Avengers set up in their new base while Captain America visited the injured Swordsman. Seeking to prevent Loki's plot, Agatha Harkness transferred her essence from the tree Loki trapped her in, into the body of her familiar Ebony. The Avengers next had to deal with the springing of Loki's master plan in a series of attacks. The first coming in the form of the [[Masters of Evil (Heroes Reborn) (Earth-616)|Masters of Evil]], a group consisting of the Enchantress, [[Skurge (Heroes Reborn) (Earth-616)|Executioner]], [[Simon Williams (Heroes Reborn) (Earth-616)|Wonder Man]], Ultron, and the Scarlet Witch.{{r|Avengers Vol 2 7}}\n\nAs the Avengers are busy battling this group, Loki -- having found a connection between the energies of the gamma core on Avenger's island and the Avengers foes -- absorbed the bodies of Kang and Mantis. The Avengers made short work of the first group of the Masters, destroying Ultron and knocking out the Executioner and Wonder Man, however the Scarlet Witch and Enchantress managed to escape. Ant-Man find himself trouble while attempting to repair the Vision, and Agatha Harkness in Ebony's body was struck down by Loki before she could warn the Avengers. Captain American then convinced Nick Fury to let him interrogate Baron Zemo, and [[George Tarleton (Heroes Reborn) (Earth-616)|MODOK]] he  arrived too late as they were missing, unaware that Loki had absorbed them into his body as well.{{r|Avengers Vol 2 8}} Cap then briefly took time away from the team, breaking away from his own association with the government.{{r|Captain America Vol 2 7}} As the other Avengers clean up their headquarters they were be attacked by more members of the Masters: the [[Nathan Garrett (Heroes Reborn) (Earth-616)|Black Knight]], [[Chen Lu (Heroes Reborn) (Earth-616)|Radioactive Man]], [[David Cannon (Heroes Reborn) (Earth-616)|Whirlwind]], [[Ulysses Klaw (Heroes Reborn) (Earth-616)|Klaw]] and the [[Bruno Horgan (Heroes Reborn) (Earth-616)|Melter]]. While the Avengers are busy with this new threat, the Executioner and Wonder Man were also absorbed by Loki.{{r|Avengers Vol 2 8}}\n\nIn the ensuing battle, these new Masters of Evil were easily defeated, and when Thor attempted to slay them, he is ordered to stand down by the returning Captain America. No longer tolerating the Avengers passive stance on their foes, Thor departed from the group, prompting Loki to send the Enchantress to manipulate him into joining their cause. Captain America next visited Swordsman in the hospital again only to find him missing (another victim absorbed by Loki), while Iron Man was asked to go to the SHIELD helicarrier by Janet van Dyne to check on Hank, they arrived just in time to save him from the Vision, whose body had grown critical forcing Iron Man to toss it out of the helicarrier to explode. Loki then arrived at the Mansion, absorbing the latest batch of defeated villains and offer both Hellcat and Hawkeye places in his army, transferring Hellcat's essence into Scarlet Witch's body. Realizing the gamma core on Avengers Island had been reactivated, Iron Man, Captain America, Ant-Man and Janet (now the Wasp) went to check it out. They found that it was spawning new villains for them to fight including the [[Super-Adaptoid (Heroes Reborn) (Earth-616)|Super-Adaptoid]], a seemingly resurrected Grim Reaper and [[Arthur Parks (Heroes Reborn) (Earth-616)|Living Laser]]. Blasting the gamma core with his repulsor rays seemingly stopped this process, and create an unexpected side effect: the arrival of the true Thor from Earth-616. Thor had a vague recollection of his previous life with the Avengers but was welcomed into the group.{{r|Avengers Vol 2 10}}\n\nAfter learning from Reed Richards that the gamma core, for unexplained reasons now had a rip in the fabric of time, the remaining Avengers then returned to their headquarters to be briefed by the Fury LMD about some unknown entity that is absorbing all their old foes. They are then attacked by the Counter-Earth Thor, Hawkeye, Enchantress and the Scarlet Witch/Hellcat. This all proved to be a large distraction for Loki to access the gamma core himself and link his power to it gaining phenomenal power which he would then attempt to use to take over the Counter-Earth dimension.{{r|Avengers Vol 2 10}}\n\nWith Loki's ascension to supreme power, the Counter-Earth Thor and Enchantress attempted to join their benefactor only to be betrayed. Realizing that they were played for fools they then joined with the Avengers in coming up with a plan to try and stop Loki's plot. Hellcat, unable to turn on Loki had her fusion to the Scarlet Witch betrayed by the now conscious Agatha Harkness/Ebony. Ultimately this revelation and lack of remorse led to Hellcat's destruction and Wanda's freedom. The Enchantress then restored Agatha back to normal. They then all pooled their resources together in stopping Loki. With the Enchantress, Agatha and Scarlet Witch combining their magics that transformed the Counter-Earth Thor into a gigantic version of [[Odin Borson (Earth-616)|Odin]] as a distraction for Loki and make him drain his powers. When his powers are drained, a combination of Iron Man's technical know-how and the true Thor's hammer then blocked Loki's power source, leading to his ultimate demise. At the end of the battle, both Loki and the Counter-Earth Thor would seemingly perish.{{r|Avengers Vol 2 11}}\n\nAfter the battle the core Avengers then went off to resolve personal conflicts. Captain America went off to crush the [[Sons of the Serpent (Heroes Reborn) (Earth-616)|Sons of the Serpent]] freeing the real Nick Fury in the process,{{r|Captain America Vol 2 8|11}} Iron Man finally crushed the Hydra organization, revealing their benefactor to be Dr. Doom,{{r|Iron Man Vol 2 7|11}} the Avengers later reunited to participate in a Viking funeral for the Counter-Earth Thor.{{r|Avengers Vol 2 12}}\n\n===Heroes Reunited===\nThe Earth was soon threatened by [[Galactus (Heroes Reborn) (Earth-616)|Galactus]] and his Heralds{{r|Fantastic Four Vol 2 11}}. This prompted SHIELD to collect the Fantastic Four, Avengers, Black Panther and Namor to combat the threat. SHIELD then sent out different teams to the locations where Galactus' heralds have gone to plant terraformers that would allow Galactus to consume the Earth. Captain America, Scarlet Witch, Ant-Man, Wasp, Thor, and Hawkeye joined Namor in travelling to [[Monster Island]] to stop [[Plasma (Heroes Reborn) (Earth-616)|Plasma]] from planting her terraformer. Although their attempt was interfered with by the [[Harvey Elder (Heroes Reborn) (Earth-616)|Mole Man]], the heroes succeed in destroying Plasma and the terraformer, but at the expense of Namor's life. The heroes later helped the Fantastic Four clash with [[Tyros (Heroes Reborn) (Earth-616)|Terrax]], a battle which end with Thor slain. Ultimately the heroes failed to stop Galactus who succeed in consuming the Earth. Dr. Doom however survived by travelling back in time 24 hours before the carnage in the hopes of preventing the Earth's destruction.{{r|Fantastic Four Vol 2 12}}\n\nFor some unexplained reason, every time Doom travelled back in time, events would happen radically different, and he would fail in stopping Galactus two more times, however with each failure he gained more knowledge that would help defeat Galactus eventually.\n\nIn his second attempt, he confronted the Avengers and SHIELD directly, only to teleport away when they refused to trust him. Fury then sent the group out to various locations to battle Galactus' heralds. Scarlet Witch and the Vision (his memory circuits preserved by Pym and installed in a new body) joined the Hulk in stopping [[Pyreus Kril (Heroes Reborn) (Earth-616)|Firelord]] in [[Antarctica]]. They succeed but the Hulk was gravely injured in the encounter. Captain America, Wasp, Hawkeye, Iron Man and Thor then clashed with Terrax in [[Tokyo]]. There, Hawkeye and Wasp also perished before Thor would kill Terrax and destroy the Terraformer. Not wishing for Galactus to succeed the heroes then returned to Avengers Mansion where the dying Bruce Banner recommended breaching the gamma core and increasing the space-time rift to destroy Galactus, they succeeded in doing so, although Doom again travelled back in time once more to try and stop Galactus and save the Earth.{{r|Avengers Vol 2 12}}\n\nIn his third attempt, Doom worked with SHIELD directly, and gathered Iron Man and the newly formed [[Hulkbusters (Heroes Reborn) (Earth-616)|Hulkbusters]] team to join the battle, the Fantastic Four died early in battle this time around. While Doom, Bruce Banner, Ant-Man and Iron Man then began working on an \"ultimate nullifier\" weapon to use against Galactus, the others were dispatched to battle the heralds. Thor and [[Jennifer Walters (Heroes Reborn) (Earth-616)|She-Hulk]] battled Terrax in [[Attilan]]; Captain America, Namor, [[Leonard Samson (Heroes Reborn) (Earth-616)|Doc Samson]] and Hawkeye battled Firelord on Monster Island; Vision, Scarlet Witch and Wasp also battled Plasma in Antarctica. The outcome of the battle was not known, as Dr. Doom travelled back in time one last time after Iron Man, Ant-Man and the Hulk failed to stop Galactus with their device.{{r|Iron Man Vol 2 12}}\n\nIn his final attempt, Dr. Doom targeted Cap's side kick Bucky due to the fact that she was a \"chronal anomaly\" getting into a clash with Captain America. This prompted Doom to convince the hero to help him in stopping Galactus. Getting the combined efforts of both the Avengers and the Hulkbusters, they saved the Fantastic Four from death at the hands of the heralds of Galactus. Holing up at Avengers mansion, the gathering of heroes waited on the sidelines as Mr. Fantastic, Bruce Banner, Ant-Man, Dr. Doom, and Iron Man worked on a new Ultimate Nullifier that would absorb and rechannel Galactus' powers in the hopes of overloading him. When Bucky was gravely injured by Galactus, it convinced his most loyal herald the [[Norrin Radd (Heroes Reborn) (Earth-616)|Silver Surfer]] to betray his master and sacrifice his life to kill Galactus, saving the Earth.{{r|Captain America Vol 2 12}}\n\n===World War III===\nWhen Dr. Doom attempted to create a [[Negative Zone]] Portal of his own, he caused a catastrophic event that would merge Counter-Earth with that of an alternate universe of a distant cosmos (By that cosmos' designation it would be classified as [[w:c:dc:Wildstorm Universe|Earth-50]]) to create the alternate universe [[Earth-13]]. In this universe the heroes of Counter-Earth and this distant cosmos would coexist. The Avengers and Fantastic Four worked together with the [[w:c:dc:Wildcats|Wild C.A.T.s]], [[w:c:dc:Wetworks|Wetworks]], and other heroes in turning back an invasion of both the [[Skrulls]] and the [[DCDP:Daemonites|Daemonites]]. Ultimately the Negative Zone portal was destroyed by [[Richard Jones (Earth-13031)|Rick Jones]] separating the two universes and restoring the status-quo on both worlds leaving none with any recollection of what happened.{{r|Fantastic Four Vol 2 13}}{{r|Avengers Vol 2 13}}{{r|Iron Man Vol 2 13}}{{r|Captain America Vol 2 13}}\n\n==The Return Home==\nA year after the Avengers were reborn, the [[Celestials]] sent their agent [[Ashema (Earth-616)|Ashema]] to force Franklin Richards to choose which version of Earth would survive, showing him his work on Counter-Earth and revealing to him that his parents and their friends are alive an well. During this period, Thor helped the [[Benjamin Grimm (Earth-616)|Thing]] in a battle against the Hulk in New York{{r|Heroes Reborn: The Return Vol 1 1}}. Then aiding in defending New York from another Hulk attack and defend people from the geographical upheaval caused by the Celestials impending destruction of Counter-Earth.{{r|Heroes Reborn: The Return Vol 1 2}}\n\nWhen [[Peter Parker (Earth-616)|Spider-Man]] and the Hulk that was left on Earth-616 were accidentally transported to Counter-Earth, the two Hulks began to fight, bringing Captain America, Hawkeye, Vision, the Thing and the [[Jonathan Storm (Earth-616)|Human Torch]] to contain the battle. While this was happening, Reed Richards had Iron Man fly into the Negative Zone with a core sample from the Earth to learn that Franklin Richards' story about their Earth is true prompting the heroes to all agree to work with Ashema, Franklin and Dr. Doom in saving Counter-Earth.{{r|Heroes Reborn: The Return Vol 1 3}}\n\nRealizing that all those Franklin Richards brought to Counter-Earth would have to return to their home world, they then said their farewells to their friends and allies. Captain America, Iron Man, Vision, Hawkeye, Scarlet Witch, Ant-Man, Wasp, Black Panther, Namor, and Falcon all left Counter-Earth along with the Fantastic Four, and Dr. Doom. As Ashema sacrificed her freedom to save Counter-Earth from destruction, Dr. Doom attempted to kidnap Franklin Richards to exploit the boys powers, however the boy was saved by Thor, leaving Doom to be lost between dimensions. The heroes then succeed in breaching the barrier back to their true home, having all their past memories restored.{{r|Heroes Reborn: The Return Vol 1 4}}\n\n===Legacy===\nUpon the heroes return to Earth-616, the Avengers would re-establish themselves on that Earth,{{r|Avengers Vol 3 1}} as the group had been disbanded since the Onslaught incident. Of the Avengers who were shunted to Counter-Earth, Captain America, Iron Man, Vision, and the Scarlet Witch remained part of the active roster with everyone else going on reserve status{{r|Avengers Vol 3 4}}. Upon their return form Counter-Earth, Iron Man was be restored as an adult, retaining memories of his Earth-616, Earth-96020, and Counter-Earth counterparts.{{r|Iron Man Vol 3 1}} The Wasp was also be restored to her human form, retaining her original powers prior to her mutation previous to the Onslaught incident.{{r|Avengers Vol 3 1}} Any enhancement that Falcon received from his exposure to the Counter-Earth variant of the Super-Soldier serum appear to have also been reversed.\n\nOn Counter-Earth, the Avengers left behind a legacy and bring new champions to defend that world from continuing chaos. Rebel O'Reilly obtained a suit of Iron Man's Promethian Armor and join a rebellion against Master Man's dominance of the west coast{{r|Heroes Reborn: Rebel Vol 1 1}}. Stark's Iron Man technology was also be co-opted by SHIELD and used for their [[Iron Men (Heroes Reborn) (Earth-616)|Iron Men]] army.{{r|Doom: The Emperor Returns Vol 1 1}}\n\nSwordsman contracted cancer and went insane and becoming the masked mercenary Deadpool. However before his descent into madness he encouraged Henry Pym's former janitor [[Ernest Sanger (Heroes Reborn) (Earth-616)|Ernest Sanger]] to start a group of heroes to replace those lost. They become the [[Remnants (Heroes Reborn) (Earth-616)|Remnants]], Ernest wore Pym's Ant-Man armor, calling himself Mant. They failed to stopping Deadpool from unleashing a nuclear explosion that tore a hole in the fabric of time and space.{{r|Heroes Reborn: Remnants Vol 1 1}}\n\nCarrying on the Avenger's legacy best was Captain America's former partner Bucky, who formed a group of young super-powered heroes together to become the [[Young Allies (Heroes Reborn) (Earth-616)|Young Allies]].{{r|Heroes Reborn: Young Allies Vol 1 1}}\n\nLastly, following the events of [[M-Day]], [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]] would be reborn and seek to terrorize Franklin Richards anew. In order to escape Onslaught, Franklin would create another pocket dimension that would be an exact duplicate of Counter-Earth prior to the heroes departure. On this world, Franklin would create another team of [[Avengers (Onslaught Reborn) (Earth-616)|Avengers]] based on the ones formed on Counter Earth.{{r|Onslaught Reborn Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Heroes Reborn (1996 Event)]]"
                }
            }
        }
    ],
    "page_id": "335407"
}