{
    "pageid": 722074,
    "ns": 0,
    "title": "Avengers of the Supernatural (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Avengers of the Supernatural (Earth-616) from Uncanny Avengers Annual Vol 1 1 0001.jpg\n| Name                    = Avengers of the Supernatural\n| EditorialNames          = \n| Aliases                 = Antiquated Stereotype Geek Brigade\n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Mojoworld]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Eric Brooks (Earth-616)|Blade]], [[Stephen Strange (Earth-616)|Doctor Strange]], [[Johnathon Blaze (Earth-616)|Ghost Rider]], [[Manphibian (Earth-616)|Manphibian]], [[Theodore Sallis (Earth-616)|Man-Thing]], [[Satana Hellstrom (Earth-616)|Satana]]\n| Allies                  = [[Avengers Unity Division (Earth-616)|Avengers Unity Division]]\n| Enemies                 = [[Mojo (Mojoverse)|Mojo]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Rick Remender; Paul Renaud\n| First                   = Uncanny Avengers Annual #1\n| Last                    = Uncanny Avengers Annual #1\n\n| HistoryText             = The Avengers of the Supernatural were a group of supernatural heroes chosen by [[Mojo (Mojoverse)|Mojo]] for his newest reality show. They were mind-controlled into abducting the [[Avengers Unity Division (Earth-616)|Avengers Unity Division]] from the Avengers Mansion.\n\nOnce in Mojoworld, both teams were made to take part in a reality show called \"Martian Transylvania Super Hero Mutant Monster Hunter High School,\" in which the mutants of the Unity Division were goth outcasts, the rest were football stars and cheerleaders, and the Avengers of the Supernatural were the geeks of the High School. As part of the show, the Scarlet Witch told Johnny Blaze she was pregnant, but the [[Zarathos (Earth-616)|Spirit of Vengeance]] wasn't under the influence of Mojo, for which it believed it would really have an offspring. Blaze was possessed by the spirit, and as he went \"too far out of character,\" Mojo's influence over the other heroes was broken too.\n\nThe Ghost Rider started rampaging through Mojoworld looking for sinner souls to punish, and the Avengers attempted to let him do it, until Mojo convinced them to save Mojoworld, as there were numerous innocent lives. From a skyscraper, the Ghost Rider begun submitting the inhabitants of Mojoworld to his Penace Stare.\n\nBoth Avengers team fought Ghost Rider in order to distract him, and let Satana pry the Spirit of Vengeance from Blaze and temper it. Satana failed to attack Ghost Rider, but Rogue managed to sneak up on him and touch him to absorb his powers. This way, she became the new Ghost Rider and tempered the Spirit of Vengeance, but as it begun taking control over her, Blaze reabsorbed the spirit into him, becoming the Ghost Rider once more.\n\nHaving saved Mojoworld and having controlled the Spirit of Vengeance, the Avengers of the Supernatural and the Unity Divison returned to their universe, where they quickly started a pool party.{{r|Uncanny Avengers Annual #1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Mystical Organizations]]"
                }
            }
        }
    ],
    "page_id": "722074"
}