{
    "pageid": 440094,
    "ns": 0,
    "title": "Avengers (1950s) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = New Avengers Vol 2 10 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Avengers]]\n| Aliases                 = [[Avengers Initiative]]{{r|Avengers NOW! #1}}\n| EditorialNames          = [[Avengers 1959 Vol 1|Avengers 1959]], [[New Avengers Vol 2 10|New Avengers 1959]]\n| Status                  = Defunct\n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Nicholas Fury (Earth-616)|Nick Fury]]\n| CurrentMembers          = \n| FormerMembers           = [[Louise Grant (Earth-616)|Blonde Phantom]], [[Ulysses Bloodstone (Earth-616)|Ulysses Bloodstone]], [[Timothy Dugan (Earth-616)|Dum-Dum Dugan]], [[Duvid Fortunov (Earth-616)|Dominic Fortune]], [[Nicholas Fury (Earth-616)|Nick Fury]], [[Sergei Kravinoff (Earth-616)|Kraven]], [[Aquaria Neptunia (Earth-616)|Namora]], [[Victor Creed (Earth-616)|Sabretooth]], [[Ernst Sablinova (Earth-616)|Silver Sable]]\n| Allies                  = [[Powell McTeague (Earth-616)|Powell McTeague]]\n| Enemies                 = [[ICON (1950s) (Earth-616)|ICON]], [[Red Skull (1950s Impostor) (Earth-616)|Red Skull impersonator]], [[Kron-bots (Earth-616)|Kron-bots]]\n\n| Origin                  = Recruited by Nick Fury under Presidential orders.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Brian Michael Bendis; Howard Chaykin\n| First                   = New Avengers Vol 2 10\n| Last                    = Avengers 1959 Vol 1 5\n\n| HistoryText             = In 1959, [[Nicholas Fury (Earth-616)|Nick Fury]] was tracked down by a General Hill who had sought Fury out on orders from [[Dwight D. Eisenhower (Earth-616)|President Eisenhower]] to gather operatives for a mission called the [[Avengers (1950s)|Avengers Initiative]].{{r|New Avengers Vol 2 #9}} Fury and Dugan then went to gather their operatives. Their first stop was the island nation of [[Madripoor]] where they recruited the feral mutant known as [[Victor Creed (Earth-616)|Sabretooth]]. In Paris, the soldier of fortune known as [[Duvid Fortunov (Earth-616)|Dominic Fortune]]; the [[Atlanteans|Atlantean]] princess [[Aquaria Neptunia (Earth-616)|Namora]] and her boyfriend master hunter [[Sergei Kravinoff (Earth-616)|Kraven the Hunter]] from the Emerald Coast of Florida; and immortal monster hunter [[Ulysses Bloodstone (Earth-616)|Bloodstone]] and Nazi hunter [[Ernst Sablinova (Earth-616)|Silver Sable]] in Boston, Massachusetts.{{r|New Avengers Vol 2 #10}} \n\nWith his team of Avengers, Fury took the group to Helsingborg, Sweden, where there were reports of a [[Red Skull (1950s Impostor) (Earth-616)|Red Skull]] impostor who was gathering former Nazis for a new Reich. The group infiltrated the Nazi's stronghold and set it ablaze after discovering the Nazis had created their own [[Captain America (Nazi) (Earth-616)|Captain America]].{{r|New Avengers Vol 2 #11}} Fury and his Avengers slew the faux-Captain America and captured the Red Skull recovering his secret weapon.\n\n[[File:Nick Fury's Avengers from New Avengers Vol 2 11.jpg|left|thumb|Nick Fury's Avengers]] \nHowever before they could get answers out of him, Sabretooth killed the Red Skull impostor as well.{{r|New Avengers Vol 2 #12}} After this, Fury disbanded his group, telling them that he would call for them when he needed them again. He then used his government connections to have some of the international charges against his teammates cleared. Turning over the Red Skull's briefcase over to General Hill, Fury learned that it contained a combination of the Super-Soldier Serum that created Captain America and the Infinity Formula to create a more powerful super-soldier.{{r|New Avengers Vol 2 #13}}\n\nIn autumn of that year, Fury reformed his Avengers for another mission. However after a brief reunion, Bloodstone and Sable took a leave of absence from the group, the Avengers -- and Fury in particular -- were being targeted by escaped Nazis who were being manipulated by occultist [[Geoffrey Sydenham (Earth-616)|Geoffrey Sydenham]] who used his influence within the United States government to form an agency known only as [[ICON (1950s) (Earth-616)|ICON]].{{r|Avengers 1959 #2}} The purpose of ICON was to use the occult to summon the [[Dark Dimension]]'s ruler [[Dormammu (Earth-616)|Dormammu]] to protect America from Communist elements.{{r|Avengers 1959 #4}} After all the attempts on the lives of the Avengers failed, Fury was approached by the mystic [[Powell McTeague (Earth-616)|Powell McTeague]] who offered his assistance to the Avengers in cracking the conspiracy.{{r|Avengers 1959 #1}}\n\nWith information obtained by McTeague, Fury traveled to the nation of Latveria to rendezvous with his old Howler ally Eric Koenig and the Blonde Phantom to learn what he could about the secret organization recruiting former Nazis. He also learned that [[T'Chaka (Earth-616)|T'Chaka]], future successor to the title of the Black Panther, was also kidnapped from his home by Sydenham, who claimed to be from the US Defense department. While they found Nazi operative [[Dieter Skul (Earth-616)|Deiter Skul]] and the remains of the [[Lord of Death (Earth-616)|Lord of Death's]] [[Hollow Men (Earth-616)|Hollow Men]] zombies.{{r|Avengers 1959 #2}}\n\n[[File:Avengers (1950s) (Earth-616) from Avengers 1959 Vol 1 4 0001.jpg|thumb|right|The Avengers vs ICON]]\nFury and the Blonde Phantom next traveled to Wakanda to learn more about T'Chaka's kidnapping. There they learned that Skul had fled to the nation of [[Madripoor]] and went there aboard one of Howard Stark's specially built ships. Along the way they were attacked by the [[Ubermadchen (Earth-616)|Ubermadchen]] but the battle was ended when the other Avengers arrived on the scene and the Ubermadchen were captured.<ref>{{cl|Avengers 1959 #3}}. Here Fury and [[Howard Stark (Earth-616)|Howard Stark]] act as though they have never previously met, even though they had done so at least twice earlier as depicted in {{cl|Captain America Annual #9}} and more recently in {{cl|Original Sin #5}}. Likely they were keeping their past encounters a secret in light of the secret pact they made in Original Sin #5</ref>  When they learned from the Ubermadchen that Nazi operatives were being summoned by an known force, Fury had Sabretooth kill the women. \n\nSearching their files, they tracked down Fury's old foe the Planner and attacked his estate as well. From him they learned that Skul was returning to Wakanda to launch an attack along, so Fury and his Avengers followed him there.{{r|Avengers 1959 #4}} The Avengers clashed with Skul and his minions, [[Doctorangutan (Earth-616)|Doctorangutan]], [[Count von Blitzkrieg (Earth-616)|Count von Blitzkrieg]], [[Vunderknight (Earth-616)|Vunderknight]], the [[Countess Kyra (Earth-616)|Leopard Woman]] and an army of Hollow Men and [[Kron-bots (Earth-616)|Kron-bots]]. Following the defeat of their foes, Fury and the Avengers took their place when Geoffrey Sydenham attempted to teleport the Nazis to Washington D.C. for his spell to contact Dormammu. \n\nThere the group stopped more of his Nazi operatives: Baron Blood, [[Werner Schmidt (Earth-616)|Brain Drain]], [[Shannon Kane (Earth-616)|Spider Queen]], [[Nikolaus Geist (Earth-616)|Geist]], and more Hollow Men. The Nazi operatives were either captured and slain along with Sydenham. With the conspiracy taken down, Fury disbanded his Avengers and completed his promise to get them full pardons for their past crimes. Shortly thereafter, Fury learned to his shock and dismay that Sydenham was released even though he committed an act of treason. Fury's friends Dugan and Koenig had managed to rescue T'Chaka, securing peaceful relations between the United States and Wakanda.{{r|Avengers 1959 #5}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "440094"
}