{
    "pageid": 38278,
    "ns": 0,
    "title": "B.A.D. Girls, Inc. (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = B.A.D. Girls, Inc. (Earth-616) from All-New Official Handbook of the Marvel Universe A to Z Vol 1 1 0001.jpg\n| ImageSize               = 250px\n| Name                    = B.A.D. Girls, Inc.\n| Aliases                 = None Known\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly [[Tanya Sealy (Earth-616)|Black Mamba]]\n| CurrentMembers          = \n| FormerMembers           = [[Cleopatra Nefertiti (Earth-616)|Asp]], [[Tanya Sealy (Earth-616)|Black Mamba]], [[Rachel Leighton (Earth-616)|Diamondback]], [[Impala (Earth-616)|Impala]]\n| Allies                  = [[Steven Rogers (Earth-616)|Captain America]]\n| Enemies                 = [[Serpent Society (Earth-616)|Serpent Society]]\n\n| Origin                  = A group of mercenaries who were former members of the Serpent Society\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mark Gruenwald; Ron Lim\n| First                   = Captain America #385\n| Last                    = \n\n| HistoryText             = The [[Cleopatra Nefertiti (Earth-616)|Asp]], [[Tanya Sealy (Earth-616)|Black Mamba]], and [[Rachel Leighton (Earth-616)|Diamondback]] were close friends as well as founding members of [[Seth Voelker (Earth-616)|Sidewinder]]'s super-villain team, the [[Serpent Society (Earth-616)|Serpent Society]]. \n\nWhen Diamondback began secretly dating the hero Captain America, otherwise known as [[Steven Rogers (Earth-616)|Steve Rogers]], the others acted behind the scenes to make sure that her first real date was uneventful. After learning of Diamondback and Cap's relationship, the Society's new leader, [[Klaus Voorhees (Earth-616)|King Cobra]], had Diamondback kidnapped and placed on trial, fearing that she would reveal the group's secrets to the Captain. Diamondback was found guilty by the majority of her fellow Serpents, and sentenced to execution. Black Mamba and Asp objected, but were overruled by King Cobra. To save Diamondback, Black Mamba and Asp called in a favor from their former leader, Sidewinder (who was also Black Mamba's ex-boyfriend), and he rescued Diamondback. However, in retaliation, King Cobra captured the Asp and Black Mamba. Diamondback then hired the mercenary [[Paladin (Earth-616)|Paladin]] to help her free the pair. Together, with Captain America, and Paladin, the five combined to defeat the Serpent Society.\n\nFearing retaliation from the Society, Diamondback suggested they form their own group, B.A.D. Girls, Inc., the \"B\", \"A\", and \"D\" being the initials of their combined codenames. Later, the remaining Serpent Society members captured Diamondback, however, [[Olinka Barankova (Earth-616)|M.O.D.A.M.]] intervened and kidnapped their former teammate [[Blanche Sitznski (Earth-616)|Anaconda]] and all three B.A.D Girls to enlist them for [[Deidre Wentworth (Earth-616)|Superia]]'s army of [[Femizons (Earth-616)|Femizons]]. While on Superia's cruise ship, Asp and Mamba befriended Zambian criminal javelin expert [[Impala (Earth-616)|Impala]], while Diamondback was attacked and almost killed by her old rival [[Sheoke Sanada (Earth-616)|Snapdragon]]. Traumatized, Diamondback decided to quit adventuring, and the team were rescued by Captain America and Paladin who once again joined forces with them to defeat Superia and her Femizons. After the battle, Captain America offered to clear their names, but the girls declined. When Mamba pulled the image of Diamondback's greatest fear from her, which was Snapdragon, Diamondback quit the group in anger. Black Mamba and Asp decided to investigate, seeking out Snapdragon. \n\nIn New York's [[Bar With No Name]], the pair were attacked by [[Anita Ehren (Earth-616)|Battleaxe]], [[Ruriko Tsumura (Earth-616)|Steel Wind]], and [[Angela Golden (Earth-616)|Golddigger]], who were seeking the bounty Superia had placed on their heads. Impala came to their rescue and joined B.A.D. Girls Inc.,replacing Diamondback. \n\nThe new trio briefly fought [[Sersi (Earth-616)|Sersi]] an Avenger when stealing a [[Serpent Saucer]] from the Society's old headquarters, and eventually tracked Superia and Snapdragon to an [[Advanced Idea Mechanics (Earth-616)|A.I.M.]] weapons exposition in [[Boca Caliente]]. However, when Snapdragon was killed by Diamondback, the threesome lost their immediate goal, and the group eventually dissolved.\n\nDiamondback regained her confidence and she contacted her friends and their group remained intermittently active. Diamondback worked for [[S.H.I.E.L.D.]], while the Asp and Black Mamba both freelanced. Mamba briefly worked for [[Justine Hammer (Earth-616)|Justine Hammer]] against the [[Thunderbolts (Earth-616)|Thunderbolts]]. \n\nSome time later, Asp and Mamba rejoined the Serpent Society when they were hunting what King Cobra believed to be Diamondback, but who turned out to be a LMD. The founding B.A.D. Girls later reunited when [[Nathan Summers (Earth-616)|Cable]] anonymously hired them to steal a new computer hard drive from the Dominus Corporation. After battling [[Wade Wilson (Earth-616)|Deadpool]] for the technology, they determined that it had already been stolen by [[Shen Kuei (Earth-616)|Cat]], and confronted him in Hong Kong. Aiding Deadpool against an army of [[Amie Zamborano (Earth-616)|Makeshift]] and [[Anastasia Summit (Earth-616)|Rive]] clones, they completed their contract, and the trio went their separate ways until their next hire.\n\n===Civil War===\nDuring the superhero [[Civil War]] over the Super Human Registration Act, the B.A.D. Girls opposed it, and joined up with Captain America's [[Secret Avengers (Civil War) (Earth-616)|Secret Avengers]].\n\n===Disbandment===\nOver time, the market for \"do-gooder\" mercenaries turned out to be scarce, with an already crowded supply. This predicament led to the dissolution of B.A.D. Girls.{{r|Captain America: Sam Wilson Vol 1 4}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Private Military Companies]]"
                }
            }
        }
    ],
    "page_id": "38278"
}