{
    "pageid": 1292590,
    "ns": 0,
    "title": "Babysitters Club (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = Babysitters Club\n| Image                   = War of the Realms Journey into Mystery Vol 1 1 Textless.jpg\n| ImageSize               = 300\n| Name                    = \n| EditorialNames          = \n| Aliases                 = Babysitters Club,{{r|War of the Realms: Journey into Mystery Vol 1 2}} the Babysitters{{r|War of the Realms: Journey into Mystery Vol 1 5}}\n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Wonder Wagon]]\n\n| Leaders                 = [[Balder Odinson (Earth-616)|Balder the Brave]]\n| CurrentMembers          = [[Balder Odinson (Earth-616)|Balder the Brave]], [[Rebecca Ryker (Earth-616)|Death Locket]], [[Sebastian Druid (Earth-616)|Druid]], [[Katherine Bishop (Earth-616)|Hawkeye]], [[Miles Morales (Earth-1610)|Spider-Man]], [[Thori (Earth-616)|Thori]], [[Simon Williams (Earth-616)|Wonder Man]]\n| FormerMembers           = \n| Allies                  = [[Laussa Odinsdottir (Earth-616)|Laussa Odinsdottir]]\n| Enemies                 = [[Sindr (Earth-616)|Sindr, Queen of Cinders]], [[Ares (Earth-616)|Ares]]\n\n| Origin                  = Joined together to protect the young child of the [[Freya (Earth-616)|All-Mother Freya]].\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Clint McElroy; Griffin McElroy; Justin McElroy; Travis McElroy; Andre Lima Araujo\n| First                   = War of the Realms: Journey into Mystery Vol 1 1\n| Last                    = \n\n| HistoryText             = The \"Babysitters Club,\" as nicknamed by [[Katherine Bishop (Earth-616)|Hawkeye]], was a group of heroes gathered by [[Balder Odinson (Earth-616)|Balder the Brave]] during the [[War of the Realms]] in order to keep his baby sister, [[Laussa Odinsdottir (Earth-616)|Laussa]], from being taken by her half-sister [[Sindr (Earth-616)|Sindr]], the Queen of Cinders. Their formation was suggested to Balder by the [[Norns (Fates) (Earth-616)|Norn]] [[Skuld (Earth-616)|Skuld]], who also told him to take Laussa as far to the West as possible. Using [[Simon Williams (Earth-616)|Wonder Man]]'s [[Wonder Wagon]] for transportation and to hide in plain sight, they were being hunted by Sindr's accomplice [[Ares (Earth-616)|Ares]], the [[God of War]]. When the babysitters were on the road, Ares approached them in his all-terrain truck. Wonder Man broke the bridge where they were driving in half, allowing the group to escape.{{r|War of the Realms: Journey into Mystery Vol 1 1}}\n\nUnknownst to any of her protectors, Laussa's godly and royal instincts prompted her to gather an army to fight in the War of the Realms, and she instinctively used her latent powers of mental manipulation to influence the \"Babysitters Club\" into visiting specific destinations where they could gather allies she would then influence too.{{r|War of the Realms: Journey into Mystery Vol 1 5}} The first of these locations was [[Bide-a-Wee RV Campground]], a caravan park inhabited by [[Deviant Skrulls|Skrull]] desertors. As they ran out of the camper, the heroes were introduced to the permanent residents of the campground. They were invited to a sing along around the campfire. During the performance, Laussa caused a fickler of the fire to burn the guitar that Sol was playing, forcing him to reveal his true nature. The rest of the campers revealed themselves and attacked the heroes in order to keep their secret safe, but calmed down very quickly when they were introduced to Laussa after [[Rebecca Ryker (Earth-616)|Death Locket]] took her out of the camper and the baby charmed them into backing down.{{r|War of the Realms: Journey into Mystery Vol 1 2}}\n\nAfter hitting the road the next morning, the \"Babysitter Club\" came upon an abandoned Wild West-inspired theme park named [[Six Gun Territory]]. The group exited the RV and wandered around the town, where they were confronted by the [[Carter Slade (Earth-616)|Phantom Rider]] and other spirits until [[Sebastian Druid (Earth-616)|Druid]]'s ability to talk to the ghosts revealed that their presence was related to Laussa.{{r|War of the Realms: Journey into Mystery Vol 1 3}} The [[Kushala (Earth-616)|Demon Rider]] later appeared to explain she had summoned the ghosts and they pledged allegiance to Laussa. They rode out of town in preparation for the War of the Realm's final battle afterwards.\n\nLaussa next made the babysitters stop by [[Sterling Hotel & Casino]], prompted by the need for funds for their trip, where they stumbled into HenchFest, a convention for super villain minions. When trying to make money at the casino by hacking the slot machines, a henchman recognized Hawkeye, resulting in a brawl until Simon managed to call a ceasefire. In the meantime, Ares had caught up with the babysitters after being guided to their location by Sindr. He abducted Laussa from the hotel room where she was being guarded by [[Thori (Earth-616)|Thori]].{{r|War of the Realms: Journey into Mystery Vol 1 4}}\n\nThe babysitters managed to retrieve the baby and confronted Ares. During the fight, the Demon Rider arrived with an army of the people from the locations the heroes had visited. She revealed that she had been influenced by Laussa, and had facilitated Ares' arrival by impersonating Sindr at the baby's request, so that she could influence Ares into fighting for the Earth. The babysitters discerned Laussa's powers and the fact that she had been influencing their entire journey. After Ares accepted to follow the child's will, the babysitters reactivated a [[S.H.I.E.L.D. Helicarrier]] hidden in [[Lake Tahoe]] and reached [[Avengers Mountain]] with their new allies and the baby safe. When Earth's heroes were gathered for the War of the Realm's final battle, the babysitters decided to move into the fight together.{{r|War of the Realms: Journey into Mystery Vol 1 5}}\n\n| Equipment               = \n| Transportation          = [[Wonder Wagon]]\n| Weapons                 = \n\n| Notes                   = * [[Katherine Bishop (Earth-616)|Hawkeye]] off-handedly calls this group \"the Babysitters Club\" in {{cl|War of the Realms: Journey into Mystery Vol 1 2}} and {{cl|War of the Realms: Journey into Mystery Vol 1 2|3}}, but the team is never actually given an official name.\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1292590"
}