{
    "pageid": 504758,
    "ns": 0,
    "title": "Bandit Murder Gang (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Bandit Murder Gang (Earth-616) from Captain America Comics Vol 1 44 0001.jpg\n| Name                    = Bandit Murder Gang\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = Bank Robbers\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Allen Bellman\n| First                   = Captain America Comics Vol 1 44\n| Last                    = Captain America Comics Vol 1 44\n\n| HistoryText             = The Bandit Murder Gang, as they came to be known, were a group of bank robbers who were active during the 1940s. In 1945 they devised a plan in which they used New York's sewer system to tunnel up into bank vaults and clean them out. In order to confuse the authorities, they then blasted the  vault doors off the hinges. During one of these robberies, they were caught in the act by two police officers who were gunned down in cold blood. These murders attracted the attention of the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]] who began investigating the strange robberies.\n\nAfter two more successful heists, the gang prepared to rob the Farmers Exchange Bank when the Torch deduced who the robberies were being done. Following the tunnels to the gangs base, the two heroes were spotted by one of its members and their leader set a trap for the two flaming heroes. Trapping them in a glass dome filled with asbestos gum, the Bandit Murder Gang left the two heroes to die under the constricting force of the drying asbestos gum.\n\nThe Torch and Toro managed to break free and chased the gang to the Farmers Exchange. There, the crooks attempted to flee through the bank vault, but a fire ball launched by the Torch set off a fuse of their explosives, the resulting explosion killed the entire gang.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Bandit Murder Gang were all armed with pistols and had access to explosives. They had a glass dome that they could fill with asbestos gum, which was specially prepared to deal with the Human Torch and Toro.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "504758"
}