{
    "pageid": 30267,
    "ns": 0,
    "title": "Band of the Bland (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Band of the Bland (Earth-616) from All-New Official Handbook of the Marvel Universe A to Z Vol 1 1 0001.png\n| Name                    = Band of the Bland\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Citadel of Mundane Magic, above Rad Ronin's Fujiyama Funhouse, New York\n\n\n| Leaders                 = [[Doctor Angst]]\n| CurrentMembers          = [[Sitting Bullseye]], [[Doctor Angst]], [[Spanker]], [[Tillie the Hun]]\n\n| FormerMembers           = [[Black Hole]]\n| Allies                  = \n| Enemies                 = [[Howard the Duck (Earth-616)|Howard the Duck]], [[Defenders (Earth-616)|Defenders]], [[Jennifer Walters (Earth-616)|She-Hulk]], [[Laslo Pevely (Earth-616)|The Terror]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Central Park]], [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Steve Gerber; Sal Buscema; Klaus Janson\n| First                   = Marvel Treasury Edition #12\n| Last                    = Sensational She-Hulk Vol 1 17\n\n| HistoryText             = The Band of the Bland were a group of mundane, derivative, stereotypical wannabe super-villains that no one had ever heard of. [[Floyd Mangles (Earth-616)|Dr. Angst]] summoned the group together in Central Park because he claimed that they shared one common thing, none of them had ever had an original thought in their lives. He stated that he wanted the group to band together to make a name for themselves, but in actuality he had been hired by an unknown party to kill then-presidential candidate [[Howard the Duck (Earth-616)|Howard the Duck]]. Before seeking out and attacking Howard, Angst gave the group Mettle Spheres created from a mystical element called Promethium that was supposed to enhance their powers. As it turned out, Promethium is actually a mystical placebo that actually has no real effect on its user. Nonetheless, the group, now believing that they were stronger than ever, attacked [[Stephen Strange (Earth-616)|Doctor Strange's]] [[Sanctum Sanctorum]], where Howard was conversing with the [[Defenders (Earth-616)|Defenders]]. Howard and the Defenders soon defeated the Band, and they were presumably sent to prison.{{r|Marvel Treasury Edition Vol 1 #12}}\n\nYears later, Angst escaped from prison and tracked down the other members of the Band of the Bland who had all been released earlier and had gone their own separate ways, creating unspectacular lives for themselves. Angst reformed the Band to put a new mystical plot into motion. This plot became known as the Cosmic Squish Principle, essentially this would release a multitude of compacted universes which would eventually squish their own [[Earth-616| Earth dimension]] out of existence.{{r|Sensational She-Hulk Vol 1 #15}} Angst created five loci points amidst all of the pocket universes, and out of these he planned to create a new universe, the Insipiverse, which the Band would be the rulers of.{{r|Sensational She-Hulk Vol 1 #16}} This plot was opposed by the [[Jennifer Walters (Earth-616)|She-Hulk]], her secretary [[Louise Grant (Earth-616)|Louise Mason]], 1940s vigilante [[Laslo Pevely (Earth-616)|The Terror]], a member of an offshoot of the [[Watchers]] race known as the Critic, Brent Wilcox and the Band's old enemy, Howard the Duck. This group caused [[Morton Kribbee (Earth-616)|Black Hole]] to suck up all of the pocket universes using his power and the Critic forced him to hold them all within him. Black Hole somehow later ended up in Ravencroft mental institution, but the fate of the rest of the Band remains unrevealed.{{r|Sensational She-Hulk Vol 1 #17}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n* [http://www.marvunapp.com/Appendix/bandblan.htm Band of the Bland at the Marvel Appendix]\n* [http://www.marvel.com/universe/Band_of_the_Bland Band of the Bland at Marvel.com]\n* [http://en.wikipedia.org/wiki/Band_of_the_Bland Band of the Bland at Wikipedia]\n}}"
                }
            }
        }
    ],
    "page_id": "30267"
}