{
    "pageid": 631721,
    "ns": 0,
    "title": "Bantu Tribe (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Waku (Earth-616) from Jungle Tales Vol 1 1 0001.jpg\n| Name                    = Bantu Tribe\n| Aliases                 = Bantu people\n\n| Leaders                 = [[Waku (Earth-616)|Waku]]\n| CurrentMembers          = [[Lalei (Earth-616)|Lalei]], Rakatu (warrior), Omando, Chomachi\n| FormerMembers           = Kaba (former ruler, deceased), Mabu (former ruler, deceased), Jobu (usurper, deceased), Hoda (witch doctor, deceased), Kom, Zabo\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = \n| BaseOfOperations        = [[South Africa]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Ogden Whitney\n| First                   = Jungle Tales #1\n\n| History                 = The Bantu tribe was an indigenous tribe that had existed in the jungles of South Africa for centuries. In the 1950s their leader was Kaba, who in 1954 fell terminally ill and died passing along the mantle of leadership to his son [[Waku (Earth-616)|Waku]] however advised his son that he should never use force. This was contrary to the tribal tradition where any succeeding leader of the tribe had to battle the best warriors among them. When Waku refused to do so his people forced him into exile while his rival Mabu took over the tribe. Mabu defeated all their warriors and lived in opulence while the tribe toiled. [[Lalei (Earth-616)|Lalei]], Waku's lover, knew about Waku's vow to his father and after a month into Mabu's rule, during a celebration of Kaba's life, Lalei disguised herself as the \"spirit\" of Kaba and lifted Waku of his vow. Falling for this, Waku confronted and defeated Mabu in combat, tossing him into a bonfire where the usurper burned alive. Realizing Lalei's trick Waku was about to throw himself into the flames in disgrace when the real spirit of his father appeared and recanted his dying wishes allowing Waku to become the tribe's leader{{r|Jungle Tales #1}}.\n\nLater when floods threatened the Bantu tribe, Waku led his people to higher ground near their ancestral grave yard. There the tribal witch doctor Hoda attempted to usurp control of the tribe by using his magic to raise an army of [[Zombies|zombies]] to overthrow Waku. Waku fought off the undead warriors, prompting Hoda to raise an army of zombie animals to enhance their ranks, however this backfired as the zombified animals attacked the human zombies and slew Hoda{{r|Jungle Tales #2}}. Shortly thereafter, Waku found his rule briefly usurped by his own friend Jobu, who convinced the locals that the \"Fire God\" were mad at Waku. Waku clashed with Jobu, who was slain in a fire. Following Jobu's defeat the real \"Fire God\" appeared before Waku and decreed that Waku was fit to lead his people{{r|Jungle Tales #3}}. His title of leadership was once again challenged by the warrior Rakatu and when the gorilla Gondo capture Lalei. However, Waku proved his superiority by defeating Rakatu in battle in hand to hand combat and Gondo returned Lalei to him{{r|Jungle Tales #4}}. Other people who tried to take over Waku's rule included the warrior Kom{{r|Jungle Tales #5}} and Zabo{{r|Jungle Tales #6}}<ref>Waku story from {{cl|Jungle Tales #7}} goes here</ref>. Later when the tribe is threatened with starvation thanks to a lava flow that cut off their water supply, Waku ventured off to free the water. He was opposed by Omando and Chomanchi who captured Lalei in order to eliminate Waku in order to take control of the tribe themselves, but Waku defeated them and freed the water from its naturally made dam{{r|Jann of the Jungle #8}}.\n\nThe Bantu people were loyal to Waku who was not only their ruler, but also their defender from that many threats that came out of the jungle.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = [[:Wikipedia:Bantu peoples|Bantu peoples at Wikipedia]]\n}}\n[[Category:African Tribes]]"
                }
            }
        }
    ],
    "page_id": "631721"
}