{
    "pageid": 339707,
    "ns": 0,
    "title": "Bastards of Evil (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Young Allies Vol 2 4 Textless.jpg\n| ImageSize               = 300px\n| Name                    = Bastards of Evil\n| Aliases                 = \n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Superior (Bastards of Evil) (Earth-616)|The Superior]]\n| CurrentMembers          = [[Superior (Bastards of Evil) (Earth-616)|The Superior]]; [[Danielle Blunt (Earth-616)|Aftershock]]; [[Liana Feeser (Earth-616)|Mortar]]; [[Jason Pierce (Earth-616)|Ember]]\n| FormerMembers           = [[Warhead (Earth-616)|Warhead]]; [[Devin Touhy (Earth-616)|Singularity]]\n| Allies                  = \n| Enemies                 = [[Young Allies (Modern) (Earth-616)|Young Allies]]\n\n| Origin                  = Exposure to various radiations\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Sean McKeever; David Baldeón\n| First                   = Young Allies Vol 2 1\n| Last                    = \n\n| HistoryText             = The alleged discarded and disavowed sons and daughters of supervillains, the Bastards of Evil formed not to rob banks or take over the world, but purely to cause death and destruction to prove they were superior beings. They see themselves as the next generation, the future, of evil.\n\nInitially, the Bastards individually committed acts of destructive terrorism around the United States and documented their actions with floating robotic cameras. The footage would then be uploaded to a website for viewing and comments, attempting to generate positive feedback for their acts of terror. One such event, [[Warhead (Earth-616)|Warhead]] destroying an unidentified portion of Ohio, was stopped by [[Greg Willis (Earth-616)|Gravity]], though Warhead escaped.{{r|Young Allies Vol 2 1}}\n\nThe Bastards made their debut as a full group in New York City, where they encountered the various members of the group contextually known as the [[Young Allies (Modern) (Earth-616)|Young Allies]]. [[Danielle Blunt (Earth-616)|Aftershock]] ridiculed [[Angelica Jones (Earth-616)|Firestar]] for trying to find a reason behind their actions, while [[Jason Pierce (Earth-616)|Ember]] taunted several innocent bystanders that even though a hero was on the scene, they were still going to die because the hero was too busy fighting the other Bastards of Evil to save them. [[Warhead (Earth-616)|Warhead]] was saved from losing a fight against an enraged [[Greg Willis (Earth-616)|Gravity]] by his teammate [[Devin Touhy (Earth-616)|Singularity]], but said that it would have been better to let Gravity kill him, to have a shiny superhero murder a villain on camera. Warhead then blew himself up on the former site of the [[World Trade Center]], killing himself and thousands of innocent bystanders.{{r|Young Allies Vol 2 1|2}}\n\nIt was later revealed that the Bastards of Evil were actually ordinary teenagers kidnapped by [[Superior (Bastards of Evil) (Earth-616)|The Superior]]. Exposed to various forms of radiation and given \"personal narrative implants,\" the Bastards were given false memories of being the forgotten children of supervillains with powers similar to those the Superior gave them. The Bastards were meant as an example of \"what the future ought to hold\" for humanity, at least within the Superior's perspective.{{r|Young Allies Vol 2 5}}\n\nWhen Allies Nomad and Araña were kidnapped, the Bastards planned to murder them on live television as well as their website. The Young Allies were able to convince the Bastards of Evil to fight amongst themselves, with Aftershock openly attacking Singularity. The blast caused Singularity's true memories to return, making him remember his life before his false memories. Turning on the Superior, and causing the other remaining Bastards to question their own memories, he allowed the Young Allies (with the assistance of some more veteran heroes) the time to defeat them.{{r|Young Allies Vol 2 4|5}}\n\nThe Bastards of Evil are currently being held in prison. The Superior claimed that he already had a plan to escape incarceration, wipe the memories of the remaining Bastards and create \"new siblings.\"{{r|Young Allies Vol 2 5}}\n\n==The Bastards of Evil==\n* [[Superior (Bastards of Evil) (Earth-616)|The Superior]] - (Unrevealed),\"son\" of [[Samuel Sterns (Earth-616)|The Leader]]\n* [[Danielle Blunt (Earth-616)|Aftershock]] - (Danielle Blunt), \"daughter\" of [[Maxwell Dillon (Earth-616)|Electro]]\n* [[Liana Feeser (Earth-616)|Mortar]] - (Liana Feeser), \"daughter\" of [[Paul Duval (Earth-616)|Grey Gargoyle]]\n* [[Jason Pierce (Earth-616)|Ember]] - (Jason Pierce) \"son\" of [[St. John Allerdyce (Earth-616)|Pyro]]\n* [[Warhead (Earth-616)|Warhead]] - (Unrevealed), \"son\" of [[Chen Lu (Earth-616)|Radioactive Man]], presumed deceased\n* [[Devin Touhy (Earth-616)|Singularity]] - (Devin Touhy), \"son\" of [[Franklin Hall (Earth-616)|Graviton]], presumed deceased\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   =  The full motivation for the Superior creating the other Bastards has not yet been disclosed, though he did state that he plans to elevate society by dismantling it in order to rebuild it. He refers to the other Bastards as his 'siblings', and at one point suggested that Gravity would be a good candidate to become a brother if he weren't already an adult, suggesting that his process only works on younger individuals. This could also be because the Superior doesn't believe that adults are adequate for his vision of the new reality, and that it must be a youth revolution.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Heroic Age (Event)]]"
                }
            }
        }
    ],
    "page_id": "339707"
}