{
    "pageid": 490132,
    "ns": 0,
    "title": "Batmen (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Batmen (Earth-616) from All Select Comics Vol 1 1 0001.jpg\n| Name                    = Batmen\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = The Aerie\n\n| Leaders                 = [[Vulture (Batmen) (Earth-616)|Vulture]]\n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Don Rico\n| First                   = All Select Comics Vol 1 1\n| Last                    = All Select Comics Vol 1 1\n\n| HistoryText             = The Batmen were a group of unwilling slaves of the [[National Socialist German Workers Party (Earth-616)|Nazi]] scientist known only as the [[Vulture (Batmen) (Earth-616)|Vulture]]. Injected with a serum that increased their strength 20 fold and gave them the ability to fly, they required repeat injections every 24 hours or they would die. It would appear that the injections caused them to mutate into bald, purple skinned creatures. The Vulture had their tongues cut out to prevent them from speaking and gave them prop wings to aid with their flying.\n\nIn the fall of 1943, the Vulture then sent his Batmen to help capture members society that were assisting the war effort within the United States as well as to carry out sabotage missions across the country. The Vulture publicized his kidnappings and acts of sabotage by warning the authorities in advance and boasting how they and [[Steven Rogers (Earth-616)|Captain America]] could not capture them. \n\nUltimately, one of the Batmen were captured by Captain America and his partner [[James Buchanan Barnes (Earth-616)|Bucky]] who forced the mute Batman to show them to his masters hideout. However, the 24 hour period for re-injection elapsed and the Batman died. Undaunted, the two heroes managed to find the Vulture's hideout, but were captured themselves. They were brought to the \"Aerie\" the Vultures hideout hidden within a mountain that was impossible for normal men to clumb. Captain America and Bucky managed to break free and defeat the Vulture. Then used some of his serum so that they and the Vulture's prisoners could escape. Before leaving, Captain America destroyed all means to create more of the serum and all of the Batmen presumably died.{{r|All Select Comics Vol 1 1}}\n\n| Equipment               = The Batmen all wore synthetically made wings that aided them with their natural flight abilities.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Male Characters]]\n[[Category:Scientists]]"
                }
            }
        }
    ],
    "page_id": "490132"
}