{
    "pageid": 552862,
    "ns": 0,
    "title": "Beauty Magazine (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Beauty Magazine\n| Aliases                 = \n\n| Leaders                 = [[Whitney Hammond (Earth-616)|Whitney Hammond]]\n| CurrentMembers          = [[Aphrodite Ourania (Earth-616)|Victoria Starr]], [[Della Mason (Earth-616)|Della Mason]], [[Perry Palette (Earth-616)|Perry Palette]], [[Marvin Klee (Earth-616)|Marvin Klee]], [[Jim Brown (Foreman) (Earth-616)|Jim Brown]]\n| FormerMembers           = [[Clarence Snippe (Earth-616)|Clarence Snippe]], [[Phoebus Apollo (Earth-616)|Paul Belvedere]]\n\n| Identity                = \n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Manhattan]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Venus #1\n\n| History                 = ===Overview===\n\nBeauty Magazine was a magazine that was established in the 1940s by publisher [[Whitney Hammond (Earth-616)|Whitney Hammond]], it featured articles about romance and beauty. In 1948, Hammond hired [[Aphrodite Ourania (Earth-616)|Venus]] as editor of the magazine unaware that she was truly the love goddess of the [[Olympians|Olympian]] pantheon. Other employees included secretary [[Della Mason (Earth-616)|Della Mason]], art director [[Perry Palette (Earth-616)|Perry Palette]], and [[Clarence Snippe (Earth-616)|Clarence Snippe]]. Snipe was the editor prior to Venus, who quit the magazine after Venus was hired on, Clarence went on to work for \"Lovely Lady Magazine\" a rival publication{{r|Venus #1}}. During the publications run, Della constantly attempted to discredit Venus to win the position of editor and win the heart of Hammond, who had quickly begun a relationship with Venus. The magazine had it's own printing press in New York City, run by foreman Jim Brown.{{r|Venus #2}} The magazine also briefly employed another Olympian god, [[Phoebus Apollo (Earth-616)|Apollo]] during a time he posed as mortal Paul Belvedere in a plot to force Venus to return to [[Olympus]].{{r|Venus #3}}\n\n===Publication History===\n\nIn 1948, Beauty Magazine was struggling as a business until Whitney Hammond happened to stumble upon Venus as she materialized on Earth when she had decided to live and find love among mortals. He swept her away to the offices intending her to be a model. Not believing that Venus was really the goddess of love, Whitney intended to create publicity by claiming that she was discovered on a remote island and was the descendant of the goddess herself. His editor Clarence Snipe disliked the idea and was fired as a result, Hammond in a surprise move then hired Venus as his new editor much to the chagrin of Della Mason. With Venus working for the magazine the company flourished and became an instant sensation gaining publicity and notoriety.{{r|Venus #1}}\n\nWhen rival \"Lovely Lady Magazine\" was about to release a story featuring the 10 most lovely women in the world, Venus helped Beauty Magazine release a competing article. Unknown to all, Venus gathered various goddesses to appear in the article, trumping Lovely Lady's feature.{{r|Venus #1}} Hammond next intended Venus to cover a fashion show in Atlantic City next, but Della's machinations tricked Venus into traveling to Cactus City instead, hoping Venus would be fired. This plan backfired as Venus appearing in the town generated a lot of press for the magazine. Hammond was later horrified after bringing Venus to the printing presses to oversee the operation when the workers all fell head over heels for the goddess. However, despite this momentary distraction, her visit actually boosted productivity among the workers{{r|Venus #2}}. Venus also succeeded in getting an exclusive interview with Hollywood actor Rodney Radiant and got the breaking news that he was to marry his high school sweetheart Connie Lane. When Apollo decided that Venus should return to Olympus, he decided to sabotage her life on Earth by assuming the mortal guise of Paul Belvedere and getting a job at the magazine. Whitney Hammond hired \"Belvedere\" as assistant editor for the magazine. Apollo had forced the sun to stay up for 24 hours, causing a disruption within the magazine by causing the presses to temporarily burn out and sweat out the employees. Venus eventually foiled Apollo's plot and production went back on schedule.{{r|Venus #3}}\n\nIn 1949, Venus next was forced be [[Zeus (Earth-616)|Zeus]] to find the perfect mortal lovers in order to remain on Earth. In order to cover for this, she used the mission as a story idea for Beauty Magazine. Venus found her story in Meg Saunders and her boyfriend Danny who were planning on getting married in a week. Venus managed to prevent Apollo and [[Daphne (Earth-616)|Daphne]] from causing the lovers to falter. Getting the story for Beauty Magazine and winning her right to remain on Earth.{{r|Venus #5}} Hammond next took a risk by enter Venus in a Mardi Gras float that only featured her. However, the arrival of [[Loki Laufeyson (Earth-616)|Loki]] forced Venus to abandon her float, disqualifying Beauty Magazine from the parade competition. Hammond was also briefly possessed by Loki, and forced him to fire Venus as editor and install Della Mason in her place. He then attempted to force Whitney to sell Beauty Magazine to Arnold Simms, who had been hounding Hammond to sell the magazine and intended to turn it into a rag. Venus prevented the telegram from reaching Simms, and eventually freed Hammond from Loki's control. Free from Loki's evil influence, Hammond --unaware of what happened-- promptly rehired Venus.{{r|Venus #6}}\n\nIn 1950, Beauty Magazine continued to publish its usual material, but also branched off into other types of stories that were not centred around beauty and romance and became subject to danger from various super-natural threats. For a time, Beauty artist [[Marvin Klee (Earth-616)|Marvin Klee]] was briefly possessed by the spirit of Apollo when Apollo once more sought to win the love of Venus. Later it published it's most legally dangerous article yet: One written by Venus guaranteeing to bring out the inner beauty of any woman who wrote in asking for advice. Unknown to the staff, Venus summoned the spirits of Cleopatra, Helen of Troy and other women of legendary beauty to help write her responses. Even an attempt by Della Mason to force Beauty Magazine into litigation with an unsatisfied reader was thwarted{{r|Venus #9}}. Shortly thereafter the office was nearly destroyed by a tornado created by Loki's son the so-called [[Son of Satan (Loki's son) (Earth-616)|Son of Satan]], but he was defeated by Venus. Also during that year, Beauty Magazine managed to buy out its chief rival, Lovely Lady Magazine when its owner Paul Banner agreed to sell to Whitney Hammond to avoid going bankrupt.{{r|Venus #10}}\n\nThe magazine continued publication until the early 1950s. Eventually, Venus left the publication after terminating her relationship with Whitney Hammond. It is unknown if Beauty Magazine is still in publication to this day.\n\n===Staff===\n* [[Whitney Hammond (Earth-616)|Whitney Hammond]] - Owner and publisher\n* [[Aphrodite Ourania (Earth-616)|Venus]] - Editor\n* [[Clarence Snippe (Earth-616)|Clarence Snippe]] - Former editor (fired)\n* [[Della Mason (Earth-616)|Della Mason]] - Secretary\n* [[Phoebus Apollo (Earth-616)|Paul Belvedere]] - Assistant editor (fired)\n* [[Perry Palette (Earth-616)|Perry Palette]] - Art Director\n* Lucy (last name unknown) - Office worker{{r|Marvel Mystery Comics #91}}\n* [[Marvin Klee (Earth-616)|Marvin Klee]] - Artist\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Print Media]]"
                }
            }
        }
    ],
    "page_id": "552862"
}