{
    "pageid": 843724,
    "ns": 0,
    "title": "Beautiful Garbage (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Beautiful Garbage (Earth-616) Iron Man Hypervelocity Vol 1 2.jpg\n| Name                    = [[Beautiful Garbage]]\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Absynthe (Earth-616)|Absynthe]], unnamed A.I.s\n| Allies                  = \n| Enemies                 = [[Anthony Stark (Earth-616)|Iron Man]], [[Tony Stark 2.0 (Earth-616)|Iron Man 2.0]], [[Superhuman Restraint Unit (Earth-616)|Capekillers]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Adam Warren\n| First                   = Iron Man: Hypervelocity Vol 1 2\n| Last                    = \n\n| HistoryText             = The \"Beautiful Garbage\" were the multicultural waste product from assorted black-program attempts to upload human consciousness into digitilized form, including upload-research projects from [[Advanced Idea Mechanics (Earth-616)|A.I.M.]] and [[Hydra (Earth-616)|Hydra]]. They were beta-test uploads that had been classified as disposable trial runs. However, they escaped disposal and deletion.\n\nThese A.I.s and one of them specifically, [[Absynthe (Earth-616)|Absynthe]], targeted [[Iron Man (Anthony \"Tony\" Stark)|Tony Stark]] for his \"accelerationware,\" technology capable of making programs achieve incredible speeds.{{r|Iron Man: Hypervelocity Vol 1 6}} During Stark's test run with his new [[Iron Man Armor Model 29|Iron Man Armor]], the Beautiful Garbage mechas attacked him with a rail gun, which perfored his suit and incapacitated Stark. The new Iron Man's fail safe program kicked in, and a digitalized version of Stark's mind, [[Tony Stark 2.0 (Earth-616)|\"Tony Stark 2.0\"]] was uploaded into the suit.{{r|Iron Man: Hypervelocity Vol 1 2}} Via deposit by the rail gun round that penetrated the suit, Absynthe infiltrated its operating code.{{r|Iron Man: Hypervelocity Vol 1 3}}\n\nA group of Beautiful Garbage later arrived to the [[Assault Carrier Samuel Sawyer|Assault Carrier]] of the [[Superhuman Restraint Unit (Earth-616)|Capekillers]],{{r|Iron Man: Hypervelocity #5}} using Iron Man 2.0 as a bait to penetrate the Carrier, in order to manually hack into the Capekillers' systems and access to some of the highest-yield hardware on the planet.\n\nIn order to confront the mechas, Iron Man 2.0 had to jack up his cognitive clockspeed, and recoded his \"accelerationware\" software. Now moving at incredible speeds, Iron Man 2.0 was able to defeat almost every one of the mechas, up until the remaining two started moving at even higher speeds. Absynthe had covertly uploaded Tony 2.0's accelerationware into the Beautiful Garbage, which ran much faster on their processors' chipsets. However, Tony wrote additional functions into the accelerationware, which turned the remaining Beautiful Garbage into software-parasitized puppets. Tony 2.0 made the mechs destroy each other.{{r|Iron Man: Hypervelocity #6}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "843724"
}