{
    "pageid": 32615,
    "ns": 0,
    "title": "Beginagains (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Ryest (Earth-616) from X-Factor Vol 1 46 0001.jpg\n| Name                    = Beginagains\n| Aliases                 = \n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Ryest (Earth-616)|Ryest]]\n| CurrentMembers          = [[Zalph (Earth-616)|Zalph]], [[Dykon (Earth-616)|Dykon]]\n| FormerMembers           = [[Scott Summers (Earth-616)|Cyclops]]\n| Allies                  = [[Chosen (Earth-616)|Chosen]], [[Rejects (Earth-616)|Rejects]], [[X-Factor (Earth-616)|X-Factor]]\n| Enemies                 = [[Celestials]], formerly [[Chosen (Earth-616)|Chosen]], [[Rejects (Earth-616)|Rejects]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Louise Simonson; Paul Smith\n| First                   = X-Factor Vol 1 44\n| Last                    = X-Factor Vol 1 50\n\n| HistoryText             = \nOn a planet far from [[Earth]], the [[Celestials]] visited and evolved the native species, much like the [[Homo Superior|mutants]] of Earth. The beings evolved into super powered beings, some of them having outward alterations and other having interior alterations. The two groups began to segregate and the physically deformed beings became known as the [[Rejects (Earth-616)|Rejects]], while the other, more humanoid, group became the [[Chosen]]. The Celestials, who were called \"Space Gods\", returned four times and judged both groups, finding them acceptable and leaving them to progress until their next appearance. The Space Gods were worshiped and considered saviors by both the Rejects and the Chosen, each group praying to the Celestials  to sway the gods to their own petty purposes. After believing that the Space Gods did not hear their prayers, a third group emerged, comprised of both Rejects and Chosen, calling themselves, the Beginagains. Eventually, all groups began to become envious of each other and the whole planet began to war with each other.  \n\nThe Beginagains moved underground, so as to not be seen with either group. The Chosen began to build huge cities, while the Rejects moved to the forests and woods.  \n\n===X-Factor===\nWhen the group [[X-Factor (Earth-616)|X-Factor]] was pulled to their planet along with their Ship by the Celestials, the heroes were mistakenly split up divided into Reject and Chosen camps by the members of those sects. However, Cyclops, who was separated from the battle by the foot of the Celestial Gammenon, met the Beginagain leader, Ryest. He convinced the Beginagains to join him in his efforts to free his son and allies.{{r|X-Factor Vol 1 44}}\n\nWhen the Celestials prepared to make their judgment, Ryest convinced the sects to set aside their differences to unite against the Celestials in an effort to save themselves. Channeling all of their power through Cyclops, they disintegrated the hand of Arishem the Judge, causing the Celestials to leave. Ryest understood that the Celestials had only allowed themselves to be driven off to encourage the unification of the sects. Ryest, along with Chosen leader Palik and Reject leader Zharkah, formed a triumvirate to guide the unification of the sect. Whether the unification is successful or not remains to be seen.{{r|X-Factor #50}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "32615"
}