{
    "pageid": 62826,
    "ns": 0,
    "title": "Berzerkers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Berzerkers (Earth-928) from X-Men Alpha Flight Vol 1 1 001.jpg\n| Name                    = [[Berzerkers]]\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Master Builder]]\n| CurrentMembers          = [[Beastmaster]], [[Brawler]], [[Nick Rodriguez (Earth-616)|Pathfinder]], [[Cornucopia]], [[Earth-Mover]], [[Lore Lord]], [[Madelyne Pryor|Anodyne]], [[Lord of the Plants]]\n| FormerMembers           = \n| Allies                  = [[Scott Summers (Earth-616)|Cyclops]]\n| Enemies                 = [[Alpha Flight (Earth-616)|Alpha Flight]], [[X-Men (Earth-616)|X-Men]]\n\n| Origin                  = Magickally enhanced humans\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Chris Claremont; Paul Smith\n| First                   = X-Men/Alpha Flight Vol 1 1\n| Last                    = X-Men/Alpha Flight Vol 1 2\n\n| HistoryText             = \nA geological survey composed of U.S. and Canadian staff was flying to a remote location when unusual atmospherics caused difficulties for their pilot, [[Madelyne Pryor]].  Her boyfriend, [[Scott Summers (Earth-616)|Scott Summers]] was reminded of a storm he had faced while a member of the [[X-Men (Earth-616)|X-Men]] caused by [[Michael Twoyoungmen (Earth-616)|Shaman]].  After a significant lightning flash, their plane crash landed.\n\nOnce on the ground, the expedition members discovered that most (with the exception of Scott Summers) been changed by the [[Fire Fountain]].  Those changed had grown in size and gained supernatural abilities.  Madelyne Pryor discovered she had the ability to heal those injured. [[Master Builder]] created a city for them around the Fountain and [[Cornucopia]] created food and clothing.\n\n[[Marvel Girl (Rachel Summers)|Rachel Summers]] had perceived the danger to Summers (as he had fathered her in an alternate timeline).  She initially attached Shaman under the mistaken belief he caused the accident.  The X-Men and [[Alpha Flight (Earth-616)|Alpha Flight]] worked together to find the expedition.\n\nThe group decided that they could use the magic of the Fire Fountain to cure all the world's ills and decided to use it to convert humanity.  Once the combined X-Men/Alpha Flight arrived, it became apparent that the magic of the Fire Fountain had a negative effect on other magic users as Shaman lost control of his abilities and [[Snowbird]] was struck ill.  Master Builder realized he was losing the ability to create new sculptures when he faced increasing difficulty in drawing new designs in his sketchbook.\n\n[[Beastmaster]] and [[Pathfinder]] worked to prevent [[James Howlett|Wolverine]] from saving Snowbird.  When enough questions began to surface, a rift developed between those who supported using the Fountain to change the world and those who did not.\n\nAfter a battle, it was revealed the Fountain was created by [[Loki]] in an effort to elevate his status in Asgard.  When it was also revealed that the cost to change was a person's creativity and ability to imagine, it was unanimously decided to stop Loki's plan.  During the controntation, [[Those Who Sit Above in Shadow (Earth-616)|Those Who Sit Above in Shadow]] intervened and forced Loki to end his plans.\n\nAll the members of the group reverted to normal.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "62826"
}