{
    "pageid": 487934,
    "ns": 0,
    "title": "Birdmen of Pa-Pi-Ru-Gua (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Birdmen of Pa-Pi-Ru-Gua (Earth-616) from Captain America Comics Vol 1 28 0001.jpg\n| Name                    = Birdmen of Pa-Pi-Ru-Gua\n| Aliases                 = [[Birdmen]]\n\n| Leaders                 = Unnamed chief\n| CurrentMembers          = Unnamed members\n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = Formerly [[Imperial Japan (Earth-616)|Imperial Japan]]\n| Enemies                 = [[James Buchanan Barnes (Earth-616)|Bucky]], [[Steven Rogers (Earth-616)|Captain America]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[New Guinea]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Syd Shores\n| First                   = Captain America Comics Vol 1 28\n\n| History                 = [[File:Pa-Pi-Ru-Gua Birdmen Chief (Earth-616) from Captain America Comics Vol 1 28 0001.jpg|thumb|left|160px|The chief of the Birdmen]]\nThe Birdmen of Pa-Pi-Ru-Gua were a race of humans that lived on a remote island near New Guinea. They were a primitive race that commanded and flew on massive birds of unknown origins and lived inside a dormant volcano. In 1943, they were discovered by the [[Imperial Japan (Earth-616)|Imperial Japanese]] army who convinced them to join their side, and they set up their base within their volcano home. This gave the Japanese a strategical advantage in the area. \n\nSo much so that the military called on [[Steven Rogers (Earth-616)|Captain America]] to find it. He and his partner [[James Buchanan Barnes (Earth-616)|Bucky]] were shot down on the island home of the Birdmen, and they were taken prisoner. There they were told by the chief of the Birdmen that Captain America was to undergo Three Trials of Ru-Gu-Ri-Bi. If Cap won he, Bucky and the captured soldiers would be freed; if he lost, they would all be fed to the giant birds that the Birdmen controlled.\n\nAs Captain America completed these tasks, Bucky and the others broke free from the hut they were being kept in and fought their way to a Japanese bomber and saved Cap. As they fled, they dropped a bomb down into the volcano that caused it to become active again, causing a massive eruption that wiped out everyone below. If this led to the extinction of the Birdmen remains to be explored.{{r|Captain America Comics Vol 1 28}}\n| Notes                   = * A tribal people they put worthy opponents through the Three Trials of Ru-Gu-Ri-Bi. Two of these trials have been depicted: The first is battling a gorilla to the defeat, the second the worthy is made to swim across an alligator infested river. The third trial has not been recorded and is unknown. Those who passed the three trials were allowed to go free; those who failed but survived were then fed to their massive birds.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Tribes]]"
                }
            }
        }
    ],
    "page_id": "487934"
}