{
    "pageid": 5902,
    "ns": 0,
    "title": "Black Air (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Black Air (Earth-616) from Excalibur Vol 1 87 0001.jpg\n| Name                    = [[Black Air]]\n| Aliases                 = \n\n| Leaders                = \n| CurrentMembers          = [[Michele Scicluna (Earth-616)|Michele Scicluna]]; [[Peter Wisdom (Earth-616)|Pete Wisdom]]; [[Lee Franks (Earth-616)|Lee Franks]]; [[Threadgold (Earth-616)|Threadgold]]; [[Jago Marrak (Earth-616)|Jago Marrak]]\n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Excalibur (Earth-616)|Excalibur]], [[Weird Happenings Organization (Earth-616)|W.H.O.]]\n| Enemies                 = \n\n| Origin                  = Black Air is a former Governmental Intelligence department founded and operating primarily within the United Kingdom in the fictional Marvel Universe, initially as an adjunct to the Ministry of Defense. It was introduced along with [[Peter Wisdom (Earth-616)|Pete Wisdom]] in the [[Excalibur (Earth-616)|Excalibur]].\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = The Blackwall (former HQ), [[England]], [[United Kingdom]]; Dream Nails (former research facility)\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Warren Ellis; Ken Lashley\n| First                   = Excalibur Vol 1 86\n\n| History                 = \nBlack Air, as a covert, secretive intelligence department, was mandated with the investigation into and research of supernatural and paranormal phenomena, at first alongside, and then replacing another British Intelligence department, the [[Weird Happenings Organization (Earth-616)|Weird Happenings Organization (W.H.O)]].\n\nThe organization was introduced and had entirely replaced the W.H.O, collecting alien technologies and specimens for use in combat and gene-splicing with human test subjects, respectively; at introduction, Black Air used the W.H.O's old links to the super-team [[Excalibur (Earth-616)|Excalibur]] to send them to investigate a civil uprising in [[Genosha]], with particular reference to anti-mutant ammunition. As an attachment to the team, field agent [[Peter Wisdom (Earth-616)|Peter Wisdom]] was sent along as Black Air's representative. However, it transpired that the entire mission had in fact been a ruse; Black Air had in fact sent the mission simply to cause a commotion, that they might use to their advantage, accessing whatever technologies or informations were revealed by the investigation.<ref>[http://www.uncannyxmen.net/db/spotlight/showquestion.asp?faq=10&fldAuto=114&page=2]</ref>\n\nFollowing that mission, Wisdom took Excalibur member [[Katherine Pryde (Earth-616)|Kitty Pryde]] with him to investigate the death of an old friend, ultimately leading him to ''Dream Nails'', a codenamed Black Air facility which had dealt with xeno-biological specimens, such as a race known as the [[Uncreated (Aliens)|Uncreated]]; these creatures had been experimented on within the facility to create ''Blood Eagle'', a psychoactive virus that would consume the flesh of the host if they experienced any stressful emotion.  Ultimately, Wisdom and Pryde destroyed the Dream Nails facility.<ref>[http://www.uncannyxmen.net/db/spotlight/showquestion.asp?faq=10&fldAuto=114&page=2]</ref>\n\nLater, in a bid to seize control of the country, Black Air allied themselves with the London Branch of the [[Hellfire Club (Earth-616)|Hellfire Club]], an ancient \"gentleman's club\" devoted to power through non-traditional means, in order to both bribe the British Parliament, and raise an ancient demon from its crypt below [[London (England)|London]]. The aim was to release it onto the streets, hoping to use the ensuing chaos to their advantage. Douglock, the being composed of [[Warlock (Technarch) (Earth-616)|Warlock]] and [[Douglas Ramsey (Earth-616)|Cypher]] was to be used as the conduit to the crypt. However, Wisdom and Excalibur were able to enter ''The Blackwall'', Black Air's HQ, and sever the link, rescuing Douglock, destroying The Blackwall and stopping the resurrection.\n\nHowever, Black Air survived this loss of political and actual power, albeit in a much-reduced manner, operating only through a handful of splinter cells. One of these cells sent [[Sari St. Hubbins (Earth-616)|Sari St. Hubbins]], a contract killer, to kill her former lover, Pete Wisdom, who was primarily responsible for their fall from power; simultaneously, they were responsible for the kidnapping and sale to extraterrestrials of [[Kurt Wagner (Earth-616)|Nightcrawler]].<ref>[http://www.uncannyxmen.net/db/spotlight/showquestion.asp?faq=10&fldAuto=114&page=3]</ref>\n\nRecently, as Excalibur have surfaced as a team once more, so have Black Air, as a private-sector rival operation to [[MI13 (Earth-616)|MI-13]] (otherwise known as ''The Department,'' which appears to employ, or at least be affiliated with Pete Wisdom), the official non-corrupt Governmental Intelligence successor to the Weird Happenings Organization and Black Air. As to their current aims, numbers and strength, little is known yet.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n*[http://www.uncannyxmen.net/db/spotlight/showquestion.asp?faq=10&fldAuto=114&page=2 Black Air history as part of Peter Wisdom's biography at Uncannyxmen.net]\n*[http://marveldirectory.com/teams/excalibur.htm A list of Black Air appearances in the Excalibur title up to #100 at MarvelDirectory.com]\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Black Air]]\n[[Category:Terrorist Organizations]]\n[[Category:Secret Intelligence Service]]\n[[Category:British Organizations]]"
                }
            }
        }
    ],
    "page_id": "5902"
}