{
    "pageid": 784551,
    "ns": 0,
    "title": "Black Widow Ops Program (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Black Widow Ops Program (Earth-616) from Winter Soldier Vol 1 7 001.jpg\n| Name                    = [[Black Widow Ops Program]] \n| Aliases                 = Программа спец-отряда \"Черная Вдова\"\n\n| Status                  = Active \n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Red Room Academy (Moscow)|Red Room Academy]], [[Moscow]], [[Russia|U.S.S.R.]]\n\n| Leaders                 = \n| CurrentMembers          = [[Yurgei Ivanov (Earth-616)|Epsilon Red]], [[Natalia Romanova (Earth-616)|Natalia Romanova (Clone)]], [[Mikhail Ursus (Earth-616)|Ursa Major]]\n| FormerMembers           = [[Natalia Romanova (Earth-616)|Natalia Romanova]], [[James Buchanan Barnes (Earth-616)|Winter Soldier]], [[Yelena Belova (Earth-616)|Yelena Belova]], [[Grigor Ivanovich Pchelintsov (Earth-616)|Professor Grigor Pchelintsov]], [[Lyudmila Antonovna Kudrin (Earth-616)|Dr. Lyudmila Kudrin]], [[Nadia Van Dyne (Earth-616)|Nadia Pym]], [[Ying Liu (Earth-616)|Ying Liu]], [[Alexander Cady (Earth-616)|Alexander Cady]]\n| Allies                  = [[Komitet Gosudarstvennoy Bezopasnosti (Earth-616)|K.G.B.]], [[Department X (Earth-616)|Department X]], [[Romulus (Earth-616)|Romulus]]\n| Enemies                 = [[Central Intelligence Agency (Earth-616)|CIA]], [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]], [[MI6 (Earth-616)|MI6]]\n\n| Origin                  = Soviet program used to create the perfect operative and assassin\n| PlaceOfFormation        = [[Red Room Academy (Moscow)|Red Room]], [[Moscow]], [[Russia|U.S.S.R.]]\n| Creators                = Devin Grayson; J.G. Jones\n| First                   = Black Widow Vol 1 1\n| History                 = \n===Origins===\nThe Black Widow Ops Program (Программа спец-отряда \"Черная Вдова\") was one of the [[Department X (Earth-616)|Department X]]'s espionage training programs, which played a critical role in [[Natalia Romanova (Earth-616)|Natalia Romanova]]'s life. Based at the [[Red Room]] facility, it had been a [[Cold War (Event)|Cold War]] program to train the deadliest female spy in the world. It was created due to the success of their previous sleeper agent and assassin, the [[James Buchanan Barnes (Earth-616)|Winter Soldier]].{{r|Captain America Vol 5 27}}\n\n[[File:Red Room (Earth-616) Black Widow Deadly Origin Vol 1 2.jpg|left|thumb|Red Room training]]\nThe Black Widow Ops Program didn't simply use training, but also employed biochemical enhancements for its agents and also implanted them with false memories reminiscent of those used by the [[Weapon Plus (Earth-616)|Weapon Plus Program]].{{r|Captain America Vol 5 27}} \nDepartment X recruited 28 little orphan girls to make them undetectable deep-cover agents to infiltrate [[China]] and the West. The core methodology was designed by [[Grigor Ivanovich Pchelintsov (Earth-616)|Professor Grigor Pchelintsov]], a leader in the field of psychotechnics, and allowed for imprinting people with almost completely fabricated memories.{{r|Captain America Vol 5 27}} They were made to believe that they were trained in ballet in the [[Bolshoi Theatre]].{{r|Black Widow Vol 3 #4|5}}{{r|Black Widow Vol 3 #6}} During her training, Romanova was contacted by the [[Amora (Earth-616)|Enchantress]], who manipulated her simply for the sake of it suggesting that Romanova may be freed only to prevent her from escaping - however, Romanova's effort attracted attention of the program's organizers who would have otherwise \"discarded\" Romanova.{{r|Black Widow and the Marvel Girls #1}} Natasha was placed with a handler, [[Ivan Petrovitch (Earth-616)|Ivan Petrovitch]].\n\n===Enhancements===\nFurthermore, the girls all received a special treatment designed by [[Lyudmila Antonovna Kudrin (Earth-616)|Dr. Lyudmila Kudrin]], a biochemist. The Kudrin treatment could make women stay young for many decades, as well as superhumanly healthy and resilient.{{r|Black Widow Vol 3 #6}}\n\n[[File:Red Room (Earth-616) Black Widow Vol 1 1.gif|left|thumb]]\n===Wolf Spider Ops Program===\n[[Niko Constantin (Earth-616)|Niko Constantin]] was the only male trainee of the Red Room's male equivalent dubbed \"Wolf Spider\", Niko Constantin proved to be an effective killer, but impossible to handle or control, leading to the program to be declared a failure. Years later, he was found to be imprisoned in a Russian gulag, leading a gang of convicts dubbed the Wolf Spiders, and holding a grudge against James \"Bucky\" Barnes, one of the trainers for the Wolf Spider program.{{r|Captain America #617}}\n\n===Yelena Belova===\nThe [[Komitet Gosudarstvennoy Bezopasnosti (Earth-616)|K.G.B.]] continued the Black Widow Ops Program at the Red Room in the late 1970's. The new Black Widow program was making a reality out of the disinformation, thus helping hide what the real project had been. This Red Room program successfully trained their agent, [[Yelena Belova (Earth-616)|Yelena Belova]], though she soon left the service.{{r|Black Widow Vol 1 1}}\n\n===North Institute===\nNatasha, weary of espionage and adventure, retired to [[Arizona (State)|Arizona]] but was targeted, as were the other Black Widow subjects of the Red Room, by the [[North Institute (Earth-616)|North Institute]] on behalf of the corporation [[Gynacon (Earth-616)|Gynacon]]. Natasha's investigations led her back to [[Russia]], where she was appalled to learn the previously unimagined extent of her past manipulation, and she discovered the Widows were being hunted because Gynacon, having purchased Russian biotechnology from Red Room's successor agency 2R, wanted all prior users of the technology dead. After killing Gynacon CEO [[Ian McMasters (Earth-616)|Ian McMasters]], she clashed with operatives of multiple governments to help [[Sally Anne Carter (Earth-616)|Sally Anne Carter]], a girl Natasha had befriended in her investigations, whom she rescued with help from [[Matthew Murdock (Earth-616)|Daredevil]] and Yelena Belova.{{r|Black Widow Vol 3 1}}\n\n===Dark Ocean Society===\n[[File:Red Room (Earth-616) Widowmaker Vol 1 -4.jpg|left|thumb|Red Room Massacre]]\nThe Red Room was the site of mass killings of K.G.B recruits. Surveillance video revealed the killings were carried out by the [[Dark Ocean Society (Earth-616)|Dark Ocean Society]] lead by a new Ronin.{{r|Widowmaker #1}} However before their investigation was completed the group was attacked by the [[Supreme Soviets (Earth-616)|Supreme Soviets]] and were forced to split up.{{r|Widowmaker #2}} [[Clinton Barton (Earth-616)|Hawkeye]] and Black Widow traveled to Sapporo, [[Japan]], the base of operations of the Dark Ocean Society; and [[Barbara Morse (Earth-616)|Mockingbird]] and [[Dominic Fortune III (Earth-616)|Dominic Fortune]] headed to the tip of the Kamchatka Peninsula following mass Russian troop movements.{{r|Widowmaker #3}} The group reunited on the disputed [[Kuril Islands]] and discovered the identity of the new Ronin to be [[Alexi Shostakov (Earth-616)|Alexi Shostakov]], the original Red Guardian and Black Widow's ex-husband. Shostakov revealed he intended to force a war between Russia and Japan to restore Russia's former glory. A battle ensued as the heroes took on a combination of the Dark Ocean Society and the Supreme Soviets. During the battle Hawkeye received a critical blow to the head, but Widow however managed to take down Shostakov with the help of [[Fantasma (Dark Ocean Society) (Earth-616)|Fantasma]].{{r|Widowmaker #4}}\n\n===Reformation===\nThe Red Room was reformed years later, and an American branch overseen by [[Alexander Cady (Earth-616)|Alexander Cady]]{{r|Tales of Suspense Vol 1 103}} was established in [[Westchester County]], [[New York (State)|New York]].{{r|Tales of Suspense Vol 1 104}} In addition to continuing the original Red Room training program, this base delved into a cloning program with the objective to have at its disposal exact replicas of their best agents. A clone of Natasha Romanoff was created shortly after her death at the hands of [[Steven Rogers (Earth-61311)|Captain America]]. Even though her handler Cady intended her only to possess memories related to her service at the Red Room, [[Mikhail Ursus (Earth-616)|Ursa Major]] secretly interfered in the process that was supposed to give her only a selected few of the original Natasha Romanoff's memories.\n\nThe clone went on to target the remnants of both [[Hydra (Earth-616)|Hydra]] and [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]], while keeping a secret the fact that she remembered the entire life of her previous self. Black Widow eventually investigated the Red Room and found out about the cloning program and that she was a clone herself. Natasha started working against her handlers after Ursa Major urged her to destroy the Red Room and put an end to their operations. After faking the death of one of her targets, ex-S.H.I.E.L.D. agent [[Sally Blevins (Earth-616)|Sally Blevins]], Natasha killed Alexander Cady and pinned his murder on the Winter Soldier to throw her superiors for a loop.{{r|Tales of Suspense Vol 1 103}}\n\nAfter seemingly disposing of the Winter Soldier and his ally Hawkeye, Natasha rose up to the rank of commander, though she used her influence on the recruits to secretly turn them against their masters. Black Widow was forced to reveal her true intentions after Bucky and Clint tracked her down to the base. She killed her comrades, liberated the recruits and put an end to the cloning program. The base was detonated after Black Widow's coup was reported, and she set out to continue her endeavor to end the Red Room.{{r|Tales of Suspense Vol 1 104}}\n\n| Equipment               = '''[[Super-Soldier Serum]]''' \n| Transportation          = \n| Weapons                 = '''[[Widow's Bite]]:'''\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Government Organizations]]\n[[Category:KGB Projects]]\n[[Category:Soviet Organizations]]\n[[Category:Super-Soldier Programs]]"
                }
            }
        }
    ],
    "page_id": "784551"
}