{
    "pageid": 466532,
    "ns": 0,
    "title": "Black Dragon Society (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Black Dragon Society (Earth-616) from All Winners Comics Vol 1 3 0001.jpg\n| Name                    = [[Black Dragon Society]]\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Imperial Japan (Earth-616)|Imperial Japan]], [[Howard Smith (Earth-616)|Howard Smith]]\n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = Terrorist organization\n| Reality                 = Earth-616\n| Status                  = \n| BaseOfOperations        = Mobile\n| PlaceOfFormation        = [[Japan]]\n| PlaceOfDissolution      = \n\n| Creators                = Carl Burgos\n| First                   = All Winners Comics Vol 1 3\n\n| History                 = The Black Dragon Society was a Japanese terrorist organization that sided with [[Imperial Japan (Earth-616)|Imperial Japan]] during [[World War II]]. Following the trade embargo against [[Japan]] by the [[United States of America|United States]], Japan was in desperate need of oil and sought alternate means of obtaining it. So, it hired the Black Dragon Society and sent them into America in order to secure oil supplies. Through American businessman [[Howard Smith (Earth-616)|Howard Smith]], they sought to purchase the Wild Cat oil well located in [[Texas (State)|Texas]]. Succeeding in purchasing it from [[Ray Thompson (Earth-616)|Ray Thompson]] a wealthy oil operator, a pipeline was built from the Wild Cat well to the [[Pacific Ocean]] where the oil was pumped into a Japanese sub and transported back to Japan. Thompson learned of this, and before he could alert the authorities, he was murdered by one of the Black Dragon Society's agents.\n\nThe shots that killed Thompson were heard by the android [[Jim Hammond (Earth-616)|Human Torch]] and his partner [[Thomas Raymond (Earth-616)|Toro]]. Their attempt to stop the killer failed when the assassin turned the gun on himself. Searching the dead man's body, the Torch found the mark of the Black Dragon Society. Their investigation led them to Howard Smith, who struck the Torch as suspicious. Aware that the Torch was now investigating their operation, the Black Dragons attempted to eliminate the Torch and Toro as they rode a train to Texas. This plot failed, and the Torch and Toro discovered the pipeline. Members of the Black Dragon Society attempted to stop the two heroes from discovering where the oil went, but two of their numbers burned to death when the Torch and Toro ignited oil. Their leader fled to the Japanese sub and ordered a full retreat. However, they were too late to escape from the Human Torch and Toro who easily overpowered the sub's crew and forced them to surface. Forced to raise a white flag, the surviving members of the Black Dragon Society and Japanese sub-crew were captured by the [[United States Navy (Earth-616)|U.S. Navy]] and forced to explain their plot.{{r|All Winners Comics #3}}\n\nThe fate of Howard Smith is unknown, however it is likely he was arrested for his involvement with the group. If all of the members of the Black Dragon Society were killed or arrested and if they still remain active is as yet unrevealed.\n| Equipment               = The Black Dragon Society had specially made cloaks and masks that were fireproof. They also used specially designed diving masks that allowed them to breath and see while emerged in crude oil. \n| Transportation          = \n| Weapons                 = The Black Dragon Society armed themselves with pistols, knives, chemical sprayers that could douse the Human Torch and Toro's flames. \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]\n[[Category:Historical Organizations]]"
                }
            }
        }
    ],
    "page_id": "466532"
}