{
    "pageid": 1201798,
    "ns": 0,
    "title": "Black Riders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Black Riders (Earth-616) from Six Guns Vol 1 1 001.jpg\n| Name                    = Black Riders Motorcycle Club\n| EditorialNames          = \n| Aliases                 = The Black Riders\n\n| Leaders                 = [[Jefferson Cole (Earth-616)|Jefferson Cole]]\n| CurrentMembers          = \n| FormerMembers           = Crawley, Delilah \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Texas Ranger Division (Earth-616)|Texas Rangers]], [[Blackguard (Earth-616)|Blackguard]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Texas (State)|Texas]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[El Paso]], [[Texas (State)|Texas]]\n\n| Creators                = Andy Diggle; Davide Gianfelice\n| First                   = Six Guns Vol 1 1\n\n|Quotation                = Honestly, you bikers. Beneath all that bluster and bravado... you're all just hopeless romantics at heart. \n|Speaker                  = Vance\n| History                 = The Black Riders Motorcycle Club, most frequently known simply as The Black Riders, was a motorcycle gang formed by [[Jefferson Cole (Earth-616)|Jefferson Cole]]. While the gang grew in infamy and was known to be quite dangerous, Cole was deliberate about what kind of jobs they would take and how much heat they would draw at a time, keeping them from becoming major targets or wanted by the police, as no formal proof that they had ever been involved in anything illegal had ever been uncovered. \n\nThe Riders were contracted by an anonymous man, actually Vance, the leader of a PMC organization owned by [[Roxxon Energy Corporation (Earth-616)|Roxxon]] called [[Blackguard (Earth-616)|Blackguard]], to interrupt a Texas Ranger prisoner transfer and liberate the prisoner, [[Maria Vasquez (Earth-616)|Maria Vasquez]], better known as the Heroes for Hire operative Tarantula, who had been expedited to the United States for the murder of two men in [[San Diablo]]. The enigmatic benefactor wanted Tarantula brought in alive and unharmed, leading Cole to believe that this was supposed to be a rescue operation. The Riders tracked down the Ranger vehicle hauling Vasquez and knocked it out with a spike trap, but were surprised when not only was Vasquez unhappy to see them, but she attacked them, forcing Cole to disable her with a non-lethal riot round. In the confusion of the fighting, the two Rangers were able to recover and attempted to arrest the Riders - leading them to open fire on [[Robert Madigan (Earth-616)|Officer Robert Madgian]], lethally wounding him. In retaliation, his partner [[Tex Dawson (Modern) (Earth-616)|Tex Dawson]] returned fire and killed one of the Riders. Crawley, one of the Riders, was able to flank Dawson but before he could finish the Ranger off, Cole demanded he stand down. Cole apologized to Dawson for Madigan's death and claimed that with both sides losing a man, they were even and would go their separate ways, taking Tarantula and driving off into the sunset. \n\nThat night, the bikers met up with Vance and handed Tarantula over to him in exchange for a briefcase filled with money. While the rest of the gang made to count the bills, Cole flagged down Vance before he could leave and pressed for details about the job; having become uncomfortable after Tarantula's resistance made it clear that she wasn't looking for a rescue. Cole wanted to ensure that she wasn't in even greater trouble with Vance, and that his gang wouldn't have to worry about any additional heat because of the job. Vance blew off Cole's concerns and drove away with the girl, just as the Riders realized that the bills inside the briefcase were counterfeits used to cover up an elaborate fuel-air bomb which immediately detonated, killing all eleven remaining members of the gang, leaving only Cole himself alive. \n\nIn memory of the group, Cole decided to call himself The Black Rider, and swore to track down Vance and claim his vengeance. \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1201798"
}