{
    "pageid": 1101671,
    "ns": 0,
    "title": "Black Knife Cartel (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Black Knife Cartel (Earth-616) from Bullseye Vol 1 2 001.png\n| Name                    = Black Knife Cartel\n| Aliases                 = \n\n| Leaders                 = [[Teodor Zarco (Earth-616)|Teodor Zarco]]\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Bullseye (Lester) (Earth-616)|Bullseye (Lester)]]\n\n| Origin                  = [[Homo sapiens|Human]]\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Medellín]], [[Colombia]]\n| PlaceOfFormation        = [[Colombia]]\n| PlaceOfDissolution      = \n\n| Creators                = Ed Brisson; Guillermo Sanna Bauza\n| First                   = Bullseye Vol 1 2\n\n| History                 = The Black Knife Cartel supplied every criminal organization in the [[United States of America|U.S.]] It was led by [[Teodor Zarco (Earth-616)|Teodor Zarco]], a sadistic drug lord. Except for Teodor Zarco, all other members of the cartel had their foreheads marked with the \"X\" sign. The cartel had eyes throughout [[Colombia]].{{r|Bullseye Vol 1 1}} Everyone either was in the cartel's pocket and/or feared the cartel, and therefore no one talked. 10 years earlier the federal police tried to shut down the cartel, and its retaliation was apocalyptic. The federales were taken alive and put in prison. Their parents, children, lovers, grandparents, cousins, neighbors, and school teachers were brought to the prison. Teodor forced the federales to watch has they were killed and fed to the dogs. Ever since the federales left the cartel alone.{{r|Bullseye Vol 1 2}}\n\n[[Bullseye (Lester) (Earth-616)|Bullseye]] was hired by a NY mobster to rescue his son who had been taken hostage by the cartel. Upon arriving in Colombia, Bullseye made a lot of noise, wounding and killing people to get the cartel's attention which he finally succeeded.{{r|Bullseye Vol 1 2}} After a ferocious battle, that cost them many lives, Bullseye was captured by the Cartel but he escaped. Only to be recaptured by the cartel, due to being shot by Fabian the mobster's son who wasn't a hostage but was working with the cartel. He was brutally tortured until an FBI agent and two ex-CIA operatives intervened. The FBI agent seeking revenge against Bullseye for the murder of her FBI husband.{{r|Bullseye Vol 1 3|4}} Teodor's mansion (compound) then came under attack by [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]]. In the ensuing battle, Teodor was killed by Bullseye.{{r|Bullseye Vol 1 4}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Drug Cartels]]\n[[Category:Criminal Organizations]]\n[[Category:Colombian Organizations]]\n[[Category:Cartels]]"
                }
            }
        }
    ],
    "page_id": "1101671"
}