{
    "pageid": 547221,
    "ns": 0,
    "title": "Black Raiders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Black Raiders (Earth-616) from Tex Taylor Vol 1 2 0001.jpg\n| Name                    = Black Raiders\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Sagebrush]], [[Texas (State)|Texas]]\n\n| Leaders                 = Formerly Mr. Spruce\n| CurrentMembers          = \n| FormerMembers           = Mr. Spruce, unnamed members\n| Allies                  = \n| Enemies                 = [[Tex Taylor (Earth-616)|Tex Taylor]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Pierce Rice\n| First                   = Tex Taylor Vol 1 2\n| Last                    = Tex Taylor Vol 1 2\n\n| HistoryText             = The Black Raiders were a gang of robbers who were active during the days of the American Frontier. They operated out of the town of [[Sagebrush]], [[Texas (State)|Texas]] and were led by Mr. Spruce the owner of Spruce's Outfitting Store, however none of the gang members knew the true identity of their leader. They robbed local stores in the region and terrorized the locals. In order to avoid suspicion, Spruce had his gang rob his own store. His undoing came from having his men rob the place while cowboy [[Tex Taylor (Earth-616)|Tex Taylor]] was in town and shopping in the store. Although Tex was unable to stop the Black Raiders from robbing the cash, he agreed to local jewellery dealer Miss Farrel that he would guard her store, the next likely target as she was to ship $10,000 worth of diamonds to Pecos City.\n\nThat night, Tex stood guard and the Black Raiders came to rob the store. Although Tex managed to gun down some of the gang members, their leader (Spruce in disguise) knocked the hero out with a single punch and stole the jewels and fled. While most of the gang was rounded up by the sheriff they were unable to tell him who the identity of their leader was. Tex's face was wounded by the ring worn by the leader and seeing the \"s\" shaped mark on his face knew who it was. When he confronted Spruce, the crooked shop owner tried to gun the cowpoke down but Tex was faster and easily knocked Spruce out with a left hook and turned him over to the authorities.{{r|Tex Taylor Vol 1 2}}\n\nThe fate of Spruce and the surviving members of his gang are unknown, but it's unlikely they reformed again.\n\n| Equipment               = Members of the Black Raiders wore bandanna's over their faces to hide their identities. \n| Transportation          = Each member of the Black Raiders rode a horse.\n| Weapons                 = Members of the Black Raiders carried one or two six-shooters.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Shooting]]\n[[Category:Equestrianism]]\n[[Category:Western Teams]]"
                }
            }
        }
    ],
    "page_id": "547221"
}