{
    "pageid": 482369,
    "ns": 0,
    "title": "Black Dragons (Nowhere) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Black Dragons (Nowhere) (Earth-616) from Marvel Mystery Comics Vol 1 35 0001.jpg\n| Name                    = Black Dragons\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \"China\", [[Nowhere]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Jimmy Jupiter (Earth-616)|Jimmy Jupiter]], [[Wump Jump (Earth-616)|Wump Jump]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Ed Robbins\n| First                   = Marvel Mystery Comics Vol 1 35\n| Last                    = Marvel Mystery Comics Vol 1 35\n\n| HistoryText             = [[File:Black Dragons (Nowhere) (Earth-616) from Marvel Mystery Comics Vol 1 35 0002.jpg|thumb|left|The true forms of the Black Dragons made out of coco butter.]]\nThe Black Dragons were actually tiny men made out of coco butter who built tanks that resembled dragons that were common in the area of [[Nowhere]] called China. Since the dragons in the region had long since forgotten how to breath fire, the so-called Black Dragons were unstoppable as they were armed with fire-spewing devices.\n\nTheir reign of terror came to an end when the region was visited by [[Jimmy Jupiter (Earth-616)|Jimmy Jupiter]]. The boy was chased by the dragons and until he ran into his old friend [[Wump Jump (Earth-616)|Wump Jump]] the Dragon. Wump Jump was in China to visit his family. Later, when the Black Dragons attacked Wump Jump's home, Jimmy use ragweed to trigger a hay fever attack on Wump Jump, causing them to breath fire back at the Black Dragons. The flames were so hot that they melted the outer dragon shells and also caused the coco butter men inside to melt as well, ending their threat.{{r|Marvel Mystery Comics Vol 1 35}}\n\n| Equipment               = \n| Transportation          = The Black Dragons rode inside tanks that resembled black dragons that are common in the China region of Nowhere. They were able to breath flames out of their \"noses\".  However, the Black Dragons could not stand up to the extreme heat created by the flames of real dragons.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = The Black Dragons appeared to be an allegory of the [[Imperial Japan (Earth-616)|Imperial Japanese Army]], which at the time {{cl|Marvel Mystery Comics Vol 1 35}} was published were attempting to invade China during [[World War II]].\n| Links                   = \n}}\n[[Category:Nowhere Races]]"
                }
            }
        }
    ],
    "page_id": "482369"
}