{
    "pageid": 65338,
    "ns": 0,
    "title": "Blautot Commandos (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team  Template\n| Image                   = \n| Name                    = Blautot Commandos\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Nazi Germany; Klaus Kruptmann's home, near [[Albuquerque]], [[New Mexico (State)|New Mexico]]\n\n| Leaders                 = [[Red Skull (Johann Shmidt)|Red Skull]]\n| CurrentMembers          = \n| FormerMembers           = Konrad Schmidt; Hermann Volkmann; 34 unnamed others\n| Allies                  = [[Klaus Kruptmann]], [[Baron Zemo (Heinrich Zemo)]] (probably)\n| Enemies                 = [[Nick Fury]]\n\n| Origin                  = Elite Nazi commandos\n| PlaceOfFormation        = Nazi Germany\n| PlaceOfDissolution      = \n| Creators                = Ray Winninger; John Statema\n| First                   = All This and World War II\n| Last                    = \n\n| HistoryText             = The '''Blautot Commandos''' were an elite commando team in Nazi Germany, under the orders of the [[Johann Shmidt (Earth-616)|Red Skull]] during the first years of World War Two. It was so secret that most people were absolutely unaware of their existence.\n\nIn 1943, Nazi scientist [[Heinrich Zemo (Earth-616)|Baron Heinrich Zemo]] repaired an alien [[Orphu Time Machine]] and built two more operative time machines with the help of other scientists including [[Klaus Kruptmann (Earth-616)|Klaus Kruptmann]]. The Red Skull decided then to send three elite commando units to pre-determined points in the future, where they could find futuristic weapons to use agains the allies. The Blautot Commandos were chosen for this mission.\n\nThree twelve-person teams were sent. One was sent to year 5718, and never heard again. Another one was sent to 2146 and returned with an almost-impervious airborne attack vehicle that could level small towns. The machine was sent to [[John Falsworth (John Falsworth)|Baron Blood]]'s [[Castle Grachtt]], in [[Romania]], where Zemo would analyse it and get it ready for an attack on Italy. The Blautot team was ''not'' sent to Romania as security force.\n\nThe third team, sent to the sewards of [[San Diego]] in 1989, was met by Dr. Kruptmann, who was waiting for them. Kruptmann was a loyal Nazi, although he pretended to be working for the Americans, and offered the Blautots his own home to use as HQ. He also gave them a microscanner to enter a secret lab in [[Albuquerque]], where they could steal hulking tank-like robot [[Cavalier]]. Kruptmann could gave all this because he worked in this lab, in a different project.\n\nKruptmann did not know that lab officer [[Nicholas Fury (Earth-616)|Colonel Fury]] had called some super heroes to test the Cavalier. The Blautot tried to capture the Cavalier during the test, but they were defeated by the testers.\n\nThe Blautot insignia was not recognized - even Fury had never seen it. The Blautots's training allowed them to resist the questioning saying nothing but their names and numbers - which could not be traced; those names and numbers did not exist in any army in the world, not even beyond the Iron Curtain. However, two hints gave away all the scheme:\n\nFirstly, the insignia did appear in a book: [[World War Two Inside and Out: All the People, All the Places, and All the Events]], by [[Hamilton Crane]], explained that the elite Blautot Commandos mysteriously disappeared in 1943 (Fury then recognized that he had heard of them during the war). Besides, the microscanner was traced to Kruptmann, which led to the scientist's capture, then to the finding of the time ship, and eventually to a mission in 1943 to stop the Nazi scheme.{{r|All This and World War II}}\n\n| Equipment               = \n| Transportation          = [[Orphu Time Machine]]\n| Weapons                 = (per person) ''Schmeisser'' MP40 submachine gun; two fragmentation grenades; one smoke grenade; one assault knife\n\n| Notes                   = \n| Trivia                  = * \"Blautot\" is a fusion of two German words meaning \"blue\" and \"dead\" (the adjective form of death). However, as they were labelled \"Blue '''Death''' Commandos\", with \"death\" being a noun, the name of the unit in proper German would be \"Blau'''tod'''-Kommandos\".\n* Plot hole: There were three Blautot units sent through time: The 5718 was lost; the 1989 was defeated by the player characters and probably sent to jail in 1989; but the 2146 brought a super-weapon with them. Hamilton Crane's book detailed that the Blautots disappeared in 1943. Something must have happened to them off-screen.\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "65338"
}