{
    "pageid": 510101,
    "ns": 0,
    "title": "Bronze Savages (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Bronze Savages (Earth-616) from U.S.A. Comics Vol 1 16 0001.jpg\n| Name                    = Bronze Savages\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Seattle]], [[Washington (State)|Washington State]] and an undisclosed location in southwestern [[Canada]].\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Unnamed members\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = U.S.A. Comics Vol 1 16\n| Last                    = U.S.A. Comics Vol 1 16\n\n| HistoryText             = The so-called Bronze Savages were a tribe of Native Americans who lived around Washington state along the Canadian boarder. Resenting the original European colonists of North America, they saw this colonization as an insult to their god, who was represented as a green totem pole. Believing that by killing Caucasians they would drive them from their native land and appease their god. They began a series of murders on men, leaving a miniature green totem at the scene of each death. The authorities were unable to find out how the men were killed and the tribe continued to operate out of a barn in the town of Belford where they carried out their rituals.\n\nEventually the murders attracted the attention of [[Steven Rogers (Earth-616)|Captain America]] and [[James Buchanan Barnes (Earth-616)|Bucky]] and they went into the area to investigate. After being attacked on the train there, the pair arrived too late to stop the murder of the grandfather of the woman who tipped them off to the murders. Going to the tribes make-shift temple, Captain America and Bucky rounded them up for the authorities. However when another murder was committed while the tribe members were incarcerated the authorities were forced to let them free.\n\n[[File:Totem of the Bronze Savages from U.S.A. Comics Vol 1 16 0001.jpg|thumb|The totem worshipped by the Bronze Savages]]\nReading up on the tribe, the two heroes learned where their traditional land was located and took a canoe up there. They were soon confronted by the chief and his tribes people who explained their plot. They explained that they used the power of fear to kill their victims and then capture Cap and Bucky. The tribe then placed the two heroes atop a massive totem pole which they then lit on fire hoping to kill Cap and Bucky. The two heroes managed to break free and escape. As they fled the burning totem, they witnessed as it toppled, causing the tribes cliff-side camp to fall down a chasm sending all its members to their demise.{{r|U.S.A. Comics Vol 1 16}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each one of the Bronze Savages used traditional Native American weapons such as daggers, spears, clubs and bows and arrows.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "510101"
}