{
    "pageid": 1290620,
    "ns": 0,
    "title": "Builder Armada (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Title                   = Builder Armada\n| Image                   = Builders'_Fleet_from_Avengers_Vol_5_1.png\n| Name                    = Builder Armada{{r|Infinity Vol 1 2}}\n| EditorialNames          = \n| Aliases                 = Builder Fleet{{r|Infinity Vol 1 3}}\n\n| Status                  = Defunct\n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n| TeamLeaders             = \n| CurrentMembers          = \n| FormerMembers           = [[Builders (Race)|Builders]], [[Caretakers (Builders)|Caretakers]], [[Alephs]], [[Gardeners]], [[Curators]]\n| Allies                  = \n| Enemies                 = [[Galactic Council (Earth-616)|Galactic Council]], [[Avengers (Earth-616)|Avengers]], [[Glossary:Enigma Force|Enigma Force]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Infinity Vol 1 1\n\n| Overview                = The '''Builder Armada''' was a vast and incredibly powerful force. It consisted of several fleets, of which the main fleet had over 22,000 warships, including 17,000 light cruisers, 3,000 carriers, 2,000 heavy cruisers, 300 worldships, and 12 planet killers. The most powerful starships in its arsenal were the [[Planet Killer (Builders)|planet killers]], planetoid-sized warships that with their primary weapon (energy blast) destroyed worlds, turning them into cosmic dust. [[Alephs]], powerful sentient robots taller than the average humanoids were deployed as fighters in space combat and to lay waste to worlds.{{r|Infinity Vol 1 1|3}}{{r|Infinity: Against the Tide: Infinite Comic Vol 1 1|2}}\n| History                 = The [[Builders (Race)|Builders]]' armada was cutting a path of destruction through known space, heading toward [[Earth]]. The planet of [[Galador]] was destroyed by one of their planetoid-sized World Killers.{{r|Infinity Vol 1 1}} The [[Galactic Council (Earth-616)|Galactic Council]] attempted to set a trap for the Builders' fleet at the Corridor, site of a battle in a previous Kree-Shi'ar conflict. Which was named for being a \"corridor\" between a black hole and the asteroid remains of two shattered planets.{{r|Infinity Vol 1 2}}\n\n[[File:Builders'_Planet_Killer_from_Infinity_Vol_1_1.png|thumb|250px|Builders' Planet Killer about to destroy Galador]]\nLed by [[Kallark (Earth-616)|Gladiator]], the [[Council Armada (Earth-616)|Council Armada]] mined the asteroids and waited for the Builders' Armada. Upon its arrival they attacked and destroyed a number of Builder ships, at which point the Builders sprung their own trap. The Builders' fleet decloaked and within a minute destroyed a third of the Council fleet.{{r|Avengers Vol 5 18}} They pursued the retreating Council fleet to the agricultural world of [[Whaan Prime]], where they encountered ferocious resistance from the Council fleet. In a demonstration of their power, a [[Gardener]] was sent to the planet where it committed suicide, ending life on it with a plague.{{r|Infinity Vol 1 2}}\n\nThe Council armada successfully attacked the Builders' fleet over Builder-occupied [[Hala (Planet)|Hala]]. Super powered teams seized control of two of the world killers and turned it on the other world killers, destroying 8 of them and turning the tide of the war.\n{{r|Infinity Vol 1 3}} After suffering a serious of defeats, the Builders' fleet eventually self-destructed upon the order of the Builders.{{r|Avengers Vol 5 21}} \n| Equipment               = \n| Transportation          = Planetoid-sized World Killers, various types of interstellar warp-capable warships (with force fields and cloaking technology), sentient ships\n| Weapons                 = Directed energy weapons (beam type), [[Alephs]]\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Interstellar Fleets]]\n[[Category:Alien Military Forces]]"
                }
            }
        }
    ],
    "page_id": "1290620"
}