{
    "pageid": 1279422,
    "ns": 0,
    "title": "Butcher Squadron (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Butcher Squadron (Earth-616) from Thanos Vol 3 1 001.jpg\n| ImageSize               = 250px\n| Name                    = Butcher Squadron\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile aboard the [[Sanctuary (Vehicle)|Zero Sanctuary]]\n\n| Leaders                 = Formerly [[Thanos (Earth-616)|Thanos]]\n| CurrentMembers          = \n| FormerMembers           = [[Gh'Ree and R'Hos Blood (Earth-616)|Blood Brothers]], [[Ballista Grim (Earth-616)|Ballista Grim]], [[Ebony Maw (Earth-616)|Ebony Maw]], [[Ferox (Earth-616)|Ferox]], [[Infesti Macera (Earth-616)|Infesti Macera]], [[Proxima Midnight (Earth-616)|Proxima Midnight]]\n| Allies                  = \n| Enemies                 = [[Dorcaenir]], [[Universal Church of Truth (Earth-616)|Universal Church of Truth]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Tini Howard; Ariel Olivetti\n| First                   = Thanos Vol 3 1\n| Last                    = Thanos Vol 3 6\n\n| HistoryText             = The Butcher Squadron were a group of killers that worked for [[Thanos (Earth-616)|Thanos]] to carry out acts of wanton murder and death. They knew when they were about to go out on a mission when they heard the screams of a crew member Thanos killed. One of the jobs they did was to wipe out the pacifistic [[Dorcaernir]] people. They later were ordered by Thanos to launch an attack on the planet [[Zen-Whoberi (Planet)|Zen-Whoberi]] to prevent it from being taken over by the [[Universal Church of Truth (Earth-616)|Universal Church of Truth]].{{r|Thanos Vol 3 1}}\n\nAfter its member [[Ebony Maw (Earth-616)|Ebony Maw]] allowed Thanos' prisoner [[Gamora Zen Whoberi Ben Titan (Earth-7528)|Gamora]] to escape from her cell, the Butcher Squadron searched the ship for her. However, Thanos already found her first and asked the Squadron to meet with him. When Thanos asked which member of the Squadron allowed Gamora to escape, the Squadron were tight-lipped while Gamora explained that she escaped herself. Gamora then took a knife from [[Infesti Macera (Earth-616)|Infesti Macera]] and threatened Thanos with it. Thanos was impressed with Gamora. So, instead of punishing her, he punished Infesti by killing him for allowing Gamora to take his weapon as well as to send a message to the Squadron who were contemplating turning on Thanos.{{r|Thanos Vol 3 2}}\n\nDespite the killing of Infesti, some in Thanos' crew still contemplated turning on him. After Thanos had his crew make a valueless attack on the planet [[Sakaar]], the Blood Brothers and pilots of the Fates were convinced by the Butcher Squadron to kidnap Gamora and hold her for ransom. The kidnapping fell apart when Gamora attacked the pilot of the ship she was one, allowing Thanos to destroy its two fellow ship. After dumping the pilot out into the depths of space, Gamora managed to get the ship back to the Sanctuary. Instead of killing the Blood Brothers, Thanos placed them in the brig for the time being.{{r|Thanos Vol 3 3|4}}\n\nThe Butcher Squadron feigned loyalty toward Thanos when they came to help Thanos take away the Blood Brothers. However, they made the mistake of telling their plan of betraying Thanos in front of Gamora. Gamora let them know this and threatened to tell Thanos. Proxima attempted to silence Gamora but failed. This to a full scare mutiny on the Sanctuary. During the mutiny, the Squadron was once forced to aid Thanos so he didn't kill them. Thanos considered the mutiny to be weak and decided to leave to go after his arch-nemesis, the [[Magus (Earth-7528)|Magus]], leaving Gamora behind.{{r|Thanos Vol 3 4}}\n\nWith Thanos gone, the Butcher Squadron went after Gamora. However, Gamora was able to outmaneuver the Squadron and escape on a ship to reunite with Thanos. Ballista Grim was on Gamora's ship, hoping to pry her out of it. When the ship took off, Ballista was taken with it, leading to her death out in the depths of space. With Gamora gone, Ebony Maw and Proxima began working out their move.{{r|Thanos Vol 3 5}}\n\nMaw eventually discovered that Thanos had directed the ship on a one-way collision course for the Templeship of the Universal Church of Truth in a scheme to weaken Magus. Maw and Proxima managed to flee using an escape pod. The Blood Brothers also fled the ship as well. When Maw, Proxima, and the Blood Brothers met with Thanos months later, he chose to spare them. He even promoted Maw and Proxima and made them members of his new team, [[Black Order (Earth-616)|Cull Obsidian]].{{r|Thanos Vol 3 6}}\n\nWhat became of the Butcher Squadron after that is unknown, but it likely disbanded.\n\n| Equipment               = \n| Transportation          = Formerly [[Zero Sanctuary (Vehicle)|Zero Sanctuary]], the transport shuttle the [[Sepulcher (Vehicle)|Sepulcher]]\n| Weapons                 = Energy rifles, a trident wielded by Proxima Midnight\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1279422"
}