{
    "pageid": 323925,
    "ns": 0,
    "title": "Caged Angels (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Thunderbolts Vol 1 120 Textless.jpg\n| Name                    = Caged Angels\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n| Leaders                 = [[Mindwave (Telepath) (Earth-616)|Mind-Wave]]\n| CurrentMembers          =\n| FormerMembers           = [[Kendra Louise Price (Earth-616)|Caprice]], [[Mirage (Telepath) (Earth-616)|Mirage]], [[Bluestreak (Telepath) (Earth-616)|Blue Streak]]\n| Origin                  = The Caged Angels are a group of superheroes with the goal of turning the [[Thunderbolts (Earth-616)|Thunderbolts]] members against one another and kill them all. \n| PlaceOfFormation        = \n| PlaceOfDissolution      =\n| Creators                = Warren Ellis; Mike Deodato Jr.\n| First                   = Thunderbolts Vol 1 117\n| Last                    = Thunderbolts Vol 1 121\n\n| HistoryText             = The Caged Angels were four people with [[telepathy|telepathic powers]] that were being held captive in the [[Thunderbolts (Earth-616)|Thunderbolts]]' base, and who were using their powers to turn the team members against one another, attempting to kill them. The telepathic quartet, eventually (by the end of the battle and their lives), had managed to brainwash Swordsman into blowing up their big transport craft, the \"Zeus\", killing a lot of people; Venom into eating people; [[Chen Lu (Earth-616)|Radioactive Man]] into threatening to give everyone cancer; Norman Osborn into taking on his Green Goblin persona, also killing many; and Moonstone into planning to kill Samson and Robbie. Samson and Robbie were unaffected, and were ready for when Moonstone tried to take them out. Robbie, with Samson’s help, rediscovered some of his Speedball powers, so he used his Penance power to defeat Moonstone, and his Speedball power to save her from the crash. Meanwhile, Osborn, in his Goblin threads, was out to kill just about everyone until a very angry [[Melissa Gold (Earth-616)|Songbird]], who was going to stop the Caged Angels and already hated Osborn, started a battle royale. [[Melissa Gold (Earth-616)|Songbird]] succeeded in defeating [[Norman Osborn (Earth-616)|Osborn]] and both collapsed. As the telepaths thought that their plan  was a success, [[Bullseye (Lester) (Earth-616)|Bullseye]], apparently recovered from the nano-surgery, walked away from the operating table, grabbed some scalpels, and killed the four telepaths for practice, unaware he was saving the team.  \n| Equipment               =\n| Transportation          = \n| Weapons                 =\n| Notes                   = \n| Trivia                  =\n| Wikipedia               =\n| Links                   =\n}}"
                }
            }
        }
    ],
    "page_id": "323925"
}