{
    "pageid": 302661,
    "ns": 0,
    "title": "Calliope's Carnival & Circus (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Calliope's Carnival & Circus (Earth-616) from Werewolf by Night Vol 1 6 0001.jpg\n| Name                    = Calliope's Carnival & Circus\n| Aliases                 = Carnival of Fear\n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Rihva (Earth-616)|Swami Rihva]]\n| CurrentMembers          = \n| FormerMembers           = [[Executioner (Calliope's Carnival) (Earth-616)|Executioner]], Calliope, Elmo the Strongman (deceased), the Human Pretzel, Lotta, Mige the Lion Tamer (deceased), Odalisk, Slim Tim Thin, Valkyrie, several other unnamed members.\n| Allies                  = \n| Enemies                 = [[Jack Russell (Earth-616)|Werewolf by Night]], [[Lissa Russell (Earth-616)|Lissa Russell]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Kansas City]]\n| PlaceOfDissolution      = \n| Creators                = Len Wein; Mike Ploog\n| First                   = Werewolf by Night #6\n| Last                    = Werewolf by Night #7\n\n| HistoryText             = Calliope owned a struggling travelling circus that made its way around the Mid-Western [[United States]] and was desperate to sell it. During a stop in Kansas City, Calliope met [[Rihva (Earth-616)|Rihva]] a swami who was seeking to unlock the map to a vast treasure hidden inside the \"Blood Stone.\" He and his band of outcasts and freaks had been travelling the world to find someone with supernatural blood who could unlock the stone's secrets. The group of misfits proposed buying the circus from Calliope to use as cover as they continued their search and promised the current circus workers to a part of the treasure once they found it. Calliope agreed and the group continued with their mission, now with a form of cover to attract less attention from prying eyes.{{r|Werewolf by Night #6|7}}\n\nWhen the carnival came to [[Los Angeles]], Rihva captured [[Jack Russell (Earth-616)|Jack Russell]], having deduced his Werewolf identity through his crystal ball. Rihva planned on using the supernatural blood of the Werewolf to open the Blood Stone's secrets. In the meantime, the Carnival displayed Russell during his transformations as a spectacle for audiences to gape at. One night, Mige the animal trainer released the beast, hoping he would leave the circus, however, the Werewolf's bloodlust sent him after the diminutive animal trainor and soon all of the circus' workers were trying to fight back the wolf. Eventually, Mige tricked the Werewolf into following him into his lion's cage where the Werewolf did battle with two lions. Elmo the strongman burst onto the scene in time to try and help his new friend Jack and finally Rihva calmed the animal's down using his hypnotic powers and berate the little Mige for being so untrustworthy. {{r|Werewolf by Night #6}}\n\nThe next night, Rihva planned on killing the Werewolf and using his blood to activate the Blood Stone. When Elmo learned that Rihva actually planned on killing the creature, he strongly objected, but before he could do anything he was shot in the back by Mige. As he was dying, Elmo picked up Mige and broke the dwarf's back as he asked why he would do such a thing as he was Elmo's friend. The ensuing chaos caused the tent to catch on fire and the Werewolf soon broke his bonds. The other circus members briefly tried to stop the Werewolf before escaping for their lives. The Werewolf followed Rihva, who tried to use his mental powers on the beast, but all he could see was all of the terrible things the Werewolf planned to do to him. This grumsome scene was too much for Rihva to take and he died on the spot of a heart attack. The other circus member's subsequent fates remain unrevealed.{{r|Werewolf by Night #7}}\n\n| Equipment               = \n| Transportation          = Circus trucks\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * http://www.marvunapp.com/Appendix2/calliopecarnival.htm\n}}\n[[Category:Circuses]]"
                }
            }
        }
    ],
    "page_id": "302661"
}