{
    "pageid": 521760,
    "ns": 0,
    "title": "Card Killers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Ace Gang (Earth-616) from Saga of the Sub-Mariner Vol 1 6 001.JPG\n| Name                    = Card Killers\n| NameRef                 = {{r|Saga of the Sub-Mariner Vol 1 6}}\n| Aliases                 = Ace Gang\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = [[Ace (Card Killers) (Earth-616)|Ace]]\n| CurrentMembers          = \n| FormerMembers           = [[Ace (Card Killers) (Earth-616)|Ace]], [[Jack of Hearts (Card Killers) (Earth-616)|Jack of Hearts]], [[Jack of Diamonds (Card Killers) (Earth-616)|Jack of Diamonds]], [[Louise Judson (Earth-616)|Queen (Louise Judson)]], [[King (Card Killers) (Earth-616)|King]], various other members\n| Allies                  = \n| Enemies                 = [[Namor McKenzie (Earth-616)|Sub-Mariner]], [[Betty Dean (Earth-616)|Betty Dean]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gustav Schrotter\n| First                   = Sub-Mariner Comics Vol 1 21\n| Last                    = Sub-Mariner Comics Vol 1 21\n\n| HistoryText             = The Card Killers was a group of playing card themed robbers who were active in the New York City area in the 1940s. By the end of 1946 they were notorious for their daring waterfront robberies and were wanted for at least one murder. Their leader was a man named Ace who was secretly married to society girl Louise Judson who operated with the Card Killers under the alias of \"Queen\", she often provided the group information about society functions.\n\nTheir crime spree attracted the attention of the [[Namor McKenzie (Earth-616)|Sub-Mariner]] who began searching for the gangs whereabouts after the killed a night watchman during one of their most recent heists. That night, Louise was throwing a birthday party for her brother Clarence, drawing a large guest list of the wealthiest people in the city. Louise then tipped off her gang to rob the yacht, and had one of the Card Killers. Although they were interrupted by the Sub-Mariner, the gang knocked the hero out and then -- as per the plan -- shot Louise's brother Clarence in cold blood in order to avoid implicating her in the heist so that they could still utilize her position in society. After the gang escaped, Namor found the remains of a walkie-talkie that was smashed in the fight and traced it back to the manufacturer.\n\nHearing this, Louise had one of her men gun the man who sold her gang the walkie talkies. Meanwhile, she managed to convince consoling reporter [[Betty Dean (Earth-616)|Betty Dean]] alone long enough to rendezvous with the rest of the gang so they could prepare for their next crime. Namor however, realizing Louise was involved in the gang tracked down their hideout and attacked. Although initially captured and left to die by way of a playing card inspired death trap, Namor broke free and smashed the Card Killers's yacht, taking them all prisoner and turning them over to the police.\n\nLater, when relating the story to Betty Dean, Namor stated that the members of the Card Killers would be executed for their crimes. However the ultimate fate of each of the members of the gang remains unknown, and the group has not been seen since. \n\n| Equipment               = \n| Transportation          = Centralized along the New York waterfront the Card Killers utilized a yacht.\n| Weapons                 = The Card Killers used conventional firearms and used the occasional playing card inspired weapon. Such as weighted ceiling tiles designed to resemble playing cards that could be dropped on intruders, and large playing card designed blade on wheels that could slice through wood and flesh.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "521760"
}