{
    "pageid": 610618,
    "ns": 0,
    "title": "Caretakers of Arcturus (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Caretakers of Arcturus (Earth-616) from Fear Vol 1 26 001.png\n| ImageSize               = 250px\n| Name                    = Caretakers of Arcturus\n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Arcturus IV]]; [[Savage Land]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Kammar (Earth-616)|Kammar]]; [[Ular (Earth-616)|Ular]]; [[Zoltar (Earth-616)|Zoltar]]\n| Allies                  = [[Beyonders]]\n| Enemies                 = [[Michael Morbius (Earth-616)|Morbius]]; [[Lord I (Earth-616)|Lord I]] of Arcturus IV\n\n| Origin                  = Genetic specialists for the [[Fortisquians]], who were created by the [[Beyonders]] for the purpose of colonizing the universe.\n| PlaceOfFormation        = [[Arcturus IV]]\n| PlaceOfDissolution      = \n| Creators                = Mike Friedrich; Paul Gulacy; Steve Gerber; Gil Kane; \n| First                   = Fear Vol 1 20\n| Last                    = Fear Vol 1 26\n\n| HistoryText             = The three beings known as the '''Caretakers''' were born on [[Arcturus IV]] more than ten thousand years ago.{{r|Fear Vol 1 21}} They were among the small number of [[Fortisquians]] who lived on the planet.{{r|Fantastic Four Vol 1 316}} Kammar, Ular and Zoltar were some of the '''Genelords of Arcturus''' who controlled the reproduction of the native [[Arcturans|Arcturan]] race.{{r|Doctor Strange, Sorcerer Supreme Vol 1 26}}\n\nAbout ten thousand years ago, the leaders on [[Fortisque]] were contacted by the [[Beyonders|unknown race]] who had created them and ordered to save an [[Savage Land|animal preserve]] on [[Earth]].{{r|Fantastic Four Vol 1 316}} Those chosen for the mission set out from Arcturus IV aboard a starship called '''The Comet''' but it crashed on Earth, leaving only three survivors.{{r|Fear Vol 1 21}} Those survivors made their way to the Savage Land where they repaired the damaged environmental systems and then discovered a teleportation warp that transported them back to Arcturus IV.{{r|Fantastic Four Vol 1 316}} Unfortunately, after the expedition to Earth had left, those left in control of the planet had attempted to outlaw all natural reproduction in favor of creating new people only in the Incuflask factories. However, many Arcturans had violently opposed this idea and what began with terrorist bombings soon led to a full-scale nuclear war that killed most of the population.{{r|Fear Vol 1 23}} Discovering their homeworld in ruins following that war, the three returned to Earth.{{r|Fantastic Four Vol 1 316}}\n\nBack on Earth, the three survivors decided that their mission was to teach and guide the human race as their Caretakers.{{r|Fear Vol 1 21}} After discovering that Earth was rich in mystic energies, the trio decided that they would also improve mankind. Soon after their arrival, the Caretakers used a combination of science and sorcery to take the seed of the wolf named [[Windracer (Earth-616)|Windracer]] and bind it into certain men, creating [[Werewolves]] like [[Greysire (Earth-616)|Greysire]].{{r|Doctor Strange, Sorcerer Supreme Vol 1 26}} However, the Caretakers eventually lost control over their creations.{{r|Doctor Strange, Sorcerer Supreme Vol 1 27}}\n\nIn later years, the Caretakers continued their experiments and allegedly created the long-lived super-humans who became known as [[Maha Yogi (Earth-616)|Maha Yogi]] and the [[Anath-Na Mut (Earth-616)|Sphinx]].{{r|Doctor Strange, Sorcerer Supreme Vol 1 27}}\n\nOne thousand years ago, the Caretakers also allegedly helped the wizard [[Ebrok (Earth-616)|Ebrok]] create the race of [[Cat People (Demons)|Cat People]].{{r|Doctor Strange, Sorcerer Supreme Vol 1 27}}\n\nWithin the last century, the Caretakers became concerned that mankind seemed to have entered a decline in which his societies were crumbling and the people had placed their most potent weapons in the hands of leaders who cared more for wealth and power than for their fellow beings. Having (allegedly) discovered that they were dying, the Caretakers had undertaken '''Project: Second Genesis''' in order to create a race of super-men that they called \"[[Children of the Comet (Earth-616)|the Children of the Comet]].\" The Caretakers intended for this super-race to join with man in order to carry on their work. However, they were opposed by the sorcerer [[Daemond (Earth-616)|Daemond]] who believed that man's future lay with the dark forces of the supernatural.{{r|Fear Vol 1 21}}\n\nEventually, the Caretakers recruited [[Michael Morbius (Earth-616)|Morbius]] to help them by killing Daemond and his evil cult in exchange for their help in finding [[Martine Bancroft (Earth-616)|Martine Bancroft]] for him.{{r|Fear Vol 1 21}} They also planned for Morbius to lead the members of the super-race they were creating that was to infiltrate Earth's population and guide it from within.{{r|Fear Vol 1 22}} However, after Morbius ended up on Arcturus IV and discovered that the super-race that had been created there had become a race of radiation-mutated freaks who wished only to die, he agreed to oppose the plans of the Caretakers.{{r|Fear Vol 1 23}}\n\nAs the final confrontation neared, the Caretakers realized that Morbius was no longer worthy of their trust and sent their agents to kill Daemond and his cult.{{r|Fear Vol 1 25}} The Caretakers later teleported themselves to Daemond's base and, while their clonal agents battled the cultists, the Caretakers themselves fought Daemond. Eventually, after both sets of minions had annihilated each other, the Caretakers and Daemond realized that Morbius had disappeared and knew that only the girl [[Tara (Children of the Comet) (Earth-616)|Tara]], the flawed prototype for the Children of the Comet, could be responsible. Fearing her power, the Caretakers and Daemond agreed to a truce and they all teleported to the base of the Caretakers. Once there, Tara claimed that Daemond was actually a fourth Caretaker and that she had created his identity as Daemond the Sorcerer for her own ends but both he and the Caretakers rejected this claim and attacked her. Tara responded by using her powers to animate the three unborn Children of the Comet and send them to kill both the Caretakers and Daemond. At the same time, Tara, knowing that the entire world would have to die if she were to survive, provoked Morbius into attacking and fatally draining her of all her blood. Her death throes somehow caused the base to be destroyed.{{r|Fear Vol 1 26}}\n\n| Equipment               = \n| Transportation          = * A starship called \"The Comet\"\n* They are also aware of several warps that transport them between the Savage Land on Earth and a location on Arcturus IV.\n| Weapons                 = \n\n| Notes                   = * The back-story of the Caretakers has been revised twice since their first appearance and new information from these retcons have not meshed perfectly with previously-established facts.\n** In {{cl|Fear Vol 1 21}}, the Caretakers claimed that they were the three survivors (a scientist, an engineer and a historian) from a starship that had crashed while on a mission to merely observe and explore Earth, and that their idea to create a super-race to save mankind from its current decline was a recent one. However, in {{cl|Fear Vol 1 24}}, it was revealed that the Caretakers were the ancestors and the creators of the race of radiation-mutated immortal freaks who then made up the majority of the Arcturan population.\n** According to {{cl|Fantastic Four Vol 1 316}}, the Caretakers were actually Fortisquians who had been living on Arcturus IV and controlling the evolution of the Arcturan race until 12,000 years ago when they were sent to Earth to save an animal preserve that, unknown to them, had been constructed by the [[Nuwali]].\n** In {{cl|Doctor Strange, Sorcerer Supreme Vol 1 26}}, [[Stephen Strange (Earth-616)|Stephen Strange]] is shown reading a chapter from the [[Book of the Vishanti]] that dealt with the origin of werewolves. Written by an unknown author, this chapter recounted how Greysire, a werewolf in wolf form, often told other wolves the story of how the '''Brethren''' (what the wolves call werewolves) had been created ten thousand years ago by three Genelords of Arcturus who had fled to Earth after war broke out on Arcturus IV. After arriving on Earth, they soon decided to improve man by creating a new and superior people, and used the \"seed\" from a wolf to do so.\n* The Fantastic Four retcon attempts to link the name of the starship in which the Caretakers travelled to Earth with the fact that the Fortisquians used \"comet-ships\" (starships disguised as comets) whenever they secretly checked up on their colonies on other planets. It doesn't really work because there's never been even a hint that The Comet was ever disguised as a comet. Additionally, the idea of sending genetic specialists to save an animal preserve also doesn't make much sense when the reason that preserve was threatened was due to a technological failure.\n* Although the first two versions clearly state that the Caretakers left Arcturus IV before the war, the most recent version claims that the war was the reason why they fled their homeworld. This version also omits any mention of them not being members of the Arcturan race.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Arcturans]]\n[[Category:Fortisquians]]"
                }
            }
        }
    ],
    "page_id": "610618"
}