{
    "pageid": 489778,
    "ns": 0,
    "title": "Carnival of Doom (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Carnival of Doom (Earth-616) from Captain America Comics Vol 1 29 0001.jpg\n| Name                    = Carnival of Doom\n| Aliases                 = Devil Dancers{{r|Avengers, Thor & Captain America: Official Index to the Marvel Universe Vol 1 8}}\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Rudolf{{r|Avengers, Thor & Captain America: Official Index to the Marvel Universe Vol 1 8}}\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Captain America Comics Vol 1 29\n| Last                    = Captain America Comics Vol 1 29\n\n| HistoryText             = The so-called \"Carnival of Doom\" or \"Devil Dancers\" were a group of [[National Socialist German Workers Party (Earth-616)|Nazi]] spies active during [[World War II]]. In the summer of 1943, they became aware of the \"Ballet Gestapo\", a play put on in New York that mocked the Nazi regime as well as its leader [[Adolf Hitler (Earth-616)|Adolf Hitler]]. They set out to eliminate all those involved for this effrontery to their leader.\n\nSuspecting that the [[Jim Hammond (Earth-616)|Human Torch]] and his partner [[Thomas Raymond (Earth-616)|Toro]] would attempt to stop them, they sent one of their agents to lob a grenade into their apartment. The Human Torch and Toro thwarted this assassination attempt, and their attacker fell from the fire escape outside their window. As he died, he told the two heroes that he was ordered to keep them away from the Ballet Gestapo.\n\nThat night, the Carnival of Doom dressed in devil costumes as extras in the play. When the performance went on and the actor mockingly Hitler called them on stage, they then began attacking the actors killing them on stage with real pitchforks. Witnessing this from the audience, the Human Torch and Toro flamed into action and stopped them from murdering any more of the cast.\n\nThe members of the Carnival of Doom fled up into the catwalk, however when the Torch burned away the ropes holding up the scaffold, they all fell to their deaths.{{r|Captain America Comics Vol 1 29}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = When posing as actors in the \"Ballet Gestapo\" play, they were armed with pitch forks. They also had access to fire arms and grenades.\n\n| Notes                   = {{cl|Avengers, Thor & Captain America: Official Index to the Marvel Universe Vol 1 8}} calls them the Devil Dancers and says one of them demonstrated near superhuman strength when he threw a 1,000-lb sandbag. Also, team member Rudolf was named.\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "489778"
}