{
    "pageid": 556056,
    "ns": 0,
    "title": "Cavemen of Mystery Mountain (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Cavemen of Mystery Mountain (Earth-616) from Western Winners Vol 1 6 0001.jpg\n| Name                    = Cavemen of Mystery Mountain\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mystery Mountain, [[Texas (State)|Texas]] near the town of [[Leadville]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = unnamed members\n| Allies                  = \n| Enemies                 = [[Matthew Masters (Earth-616)|Black Rider]], [[Marie Lathrop (Earth-616)|Marie Lathrop]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Syd Shores\n| First                   = Western Winners #6\n| Last                    = Western Winners #6\n\n| HistoryText             = The Cavemen of Mystery Mountain were a group of cavemen who appear to have not evolved for centuries. They were located on Mystery Mountain in the state of [[Texas (State)|Texas]] near the Frontier town of [[Leadville]]. For centuries this tribe of savages lived on the top of the mountain, undetected by modern man. They often travelled down to hunt for food, killing any humans they crossed paths with.\n\nDuring the days of the American Frontier, the cavemen on Mystery Mountain were unknown to the nearby population of Leadville, who could not explain why dead bodies turned up near the mountain on occasion. Nobody thought to investigate until the day that local girl [[Marie Lathrop (Earth-616)|Marie Lathrop]] was captured by the cavemen, prompting her jilted lover, local doctor [[Matthew Masters (Earth-616)|Matthew Masters]] to investigate her disappearance in his costumed identity of the Black Rider.\n\nThe Black Rider climbed Mystery Mountain and found that the cavemen had tied Marie to a stake and intended to burn her alive as an offering to their gods. The Rider tried to fight off the cavemen but found himself overpowered and taken prisoner. He too was tied to the stake and when the cavemen lit the kindling around their feet, the Black Rider used the flames to burn through his bonds. Free, the Rider also freed Marie and the pair made a run for it. The cavemen tried to stop their prisoners, but the Black Rider drew his guns and apparently wiped out the entire tribe, leaving no survivors.{{r|Western Winners #6}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Primitive savages on part with prehistoric cavemen, the men of Mystery Mountain had crude instruments such as rocks and spears.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "556056"
}