{
    "pageid": 505885,
    "ns": 0,
    "title": "Cell-13 (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   =\n| Name                    = Cell-13\n| Aliases                 = 13th Atlantean Sleeper Cell \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Atlantis]]\n\n| Leaders                 = Formerly [[Zoran (Earth-616)|Zoran]]\n| CurrentMembers          = \n| FormerMembers           = [[Kamar (Earth-616)|Kamar]], [[Arath (Earth-616)|Arath]], [[Krakos (Earth-616)|Krakos]] , [[Zoran (Earth-616)|Zoran]]\n| Allies                  = [[Timoran (Earth-616)|Timoran]], [[Vayos (Earth-616)|Vayos]]\n| Enemies                 = [[Namor the Sub-Mariner]]\n\n| Origin                  = Atlantean terrorist cell\n| PlaceOfFormation        = Atlantis \n| PlaceOfDissolution      = Seattle, Washington \n| Creators                = Matt Cherniss; Phil Briones; Peter Johnson\n| First                   = Sub-Mariner Vol 2 1\n| Last                    = Sub-Mariner Vol 2 5\n\n| HistoryText             = Cell-13 was the 13th Atlantean Sleeper Cell created to attack the surface world. The members of the team were altered to appear human and breathe and operate on the surface world. [[Arath (Earth-616)|Arath's]] DNA was altered so he could absorb other superhuman powers specifically [[Robert Hunter (Earth-616)|Nitro]] and Krakos' strength was enhanced to match the likes of Namor in battle. The cell was led by [[Kamar (Earth-616)|Kamar]], the estranged son of Namor and was assigned by [[Zoran (Earth-616)|Zoran]] to go to the surface and use their new powers to attack various US targets.\n\nThe first target for the cell was at random as they ended up in the small town of Bentonville, Kansas. They found a young man there called Jacob Anderson, who they tortured to death and carved gills into his neck. [[Kamar (Earth-616)|Kamar]] and [[Krakos (Earth-616)|Krakos]] then leave Arath to his task as he detonated and killed about 1000 people.\n\nThe team then traveled to the city of [[Seattle]], with the plan to construct a device to absorb all the moisture from the air, causing all the humans in the city to suffocate. During the mission, the trio killed a innocent bystander called Marv just for getting to close. Arath grew inpatient with the plan, but Kamar was able to persuade him to hold back for the right moment.\n\nThe Atlantean terrorists disguised as garbage men set up the final component to the extractor device. Krakos then killed another human by tossing him into the back of the garbage truck. They surveyed the city and their future victims from the top of the Space Needle.\n\nThe team still kept their disguises as they traveled to Unocorp building and trapped a number of humans inside, which included John. All the humans were doomed to be killed by the extractor device. [[Namor McKenzie (Earth-616)|Namor the Sub-Mariner]] then arrived to stop the terrorist and destroy the device, but the super-strong [[Krakos (Earth-616)|Krakos]] punched down to the ground before he can destroy the device. \n\nKamar then revealed himself to his estranged father and how everything he was to blame. Namor was taken back by his son's presence, and just stood there as his son explained his deep hatred for him and the humans he protected. Namor then realized his opportunity to destroy the machine but was grabbed by Arath who absorbed his powers. Arath pulled him into the air and beat him repeatedly, until Namor was able to rip off his duplicated ankle wings, causing the Arath to fall to his death and be impaled on the Space Needle.\n\nKnowing that he could not reason with Kamar, Namor knocked his son unconscious and returned to Atlantis to quell the usurpers.{{r|Sub-Mariner Vol 2 1|5}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]\n[[Category:Atlantean Organizations]]"
                }
            }
        }
    ],
    "page_id": "505885"
}