{
    "pageid": 2920,
    "ns": 0,
    "title": "Champions of Xandar (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   =Champions of Xandar (Earth-616) from Official Handbook of the Marvel Universe Teams 2005 Vol 1 1 0001.gif\n| ImageSize               = 250px\n| Name                    = Champions of Xandar\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Xandar]]\n\n| Leaders                 =\n| CurrentMembers          = \n| FormerMembers           = [[Harris Moore (Earth-616)|Comet]], [[Frank Moore (Earth-616)|Crimebuster]], [[Archibald Dyker (Earth-616)|Diamondhead]], [[Richard Rider (Earth-616)|Nova]], [[Tanak Valt (Earth-616)|Nova-Prime]], [[Rieg Davan (Earth-616)|Powerhouse]], [[Thoran Rul (Earth-616)|Protector]]\n| Allies                  = [[Nova Corps (Earth-616)|Nova Corps]]\n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = [[Xandar]]\n| PlaceOfDissolution      = [[Xandar]]\n| Creators                = Marv Wolfman; Sal Buscema\n| First                   = Fantastic Four Vol 1 208\n| Last                    = Avengers Vol 1 260\n\n| HistoryText             = \nThe Champions of Xandar were a team of superhumans/superhumanoids who banded together to protect the trouble-plagued planet of Xandar. During an invasion of Xandar by the alien Skrulls, Xandar's officials contacted the Earth superteam Fantastic Four to help them fight. The leader of the Nova Corps also brought several superhumans for the fight: Nova, Powerhouse, Sphinx, Comet, Crimebuster, Diamondhead, and Doctor Sun.{{r|Nova #25}}{{r|Fantastic Four #208}}\n\nThe Sphinx sought to use the information in Xandar's computers for himself, and soon left Xandar once he extracted what he wanted, with the Fantastic Four in pursuit. The other superhumans, except Doctor Sun, enlisted in the war against the Skrulls to pick up where the Fantastic Four left off, becoming known as the Champions of Xandar.{{r|Fantastic Four #209}}\n\nAs the war progressed, they were joined by Protector, Nova-Prime, and the alien spaceknight, Rom. Eventually, the Champions and the Nova Corps repelled the Skrull invasion, but not before Diamondhead defected to the side of the Skrulls and the young Crimebuster was killed in battle. After the war, Nova forfeited his super powers in order that he might return to Earth. The remaining Champions chose to remain together as Xandar's supreme fighting force.{{r|Rom #24}}\n\nLater, however, during an invasion of Xandar by the world-conquering alien Nebula, the remaining Champions were killed in opposing her attack, which apparently wiped out the entire population of Xandar.<ref>Behind-the-scenes in a flashback from {{cl|Avengers #260}}.</ref>\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n* Unofficial Handbook of the Marvel Universe\n}}"
                }
            }
        }
    ],
    "page_id": "2920"
}