{
    "pageid": 776738,
    "ns": 0,
    "title": "Chaos (Organization) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Chaos\n| Aliases                 = \n\n\n| Leaders                 = Unrevealed; formerly [[Prophet (Chaos) (Earth-616)|The Prophet]]\n| CurrentMembers          = Numerous unnamed members\n| FormerMembers           = [[Tori Raven (Earth-616)|Tori Raven]], [[Rashid (Earth-616)|Rashid]], [[David Levine (Earth-616)|David Levine]], M. Safaa, L. Ventmiglia, K. Rin, W. Fosburgh, C. Ward\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = [[Brock Rumlow (Earth-616)|Crossbones]]\n| Enemies                 = [[Damon Dran (Earth-616)|Damon Dran]], [[Molot Boga (Earth-616)|Molot Boga]], [[Natalia Romanova (Earth-616)|Black Widow]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Nathan Edmondson; Phil Noto\n| First                   = Black Widow Vol 5 10\n\n| History                 = Chaos is mainly a financial organization, in charge of funding armies, countries, and laundring trillions of dollars.{{r|Black Widow Vol 5 13}} Their leader, the [[Prophet (Chaos) (Earth-616)|Prophet]], was bestowed with knowledge of the future by an unrevealed entity to use Chaos to ensure said future came to pass.{{r|Black Widow Vol 5 16}}\n\n[[Natalia Romanova (Earth-616)|Black Widow]] began investigating Chaos after one of their operatives managed to inflitrate the [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] headquarters and kill a witness.{{r|Black Widow Vol 5 6}} After tracing their communications to an abandoned oil tanker near [[Costa Rica]], Natasha discovered [[Brock Rumlow (Earth-616)|Crossbones]] working for them. She encountered the [[Frank Castle (Earth-616)|Punisher]], who was following Crossbones' trail, and had discovered the ship was wired with explosives. Natasha tried to use the time left to find any clue regarding Chaos, but there was nothing.{{r|Black Widow Vol 5 9}}\n\nOn behalf of Chaos, [[Rashid (Earth-616)|Rashid]] kidnapped Black Widow's counselor [[Isaiah Ross (Earth-616)|Isaiah Ross]].{{r|Black Widow Vol 5 10}}  With the help of [[Laura Kinney (Earth-616)|X-23]], Black Widow rescued him.{{r|Black Widow Vol 5 11}}\n\nChaos later exposed Black Widow to the press, compromising her.{{r|Black Widow Vol 5 12}} Natasha bagan hunting down Chaos' accountants, using a list given to her by [[Tori Raven (Earth-616)|Tori Raven]].{{r|Black Widow Vol 5 13}}\n\nBlack Widow managed to gather all of Chaos' accountants in a boat near [[Barcelona]]. She planned to use them to gather information about Chaos, but her plan failed when it was revealed Chaos had sent reinfocements to watch over the meeting, a group of agents cloaked with invisibility technology.{{r|Black Widow Vol 5 14}} Natasha was almost defeated by the agents as Chaos' accountants escaped in a helicopter, but the [[James Buchanan Barnes (Earth-616)|Winter Soldier]] rescued her. They both followed the helicopter, which was losing fuel due to damage. But when they caught up with the crashed aircraft, all of the accountants were found dead, killed by a mysterious agent. After the helicopter exploded, an unconscious Natasha was abducted by the Prophet, leaving the Winter Soldier behind.{{r|Black Widow Vol 5 15}}\n\nThe mysterious agent teleported Natasha to [[Dubai]]. He presented himself as the Prophet, revealing to the Widow the origins of Chaos. He tried to convince Natasha that Chaos only wanted to ensure a bright future for humankin, using Dubai as an example, which Chaos allegedly helped grow. She doubted of the Prophet's true intentions, and declined his offer to join them. The Prophet later teleported Natasha to a [[Russia|Russian]] wilderness, to be dealt with by more invisible agents, who were soon killed by Natasha.{{r|Black Widow Vol 5 17}}\n\nAfter Black Widow ended up submerged in the freezing waters, the Prophet started looking for her from above the ice. She used a flare to distract him while she resurfaced from the water and attacked him. The Prophet was ultimately stabbed by Natasha in the throat, and his body was left partially submerged in the water.\n\nA few days later, a kid named [[Philip (Chaos) (Earth-616)|Philip]] was contacted psionically by one of the entities of the future, with the intention to make him the next Prophet.{{r|Black Widow Vol 5 18}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "776738"
}