{
    "pageid": 1149885,
    "ns": 0,
    "title": "Charter Federation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Charter Federation's The Hub from Star Masters Vol 1 1.jpg\n| Name                    = Charter Federation\n| EditorialNames          = \n| Aliases                 = The Charter\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = \n| Affiliation             =\n| Allies                  = [[Cosmic Commandos (Earth-616)|Cosmic Commandos]], [[Star Masters (Earth-616)|Star Masters]], [[Wendell Vaughn (Earth-616)|Quasar]] \n| Enemies                 = [[Axi-Tun]], [[Votan (Earth-616)|Votan]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| Alignment               = \n| BaseOfOperations        = [[The Hub (The Charter)|The Hub]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Doug Moench\n| First                   = Shogun Warriors Vol 1 19\n\n| History                 = The Charter Federation was established approximately one million Earth-years ago with the aim of peaceful coexistence and the preservation of sentient life throughout the cosmos. Warlike races such as the [[Kree|Kree]] and [[Deviant Skrulls|Skrulls]] are not members of this organization, which over time has expanded to include over 10,000 worlds{{r|Star Masters Vol 1 1}} and 800 member-races.{{r|Star Masters Vol 1 2}} These include the [[Rigellians]], [[Pheragots]], [[Nanda (Race)|Nanda]], [[Lumina (Race)|Lumina]], [[M'Ndavians]], [[Primal Ones|Primal Ones]], and [[Lem]].\n\nAccording to the rules of the Charter, Federation starships were required to respond to any calls for aid made by Charter members. Those same rules required that, in certain circumstances, Charter members provide complete and unquestioning assistance to other Charter members. These rules also authorized interference in a non-Charter planet's sovereign affairs if any Charter race felt that that planet's inhabitants were violent and were about to attain the spaceflight capability that would pose a direct threat to other worlds.{{r|Shogun Warriors Vol 1 19|20}}\n\nBy the early 21st century, the Charter had become the largest peacekeeping institution in the Local Group of galaxies, with its own peacekeeping militia, the [[Cosmic Commandos (Earth-616)|Cosmic Commandos]].{{r|Star Masters Vol 1 1}} The militia was at the tactical level made up of squadrons known as Cosmic Commando Units, which answered to Special Tactical Command.{{r|Star Masters Vol 1 2}}{{r|Star Masters Vol 1 3}}\n\nAlthough the races of the Charter Federation had known of [[Earth]] for millennia, it was only in recent years that there was any official Charter activity in Earth's solar system. This was initiated by [[Maur-Kon (Earth-616)|Lord Maur-Kon]], a [[Myndai]] leader who had been trapped in suspended animation on the planet for millennia. Having failed to kill his long-time enemies, the [[Followers of the Light (Earth-616)|Followers of the Light]], Maur-Kon used an ancient communications link to transmit a Charter summons for aid. Knowing that his race had been banished from the Charter, Maur-Kon hid his identity by using his technology to create a convincing duplicate of a '''Primal One''' to serve as his remote-controlled avatar. When a starship crewed by a mechanoid race arrived in response, Maur-Kon used an energy-spell to enslave them to his will, as expressed through the false Primal One.{{r|Shogun Warriors Vol 1 20}} Using these unwilling allies as his Drones, Maur-Kon was able to finally kill the Followers of the Light{{r|Shogun Warriors Vol 1 16}} but twice failed to destroy the [[Shogun Warriors (Earth-616)|Shogun Warrior]] robots that the Followers had entrusted to the three humans they had chosen to be their '''Agents of the Light'''.{{r|Shogun Warriors Vol 1 18}} Seeking more help, Maur-Kon's Primal One called upon direct aid from the federation in the form of the Charter Federation's single most powerful ship, the [[Nightwind (Starcruiser)|Starcruiser Nightwind]]. Taking control of the Nightwind's internal symbiote, the planet-destroyer known as [[Gigantauron]], the false Primal One attempted to destroy both the Shogun Warrior [[Combatra (Earth-616)|Combatra]] and the [[Fantastic Four (Earth-616)|Fantastic Four]] in [[New York City]] but was thwarted and forced to abandon Gigantauron.{{r|Shogun Warriors Vol 1 19}} Travelling in Combatra, the Agents of the Light and the Fantastic Four followed him back to the starship of the mechanoids where, during the resulting battle, the [[Susan Storm (Earth-616)|Invisible Girl]] discovered Maur-Kon's hidden control room, revealed his presence and deactivated the Primal One, freeing the mechanoids from their enslavement. Exposed and deprived of his Drones, Maur-Kon was easily taken into custody by the Nightwind's crew and finally removed from Earth.{{r|Shogun Warriors Vol 1 20}}\n\nNot long afterwards, [[Votan (Earth-616)|Lord Votan]], the ruler of the [[Axi-Tun]] race, initiated a covert plan to eliminate all species that his race considered to be inferior. As part of this plan, Axi-Tun who secretly shared his genocidal views managed to attain leadership roles in the Charter's peacekeeping militia, the Cosmic Commandos. At the same time, Votan had his scientists develop a hybrid cosmic plague that could mutate to become fatal to any race once enough members of those races had been exposed to it.{{r|Cosmic Powers Unlimited Vol 1 4}}\n\nBy the time that the Axi-Tun had secretly sacrificed enough beings to make their hybrid plague fatal to all (or most) Charter races, the Charter had decided to invite the people of Earth to join them. In order to make this offer, their mobile headquarters, known as [[The Hub (The Charter)|The Hub]], travelled to Earth's star system and projected a giant \"WE COME IN PEACE\" message that appeared to every observer on Earth in a language that they could understand. When this message caused some humans to panic, [[Wendell Vaughn (Earth-616)|Quasar]], the Earth-born [[Glossary:Protectors of the Universe|Protector of the Universe]], was summoned home to investigate. Upon visiting The Hub, Quasar confirmed the Charter's peaceful intentions and accepted an offer to rest before further discussions. Unfortunately, while Quasar was sleeping, the Axi-Tun covertly released their cosmic plague on The Hub and caused the deaths of the three million ambassadors and technicians who were stationed there. Axi-Tun agents then used Quasar's image and samples of his voice to create a false message in which \"Quasar\" claimed responsibility for the deaths on behalf of the people of Earth. When that message was broadcast across the tri-galaxy area, the [[Norrin Radd (Earth-616)|Silver Surfer]] and [[Beta Ray Bill (Earth-616)|Beta Ray Bill]] came to investigate. Meanwhile, Quasar, who had surrendered to Cosmic Commando Unit One in order to help with their investigation, broke free and escaped from The Hub after learning of the broadcast that he had supposedly made. Soon encountering both the Silver Surfer and Beta Ray Bill, Quasar was able to convince them of his innocence just before the Surfer sensed that a planetoid had suddenly materialized in the solar system and was on course to strike Earth.{{r|Star Masters Vol 1 1}}\n\nDespite being attacked by the Cosmic Commandos, the three heroes were able to prevent the planetoid from striking Earth. Later, [[Morfex (Earth-616)|Captain Morfex]], who had been thrown out of his own ship's airlock for trying to help destroy the meteor, and his loyal subordinate [[Xenith (Earth-616)|Xenith]] defected from the Commandos to join with the other three to form the [[Star Masters (Earth-616)|Star Masters]].{{r|Star Masters Vol 1 2}}\n\nWhen this newly-formed team returned to The Hub to look for clues about the mass murder, they were ambushed and captured by some Axi-Tun warriors who had previously captured a team of investigators led by [[Tana Nile (Earth-616)|Tana Nile]].{{r|Star Masters Vol 1 3}} Although the Axi-Tun attempted to destroy the Star Masters, they secretly survived, rescued Nile and the other captives, and returned to The Hub where the group realized that the Axi-Tun's genocidal plan was to use the bodies of the dead ambassadors to transport the cosmic plague to their home planets where it would erupt from the bodies and swiftly kill every sentient being there. The Star Masters were too late to prevent that fate from befalling the inhabitants of the planet [[M'Ndavi]] but the Surfer was able to destroy the infection within the remaining corpses without damaging them. The Star Masters were then able to catch up to the Axi-Tun starship carrying the source of the plague, and the Surfer, Beta Ray Bill and Quasar combined their energies to completely destroy all traces of the plague. Proof discovered by the Star Masters exonerated Quasar and the Charter members voted to expel the Axi-Tun for their heinous crimes against the galaxy.{{r|Cosmic Powers Unlimited Vol 1 4}}\n\nThe Charter later requested that the Star Masters accompany Tana Nile to [[Tun]] to take Lord Votan into custody to stand trial for his crimes against the galaxy. Despite some unexpected resistance from Votan, who secretly possessed the ability to control the wills of others, the mission was successfully completed.{{r|Cosmic Powers Unlimited Vol 1 5}}\n| Equipment               = \n| Weapons                 = * Energy weapons\n* Giant robots\n* The planet-destroyer Gigantauron\n| Transportation          = Warp-capable starships\n* The Starcruiser Nightwind\n| Notes                   = * Although the Followers of the Light (aka the Lumina) who were later revealed to be members of the Charter first appeared in {{cl|Shogun Warriors Vol 1 1}}, the fact that the Charter Federation existed was not even mentioned until {{cl|Shogun Warriors Vol 1 19}}\n| Trivia                  = \n| Links                   = \n}}\n[[Category: Aliens]]\n[[Category: Interplanetary Organizations]]"
                }
            }
        }
    ],
    "page_id": "1149885"
}