{
    "pageid": 1427484,
    "ns": 0,
    "title": "Chauvin Family (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Chauvin_Family_(Earth-616)_from_Punisher_G-Force_Vol_1_1.png\n| Name                    = Chauvin Family\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = formerly [[Willie Chauvin (Earth-616)|Commander Chauvin]]\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Marseilles]], [[France]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Mike Baron; Hugh Haynes\n| First                   = \n\n| History                 = The Chauvin Family were one of [[Marseilles]]'s oldest crime families who went legit two decades ago. Their fortune came from construction, drugs, and extortion. It controlled the Francostar company, a privately owned French aerospace company. Their space launch facility was in Belizon, French Guyana. They were led by Willie Chauvin, an astronaut and drug smuggler. Cocaine was refined at the space center and smuggled into Europe via diplomatic pouch. The space station's laser was being used to destroy the drug labs of their rivals in the [[Cali Cartel (Earth-616)|Cali Cartel]], without the knowledge of the rest of the astronauts. \n\nThe [[Frank Castle (Earth-616)|Punisher]] went to Marseilles to investigate. He attempted to sneak into the Chauvin's heavily guarded mansion but was caught. After being tortured, he was put into a centrifuge but escaped. The Punisher then took their private Dassault Mirage fighter jet to French Guyana. He got on the Space Shuttle and ended up in the space station. He revealed what Chauvin had been doing and killed the commander. Astronaut Jean gave the workers at the Francostar space center time to evacuate and then destroyed it with the laser. The Punisher and the rest of the astronauts left the space station on the space shuttle after which it exploded.{{r|Punisher: G-Force Vol 1 1}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]\n[[Category:Drug Cartels]]\n[[Category:Crime Families]]\n[[Category:French Organizations]]"
                }
            }
        }
    ],
    "page_id": "1427484"
}