{
    "pageid": 175479,
    "ns": 0,
    "title": "Chessmen (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Chessmen (Earth-616) from Iron Man Vol 1 163 001.jpg\n| Name                    = The Chessmen\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Long Island]], [[New York]]\n\n| Leaders                 = Formerly [[Obadiah Stane (Earth-616)|King]]\n| CurrentMembers          = \n| FormerMembers           = [[Obadiah Stane (Earth-616)|King]] (deceased); [[Indries Moomji (Earth-616)|Queen]]; [[Napier Sutton (Earth-616)|Pawn]]; [[Fletcher Heggs (Earth-616)|Knight]] (deceased); [[Raleigh Halward (Earth-616)|Knight II]]; [[Alban Emond (Earth-616)|Bishop]]; [[Orrick Rallison (Earth-616)|Bishop II]]; [[Barnabus Kinloch (Earth-616)|Rook]]; [[Sebastian Towers (Earth-616)|Rook II]]; [[Basil Thorpe (Earth-616)|Knight III]] (Heggs's Replacement); \n| Allies                  = Laird Jamie of Glen Travail\n| Enemies                 = [[Anthony Stark (Earth-616)|Tony Stark]]; [[James Rhodes (Earth-616)|Jim Rhodes]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Long Island]], [[New York]]\n| PlaceOfDissolution      = \n| Creators                = Dennis O'Neil; Luke McDonnell\n| First                   = Iron Man Vol 1 163\n\n| HistoryText             = Millionaire industrialist [[Obadiah Stane (Earth-616)|Obadiah Stane]] wanted to eliminate his primary competitor [[Anthony Stark (Earth-616)|Tony Stark]]. Having been brought up with a great respect for the game of chess, he patterned his actions and strategies after those associated with the game. As such, he created personal assassins, each of whom represented a chess piece and were outfitted in the garb and accessories associated with their respective ranks.<!-- {{r|Iron Man Vol 1 163}} -->\n\nStane had his agents, the Chessmen, attack Stark International and assault Stark's confidante, [[James Rhodes (Earth-616)|James Rhodes]]. Stane also set up [[Indries Moomji (Earth-616)|Indries Moomji]] as Stark's lover without Stark knowing that Moomji was actually the Chessmen's Queen. While all of this was occurring, Stane and his associates conspired to lock Stark International out of various business deals. Stane then assigned his [[Fletcher Heggs (Earth-616)|Knight]] to assassinate Tony Stark in [[New Mexico (State)|New Mexico]]. The Knight fought up against Iron Man who quickly outwitted his opponent and knocked him out with an explosion.{{r|Iron Man Vol 1 163}}\n\nWhen Stane learned of the Knight's failure, he sent his [[Alban Emond (Earth-616)|Bishop]] to silence the Knight as punishment. After which, the Bishop followed Tony Stark to [[Scotland]] to finish off the job. The Bishop came very close to killing Iron Man, but when Stark discovered where the Bishop's powers came from, he disabled his weaponry and knocked him out.{{r|Iron Man Vol 1 164}}\n\nThe next challenge came from the [[Barnabus Kinloch (Earth-616)|Rook]], who was in charge of a veritable chamber of horrors inside an old Scottish castle. Iron Man fought against the  Rook's efforts and successfully prevented his friends Jim Rhodes and Indries Moomji from being killed.{{r|Iron Man Vol 1 165}}\n\nUltimately, Tony had to come face to face with the King of the Chessmen, Obadiah Stane himself. Stane's strategy against Stark was much more insidious than just wanton violence. By manipulating a string of events, he caused Tony Stark to start drinking again - a trait that nearly destroyed his life in the past. As Stark's addiction to alcohol worsened, Stane put his opponent in check. He bought Tony's company Stark International out from under him. Tony Stark quit being Iron Man and gave the job to his friend Jim Rhodes.{{r|Iron Man Vol 1 171}}\n\nChanging its name to Stane International, he kept the Chessmen on site as his personal bodyguards.{{r|Iron Man Vol 1 173}} Jim Rhodes assumed the role of Iron Man and fought up against the Chessmen on more than one occasion. Eventually though, Tony got his act together and resumed his place as Iron Man. He engaged Obadiah Stane in one-on-one combat: Tony in his new [[Iron Man Armor MK VII|Mark VIII]] armor and Stane wearing his \"[[Iron Monger Armor|Iron Monger]]\" battlesuit. Tony beat Stane, but the leader of the Chessmen was refused to go down on anybody else's terms but his own. He placed his [[Repulsor]] to the side of his head and took his own life.{{r|Iron Man Vol 1 200}}\n\nThe Chessmen apparently retained their equipment though, and have since battled Iron Man and the alien mutant [[Broo (Earth-616)|Broo]].{{r|A + X Vol 1 17}}\n\n| Equipment               = \n* '''Both Bishops''': Electronic miter; electro-staff\n* '''All 3 Knights''': Anti-Gravity steed; energy lance\n* '''Both Rooks''': Scottish castle including traps and torture chambers \n\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "175479"
}