{
    "pageid": 1292629,
    "ns": 0,
    "title": "Children of Thanos (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Children of Thanos (Earth-616) from Avengers Annual Vol 1 7 001.png\n| Name                    = Children of Thanos{{r|Death of Captain Marvel Vol 1 1}}\n| Title                   = Children of Thanos\n| EditorialNames          = \n| Aliases                 = Thanos-Thralls\n\n| Leaders                 = Formerly [[Thanos (Earth-616)|Thanos]], [[Nebula (Earth-616)|Nebula]]\n| CurrentMembers          = \n| FormerMembers           = [[Gh'Ree and R'Hos Blood (Earth-616)|Blood Brothers]], [[Kl'rt (Earth-616)|Super-Skrull]], [[Qu'lar (Earth-616)|Qu'lar the Massive]], [[Randau (Earth-616)|Space Parasite]], [[Jalin (Earth-616)|Jalin]], [[Skragg (Earth-616)|Skragg]]\n\n| Identity                = \n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Mar-Vell (Earth-616)|Captain Marvel]], [[Avengers (Earth-616)|Avengers]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Formerly [[Titan (Moon of Saturn)|Titan]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Jim Starlin; Mike Friedrich\n| First                   = Iron Man #55\n\n| Overview                = The '''Children of Thanos''' (formerly known as '''Thanos-Thralls''') were an army and fleet of the followers of [[Thanos (Earth-616)|Thanos]] from his [[Cosmic Cube]] campaign to his [[Infinity Gauntlet (Item)|Infinity Gauntlet]] campaign.{{r|Captain Marvel Vol 1 27}}{{r|Silver Surfer Vol 3 45}} It was made up of outcasts, malcontents, pirates, mercenaries, nihilists, psychotics, and religious zealots from across known space.{{r|Captain Marvel Vol 1 31}}{{r|Avengers Annual Vol 1 7}}{{r|Silver Surfer Vol 3 45}} Which possessed hundreds of warships, each of which was heavily armed and had the firepower to ravage Earth. The fleet could overwhelm any planetary defenses and was able to take on almost any intergalactic force.{{r|Captain Marvel Vol 1 31}}{{r|Avengers Annual Vol 1 7}}{{r|Silver Surfer Vol 3 45}}\n\n[[File:Children of Thanos (Earth-616) from Silver Surfer Vol 3 45 001.png|thumb|Sanctuary escorted by the Children of Thanos fleet|300px]]\nThey followed him because he lead them on a quest for glory. They fought and died on his side, his dreams becoming theirs. Thanos promised them a new life and that he would not let down all who honored the name of Thanos.{{r|Death of Captain Marvel Vol 1 1}} After Thanos first \"death\", his followers began to worship Thanos. In which there was a prophecy regarding his eventual resurrection, at which point he would bring back the days of blood and glory.{{r|Death of Captain Marvel Vol 1 1}}{{r|Silver Surfer Vol 3 38}}\n| History                 = After Thanos slaughtered the inhabitants of [[Titan (Moon of Saturn)|Titan]], he populated it with his army.{{r|Captain Marvel Vol 1 33}} He used it as his base of operations in his goal of galactic domination via the Cosmic Cube.{{r|Captain Marvel Vol 1 30|33}} Despite being in possession of the Cosmic Cube and thereby a nearly omnipotent cosmic being, he ordered his fleet to attack the Earth.{{r|Captain Marvel Vol 1 31}}\n\nThe [[Avengers (Earth-616)|Avengers]] headed out to space to intercept the approaching fleet and did battle. They discovered a black force field within which was a colossal spacecraft which they boarded. After defeating its defenders, they learned that the spacecraft's systems made it so that anyone within range would understand the words of any language, as they would perceive it in their own tongue. They destroyed the ship, resulting in confusion in the fleet as the multi-species crews no longer understood each other. Which lead to fear and then\nviolence as they turned on each other, devastating the fleet.{{r|Avengers Vol 1 125}}\n\nAfterwards it turned out that Titan's computer [[I.S.A.A.C.]] was corrupted by Thanos, and it executed a backup plan after his apparent death, which was to destroy life on Earth and eventually the rest of the universe. It used the Children of Thanos  and its own creations\n(super powered artificial lifeforms) in its plan. They were almost successful in destroying the Earth, using a death ray with the energy of 3 suns that barely missed the planet by a quarter-mile.{{r|Captain Marvel Vol 1 58|62}}\n\nWhen Thanos arrived back in the Solar System, with plans to destroy the [[Sol]] with [[Sanctuary (Vehicle)|Sanctuary's]]'s Ion Cannon (the Star-Burster) and thereby sacrifice the inhabitants of Earth to [[Death (Earth-616)|Death]], he had with him the armada. Hundreds of heavy cruisers which the Avengers were forced to battle through to get to the Sanctuary and stop him, which they were successful in doing.{{r|Avengers Annual Vol 1 7}}\n\nAfter his resurrection, Thanos returned to his Sanctuary and reclaimed it from [[Nebula (Earth-616)|Nebula]].{{r|Silver Surfer Vol 3 38}} While Thanos was away, Captain Styx assembled a massive fleet around the Sanctuary to serve Thanos which pleased him greatly. Thanos decreed that they were too serve as his personal guard and provided them a bountiful booty of treasure.{{r|Silver Surfer Vol 3 45}}\n| Equipment               = \n| Transportation          = Interstellar starships with warp drives{{r|Silver Surfer Vol 3 45}}\n| Weapons                 = Directed energy weapons (e.g. beam)\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Alien Military Forces]]\n[[Category:Interstellar Fleets]]\n[[Category:Criminal Organizations]]\n[[Category:Pirates]]\n[[Category:Mercenaries]]"
                }
            }
        }
    ],
    "page_id": "1292629"
}