{
    "pageid": 940169,
    "ns": 0,
    "title": "Children of the Comet (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = \n| Name                    = Children of the Comet\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Los Angeles]]\n\n| Leaders                 = [[Caretakers of Arcturus (Earth-616)|Caretakers of Arcturus]]\n| CurrentMembers          = \n| FormerMembers           = [[Tara (Children of the Comet) (Earth-616)|Tara]]\n| Allies                  = \n| Enemies                 = [[Daemond (Earth-616)|Daemond]]\n\n| Origin                  = Genetically-engineered superhumans\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Steve Gerber; Gil Kane\n| First                   = Fear Vol 1 21\n| Last                    = Fear Vol 1 26\n\n| HistoryText             = The '''Children of the Comet''' were three superhumans who had been genetically-engineered by aliens whose starship, '''The Comet''', had crashed on [[Earth]] ten thousand years ago. The three survivors of that crash, after discovering that the planet was inhabited, had decided to make it their mission to guide the evolution of the [[Homo sapiens|human race]] as its [[Caretakers of Arcturus (Earth-616)|Caretakers]].{{r|Fear Vol 1 21}}\n\nWithin the last century, the Caretakers had become concerned that mankind seemed to have entered a decline in which his societies were crumbling and the people had placed their most potent weapons in the hands of leaders who cared more for wealth and power than for their fellow beings. Having (allegedly) discovered that they were dying, the Caretakers had undertaken '''Project: Second Genesis''' that was meant to create a race of super-men that they called \"the Children of the Comet\" who would join with man in order to carry on their work.{{r|Fear Vol 1 21}} The Caretakers also believed that their creations were Earth's only hope because the continued existence of humanity jeopardized the very planet itself.{{r|Fear Vol 1 26}}\n\nThe first attempt by the Caretakers to create a genetically superior being, the first child of the Caretakers' comet, was the girl-child known as [[Tara (Children of the Comet) (Earth-616)|Tara]]. However, Tara was a failed prototype because she was a psychic vampire who had to feed on life to survive.{{r|Fear Vol 1 26}}\n\nAfter Tara, the Caretakers began again with three new beings who were to be grown to adulthood within embryo cylinders. However, before they were ready to be birthed, the Caretakers learned that their enemy, the sorcerer [[Daemond (Earth-616)|Daemond]], planned to abort the creation of the Children of the Comet. To prevent that from happening, the Caretakers recruited the living vampire [[Michael Morbius (Earth-616)|Morbius]] to kill Daemond and destroy his evil cult by offering to find his long-lost love [[Martine Bancroft (Earth-616)|Martine Bancroft]] for him. Morbius agreed to those terms{{r|Fear Vol 1 21}} but before he could complete the task he ended up being transported first to another dimension, the [[Land Within]],{{r|Fear Vol 1 22}} and then to the homeworld of the Caretakers, [[Arcturus IV]].{{r|Fear Vol 1 23}}\n\nAfter Morbius returned to Earth, the Caretakers realized that he was no longer worthy of their trust so, to protect Project: Second Genesis, they sent their agents to kill Daemond and his cult.{{r|Fear Vol 1 25}} Later, as they observed Daemond preparing to sacrifice Morbius, an act that would enable him to destroy Project: Second Genesis before the embryo chambers had reached full gestation, the Caretakers decided that the only way to preserve the necessary time for the Children to be granted the gift of birth was for them to teleport themselves to Daemond's chambers and battle him personally.{{r|Fear Vol 1 26}}\n\nLater, as Daemond and his cultists battled the Caretakers and their clonal agents, Tara covertly rescued Morbius and teleported him to the base of the Caretakers where she explained her origin as the flawed prototype. However, having noticed that Morbius had disappeared and realizing that Tara must have been responsible, the Caretakers and Daemond had agreed to a brief truce so that they could work together to kill Tara who had the power to crush them all. Teleporting back to their base, the Caretakers and Daemond attacked Tara but she blasted them backwards into the embryo cylinders which shattered and released the slumbering and unfinished Children of the Comet. Tara then used her powers to infuse the Children with life and commanded them to murder their fathers which they proceeded to do by strangling them to death. Seconds later, knowing that the entire world would have to die if she were to survive, Tara provoked Morbius into attacking and fatally draining her of all her blood. Her death throes released energy that destroyed the base.{{r|Fear Vol 1 26}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * For some reason, the name \"the Children of the Comet\" was almost always spelt within quotes.\n* Since the Children of the Comet were released from their embryo tubes before they could be \"granted the gift of birth,\" they were never conscious and their bodies were not fully developed. Any superhuman abilities they might have possessed were never described or demonstrated.\n* In {{cl|Fantastic Four Vol 1 316}}, the Children of the Comet were described as \"androids\" by [[Benjamin Grimm (Earth-616)|Ben Grimm]]. This is consistent with the fact that the other Agents used by the Caretakers were described as \"genetically cloned androids\" in {{cl|Fear Vol 1 26}}. In these instances, the term android was used to refer to totally-organic artificial humans, as opposed to beings who are designed to be indistinguishable from humans on the outside but have robot-like mechanical interiors.\n| Trivia                  = \n| Links                   = * [http://www.marvunapp.com/Appendix/childcom.htm Children of the Comet at ''Marvel Appendix'']\n}}\n[[Category:Caretakers of Arcturus Experiment]]"
                }
            }
        }
    ],
    "page_id": "940169"
}