{
    "pageid": 34005,
    "ns": 0,
    "title": "Children of the Vault (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Children of the Vault (Earth-616) from X-Men Legacy Vol 1 239 001.jpg\n| Name                    = Children of the Vault\n| Aliases                 = Los niños de la cámara acorazada{{r|X-Men Vol 2 191}} (rough translation to Spanish)\n| Distinguish1            = Vault\n| Distinguish2            = Children\n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = The Vault, [[Wild Sentinel Factory]], [[Ecuador]]; formerly [[Corridor]]; [[Conquistador (ship)|Conquistador]]\n\n| Leaders                 = [[Cadena (Earth-616)|Cadena]]; formerly [[Sangre (Children of the Vault) (Earth-616)|Sangre]] \n| CurrentMembers          = [[Aguja (Earth-616)|Aguja]], [[Cadena (Earth-616)|Cadena]], [[Corregidora (Earth-616)|Corregidora]], [[Diamante (Earth-616)|Diamante]], [[Fuego (Earth-616)|Fuego]], [[Horadar (Earth-616)|Horadar]], [[Madre (Earth-616)|Madre]], [[Martillo (Earth-616)|Martillo]], [[Merbavon (Earth-616)|Merbavon]], [[Olvido (Earth-616)|Olvido]], [[Perro (Earth-616)|Perro]], [[Luz (Earth-616)|Luz]], [[Piedra Dura (Earth-616)|Piedra Dura]], [[Sangre (Children of the Vault) (Earth-616)|Sangre]], [[Serafina (Earth-616)|Serafina]], [[Terramoto (Earth-616)|Terramoto]], an estimated 3000 unnamed members \n| FormerMembers           = \n| Allies                  = [[City (Earth-616)|City]], Bella Pagan; formerly Doctor Casales; unnamed scientists, [[Jeanne-Marie Beaubier (Earth-616)|Aurora]], [[Jean-Paul Beaubier (Earth-616)|Northstar]]\n| Enemies                 = [[X-Men (Earth-616)|X-Men]], [[Victor Creed (Earth-616)|Sabretooth]]\n\n| Origin                  = They are not mutants, but [[Homo novissima|highly evolved beings]] that have evolved from a baseline human genetic base over a time period of 6,000 years. Their society was raised in the hold of a ship where temporal acceleration technology was used to evolve a collection of individuals into superpowered beings. Due to genetic drift, they are a separate species from either baseline humans or mutant humans.\n\n| PlaceOfFormation        = Research facility within the Conquistador\n| PlaceOfDissolution      = \n| Creators                = Mike Carey; Chris Bachalo\n| First                   = X-Men Vol 2 188\n| Last                    = \n\n| HistoryText             = [[File:Children of the Vault (Earth-616) from X-Men Vol 2 191 0001.jpg|left|thumb|The first incarnation of the Children of the Vault.]]\nThe Children of the Vault are not mutants, but [[Homo novissima|highly evolved beings]] who descended from a baseline human genetic base over a time period of 6,000 years.{{r|X-Men Vol 5 5}} Their society was raised in the hold of a ship where temporal acceleration technology was used to evolve a collection of individuals into superpowered beings. Due to genetic drift, they are a separate species from either baseline humans or mutant humans.{{r|X-Men Vol 2 191}}\n\nA research group under [[Bella Pagan (Earth-616)|Bella Pagan]] proposed a theory of temporal acceleration and parallel evolution in the early 70s. Largely derided by the scientific community, they found backing in South America, gaining a tanker from the [[Chile|Chilean]] government. Knowledge of the project was largely lost until one of the scientists, Doctor Casales, grew guilty over the group's unethical actions and hired [[Victor Creed (Earth-616)|Sabretooth]] and his associate [[Pasco]] to kill those who had worked on the project. After killing Casales, Sabretooth found the location of the tanker. They reached the ship, the Conquistador, on [[Decimation|M-Day]], and Pasco lost his mutant powers. The Children emerged, having spent the equivalent of 6000 years in evolutionary and technological advancement. Pasco died in the resulting conflict, but Sabretooth escaped.{{r|X-Men Vol 2 191}}\n\nThe Children of the Vault evidently believed that only one race can survive as absolute ruler of the planet, and they intended to be that species. They sought to eliminate Sabretooth to keep their existence secret until they were ready to strike out at the large world. In their attempts, they casually destroyed a town in Nogales, [[Mexico]], and manipulated survivors and the media into thinking that the [[X-Men (Earth-616)|X-Men]] were involved. The X-Men located Sabretooth while investigating the allegations. While the Children intended to draw out Sabretooth and kill him, they had not planned on revealing their existence to more people. In order to kill the X-Men before they could learn of the Vault's existence, they recruited mutants [[Jeanne-Marie Beaubier (Earth-616)|Aurora]] and [[Jean-Paul Beaubier (Earth-616)|Northstar]]. Killing all of the members of the [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] facility where the two were held captive, [[Serafina (Earth-616)|Serafina]] interfaced with the simulations being used to brainwash them and warped them to her own ends. Images of the X-Men were doctored into the security footage by Serafina, allowing for another opportunity to discredit the team. The Children also enhanced the powers of the twins so that they could produce a powerful heat blast while touching.{{r|X-Men Vol 2 188|189}}\n\nAfter sending Northstar and Aurora to kill Sabretooth and the X-Men, Serafina and [[Perro (Earth-616)|Perro]] watched from a distance. The surprise attack was initially successful, seeing the apparent death of [[Robert Drake (Earth-616)|Iceman]] and severe injuries to many of the X-Men. Luckily, Aurora was defeated thanks to [[Raven Darkholme (Earth-616)|Mystique]]'s manipulation and Iceman's surprise (though incomplete) reformation, while Northstar was defeated by the combined efforts of [[Rogue (Anna Marie) (Earth-616)|Rogue]] and [[Nathan Summers (Earth-616)|Cable]].{{r|X-Men Vol 2 190}}\n\nIn interrogations after the fight (which saw intense damage, though supposedly only lasting five minutes), Cable learned through Sabretooth that their enemies were known as \"The Children of the Vault,\" were neither mutant nor human, and wanted him dead simply for learning of their existence. Sabretooth took a certain amount of pleasure in this revelation, as it now put the X-Men “on the endangered species list” along with himself.{{r|X-Men Vol 2 191}}\n\nMeanwhile, Serafina used her cloaking abilities to infiltrate [[Xavier's School for Gifted Youngsters|the mansion]] directly. She was invisible to telepaths, and [[James Howlett (Earth-616)|Wolverine]] was only mildly aware of something amiss. Still, she easily made her way to the injured [[Regan Wyngarde (Earth-616)|Lady Mastermind]] in the infirmary and hijacked her powers to trap [[Samuel Guthrie (Earth-616)|Cannonball]] in an illusion. Cannonball identified gaps in his memory (as from his perspective he had been living a span of decades within the illusion) and confronted his mysterious new wife, Serafina. Serafina gave up on trying to manipulate Cannonball, but was interrupted before she could kill him.{{r|X-Men Vol 2 191}}\n\nRogue's X-Men team, along with Sabretooth (controlled by [[Nano-Sentinels]]), and Cable, engaged the Children in battle on the Conquistador. At the same time, deciding that all secrecy had been lost, they raised the Conquistador into the air. The now-flying ship quickly made for the Xavier's School for Gifted Youngsters, where the Children intended to destroy the majority of the world's remaining mutants. Rogue's X-Men managed to defeat the Children by the narrowest of margins before they could annihilate the academy.{{r|X-Men Vol 2 192|193}}\n\nWith his last breaths, Sangre (who was mortally wounded by Mystique, armed with thermite bullets), tried to ram the Conquistador into the school, but it was stopped at the last minute by Cannonball and the [[Sentinel Squad O*N*E (Earth-616)|O*N*E Sentinels]]. Many of the Children did manage to escape the brawl alive, including Perro, leaving behind some three thousand animal carcasses changed to resemble them, so that the X-Men would believe they had been killed in an explosion on the ship. The Children escaped to [[Ecuador]] to hole up in the [[Wild Sentinel Factory|abandoned Sentinel facility]] once used by [[Cassandra Nova Xavier (Earth-616)|Cassandra Nova]], now led by [[Cadena (Earth-616)|Cadena]], swearing that they would continue with their plan, and the X-Men would not see them coming.{{r|X-Men Vol 2 193}}\n\n===Collision===\nThe Children of the Vault once again came into conflict with the X-Men when one of their number, [[Luz (Earth-616)|Luz]], escaped their extradimensional city, the Corridor, to avoid being conscripted into their Angelfire Project, which would used 30 people with energy-based powers to generate enough energy for their entire city forever. She escaped into [[Mumbai]], where she used her light-based powers to create an illusion to confuse her captors long enough to swap places which one of the locals. When the Children captured Luz's doppelganger and plugged her into the Angelfire machine, her lack of power caused the machine to malfunction and crashed the Corridor into Mumbai.{{r|X-Men: Legacy Vol 1 239|241}}\n\n===The Vault===\nThe Children of the Vault later moved into the Vault, a location in Ecuador built into the Wild Sentinel Factory where time ran much more quickly to the point where thousands of years could pass while in comparison to the outside world not much time passed at all. The mutant-only nation of [[Krakoa (Earth-616)|Krakoa]] learned of the Vault's existence and sent [[Laura Kinney (Earth-616)|Wolverine]], [[Everett Thomas (Earth-616)|Synch]], and [[Armando Muñoz (Earth-616)|Darwin]] to capture Serafina. Unfortunately, as soon as the three entered the Vault, they lost touch with the X-Men.{{r|X-Men Vol 5 5}}\n\nThe trio battled against the Children of the Vault with Wolverine seemingly killing Serafina and Fuego and Synch killing Sangre and Perro using Fuego's powers. In retaliation, Aguja unleashed a massive force field in an attempt to kill her foes, killing herself in the process.{{r|X-Men Vol 5 18}} The trio survived the attack and gathered intelligence for the next 100 years. They learned that after Serafina's capture and escape from [[Orchis (Earth-616)|Orchis]] and the rise of the nation of Krakoa, the [[City (Earth-616)|City]], artificial intelligence of the Vault, had created the third generation of the Children so they could eventually take over Earth. They also learned that any Children that died were resurrected by the City through cloning to further the evolution process. After the Children captured Darwin, the City discovered that his adaptation power could allow it to create a fourth generation of Children and killed him to learn about his physiology. The Children chased Wolverine and Synch as they escaped the Vault. The Children killed the pair, but Synch was able to pass on the intelligence he and his teammates had gathered.{{r|X-Men Vol 5 19}}\n\n| Equipment               = Various advanced technologies\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = The Children of the Vault are very similar to the [[Neo (Earth-616)|Neo]].\n* Without their technologies and the power required to operate them, they are primarily just normal humans.{{r|X-Men Vol 2 193}}\n| Trivia                  = \n| Links                   = \n* [http://en.wikipedia.org/wiki/Children_of_the_Vault Children of the Vault (Earth-616) at Wikipedia.org]\n}}"
                }
            }
        }
    ],
    "page_id": "34005"
}