{
    "pageid": 273795,
    "ns": 0,
    "title": "Code Red (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Hulk Vol 2 14 Textless Wraparound.jpg\n|ImageSize                = 400px\n| Name                    = Code Red\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Thaddeus Ross (Earth-616)|Red Hulk]]\n| CurrentMembers          = [[Thundra (Earth-715)|Thundra]]\n| FormerMembers           = [[Frank Castle (Earth-616)|Punisher]], [[Elektra Natchios (Earth-616)|Elektra]], [[Boris Vadim (Earth-616)|Crimson Dynamo]], [[Wade Wilson (Earth-616)|Deadpool]]\n\n| Allies                  = \n| Enemies                 = [[X-Force (Strike Team) (Earth-616)|X-Force]], [[Leonard Samson (Earth-616)|Doc Samson]]\n\n| Origin                  = A group of superhumans organized to kill [[Neena Thurman (Earth-616)|Domino]], who was suspected of knowing the Red Hulk's true identity.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jeph Loeb; Ian Churchill\n| First                   = Hulk Vol 2 #14\n| Last                    = Hulk Vol 2 #17\n\n| HistoryText             = After [[Neena Thurman (Earth-616)|Domino]] accidentally watched [[Thaddeus Ross (Earth-616)|Red Hulk]] transform and then survive his attack, General [[Thaddeus Ross (Earth-616)|Thaddeus Ross]] and [[Leonard Samson (Earth-616)|Doc Samson]] gave Red Hulk a list of extraordinary people to hire so that they may track down and kill Domino in 24 hours, so she can statistically inform less people. The list included [[Wade Wilson (Earth-616)|Deadpool]], [[Frank Castle (Earth-616)|Punisher]], [[Thundra (Earth-715)|Thundra]], [[Boris Vadim (Earth-616)|Crimson Dynamo]], and [[Elektra Natchios (Earth-616)|Elektra]]. After gathering up 6 hours after the team was formed, Elektra confirmed Domino's location, a small bar in Hell's Kitchen, however Domino had back up in the form of her \"friends\", the X-Force. As Code Red prepared to fight X-Force, [[James Howlett (Earth-616)|Wolverine]] told his teammates the Red Hulk \"was his\".\n\nWolverine and Red Hulk burst outside of the bar, meanwhile X-Force and Code Red begin to pair off. Punisher battles X-23, who cuts up his gun. The Crimson Dynamo fights Archangel, who grabs Dynamo and flies upward with the Dynamo. Boris however ejects from the armor and blows it up. Deadpool gets thrown around by Warpath, who then gets a frying pan to the head. Punisher grabs a pool cue and allows it to be cut in half by X-23, who he then impales with the broken end. Thundra begin to strangle Domino, who shoots her at close range, leaving her body on the ground. Elektra appears, kicking Domino in the head and warns her she thinks the whole mission is a setup. As Deadpool turns the tables on Warpath, they notice a meat cleaver has hit a power line, causing the bar to explode however Thundra fights her way out of the bar looking for Domino.\n\nAs Red Hulk and Wolverine fight, Logan manages to leap on his back impaling him repeatedly, and then jump off and slash him across the eyes, temporarily blinding him. In rage, Red Hulk throws Wolverine across Hell's kitchen into the East River as Thundra regroups with Red Hulk, Wolverine appears again in a taxi, crashing it into Red Hulk as he leaps out claiming it's \"Round two, bub\". Unfazed, Red Hulk prepares to battle Wolverine, despite still being blind, when Red She-Hulk appears, bringing Logan to the ground with her feet and pointing Domino's gun at his head.   \n\nAfter escaping from X-Force, Red Hulk and [[Elizabeth Ross (Earth-616)|Red She-Hulk]] began talking in the sewers, letting his guard down, he never saw Red She-Hulk's attack coming, stabbing his Carotid Artery, meanwhile, Samson turned the other members of Code Red against Red Hulk, who came to Red She-Hulk's aid in the sewers.\n\nThundra, however, was always loyal to Red Hulk, and began to strangle Samson. Red Hulk's vision came back and he began to fight Red She-Hulk out into the city streets and up a large building. Red She-Hulk knocked him off the building, where he regrouped with Elektra and the two tracked down Domino, where they decided it would be best if both parties withheld the information they knew about each other from the public. At Elektra's suggestion Red Hulk decided to make right by the members of Code Red, giving Deadpool large amounts of money(but not as much as initially promised), the Punisher was given an address to a secret S.H.I.E.L.D. weapons cache and advice to get out of the city, and the Crimson Dynamo was given slightly outdated Iron Man armor data to update and upgrade his own suit.  \n\n| Equipment               = * [[Crimson Dynamo Armor]]\n| Transportation          = \n| Weapons                 = \n* [[Punisher's Arsenal]]\n* [[Deadpool's Katanas]]\n* [[Elektra's Twin Sai]] \n* Thundra's Whip\n\n| Notes                   = \n| Trivia                  = * This team shares many members with [[Thunderbolts (Strike Team) (Earth-616)|Red Hulk's iteration of the Thunderbolts]].\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "273795"
}