{
    "pageid": 559462,
    "ns": 0,
    "title": "Comanche Nation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Comanche Nation (Earth-616) from Kid Colt Outlaw Vol 1 11 0001.jpg\n| Name                    = Comanche Nation\n| Aliases                 = Comanches\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Cheif Eagle Wing [[Comanche Nation (Earth-616)/Expanded Membership|Expanded Membership]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Blaine Colt (Earth-616)|Kid Colt]], [[Matthew Masters (Earth-616)|Black Rider]], [[Aloysius Kare (Earth-616)|Apache Kid]]\n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[New Mexico (State)|New Mexico]], [[Arizona (State)|Arizona]], [[Texas (State)|Texas]], [[Oklahoma (State)|Oklahoma]], [[Colorado (State)|Colorado]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Kid Colt Outlaw #10\n\n| History                 = \n===History Overview===\nThe Comanche Nation is Native American tribe that has existed in the United States as early as the 1700s, having broken off from the Shoshone people. A plains tribe, their primary skills were hunter-gathering and used horses. Around the period of the American Frontier they had close to 45,000 Commanches living in areas of present-day [[Arizona (State)|Arizona]], [[Colorado (State)|Colorado]], [[New Mexico (State)|New Mexico]], [[Oklahoma (State)|Oklahoma]], and [[Texas (State)|Texas]].\n\nPresumably, the history of the Comanche Nation on [[Earth-616]] is similar to that of the real world.\n\n===American Frontier===\nLike many Native American tribes during the days of the American Frontier, the various tribes of Comanche were either allies or enemies of settlers, the United State government or aligning themselves with outlaws and other criminals depending on the needs and motivations of each individual tribe. Often, those who were violent were referred to as renegades, and by accounts most Comanche tribes sought to maintain the peace in the regions they inhabited.\n\nHeroes of the Frontier such as [[Blaine Colt (Earth-616)|Kid Colt]], [[Aloysius Kare (Earth-616)|Apache Kid]] and others often had run ins with the Comanches as both friend and foe.\n\n====Grey Eagle's Tribe====\n\nOne tribe that existed during the days of the Frontier was one led by [[Grey Eagle (Earth-616)|Grey Eagle]]. His people worshiped the [[Manidoog]] god [[Gitche Manitou (Earth-616)|Manitou]]. Grey Eagle sired the [[Red Warrior (Earth-616)|Red Warrior]] who was apparently blessed by Manitou. The Red Warrior was raised to be the tribe's greatest warrior and he often aided them during times of peril. Red Warrior wasn't liked by all the members of his tribe, such as Yellow Arrow who failed to eliminate his foe. When the tribe was plagued by a drought, the Red Warrior found a fertile plain with ample hunting for the tribe to relocate to.{{r|Red Warrior #1}}\n\nLater the tribe was terrorized when some outlaws attempted to start a grass fire to drive the Comanches off their land. Red Warrior guided his people to safety and when the flames died down they rebuilt their home.{{r|Red Warrior #4}} Grey Eagle's tribe were almost tricked into a war with the local [[Paiute People (Earth-616)|Paiute]] by an arms dealer named Fulsom. However when both tribes realized they were being manipulated into war, they slew Fulsom and resumed peace.{{r|Red Warrior #5}}\n\nThe final fate of Grey Eagle's tribe is unknown.\n\n====Other Tribes====\n\nA tribe of Comanches living near Gunbutt Storms was framed for the murder of area ranchers by banker Simon Grubb who hoped a war between the ranchers and Comaches would wipe out both parties so he could buy up the land dirt cheap. The outlaw hero Kid Colt managed to convince the Comanches to stay their war path long enough for him to expose Grubb as the instigator and left Grubbs fate to be decided by Gunbutt Storms' sheriff and the Comaches chief Eagle Wing.{{r|Kid Colt Outlaw #10}} A band of Comanches later captured Ellen Crandle the daughter of US Marshall Bulldog Crandal in revenge for the harsh justice he dispensed on the Comaches in the past. When Bulldog attempted to rescue his daughter he was wounded and captured. Both were rescued by Kid Colt, who caused a fire in the Comanche village and created enough confusion to allow them to escape.{{r|Kid Colt Outlaw #11}} Another tribe of Comaches rescued the life of a US land agent named Carson who was attacked and his land ownership papers stolen by outlaws hired by George Blackwell. Unknown to the Comaches at the time, the documents secured their lands for Comanche us, but Blackwell made forgeries that allowed him to try and force the Comaches off their land. The Comaches were gearing up for war when they were visited by the western hero [[Preston Hardwick (Earth-616)|Gunhawk]] who convinced them to remain peaceful until he got to the bottom of things. Discovering that the Comanches had been nursing Carson to health, Gunhawk revived him and learned the truth and exposed Blackwell's plot, ensuing peace in the area.{{r|Gunhawk Vol 1 12}}\n\nA tribe that lived along the Texas-Pacific railroad were inflamed to attack railroad workers by being sold weapons and alcohol. They were stopped by the Texas Rangers and the [[David Laramee (Earth-616)|Arizona Kid]] who learned that their supplier was the owner of the railroad who organized the attacks because it was cheaper to replace the Chinese rail workers than to actually pay them.{{r|Arizona Kid #2}} Another tribe, this one led by Running Deer was also tempted by alcohol and the promises of glorious war by Running Deer's son Sly Wolf. However, the [[Matthew Masters (Earth-616)|Black Rider]] doctored the alcohol with herbs that made the warriors sick. Seeing this as a betrayal, they slew Sly Wolf and ceased their plans for war.{{r|Black Rider #15}} A Comanche warrior named Black Arrow was assisted by [[Blaine Colt (Earth-616)|Kid Colt]] in hunting down a mountain lion that was stalking cattle in the area.{{r|Kid Colt Outlaw #15}}\n\nA band of Comanches led by War Cloud was almost had their lands stolen thank to the manipulations of a cattleman named Ringo. Giving the Comanches whiskey, he tricked them into signing over their land to him and he then sought to force them from it. When War Cloud refused to leave, Ringo order his men to wipe out the tribe, but they were saved from slaughter by their ally Kid Colt.{{r|Kid Colt Outlaw #31}} The Black Rider later came to the aid of a group of Comanches outside of Leadville who were threatened by a gang of outlaws who sought to take their land.{{r|Black Rider #20}} Another tribe, led by White Eagle, was framed for attacks on the Forbes rail line by an outlaw named Forbes until the plot was exposed by Kid Colt.{{r|Kid Colt Outlaw #36}} A group of Comanches near Caliber City were also framed for attacks on settlers by a rival Apache tribe. The Comanches were cleared thanks to the intervention of the [[Lance Temple (Outlaw Kid) (Earth-616)|Outlaw Kid]].{{r|Outlaw Kid #2}} Another tribe of Comanche's were saved from extinction when they were treated for Cholera by Dr. Matthew Masters, the alter-ego of the Black Rider.{{r|Wild Western #44}} The original [[Rawhide Kid (Original) (Earth-616)|Rawhide Kid]] and his ward [[Randy Clayton (Earth-616)|Randy Clayton]] also assisted a Comanche tribe led by Red Cloud, who were being framed for attacked by a gang of arms dealing looking to profit on a war between the Comanches and the people of [[Shotgun City]].{{r|Rawhide Kid #9}}\n\n===Modern Age===\n\nThe Comanche Nation still exists to this day.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Native American Tribes]]"
                }
            }
        }
    ],
    "page_id": "559462"
}