{
    "pageid": 14075,
    "ns": 0,
    "title": "Committee (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Committee (Earth-616) from Werewolf by Night Vol 1 10 0001.jpg\n| Name                    = The Committee\n| Aliases                 = New Committee{{r|Moon Knight Vol 5 5}}\n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Los Angeles]], [[California (State)|California]]; later [[New York City]], [[New York]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Bruno Gordon (Earth-616)|Bruno Gordon]], [[Mosiah Carruthers (Earth-616)|Mosiah Carruthers]]; Donnie; [[Professor Mako (Earth-616)|Professor Mako]], [[Baron Thunder (Earth-616)|Baron Thunder]]; [[Ma Mayhem (Earth-616)|Ma Mayhem]]; [[Behemoth (Kay-Twelve)|Behemoth (Kay-Twelve)]]; [[Character Index/H#Harry|Harry]]\n| Allies                  = [[Sidney Sarnak (Earth-616)|Sarnak]]; [[Arnold Paffenroth (Earth-616)|Tatterdemalion]]; The [[Profile (Earth-616)|Profile]]; [[Anthony Masters (Earth-616)|Taskmaster]]; [[Philip Russell (Earth-616)|Philip Russell]]\n| Enemies                 = [[Marc Spector (Earth-616)|Moon Knight]]; [[Jack Russell (Earth-616)|Werewolf by Night]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Los Angeles]], [[California (State)|California]]\n| PlaceOfDissolution      = \n| Creators                = Gerry Conway; Tom Sutton\n| First                   = Werewolf by Night #10\n| Last                    = Moon Knight Vol 5 #20\n\n| HistoryText             = The Committee was a secret organization of anonymous businessmen and financiers. Their purpose was to stimulate what they perceive to be a sinking global economy by any means available to them. Many of the Committee's practices are ethically questionable, and usually illegal. To promote consumerism, Committee members were known to implement a doctrine of fear to \"shock\" the private sector into investing in various enterprises. One of the earliest examples of this practice involved their decision to employ the disfigured [[Sidney Sarnak (Earth-616)|Sarnak]], Master of Sound, to create \"an army of fear\" so that citizens spend more because they feel unsafe. These efforts brought the Committee into conflict with [[Jack Russell (Earth-616)|Jack Russell]] – also known by the sobriquet, the Werewolf by Night.{{r|Werewolf by Night Vol 1 10}} The Committee's involvement with the Russell family included Jack's stepfather, [[Philip Russell (Earth-616)|Philip Russell]] – who was being blackmailed via his wife [[Laura Russell (Earth-616)|Laura]]. When Philip refused to pay, they had her killed{{r|Werewolf by Night Vol 1 14}} - leading Jack to believe that his step-father had been responsible.\n\nDespite their frequent conflicts with the Werewolf, the Committee's most persistent adversary has been the lunar avenger, Moon Knight. At first, Moon Knight had been on the Committee's payroll, and offered $10,000 to bring them the Werewolf, but he soon turned against them and actively sought to bring them down{{r|Werewolf by Night #32|33}}. \n\n===The New Committee===\nThe Egyptian God of Vengeance, Khonshu, felt that his avatar Moon Knight had lost the drive to act as his instrument of vengeance. As Moon Knight's spirit began to falter, so too did Khonshu's power. Khonshu influenced the sons and daughters of the Committee to re-establish themselves and embark upon a course of action to secretly revitalize Moon Knight. The individual Committee members were ignorant of Khonshu's subtle influence over them, but their desire to avenge their predecessors against Moon Knight was strong.{{r|Moon Knight Vol 5 6}}\n\nThey hired the mercenary known as Bushman to mutilate Marc Spector, but with instructions to leave him alive. Bushman succeeded in this task, but at the cost of his own life. Crippled and broken, Marc Spector fell into a state of despondency and chemical dependency.{{r|Moon Knight Vol 5 2|3}} \n\nThe Committee meanwhile initiated the second phase of their plan to destroy Moon Knight. They hired a consultant known as the [[Profile (Earth-616)|Profile]] who provided them with a detailed psychological analysis of Marc Spector's state of mind. The Committee acted upon this information too quickly however and sent a hired gun to severely beat up Marc's close ally, [[Jean-Paul Duchamp (Earth-616)|Jean-Paul Duchamp]] and make it look like a random act of violence. Rather than weakening Spector's resolve even further, the attack against Jean-Paul actually gave him a reason to live.{{r|Moon Knight Vol 5 3}} Although this permutation ran counter to the Committee's designs, it served to satisfy Khonshu's goals. His instrument of vengeance was back.{{r|Moon Knight Vol 5 4}}\n\nThe Committee attempted to clean up their mess by hiring the Taskmaster to take Moon Knight out. The Taskmaster raided Spector's apartment but was unable to kill him. Spector piloted his Moon-chopper to the Committee's Manhattan headquarters and flew the chopper directly into their office. Miraculously, all of the Committee members survived the attack.{{r|Moon Knight Vol 5 4|6}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * {{cl|Werewolf by Night Vol 1 10}}\n* {{cl|Werewolf by Night Vol 1 11}}\n* {{cl|Werewolf by Night Vol 1 12}}\n* {{cl|Werewolf by Night Vol 1 17}}\n* {{cl|Moon Knight Vol 5 1}}\n* {{cl|Moon Knight Vol 5 2}}\n* {{cl|Moon Knight Vol 5 3}}\n* {{cl|Moon Knight Vol 5 4}}\n* {{cl|Moon Knight Vol 5 5}}\n* {{cl|Moon Knight Vol 5 6}}\n* [[Moon Knight]]\n* [[Profile]]\n* [[Taskmaster]]\n* [[Werewolf by Night]]\n}}\n[[Category:Criminal Organizations]]\n[[Category:Think Tanks]]"
                }
            }
        }
    ],
    "page_id": "14075"
}