{
    "pageid": 21428,
    "ns": 0,
    "title": "Commission on Superhuman Activities (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Title                   = C.S.A.\n| Image                   = Commission on Superhuman Activities (Earth-616) from Official Handbook of the Marvel Universe Vol 3 2 001.jpg\n| Name                    = Commission on Superhuman Activities \n| Aliases                 = The [[Commission]], C.S.A., [[Commission on Superhuman Affairs]]\n| Alignment               = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Commission on Superhuman Activities Home Office|C.S.A. Headquarters]], [[Washington, D.C.]]\n\n| Leaders                 = \n| CurrentMembers          = [[Martin Farrow (Earth-616)|Martin Farrow]], \n[[General Halstan (Earth-616)|General Halstan]],<br>\n[[Lewis Haywerth (Earth-616)|General Haywerth]] (U.S. Armed Forces Liaison), \n[[Anne Marie Hoag (Earth-616)|Anna Marie Hoag]], \n[[B. LeTendre (Earth-616)|B. LeTendre]],<br>\n[[George Mathers (Earth-616)|George Mathers]] (C.I.A. Liaison), \n[[Dallas Riordan (Earth-616)|Dallas Riordan]] (Acting Co-Chair)\n[[Adrian Sammish (Earth-616)|Adrian Sammish]] (Field Operations Manager), \n[[Orville Sanderson (Earth-616)|Orville Sanderson]] (F.B.I. Liason), \n[[Raymond Sikorski (Earth-616)|Raymond Sikorski]], \n[[General Standish (Earth-616)|General Standish]],\n[[Wesley Werner (Earth-616)|Wesley Werner]],\n| FormerMembers           = [[Abner Jenkins (Earth-616)|Abner Jenkins]],\n[[Henry Gyrich (Earth-616)|Henry Peter Gyrich]] (Acting Co-Chair), \n[[Brian Rinehart (Earth-616)|Brian Rinehart]], \n[[Valerie Cooper (Earth-616)|Valerie Cooper]] (Chairperson, O*N*E Director), \n[[Norman Osborn (Earth-616)|Norman Osborn]] (Thunderbolts Field Team Director),\n[[Douglas Rockwell (Earth-616)|Douglas Rockwell]],\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = Government Organization\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Uncanny X-Men #199\n\n| History                 = The '''Commission on Superhuman Activities''' is a group formed to act on superhuman affairs, with representatives from governmental organizations, such as the [[National Security Council (Earth-616)|National Security Council]], [[United States Army (Earth-616)|U.S. Army]] and the [[Federal Bureau of Investigation (Earth-616)|F.B.I.]].\n\n===Freedom Force===\nWhen Mystique offered her Brotherhood of Evil Mutants to the U.S. government as operatives in exchange for criminal pardons, the deal was negotiated through Valerie Cooper.{{r|Uncanny X-Men Vol 1 199}} Val acted as liaison to the group and often coordinated their activities through the C.S.A.\n\nIn addition to mutant-related activities, Freedom Force also acted on behalf of the Commission against other superhumans. After a \"whistle blower\" claimed the Avengers were involved in criminal activities against the government, Freedom Force was deployed against the East and West Coast branches, and brought them into custody. The Commission held a mock trial hearing at the Vault where they reviewed the allegations against the Avengers.{{r|Avengers Annual #15}}\n\nAfter Freedom Force imploded, Val Cooper created a new government-sponsored mutant agency called X-Factor. X-Factor did not appear to be as directly connected to the C.S.A. as Freedom Force, perhaps because of the influence of Charles Xavier in its inception.{{r|X-Factor #70|71}}\n\n===Captain America===\n[[File:Commission on Superhuman Activities (Earth-616), Jonathan Walker (Earth-616), and Lemar Hoskins (Earth-616) from Captain America Vol 1 335 001.jpg|thumb|left|Commission]]\nThe Commission on Superhuman Activities was also responsible for \"firing\" Steve Rogers as Captain America. The Commission asserted that the U.S. government held the legal rights to the name, costume, and shield of Captain America, and used this to attempt to force Steve Rogers into working for them. Instead, Rogers quit and turned in his costume and shield, leading the Commission to search for a new Captain America.{{r|Captain America #332}}\n\nA costumed showman called the Super-Patriot, John F. Walker of Georgia, was recruited by the C.S.A. to be the new Captain America. Unfortunately, Walker suffered a number of personal setbacks during his time as Cap, including his identity being publicly revealed by former associates out for revenge, and his parents murdered by the Watchdogs. It was eventually revealed that the entire ordeal was orchestrated by the Red Skull, who had agents in the C.S.A., Watchdogs, and other groups. Steve Rogers returned and reclaimed his identity from the embarrassed C.S.A.{{r|Captain America #333|350}}\n\nJohn Walker was apparently assassinated by Scourge of the Underworld while turning the job back over to Rogers.{{r|Captain America #351}} In reality, the C.S.A put him undercover as Jack Daniels, the U.S.Agent, using the red-white-and-black costume Rogers used during his forced retirement.{{r|Captain America #354}} The U.S.Agent was then forced onto the West Coast branch of the Avengers by the C.S.A. as a condition to the group keeping their special security status.{{r|West Coast Avengers Vol 2 #44|45}}\n\nThe U.S.Agent later lost his special privileges on the team when the Avengers reorganized under the United Nations' venue, and was kicked off the team entirely after a brawl with Hawkeye.{{r|Avengers: West Coast #69}}\n\n===Spider-Woman===\nJulia Carpenter was a college friend of Val Cooper's who volunteered for a government experiment that gave her super-powers as the second Spider-Woman. Julia was initially recruited into Freedom Force, but betrayed the group to help the Avengers escape from the Vault.{{r|Avengers Annual #15}} Iron Man helped Julia supposedly clear her name with the government, but instead the Commission assigned her an unscrupulous handler named Mike Clemson. Clemson kept Spider-Woman officially a fugitive to use her services as a black ops agent.{{r|Iron Man #214}}{{r|Peter Parker, The Spectacular Spider-Man #125|126}}\n\nAfter Spider-Woman began associating with the Avengers West, Clemson called up the recently fired U.S.Agent. He claimed to represent the C.S.A. and ordered U.S.Agent to terminate Spider-Woman as a rogue agent and enemy of the state. Walker nearly did so, but stopped at the last minute. Clemson was uncovered as a dirty agent in the C.S.A., and U.S.Agent and Spider-Woman joined Avengers West full time.{{r|Avengers: West Coast #70|74}} Clemson was later killed during his dirty dealings with the Manipulator and Deathweb.{{r|Avengers: West Coast #84|86}}\n\n===Maximum Security===\nU.S.Agent was recruited by the C.S.A. to head up STARS, the superhuman arm of the US Department of Corrections.{{r|Maximum Security #1}}\n\n===Civil War===\nDuring the [[Civil War]], the C.S.A. had not the resources and men to hand the Registration Act application. Also, [[Norman Osborn (Earth-616)|Norman Osborn]], field-leader of the [[Thunderbolts (Earth-616)|Thunderbolts]] joined the Commission.{{r|Civil War: Battle Damage Report Vol 1 1}}\n\nAfter the incident in [[Omaha]], the Commission ruled that [[Lucy Cervantes (Earth-616)|Gadget]] was killed by [[Franklin Hall (Earth-616)|Graviton]], deferring [[Cooper Roth (Earth-616)|Paragon]]'s matter for internal review.{{r|Invincible Iron Man Vol 1 23}}\n\nAt the [[United Nations]] General Assembly meeting, the Commission decided to charge [[Anthony Stark (Earth-616)|Anthony Stark]], [[Maria Hill (Earth-616)|Maria Hill]] and [[Timothy Dugan (Earth-616)|Timothy Dugan]] for terrorism, but the trial was halted by [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] The charges were dropped as soon as Iron Man defeated the [[Mandarin (Earth-616)|Mandarin]].{{r|Invincible Iron Man Vol 1 28}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Government Organizations]]\n[[Category:American Organizations]]"
                }
            }
        }
    ],
    "page_id": "21428"
}