{
    "pageid": 511106,
    "ns": 0,
    "title": "Conspiracy (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Conspiracy (Earth-616) from Rampaging Hulk Vol 1 8 0001.gif\n| Name                    = Conspiracy\n| Aliases                 = \n\n| Status                  = Defunct\n| Reality                 = Earth-616\n| Identity                = Secret\n| BaseOfOperations        = Underground cavern beneath [[New York City]]\n\n| Leaders                 = Formerly [[Noah Black (Earth-616)|Centurius]]\n| CurrentMembers          = \n| FormerMembers           = [[Atlan (Earth-616)|Atlan]], [[Bubbles O'Day (Earth-616)|Bubbles O'Day]], [[Noah Black (Earth-616)|Centurius]], [[Judan Bardham (Earth-616)|Dr. Judan Bardham]], [[Kaballa (Earth-616)|Kaballa]], [[Stephen Weems (Earth-616)|Modular Man]]\n| Allies                  = \n| Enemies                 = [[Ulysses Bloodstone (Earth-616)|Ulysses Bloodstone]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Doug Moench; Walt Simonson\n| First                   = Rampaging Hulk Vol 1 1\n\n| History                 = The Conspiracy was formed by the [[Exo-Mind (Earth-616)|Exo-Mind]], sentient consciousness of the [[Bloodgem]], to bring the shattered fragments of the gem together and give the Exo-Mind the energy to achieve a corporeal form and absorb the world's life energies. The members of the Conspiracy were lied to by the Exo-Mind's servant, [[Ulluxy'l Kwan Tae Syn (Earth-616)|Ulluxy'l Kwan Tae Syn]], under the promise that aid in this ritual will grant them all immortality and superhuman abilities, much like the \"rogue\" holder of a Bloodgem fragment, [[Ulysses Bloodstone (Earth-616)|Ulysses Bloodstone]]. \n\nUlysses first became aware of the Conspiracy when he is attacked while in [[Rio de Janeiro]], first by masked gunmen and then by the undersea beast [[Goram (Earth-616)|Goram]]. Bloodstone would later deduce that the agents were not after his own personal Bloodgem, but a separate fragment that just so happened to have been housed in same boat he was occupying.{{r|Rampaging Hulk Vol 1 1}} Bloodstone defended [[Bloodstone Island|his private island]] from being attacked by the beast, along with [[Simon Maddicks (Earth-616)|Killer Shrike]], a fellow agent of the Conspiracy. Bloodstone's ally [[Brad Carter (Earth-616)|Brad Carter]] chased after Goram upon the monster's retreat, uncovering the underwater lair of its creator, [[Noah Black (Earth-616)|Centurius]]. Brad was then quickly abducted by Centurius' men.{{r|Rampaging Hulk Vol 1 2}}\n\nUlysses reached out to [[Anthony Stark (Earth-616)|Iron Man]] to attack the base of Centurius (Formerly the base of the Gremlin). As Iron Man battled agents and monsters, Ulysses tracked down Centurius, and witnessed from afar the mad scientist kill Ulluxy'l with a weapon powered by the recently acquired Bloodgem fragment. Centurius revealed that the Conspiracy had grown tired of Ulluxy'l and hired Centurius to dispose of him, in exchange of being granted the demon's seat within the Conspiracy. Centurius then fled from the two heroes.{{r|Rampaging Hulk Vol 1 4}}\n\nSome time later in France, Conspiracy agent Domino hounds a fellow Bloodstone ally Samantha Eden for information. At the same time, Ulysses and Brad traveled to New York City to recuperate, only to find the hotel they checked into housed an elaborate \"death suite\" set up by the Conspiracy, to which Ulysses narrowly escaped.{{r|Rampaging Hulk Vol 1 5}} Travelling to the UN Building to gain legal sovereignty for Bloodstone Island, Ulysses was once again attacked, this time by [[Sharzan (Earth-616)|Sharzan the Elemental]], who captured Ulysses and took him to his master, [[Kaballa (Earth-616)|Kaballa]]. Ulysses was subdued as Kaballa extracted the Bloodgem fragment from his chest, seemingly killing him.{{r|Rampaging Hulk Vol 1 6}}\n\nThe members of the Conspiracy reassembled the Bloodgem and were almost immediately double-crossed by the Exo-Mind, who killed them all and used their life energies to give itself a crystalline body. Ulysses miraculously awoke, clinging to life, and projected his astral form into the new body of the Exo-Mind, who was currently terrorizing New York. Within, Ulysses encountered the souls of the Conspiracy members, who pleaded for his help. Ulysses' life purpose was realized as he penetrated the Exo-Mind with a spear made of psionic energy, disrupting the Hellfire Helix, shattering the crystalline body, and dispersing the souls of the Conspiracy members.{{r|Rampaging Hulk Vol 1 8}} The bodies of the Conspiracy were uncovered by Batroc's Brigade during an assignment by Baron Zemo to uncover the Bloodgem.{{r|Captain America Vol 1 358}} Only Centurius would return to the living, though how he accomplished this remains unclear. \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = * [http://www.marvunapp.com/Appendix/conspira.htm Marvel Appendix entry]\n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "511106"
}