{
    "pageid": 79562,
    "ns": 0,
    "title": "Consortium (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Consortium_(Earth-616)_from_Alpha_Flight_Vol_1_99.png\n| Name                    = Consortium\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Chief Executive Officer, Weapons Officer Trynx, employees of various races\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Ayesha (Earth-616)|Her]]\n\n| Origin                  = The Consortium is a large alien company with holdings on several worlds. \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Home Office Vessel]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[Quwrll]]\n\n| Creators                = Fabian Nicieza; Michael Bair; \n| First                   = Alpha Flight Vol 1 97\n\n| History                 = \n===Overview===\nThe Consortium was an intergalactic conglomerate with financial interests on thousands of worlds throughout the Milky Way galaxy which employed various alien species.{{r|Alpha Flight Vol 1 97}} If a planet violated one of their iron-clad contracts, it forfeited it's self-determination to the Consortium.{{r|Alpha Flight Vol 1 99}} They possessed both an armada of hundreds of attack spacecraft and ground troops.{{r|Alpha Flight Vol 1 98}} Worlds that were miniaturized and used as a power source for the city-sized mothership had their inhabitants either recruited or exterminated.{{r|Alpha Flight Vol 1 100}}\n\n===Clash with Earth's Heroes===\nDuring the planetary travels of [[Ayesha (Earth-616)|Her]], she encountered the Consortium enslaving a population. She fought against them and freed the population. This mean the Consortium brought their full force to bear on the problem.  Her, in attempt to escape the Consortium, returned to earth, only to crash land in [[Toronto]]. [[Alpha Flight (Earth-616)|Alpha Flight]] was called in to investigate and offered to protect her.{{r|Alpha Flight Vol 1 97}}\n\nThe Consortium, having followed Her, began a massive attack on the city. Alpha Flight fought off the first few waves of assault with a minimal amount of damage but the Avengers helped them deal with the final waves.{{r|Alpha Flight Vol 1 98}}\n\nDuring the battle, [[James Hudson (Earth-616)|Vindicator]] teleported half of both teams away to battle [[Galan (Earth-616)|Galactus]] on a far distant planet in another dimension.{{r|Alpha Flight Vol 1 99}}\n\nDue to the physical laws of the other dimension the combined efforts of the Avengers and Alpha Flight could have beaten Galactus, but instead an arrangement was made. Galactus would spare the [[Quwrlln]] and instead devour the Consortium mothership which was attacking Toronto, as their motherships used miniaturized planets as a fuel source. The teams worked together to allow Galactus to eat the Consortium’s mothership, ending the organization.{{r|Alpha Flight Vol 1 100}}\n| Equipment               = The Consortium had access to a wide variety of alien technology, including; cloaking technology,{{r|Alpha Flight Vol 1 97}}, miniaturization (used a miniaturized planet as a power source).{{r|Alpha Flight Vol 1 100}}\n| Transportation          = The Consortium’s primary “office” was in a large, saucer-shaped city-sized mothership.{{r|Alpha Flight Vol 1 98}}\n| Weapons                 = Directed energy weapons,{{r|Alpha Flight Vol 1 97|98}} energy-leeching dissipator space torpedoes,{{r|Alpha Flight Vol 1 97}}, attack spacecraft.{{r|Alpha Flight Vol 1 97|100}}\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category: Interplanetary Organizations]]\n[[Category: Companies]]\n[[Category:Slavers]]"
                }
            }
        }
    ],
    "page_id": "79562"
}