{
    "pageid": 12060,
    "ns": 0,
    "title": "Corporation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Corporation (Earth-616) from Captain America Vol 1 225 0001.jpg\n| Name                    = The Corporation\n| Aliases                 = \n\n| Leaders                 = [[Curtiss Jackson (Earth-616)|Curtiss Jackson]]; [[Eugene Stivak (Earth-616)|Senator Eugene Stivak]]\n| CurrentMembers          = \n| FormerMembers           = Agent 4, Agent 6, Agent 7, [[Filippo Ayala (Earth-616)|Filippo Ayala]], \"Benedict Arnold\", Benson, Blue Streak, Blue Streak, Carnation, Constrictor, Coldfire, Contract, Lyle Dekker, Duke, Ferocia, Flame, Harry, Hemlock, Grant Henderson, Kangaroo, Kickback, Kingsize, [[Konik (Earth-616)|Konik]], Dr. Karl Malus, Manslaughter, [[Simon Maris (Earth-616)|Simon Maris]], Mister Miracle, Moonstone (Sofen), Mungo, Night Flyer, O'Connor, Ricadonna, Rocketeers, Simon, Stryke, Troubleshooter, Vamp/Animus, Veda, Veil, Tim Wender, [[Character Index/H#Harry|Harry]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[Bruce Banner (Earth-616)|Hulk]], [[Luke Cage (Earth-616)|Luke Cage]]\n\n| Origin                  = Criminal Orgainization \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = All over the United States, with head offices on the east and west coasts.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Bill Mantlo; Keith Giffen\n| First                   = Deadly Hands of Kung Fu #23\n\n| History                 = The Corporation was a nationwide criminal-political organization run like a business. It employed a large number of operatives in its schemes.\n\nOne of these schemes involved blackmailing the scientist Phillip Hart into not releasing his Zero Fluid, a new, clean form of fuel to the public, threatening to reveal that he had done dealings with the Allende government in Chile. The Corporation sought the Zero Fluid as a bargaining chip to form an alliance with [[Zheng Zu (Earth-616)|Fu Manchu]]. When Hart refused, the Corporation had him killed. His son fled from the assassins, but was caught in an explosion and exposed to the Zero Fluid, turning him into the [[Jonathan Hart (Earth-616)|Jack of Hearts]].{{r|Deadly Hands of Kung Fu #23}} After his battle with the [[Hector Ayala (Earth-616)|White Tiger]], they tried to kidnap him from the hospital.{{r|Deadly Hands of Kung Fu #24|}}{{r|Deadly Hands of Kung Fu #26}}\n\nOne of their leaders was [[Filippo Ayala (Earth-616)|Filippo Ayala]], the White Tiger's brother. Pretending to be a drug dealer, he returned home, claiming that he had been strapped with a bomb by the Corporation.{{r|Deadly Hands of Kung Fu #27}} He led the White Tiger to their headquarters on the ship El Tigre, where he was ambushed by the Corporation's mercenary soldiers. After the fight, Filippo found the other leaders of their branch having killed themselves after seeing a message from Fu Manchu who expressed no interest in an alliance with them. Filippo then exploded the bomb he was still strapped to and destroyed their headquarters.{{r|Deadly Hands of Kung Fu #31}}\n\nAlthough this appeared to be a fatal blow for the organization, the Corporation continued on, with all operations in the western half of America (\"Corporation-West\") being overseen by businessman [[Curtiss Jackson (Earth-616)|Curtiss Jackson]] while [[Eugene Stivak (Earth-616)|Eugene Stivak]], a U.S. senator who led a secret criminal life under the name \"Kligger\", took over as head of operations for \"Corporation-East\", the Mid-Atlantic branch.  During their administrations, the Corporation continued to deal with assaults by the Jack of Hearts{{r|Marvel Two-In-One #48}}, and made attempts to capture the refugee [[Aaron Stack (Earth-616)|Machine Man]] with the intention of creating duplicates of him as part of their illegal arms deals.{{r|Machine Man Vol 1 7|9}} Another project at the time was an inexplicable alliance with the alien [[Dire Wraiths]] forged by Kligger, during which the Corporation attempted to produce a flying battle-suit with which to battle the Wraiths' enemy, the Galadorian spaceknight [[Rom (Earth-616)|Rom]]. This resulted in the Corporation accidentally creating a new enemy in the form of the [[Torpedo]], who was originally the flying suit's [[Michael Stivak (Earth-616)|creator]], who had learned Kligger's true intentions, and later the would-be super-hero [[Brock Jones (Earth-616)|Brock Jones]], who accidentally received the prototype flying suit.{{r|Marvel Premiere Vol 1 39|40}}\n\nIn spite of these distractions, the Corporation's main objectives during this time was to undermine the counter-espionage agency [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] while also obtaining influence over [[Bruce Banner (Earth-616)|The Hulk]], perhaps as part of a wider plan to undermine the American military as well.  These actions drew not only the attention of the Gamma Goliath but also that of [[Steven Rogers (Earth-616)|Captain America]], which came to a head after operatives of both Jackson and Stivak kidnapped Cap's partner [[Samuel Wilson (Earth-616)|The Falcon]] and his nephew [[James Wilson (Earth-616)|Jim Wilson]], who at the time had been the misunderstood Hulk's friend and fellow outcast.  A confrontation in a hidden Corporation base on [[Alcatraz Island]] ended with Stivak's death, liquidated with his permission by Jackson to escape imprisonment and scandal.{{r|Incredible Hulk Vol 1 232}}  Shortly thereafter, Jackson attempted one last time to capture the Machine Man, which only caused a showdown with the Hulk, who destroyed Corporation-West's skyscraper headquarters while Jackson himself was turned over to the police by the Machine Man.{{r|Incredible Hulk Vol 1 237}}\n\nFor an extended time, it seemed that the Corporation was defunct, but over the years it slowly made reappearances.  Surviving elements set up a \"factory\" for superhumans to operate as agents or hired muscle, provided by the criminal biochemist [[Karlin Malus (Earth-616)|Karl Malus]], but they were eventually found out by [[Luke Cage (Earth-616)|Power Man]].{{r|Cage Vol 1 13|14}} More recently, the Corporation ran a black market organ trafficking operation in New York City that specialized in transplanting [[Deviant Skrulls|Skrull]] organs.  It was found out and battled by [[Heroes for Hire (Knight & Wing) (Earth-616)|Heroes for Hire]] after a number of their Skrull organ-recipients aided one of [[Mercedes Knight (Earth-616)|Misty Knight]]'s old enemies in attempting to destroy the team.{{r|Heroes for Hire Vol 2 3|5}}\n\nWhile the Corporation has not been heard since then, presumably either a core group or surviving factions are still in operation at present, albeit returned to covert activities.  Time will tell...\n\n===Leaders===\n\n* [[Eugene Stivak (Earth-616)|Senator Stivak]], alias \"Kligger\" \n* [[Curtiss Jackson (Earth-616)|Curtiss Jackson]]\n* [[Filippo Ayala (Earth-616)|Filippo Ayayla]]\n* [[Veda (Corporation) (Earth-616)|Veda]]\n* [[Karlin Malus (Earth-616)|Karl Malus]]\n* [[Veil (Corporation) (Earth-616)|Veil]]\n\n===Agents===\n\n* [[Don Thomas (Earth-616)|Streak]]\n* [[Mr. Carnation (Earth-616)|Carnation]]\n* [[James Lucas, Jr. (Earth-616)|Coldfire]]\n* [[Conquer Lord]]\n* [[Frank Schlichting (Earth-616)|Constrictor]]\n* [[Contract (Earth-616)|Contract]]\n* [[Johann Fennhoff (Earth-616)|Doctor Faustus]]\n* [[Jonathan Hemlock (Earth-616)|Jonathan Hemlock]]\n* [[Brian Hibbs (Earth-616)|Kangaroo]]\n* [[Manslaughter (Earth-616)|Manslaughter]]\n* [[Karla Sofen (Earth-616)|Moonstone]]\n* [[Night Flyer (Earth-616)|Night Flyer]]\n* [[Rocketeers (Earth-616)|Rocketeers]]\n* [[Sleeper Agent (Earth-616)|Sleeper Agent]]\n* [[Stryke (Corporation) (Earth-616)|Stryke]]\n* [[Troubleshooter (Earth-616)|Troubleshooter]]\n* [[Denise Baranger (Earth-616)|Vamp/Animus]]\n* [[Agent 4 (Earth-616)|Agent 4]]\n* [[Agent 6 (Earth-616)|Agent 6]]\n* [[Agent 7 (Earth-616)|Agent 7]]\n* [[Number 12 (Earth-616)|Number 12]]\n* [[Harry Paul (Earth-616)|Harry Paul]]\n* [[Grant Henderson (Earth-616)|Grant Henderson]]\n* [[Simon Maris (Earth-616)|Simon Maris]]\n* [[Jason O’Connor (Earth-616)|Jason O’Connor]]\n* [[Simon Granville (Earth-616)|Simon Granville]]\n* [[Tim Wender (Earth-616)|Tim Wender]]\n* [[Ainsley Wescott (Earth-616)|Ainsley Wescott]]\n* [[Kingsize (Earth-616)|Kingsize]]\n* [[Richard Yurocko (Earth-616)|Kickback]]\n* [[Character Index/H#Harry|Harry]]\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n* The entry for [[Silvio Manfredi (Earth-616)|Silvermane]] in the [[Official Handbook of the Marvel Universe Vol 1 10|''Official Handbook of the Marvel Universe'' #10]] states that the Corporation backed Silvermane's appointment as the Supreme Hydra of a reformed faction of [[Hydra (Earth-616)|HYDRA]] seen in [[Daredevil Vol 1 121|''Daredevil'' #121]] through [[Daredevil Vol 1 123|#123]].  However, this was never stated outside of ''OHOTMU'', so its canonicity may be in question. \n* Comic book fans and historians believe it was a coincidence that Bill Mantlo and Jack Kirby both invented criminal organizations named \"The Corporation\" and that they were never intended to be the same group originally, only to be later retconned by succeeding writers and editors.  Similarly, Kligger and Senator Stivak were separate characters originally but, due to their similar appearance, were amalgamated into a single person as the respective storylines they were part of were drawn together. \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Drug Cartels]]\n[[Category:Organizations]]\n[[Category:Criminal Organizations]]\n[[Category:Terrorist Organizations]]\n[[Category:Companies]]"
                }
            }
        }
    ],
    "page_id": "12060"
}