{
    "pageid": 504763,
    "ns": 0,
    "title": "Creatures (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Creatures (Earth-616) from Captain America Comics Vol 1 44 0001.jpg\n| Name                    = Creatures\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]] and island near the Sargasso Sea\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Employees of the East Shipping Company Inc.\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]], [[Elizabeth \"Betsy\" Ross (Earth-616)|Betty Ross]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Vince Alascia\n| First                   = Captain America Comics Vol 1 44\n| Last                    = Captain America Comics Vol 1 44\n\n| HistoryText             = The \"Creatures\" -- as they came to be called -- were not creatures at all, but simply a bunch of ruthless killers who created an elaborate means of making it rich. Their leader was the owner of the East Shipping Company Inc., who came up with a method to defraud his insurance company out of millions of dollars. \n\nTo this end, he would charter shipments across the Atlantic. However, instead of loading the supplies into the ship, he would store them in a warehouse for later resale, instead loading the boats up with weighted crates. He then had the ships pilot a course near the Sargasso Sea in an area known as the \"Graveyard of Ships\" due to the thick seaweed deposits that could trap a ship. Then, he had one of his men fill the sea-cocks of the ship to flood the vessel making it sink. Meanwhile, more of his men, in octopus-creature costumes attacked the targeted ship killing the entire crew. They were stationed from an island nearby and traversed by foot over the thick seaweed. The creature costumes were used in the event that anyone survived the attacks on the ships so that they had a fantastic tale to tell that would throw off any investigations.\n\nSuch an event happened in 1945, with the lone survivor making it back to shore to tell his tale to the newsreels. The man told his story to [[Elizabeth \"Betsy\" Ross (Earth-616)|Betty Ross]] who was hired by the insurance company to investigate any potential fraud coming from the East Shipping Company. To this end, Betty got a job as a secretary for the company to see what she could learn. Meanwhile, the film reel of the surviving sailors account was witnessed by [[Steven Rogers (Earth-616)|Captain America]] and [[James Buchanan Barnes (Earth-616)|Bucky]] decided to lend their old friend a hand. Rushing to the East Shipping Company office, the heroes blew Betty's cover and a fight broke out, ending in Betty and the owner of the company being captured and hauled out. Questioning one of the men where they were going, he told Captain America that the gang was taking them to the Henry Morgan, the next ship they intend to sink.\n\nSneaking aboard the vessel, Cap and Bucky freed both Betty and the owner of the company, unaware that the owner was the mastermind. Just as Cap and Bucky were being told what was going on, the owner pulled a gun out on them and then had the trio tied to some pipes below deck. The owner then begins releasing the sea-cocks to flood the ship and then leaves the trio to drown while he reunited with his minions. Wearing their octopus creature costumes, the owner of the company led his men on an attack on the vessel. However, upon their arrival, they had found that Captain America, Betty, and Bucky had escaped and got the crew to pump the water out of the ship. Cap and Bucky then beat the attackers into submission, revealing them to be men in elaborate costumes. With the entire operation exposed, Captain America turned the \"Creatures\" over to the authorities where they were expected to face capital punishment for their crimes.{{r|Captain America Comics Vol 1 44}}\n\n| Equipment               = Each member of this gang wore costumes that resembled humanoid octopi with four tentacles operating as arms and two operating as legs. They had suction cups on each tentacle.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "504763"
}