{
    "pageid": 575136,
    "ns": 0,
    "title": "Croyos (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Croyos (Earth-616) from Apache Kid Vol 1 6 001.png\n| Name                    = Croyos\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Yellow Feather, Stalking Panther\n| Allies                  = \n| Enemies                 = [[Aloysius Kare (Earth-616)|Apache Kid]], [[Apache Nation|Apache tribe]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Apache Kid Vol 1 6\n| Last                    = Apache Kid Vol 1 15\n\n| HistoryText             = The Croyos were a band of renegade Native American tribe that existed during the days of the American Frontier. The Croyos were mortal enemies of the [[Apache Nation|Apache]] tribe led by chief [[Red Hawk (Apache Chief) (Earth-616)|Red Hawk]] and hated the white settlers in the area for taking over the land. They were led by Yellow Feather and their best warrior was Yellow Feather's son Stalking Panther. The tribe eventually sought to wipe out both Red Hawk's tribe and the soldiers that resided at the nearby [[Fort Madison]]. Stalking Panther also sought to defeat the Apache's greatest warrior the [[Aloysius Kare (Earth-616)|Apache Kid]] and take his lover [[White Swan (Earth-616)|White Swan]] as his bride. \n\nTo this end, Stalking Panther and his warriors captured the Apache Kid and took him prisoner. With the hero out of the way, the Croyos beat their war drums alerting both the soldiers and Apaches to their impending attack. As the Apaches came to aid the soldiers at Fort Madison they were ambushed by the Croyos. White Swan managed to track down the Apache Kid and distracted Stalking Panther long enough to free her love. Apache Kid then beat Stalking Panther into submission. Changing into his alter ego of Aloysius Kare, Apache Kid brought Stalking Panther to the battle. Seeing his son prisoner, Yellow Feather ordered his warriors to stand down. Yellow Feather agreed to a challenge by Kare to battle Stalking Panther. If Stalking Panther was defeated the Croyos were to leave the region. Stalking Panther, still whipped after his battle with the Apache Kid fainted before the fight could start and thus forfeited. The Croyos honored the deal and went into exile and have not been seen since.{{r|Apache Kid Vol 1 6}}\n\nSome months later the Croyos once against sought to wage war against the white settlers in the area, sending a warrior to the Apache village to petition chief Red Hawk to allow the Croyos permission to travel through their land. Red Hawk refused even at the threat of war with the Croyos. The Apache Kid then travelled to the Croyo village and challenged chief Yellow Feather to a one-on-one fight. Apache Kid won the bout but Yellow Feather attempted to shoot him with a shotgun. When the Apache Kid did not try to stop him, Yellow Feather decided against it realizing that such an action would shame his people and he surrendered promising not to wage war against the Apaches or settlers.{{r|Apache Kid Vol 1 15}}\n\n| Equipment               = \n| Transportation          = The Croyos ride horses\n| Weapons                 = The Croyos wielded weapons that were common among Native Americans during the days of the American Frontier, such as daggers, bows and arrows and spears.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "575136"
}