{
    "pageid": 482775,
    "ns": 0,
    "title": "Cult of Black Magic (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Cult of Black Magic (Earth-616) from Captain America Comics Vol 1 20 0001.jpg\n| Name                    = Cult of Black Magic\n| Aliases                 = \n\n| Leaders                 = Formerly [[Spawn of the Witch Queen (Earth-616)|Spawn of the Witch Queen]] (deceased)\n| CurrentMembers          = \n| FormerMembers           = [[Spawn of the Witch Queen (Earth-616)|Spawn of the Witch Queen]], unnamed members\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Egypt]]\n| PlaceOfFormation        = [[Egypt]]\n| PlaceOfDissolution      = [[Egypt]]\n\n| Creators                = Al Avison\n| First                   = Captain America Comics Vol 1 20\n\n| History                 = How long the Cult of Black Magic has truly existed is a mystery. They are worshipers of the [[Witch Queen of Egypt (Earth-616)|Witch Queen of Egypt]], a sorceress who practiced black magic in [[Egypt]] and worshiped her as a goddess. She was mummified along with her young son (known only as the [[Spawn of the Witch Queen (Earth-616)|Spawn of the Witch Queen]]) with instructions on how to resurrect the boy. Explorers in the 1924 unearthed the tomb and followed the instructions, and the Spawn was resurrected. He was taken by the explorers and raised to adulthood. They followed the queen's instructions to return to the temple, where they were slain by the Spawn. He then amassed his cult and with the [[Book of Thoth]] attempted to resurrect his mother.\n\nIn the meantime, the Spawn posed as British military commander Lawrence Thornton. When the joint American-British task force arrived in Egypt in the fall of 1942, one of the military colonels found a translated copy of the Book of Thoth and began divining \"Thornton's\" identity, and so the Spawn had him killed. This led [[Steven Rogers (Earth-616)|Captain America]] and [[James Buchanan Barnes (Earth-616)|Bucky]] (stationed there in their civilian identities) to investigate the death. Their path led them to the temple where they discovered the Spawn attempting to resurrect his mother.\n\nCaptain America and Bucky were gassed and bound up in mummy wrappings to be sacrificed; however, Cap broke himself and Bucky free. With Bucky still knocked out from the gas, Cap rushed him back outside before returning alone. He was almost hung by to death by the Spawn if not for the timely return of Bucky. In the final conflict with the Spawn, Cap and Bucky tossed the Book of Toth into a fire, and Egyptian intelligence agent Barbec (also a member of the cult who had seen the errors of his ways) shot the Spawn dead, causing him to revert to his mummified form. The temple then began to collapse, and only Cap and Bucky made it out alive; the cult was buried alive.{{r|Captain America Comics Vol 1 20}}\n| Equipment               = Each member of the Cult of Black Magic wore a costume that had a headpiece that was inspired by one of the many [[Ennead|Heliopian]] Gods. \n| Transportation          = \n| Weapons                 = The Cult was armed with knock out gas and various bladed weapons.\n| Notes                   = \n| Trivia                  = \n| Links                   = * [[Cult]]\n}}\n[[Category:Egyptian Organizations]]\n[[Category:Egyptian Religions]]"
                }
            }
        }
    ],
    "page_id": "482775"
}