{
    "pageid": 487869,
    "ns": 0,
    "title": "Cult of the River God (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Cult of the River God (Earth-616) from Sub-Mariner Comics Vol 1 10 0001.jpg\n| Name                    = Cult of the River God\n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Beneath the Ohio River, [[Ohio (State)|Ohio]]\n\n| Leaders                 = Formerly Dolvin\n| CurrentMembers          = \n| FormerMembers           = Dolvin, many unnamed others\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Carl Pfeufer\n| First                   = Sub-Mariner Comics Vol 1 10\n| Last                    = Sub-Mariner Comics Vol 1 10\n\n| HistoryText             = The Cult of the River God was formed by a [[National Socialist German Workers Party (Earth-616)|Nazi]] sympathizer named Dolvin. If he had any official connection to the party or not is unknown. He developed a massive underground hideout beneath the Ohio River and developed a means to flood the river if he so wished. He formed his Cult of the River God, under the idea that if the United States did not go into peace talks with Nazi Germany, then a vengeful \"river god\" would cause the Ohio River to flood.\n\nHe amassed a group of followers who worshiped the swordfish. His hideout contained many such of the fish and each member had a swordfish tattooed on their biceps. The cult attracted the attention of the [[Federal Bureau of Investigation (Earth-616)|FBI]] who planted agent John Harris to spy on the group. As the cult gained publicity, Dolvin discovered John's duplicity and causing a freak flood unleashed one of his swordfish on him. This attack was spotted by the [[Namor McKenzie (Earth-616)|Sub-Mariner]] who failed to prevent Harris from being fatally impaled or to stop the swordfish.\n\nHowever, learning of Harris' mission, Namor sought to infiltrate the cult as well. When meeting at their club house, Dolvin noticed that the tattoo Namor had put on his arm was incorrectly copied and tossed him into a pit of swordfish. Namor fought off the swordfish, and when he attempted to capture Dolvin, he set off a bomb in the house in an attempt to kill Namor. Both men survived, and Namor tracked Dolvin to his cult's secret hideout.\n\nDuring one of Dolvin's sermons of surrender, Namor attempted to talk sense into the other cult memberes. Dolvin climbed into their giant idol of a swordfish and used it to break through the walls of the tunnel flooding it and drowning his followers. Dolvin fled in a diving suit fashioned in the image of a swordfish while activating all the flood gates for overflow the river. Namor tracked him down and pulled off his diving mask, forcing Dolvin to drown while he reversed the flow of the flooding.{{r|Sub-Mariner Comics Vol 1 10}}\n\n| Equipment               = The cult had at least one suit of diving equipment that was fashioned in the shape of a swordfish. It did not appear to have any special adaptations.\n| Transportation          = \n| Weapons                 = The cult had swordfish that were trained to attack targets, and explosives.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = * [[Cult]]\n}}\n[[Category:Earth Religions]]"
                }
            }
        }
    ],
    "page_id": "487869"
}