{
    "pageid": 113953,
    "ns": 0,
    "title": "Cult of the Jackal (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Cult of the Jackal (Earth-616) from Scarlet Spider Unlimited Vol 1 1 0001.jpg\n| Name                    = [[Cult of the Jackal]]\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Transia]], [[Wundagore Mountain]]\n\n| Leaders                 = [[Anubia (Earth-616)|Anubia]]\n| CurrentMembers          = [[Caiman (Cult of the Jackal) (Earth-616)|Caiman]], [[Harrier (Cult of the Jackal) (Earth-616)|Harrier]], [[Piranis (Earth-616)|Piranis]]\n| FormerMembers           = \n| Allies                  = [[Miles Warren (Earth-616)|Jackal (Miles Warren)]]\n| Enemies                 = [[Benjamin Reilly (Earth-616)|Scarlet Spider (Ben Reilly)]], [[Herbert Wyndham (Earth-616)|High Evolutionary (Herbert Wyndham)]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Glenn Herdling; Tod Smith\n| First                   = Scarlet Spider Unlimited Vol 1 1\n| Last                    = Scarlet Spider Unlimited Vol 1 1\n\n| HistoryText             = The Cult of the Jackal was a cult of genetically engineered New Men who revered not their creator the High Evolutionary but rather his former assistant [[Miles Warren (Earth-616)|Miles Warren]] aka the Jackal. The members of the New Men were animals evolved into humanoid form by the [[Herbert Wyndham (Earth-616)|High Evolutionary]], but some among them longed to be human. Miles Warren promised to make the members of the cult human and that they would one day follow him into the world of man. Miles Warren created a retrovirus based on DNA he claimed to have gotten from human volunteers that was able to convert these New Men into human form. The retrovirus worked only temporarily and soon turned the inoculated into walking corpses. Ben Reilly speculated this retrovirus may have been a precursor to the Jackal's [[Carrion Virus]]. The Jackal left the New Men every year and returned every summer. One summer, he boasted of creating two perfect clones: [[Benjamin Reilly (Earth-616)|one]] of [[Peter Parker (Earth-616)|Peter Parker]] and the [[Joyce Delaney (Earth-616)|other]] of [[Gwendolyne Stacy (Earth-616)|Gwen Stacy]]. Jackal promised to transfer all of the New Men into the bodies of cloned humans.<!-- {{r|Scarlet Spider Unlimited Vol 1 1}} -->\n\nThe High Evolutionary wanted to break the New Men of their devotion to Miles Warren and eventually returned to subjugate them once more. It was at this point the cult was established. He kidnapped the Gwen Stacy clone and faked tests to show that she was not a clone grow in a lab but rather a college student named Joyce Delaney infected with a retrovirus to rewrite her DNA into that of Gwen Stacy's and that the same was true for [[Anthony Serba (Earth-616)|Anthony Serba]] and Spider-Man's clone. The High Evolutionary spun this tale for his people because he did not want his New Men to aspire to be clones as his viewed clones as counterproductive to evolution and he wanted the New Men to take pride in themselves as a race.<!-- {{r|Scarlet Spider Unlimited Vol 1 1}} -->\n\nEventually, Ben Reilly as the Scarlet Spider encountered the cult in the search for [[Kaine Parker (Earth-616)|Kaine]]. The cult leader [[Anubia (Earth-616)|Anubia]] told the Scarlet Spider of her belief that he was neither the real Peter Parker or a clone but rather a genetically altered Anthony Serba. The High Evolutionary later told Ben that he banished the Jackal from [[Wundagore Mountain]] for creating a [[Jackal (New Man) (Earth-616)|Jackal-Man]] creature without the High Evolutionary's approval. The High Evolutionary also explained that neither Ben or Peter was Anthony Serba and that the real Serba was murdered by Miles Warren and that was what unhinged Miles and created his Jackal persona.{{r|Scarlet Spider Unlimited Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n\n[[Cult]]\n[[Category:Earth Religions]]"
                }
            }
        }
    ],
    "page_id": "113953"
}