{
    "pageid": 23376,
    "ns": 0,
    "title": "Cult of Entropy (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Cult of Entropy (Earth-616) from Man-Thing Vol 3 5 0001.jpg\n| Name                    = [[The Cult of Entropy]]\n| Aliases                 = \n\n| Leaders                 = Formerly [[Morgan Le Fay (Earth-616)|Morgan Le Fay]], [[Mahapralaya (Earth-616)|Mahapralaya]], [[Andrew Forson (Earth-616)|Andrew Forson]], [[Victor Conrad (Earth-616)|Victorius]], [[Yagzan (Earth-616)|Yagzan]]\n| CurrentMembers          = [[Mahapralaya (Earth-616)|Mahapralaya]], [[Jacob Eichorn (Earth-616)|Styx]], [[Gerald Stone (Earth-616)|Stone]]\n| FormerMembers           = [[Akar (Earth-616)|Akar]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = [[Joseph Timms (Earth-616)|The Glob]]\n| Enemies                 = [[Ellen Brandt (Earth-616)|Ellen Brandt]]; [[Howard the Duck (Earth-616)|Howard the Duck]]; [[Bruce Banner (Earth-616)|The Hulk]]; [[Theodore Sallis (Earth-616)|Man-Thing]], [[Mercs for Money (Earth-616)|Mercs for Money]], [[Peter Parker (Earth-616)|Spider-Man]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Mobile\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[Florida (State)|Florida]] [[Everglades]]\n\n| Creators                = Steve Gerber; Mike Ploog\n| First                   = Giant-Size Man-Thing #1\n\n| History                 = \n\n===Origins===\nThe Cult of Entropy was a secret cabal of nihilists whose ambitions included the dissolution of the universe through the process of natural atrophy. They have existed for centuries. In the 1400's and 1500's, many cities were built throughout Europe to act as \"spirit traps\", catching lost souls such as those that died a violent death that were unwilling to move onto the next world. Numerous fail-safes were made to both contain these spirits and keep intruders out. The cult lost influence over time and the cities were abandoned. Sorcerors of various abilities came and tried to deal with them but all failed, while the ghosts got restless. {{r|Avengers World #4}}\n\n===Under Yagzan's rule===\nYears ago, the Cult's leader [[Yagzan (Earth-616)|Yagzan]] found the remains of [[Joseph Timms (Earth-616)|Joseph Timms, aka the Glob]]. He determined that although the body was seemingly dead, Timms' brain had survived. Yagzan removed the brain, placed it in an enclosure, and brought it back to health. He also infused a portion of himself into the brain, forming a mental link with it so that he could control it in the future. Yagzan dubbed it \"the Golden Brain\".\n\nYagzan used the power of the brain to oppose the construction of the Omegaville energy project on behalf of his cult. However, the near-by [[Theodore Sallis (Earth-616)|Man-Thing]] sensed the anger of the men nearby, and was drawn into the conflict. A surprised Yagzan then used the brain's power to construct a golden-hued replica of Glob's body, which fought with Man-Thing, but was easily defeated. The exertion caused the Golden Brain to become so hot that Yagzan dropped it into the swamp. Freed, the Golden Brain tried to recall his lost memories. Still mostly amnesiac, the Golden Brain came back onto the land, and formed a new, human body for itself out of clay. 'Joe' as he now called himself later approached the Omegaville project, where he was hired as a worker. The cult later tracked the Glob down, and, horrified by his transformation back into a human form, Yagzan re-asserted his mental control to force Glob to devolve as much as possible. Now a mass of humanoid clay, Yagzan once again ordered Glob to destroy Omegaville. Again, the Glob was stopped by Man-Thing, who pummelled him into a shapeless mass of clay. Yagzan attempted to reform the creature, but he took advantage of his amorphous form and engulfed Yagzan completely before hardening back into his human form, suffocating him.{{r|Giant-Size Man-Thing #1}}\n\n===Under Victorius' rule===\nVictorious regrouped the cult and, using the [[Cosmic Cube]] in his possession, reformed the remains of Yagzaninto Jude, the Entropic Man, and together they started their new world order. This led to a conflict with [[Benjamin Grimm (Earth-616)|the Thing]], [[Steven Rogers (Earth-616)|Captain America]] and the [[Theodore Sallis (Earth-616)|Man-Thing]] in the swamp of the [[Everglades]]. Victorious and Jude were transformed into some sort of radiant crystal when they touched the Cosmic Cube while the Man-Thing was holding it.{{r|Marvel Two-In-One #42|43}}\n\n===Under Mahapralaya's rule<!-- where does this one fit? -->===\nYears later, the Cult of Entropy resurfaced, this time led by a man named Mahapralaya. In order to show their devotion to their cause, the cultists infected their own bodies with a variety of fatal viruses and diseases, giving them a jaundiced appearance similar to that of rotting corpses. Mahapralaya even acquired fresh recruits by way of his website www.putrescence.com. As his disciples began to grow, they met a being known as Mister Termineus who apprised them of the fact that the Nexus of All Realities had been shattered and that such an incident threatened to destroy all reality. Mahapralaya knew that the Nexus' guardian the Man-Thing would be goaded into protecting the fragmented shards, so he set out to find the various pieces himself. He discovered that the Nexus fragments had housed themselves within human beings, one of which being Howard the Duck. Mahapralaya captured Howard and brought him into the Florida Everglades, the original site of the Nexus of All Realities. He believed that if he could destroy but one of the fragments, then the Nexus could never be restored, and thus his dreams of universal dissolution would come to fruition. However, the Man-Thing intervened, and intercepted the Nexus shard before Mahapralaya could acquire it. After which, the swamp creature turned his corrosive touch against the cult leader with unexpected results. Rather than burning Mahapralaya's face, The Man-Thing's powers, working in concert with the Nexus shard, actually healed his disease-ridden body, turning him into a normal person. Moments later, Mahapralaya staggers off into the swamp.{{r|Man-Thing Vol 3 #5|6}}\n\n===Under Andrew Forson's rule===\nCult member [[Andrew Forson (Earth-616)|Andrew Forson]] had once worked with undercover [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] agent [[Barbara Morse (Earth-616)|Bobbi Morse]]. Creating a second personality in her, he used Morse to kill investigating S.H.I.E.L.D. agents, then to remove Victorius himself in order to take over the cult.{{r|Avengers NOW! #1|; [[Andrew Forson (Earth-616)|Andrew Forson]]'s entry}}\n\nAndrew Forson then made Bobbi Morse forget these events. He would later join [[Advanced Idea Mechanics (Earth-616)|AIM]].{{r|Avengers NOW! #1|; [[Andrew Forson (Earth-616)|Andrew Forson]]'s entry}} Forson's dedication to the Cult of Entropy led to its philosophies being incorporated into AIM under his guidance. The Entropic Man even became a part of AIM's ruling council as Forson brought the organizations together.{{r|Secret Avengers Vol 2 #2}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n\n}}\n\n[[Cult]]\n[[Category:Terrorist Organizations]]\n[[Category:Earth Religions]]"
                }
            }
        }
    ],
    "page_id": "23376"
}