{
    "pageid": 44149,
    "ns": 0,
    "title": "Daily Globe (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Daily Globe from Fantastic Four Vol 1 2 0001.jpg\n| Name                    = Daily Globe\n| Aliases                 = \n\n| Leaders                 = [[Barney Bushkin (Earth-616)|Barney Bushkin]] (publisher)\n| CurrentMembers          = [[April Maye (Earth-616)|April Maye]], [[Character Index/J#Joe|Joe]], [[Paul Barnum (Earth-616)|Paul Barnum]]\n| FormerMembers           = [[Edward Brock (Earth-616)|Eddie Brock]], [[Character Index/G#Gavin|Gavin]], [[Character Index/J#Jay|Jay]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[New York City]], [[New York (State)|New York State]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Arnold Hicks\n| First                   = Mystic Comics #3\n\n| History                 = The Daily Globe was a rival newspaper of New York City's [[Daily Bugle]]. While it is unknown when the Globe was founded, the paper has been in publication since at least August of 1950.{{r|Adventures into Terror Vol 1 44}} Its publisher was [[Barney Bushkin (Earth-616)|Barney Bushkin]], a journalist whose rivalry with the Daily Bugle's publisher [[John Jonah Jameson (Earth-616)|John Jonah Jameson]] dated back to their college years.{{r|Peter Parker: The Spectacular Spider-Man Annual Vol 1 1}}\n\nThe [[Norman Osborn (Earth-616)|Green Goblin]] once went to the ''Globe'' to acquire Spider-Man's deep background files. However, the staff seemed hesitant to give the Goblin the information. Finally, one of the young photographers said the ''he'' was Spider-Man. The Goblin tested the boy's claim by throwing him out of the window, and the real Spider-Man swung in and rescued the boy, and the Goblin retreated.<ref>''[[Untold Tales of Spider-Man (novel)|Untold Tales of Spider-Man]]'' \"Identity Crisis\"</ref>\n\n[[Edward Brock (Earth-616)|Eddie Brock]] was a successful columnist for the newly revived Daily Globe until he began writing a series of articles about the \"[[Stanley Carter (Earth-616)|Sin-Eater]] murders.\" While protecting the \"murderer's\" identity under the First Amendment, Brock wrote a series of stories in the Globe detailing his dialogue with the supposed killer, until mounting pressure from the authorities forced him to write an exclusive revealing the murderer's name. Although that edition of the paper sold out immediately, Spider-Man soon revealed the true identity of the Sin-Eater to be Detective Stan Carter (the man Brock had been interviewing was actually a compulsive confessor), making Brock a laughingstock among his fellow journalists. Brock was fired, beginning a downward spiral that would eventually lead to him becoming the original Venom.\n\nA couple of years later, the Daily Globe went out of business. Embittered by the contrast between his life and J.J. Jameson's constant habit of failing upwards, Barney Bushkin was found drowning his sorrows in a bar by the supervillain [[Arcade (Earth-616)|Arcade]], who provied Barney with a remotely-controlled robot to terrorize Jameson. Two years later, Barney used the robot to abduct Jonah and take him to the rooftop of the Daily Globe. Once there, Barney shot Jonah with a realistic toy gun that squirted ink. After admitting that he simply wanted Jonah to feel scared, Jonah comforted Barney and even offered him to produce his segments for a radio show.{{r|Peter Parker: The Spectacular Spider-Man Annual Vol 1 1}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = * [[Peter Parker (Earth-616)|Peter Parker]] has sold photos to the Globe and was once a salaried employee.\n| Trivia                  = \n| Links                   = \n}}\n[[it:Daily Globe (Terra-616)]]\n[[Category:Companies]]\n[[Category:Newspapers]]"
                }
            }
        }
    ],
    "page_id": "44149"
}