{
    "pageid": 349418,
    "ns": 0,
    "title": "Dark Sisterhood (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Dark Sisterhood (Earth-616) from Cable Vol 1 89 001.jpg\n| Name                    = Dark Sisterhood\n| Aliases                 = Witches, [[Sisterhood]]\n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Fiona Knoblach (Earth-616)|Dark Mother]]\n| CurrentMembers          = \n| FormerMembers           = [[Bonita (Earth-616)|Bonita]], [[Fiona Knoblach (Earth-616)|Dark Mother]], [[Gina Anderson (Earth-616)|Gina Anderson]], [[Connie Moore (Earth-616)|Connie Moore]], 3000 unnamed members{{r|Cable Vol 1 92}}\n| Allies                  = \n| Enemies                 = [[Nathan Summers (Earth-616)|Cable]], [[Rachel Summers (Earth-811)|Marvel Girl]], [[William Knoblach (Earth-616)|Clarity]], [[Homo sapiens|mankind]]\n\n| Origin                  = Descendants of [[Fiona Knoblach (Earth-616)|Dark Mother]]{{r|Cable #94}}\n| PlaceOfFormation        = possibly [[Salem (Massachusetts)|Salem]], [[Massachusetts (State)|Massachusetts]]\n| PlaceOfDissolution      = [[New York City]]\n| Creators                = Robert Weinberg; Michael Ryan\n| First                   = Cable #88\n| Last                    = \n\n| HistoryText             = The organization of the Dark Sisterhood began sometime in the 18th or 19th century. Originally, the Sisterhood came from women born with unusual powers banding together for protection. Called witches, these women initially adopted the name \"The Dark Sisterhood\" in defiance of their persecutors.{{r|Cable #90}} Unbeknownst to them originally, the organization's members were all descended from the mutant known as the [[Fiona Knoblach (Earth-616)|Dark Mother]]. In the early 18th century, the Dark Mother had seven children (all girls) who scattered throughout the [[United States]]. Each of these girls married and had children of their own, most of which were girls.{{r|Cable Vol 1 93}}\n\nThese descendants, in turn, got married and raised their own families, and so on through several generations. Upon realizing their heritage, the Dark Sisterhood began recruiting exclusively from the Dark Mother's descendants.{{r|Cable Vol 1 93}} When they first banded together, the Sisters sought power to save themselves from the death and torture they were submitted to by their fellow humans. But over time, their goals became twisted. They sought not just to be equal, but to rule, to replace the corrupt system they were living in with their own. In the modern-day, The Sisterhood controls huge crime cartels. It commands politicians, ambitious generals, and renegade police officers. Their ultimate goal is global domination.{{r|Cable #90}}\n\nThe Dark Sisterhood's modus operandi whenever they established themselves in a new city was to pick an organization to bring into submission in order to make an example for the rest. This demonstration of power was to keep others in line. Typically, this punishment was meted out to any crime organization that tried to oppose the Dark Sisterhood. The Dark Sisterhood would not only extinguish the organization, but also killed off all of its members' wives, husbands, children, lovers, companions, and live-in relatives. After this massacring, they would send the last surviving member of the crime group to the bosses and leaders of the major mobs and gangs in that city, to let them know what happened and what would be the consequences of cheating the Dark Sisterhood.{{r|Cable Vol 1 88}} Throughout the world, there were criminal cartels under the Sisterhood's control, and at one point the Sisterhood was controlling half of all criminal activity in the United states.{{r|Cable Vol 1 89}}{{r|Cable Vol 1 95}}\n\nThe members of the Dark Sisterhood used their psychic abilities to manipulate others to commit their crimes, though when necessary they would do carry out the work themselves (e.g. assassination, terrorism, or using sex to influence a target).{{r|Cable Vol 1 89}} The Dark Sisterhood manipulated figures throughout society, including corporate CEOs, heads of state, generals, politicians, labor union representatives, and police officers.{{r|Cable Vol 1 90|91}} In the Dark Sisterhood, there was no forgiveness, even for their own members. The punishment for failure was death.{{r|Cable Vol 1 90}} Most members knew that the organization's ultimate stated goal was to take over the world. Only the highest tier knew the truth, that the Dark Mother's goal was to establish a global matriarchy. A world ruled by women, with the men, who in their view had poisoned the world, being their slaves.{{r|Cable Vol 1 93}} \n\nAfter ten generations, the Dark Mother had almost 30,000 descendants. At the time of their confrontation with [[Nathan Summers (Earth-616)|Cable]], the Dark Sisterhood itself had over 3,000 members.{{r|Cable Vol 1 92|93}} As the Dark Mother saw Cable as an existential threat, the Dark Sisterhood went to war against him. They attempted to kill him twice, without success. The first time 20 of them attacked one of his safe houses, where they fought him and lost, sustaining casualties. The second time they attacked what they believed to be his new safe house which was a trap, that wiped the memories of a 100 of them. In the meantime, they isolated him from his allies and set him up in the media and government, making it appear as if he was an out of control mutant terrorist. \n\nCable, in turn, began to cripple many of their operations by causing the sisters in charge of those operations to lose their memory. He then prevented the Dark Sisterhood from taking over the country, when they arranged several assassinations so one of the sisters (the Secretary of Defense) could become President of the United States. Eventually, Cable was able to provided to ally [[George Washington Bridge (Earth-616)|G.W. Bridge]], with the information he needed to convince [[Henry Gyrich (Earth-616)|Henry Gyrich]] of the conspiracy. Government agents arrested operatives of the Dark Sisterhood within the government and law enforcement, and those men in government who were working for the Sisterhood.{{r|Cable Vol 1 88|95}} \n\nThousands of government soldiers with air support attacked the headquarters of Xylon Corporation, the Dark Sisterhood's business front and the Dark Mother's base which was defended by 100s of Sisters. Cable and [[Rachel Summers (Earth-811)|Rachel Summers]] in turn headed for the Dark Mother. They fought their way through and defeated the Dark Mother, who ended up in a catatonic state.{{r|Cable Vol 1 94|95}} The Dark Sisterhood later regrouped but they lost the Dark Mother who was assassinated by the [[Marauders (Earth-616)|Marauders]] on orders of [[Nathaniel Essex (Earth-616)|Mr. Sinister]] who was eliminating those with precognitive abilities.{{r|Official Handbook of the Marvel Universe A-Z Update Vol 1 3}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = [[Psimitar]]'s (the primary weapon), high-tech weapons (firearms) comparable to that of [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]]{{r|Cable Vol 1 90}}{{r|Cable Vol 1 95}}\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Knoblach Family]]\n[[Category:Terrorist Organizations]]\n[[Category:Earth Religions]]\n[[Category:Criminal Organizations]]\n[[Category:Drug Cartels]]\n[[Category:Mutant Organizations]]"
                }
            }
        }
    ],
    "page_id": "349418"
}