{
    "pageid": 1277366,
    "ns": 0,
    "title": "Dark Guardians (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Guardians of the Galaxy Vol 5 3 Textless.jpg\n| ImageSize               = 300\n| Name                    = [[Dark Guardians]]\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Eros (Earth-616)|Starfox]]\n| CurrentMembers          = \n| FormerMembers           = [[Kallark (Earth-616)|Gladiator]], [[Nebula (Earth-616)|Nebula]], [[Eros (Earth-616)|Starfox]], [[Frank Castle (Earth-TRN666)|The Rider]], [[Zak-Del (Earth-616)|Wraith]]\n| Allies                  = [[Imperial Guard (Earth-616)|Imperial Guard]], [[Imperial Kree Army (Earth-616)|Kree Army]]\n| Enemies                 = [[Hela (Earth-616)|Hela]], [[Black Order (Earth-616)|Black Order]]; formerly [[Guardians of the Galaxy (Earth-616)|Guardians of the Galaxy]], [[Gamora Zen Whoberi Ben Titan (Earth-7528)|Gamora]], [[Richard Rider (Earth-616)|Nova]], \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Donny Cates; Geoff Shaw\n| First                   = Guardians of the Galaxy Vol 5 2\n| Last                    = Guardians of the Galaxy Vol 5 6\n\n| HistoryText             = The Dark Guardians were brought together by [[Eros (Earth-616)|Starfox]] after he read the last will of his dead brother [[Thanos (Earth-616)|Thanos]] who revealed that his resurrection would happen in the body of another. The Dark Guardians first mission was to find [[Gamora Zen Whoberi Ben Titan (Earth-7528)|Gamora]] and kill her in hopes that she was the person it would happen to. To find her, they decided to locate Gamora's ex-lover [[Richard Rider (Earth-616)|Nova]] who might know where she was at.{{r|Guardians of the Galaxy Vol 5 2}}\n\nThe Dark Guardians caught up to him and managed to make him crash-land on the planet [[Elynor-143]]. They cut off his connection to the [[Nova Corps (Earth-616)|Nova Corps]] and tried to convince him that it would be in his best interest to turn over Gamora, but Nova said he already picked a side and flew off at top speed so the Guardians couldn't catch him. [[Nebula (Earth-616)|Nebula]] chimed in that they will be able to track him due to the fact that he was beaten, confused, and bleeding out. With his connection cut off and being to far away from them the only logical place for him to go is to Gamora.{{r|Guardians of the Galaxy Vol 5 3}}\n[[File:Dark Guardians (Earth-616) from Guardians of the Galaxy Vol 5 4 001.png|left|thumb|Dark Guardians]]\nThey managed to find Nova on board [[Peter Quill (Earth-616)|Quill]]'s ship and by luck Gamora was also aboard. [[Kallark (Earth-616)|Gladiator]] handed the [[Guardians of the Galaxy (Earth-616)|Guardians of the Galaxy]] an ultimatum: hand over Gamora or they would blow them out of the sky. As they refused to hand her over, Gladiator fired an optic blast at [[Ryder (Vehicle)|The Ryder]] knocking it off course. They were forced to land with [[Beta Ray Bill (Earth-616)|Beta Ray Bill]] setting it down on an unnamed planet. Both teams engaged in a battle as Gamora joined the fray by blasting her sister Nebula. Gladiator again shot his eye beams towards Gamora, but Quill jumped in front of her taking the hit instead. The Dark Guardians defeated the group as Quill laid there apparently died as Gamora held him,{{r|Guardians of the Galaxy Vol 5 4}} though Quill would survive thanks to sturdy body armor.\n\nThe Dark Guardians took Gamora and brought her aboard her ship the [[Lilandra IV]] where she briefly met Starfox before ordering Gladiator to kill her. Gamora's execution was interrupted by the arrival of the Asgardian death goddess [[Hela (Earth-616)|Hela]] who was planning to resurrect Thanos. She quickly took out Gladiator and the [[Frank Castle (Earth-TRN666)|Rider]]. The [[Black Order (Earth-616)|Black Order]] arrived shortly after to make sure the remaining Dark Guardians didn't interfere. [[Zak-Del (Earth-616)|Wraith]] didn't put up a fight because he already received what he wanted for helping the Dark Guardians: info on the dark god [[Knull (Earth-616)|Knull]]. Hela then revealed that Starfox was Thanos' vessel of resurrection, not Gamora, and Thanos' consciousness took over Starfox's mind shortly after. When the Guardians of the Galaxy finally arrived to rescue Gamora, they found her surrounded by the unconscious remaining members of the Dark Guardians.{{r|Guardians of the Galaxy Vol 5 5}}\n\nThe remaining Dark Guardians agreed to join forces with the Guardians in order stop Thanos' resurrection. Using [[Lockjaw (Earth-616)|Lockjaw]]'s teleportation ability, the Guardians and Dark Guardians stormed [[Knowhere]] and fought off the Black Order and a horde of [[Outriders (Race)|Outriders]]. In order to stop Thanos' resurrection, Gamora killed Starfox, but this only caused Thanos to be brought back with a broken mind. When Hela fired a missile than would generate a black hole, Beta Ray Bill knocked it away with [[Stormbreaker]], causing it to hit Thanos. The black hole generated then sucked up Knowhere, Thanos, Hela, and the surviving Ouriders while the Guardians and Dark Guardians escaped via Lockjaw.{{r|Guardians of the Galaxy Vol 5 6}}\n\n| Equipment               = [[Ghost Rider's Chain]]\n| Transportation          = [[Hell Cycle]], [[Shi'ar Star Cruiser]] [[Lilandra IV]]\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1277366"
}