{
    "pageid": 1322957,
    "ns": 0,
    "title": "Daughters of Liberty (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Daughters of Liberty (Earth-616) from Women of Marvel Vol 2 1 001.jpg\n| Name                     = Daughters of Liberty\n| Aliases                 = \n\n| Leaders                 = [[Margaret Carter (Earth-616)|The Dryad (Peggy Carter)]]; formerly [[Araminta Ross (Earth-616)|The Dryad (Harriet Tubman)]]\n| CurrentMembers          = [[Shuri (Earth-616)|Aja-Adanna]], [[Natalia Romanova (Earth-616)|Black Widow]], [[Margaret Carter (Earth-616)|The Dryad]], [[Maya Lopez (Earth-616)|Echo]], [[Robin Braxton (Earth-616)|Gladiatrix]], [[Agatha Harkness (Earth-616)|Agatha Harkness]], [[Susan Storm (Earth-616)|Invisible Woman]], [[Toni Ho (Earth-616)|Iron Patriot]], [[Mercedes Knight (Earth-616)|Misty Knight]], [[Barbara Morse (Earth-616)|Mockingbird]], [[Sharon Carter (Earth-616)|Sharon Carter]], [[Jessica Drew (Earth-616)|Spider-Woman]], [[Ava Ayala (Earth-616)|White Tiger]], unidentified other members\n| FormerMembers           = [[Araminta Ross (Earth-616)|The Dryad (Harriet Tubman)]], [[Alexa Lukin (Earth-616)|Alexa Volkoff]], several unnamed members\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Steven Rogers (Earth-616)|Captain America]], [[Samuel Wilson (Earth-616)|Falcon]], [[Thaddeus Ross (Earth-616)|Thunderbolt Ross]], [[James Buchanan Barnes (Earth-616)|Winter Soldier]]; formerly [[Eliot Franklin (Thunderball) (Earth-616)|Thunderball]]\n| Enemies                 = [[Wolfgang von Strucker (Earth-616)|Baron von Strucker]], [[Foreigner (Earth-616)|The Foreigner]], [[Wilson Fisk (Earth-616)|Kingpin]], [[Hydra (Earth-616)|Neo-Hydra]], [[Power Elite (Earth-616)|Power Elite]], [[Antony Diaz (Earth-616)|Scourge]], [[Selene Gallio (Earth-616)|Selene]], [[Watchdogs (Earth-616)|Watchdogs]]\n\n| Origin                  = A group of young women who came together over their shared beliefs of universal freedom and passed this down through the generations.\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = \n| PlaceOfFormation        = [[Europe]]\n| PlaceOfDissolution      = \n\n| Creators                = Ta-Nehisi Coates; Adam Kubert\n| First                   = Captain America Vol 9 7\n| Quotation               = But believe it or not, there are things older in this world than Captain America. And what I was, what I represented, was a need as old as humanity itself. And the need for freedom, liberty and the pursuit of happiness, well, it is forever. You see, they could kill a dreamer. But they could never kill the dream. They could jail the revolutionary. But they could never jail the revolution.\n| Speaker                 = [[Sharon Carter (Earth-616)|Sharon Carter]]\n| QuoteSource             = {{Citation}}\n| History                 =\n===Origins===\nThe '''Daughters of Liberty''' were preceded by the [[Daughters of Light (Earth-616)|Daughters of Light]], a group of young women in late 18th century [[Europe]] that preached freedom; however, that group disbanded when their leader was sentenced to death by beheading, though one of her followers fled to the [[United States of America|colonies]].\n\nSpreading the message of freedom in the colonies, the Daughters of Liberty were born as a sisterhood of guardians protecting knowledge of the new era. They were trained in the ways of combat, such as swordsmanship. They were also trained in the ways of magic by [[Agatha Harkness (Earth-616)|Agatha Harkness]] and in science by the Dryad, the leader of their time.\n\nThe Daughters of Liberty made it their mission to protect freedom at all costs and to protect humanity against its own excesses and powers, ensuring these were used wisely. This included former Dryad, [[Araminta Ross (Earth-616)|Harriet Tubman]], helping lead over 300 slaves to the freedom of the North during the 19th century.\n\nBy the mid-20th century, [[Alexa Lukin (Earth-616)|Alexa Volkoff]] recruited [[Margaret Carter (Earth-616)|Peggy Carter]], a young Virginian tomboy, into the organization. Volkoff became Carter's handler and trained her to become a lethal agent.\n\nCarter's first mission was to make sure that the [[Super-Soldier Serum]] inside [[Steven Rogers (Earth-616)|Captain America]] never fell into the wrong hands, though the two fell in love during her assignment. She would later become the current Dryad.{{r|Captain America Vol 9 19}} \n\n===Modern Day===\nWhen Captain America was framed for the murder of [[Thaddeus Ross (Earth-616)|General Thaddeus Ross]], he turned himself into the authorities. This prompted the Dryad to bring together the modern incarnation of the Daughters to help clear his name, many of whom were summoned by [[Sharon Carter (Earth-616)|Sharon Carter]].{{r|Captain America Vol 9 7}}\n\nAfter returning from blackmailing [[Wilson Fisk (Earth-616)|Mayor Wilson Fisk]] for information, Sharon met with [[Mercedes Knight (Earth-616)|Misty Knight]], [[Barbara Morse (Earth-616)|Bobbi Morse]], and [[Ava Ayala (Earth-616)|Ava Ayala]] to reveal to them that Ross' true murderer was the [[Foreigner (Earth-616)|Foreigner]], the ex-husband of [[Silvija Sablinova (Earth-616)|Silver Sable]].{{r|Captain America Vol 9 8}}\n\nThe Daughters met up with the Dryad in order to discuss their plans, with [[Toni Ho (Earth-616)|Toni Ho]] having downloaded the schematics for the [[Myrmidon (Prison)|Myrmidon]]. [[Jessica Drew (Earth-616)|Jess Drew]] and [[Susan Storm (Earth-616)|Sue Storm Richards]] discussed using a prisoner, [[Eliot Franklin (Thunderball) (Earth-616)|Eliot Franklin]], to help stage a breakout. Bobbi suggested using brownouts to sneak in and the Dryad began doling out missions, stating she would go after the Foreigner herself.{{r|Captain America Vol 9 9}}\n\nFive weeks later, Sue infiltrated the Myrmidon to begin enacting the escape plan and injected Dr. Franklin with an unknown substance that caused a blackout in the prison; meanwhile, the Dryad attacked five of the Foreigner's safe houses in [[New York City]].{{r|Captain America Vol 9 10}}\n\nDue to the blackout in the prison, the prisoners rioted, giving Rogers the chance to escape and meet up with Sue and Misty, who had apprehended the Myrmidon's warden, [[Wolfgang von Strucker (Earth-616)|Baron von Strucker]]. Meanwhile, the Dryad faced the Foreigner directly, though their battle was cut short when [[Hydra (Earth-616)|Neo-Hydra]] attacked the two with a missile, seemingly killing the Foreigner. Bobbi and Jess then met with Sue, Misty, and Steve outside of the prison, while Sharon and Toni coordinated all of the missions.{{r|Captain America Vol 9 11}}\n\nWhile the Dryad was having ex-[[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] psi-agents remove all pertinent intel from von Strucker's mind, the [[James Buchanan Barnes (Earth-616)|Winter Soldier]] was standing by, feeding information about Steve to [[Nicholas Fury, Jr. (Earth-616)|Nick Fury]] on her request. During this time, Steve asked the Daughters to be his team, to which they agreed. Later on, Sharon met with Bucky and the Dryad to check on the status of von Strucker's intel, and the Dryad revealed herself to be Peggy Carter.{{r|Captain America Vol 9 12}}\n\nOn his first mission with the Daughters, Steve helped White Tiger protect immigrants at the U.S.-[[Mexico]] border from the [[Watchdogs (Earth-616)|Watchdogs]], saving many with the added help of [[Maya Lopez (Earth-616)|Echo]], while the Dryad made sure Nick Fury found their [[Manhattan]] hideout.{{r|Captain America Vol 9 13|14}}\n\nWhen a new [[Antony Diaz (Earth-616)|Scourge]] began killing corrupt Russian mercenaries hired as NYPD officers by Mayor Fisk, Steve and Misty tracked down leads. This culminated in Steve, Misty, Sue, Bobbie, and Jess suppressing a riot on national television, and tracking Scourge to his hideout, where he committed suicide.{{r|Captain America Vol 9 15|18}}\n\nRealizing Steve had discovered she was still alive, the Dryad had Agatha appear to him and inform him of the organization's history. She then revealed to him that all of the threats the Daughters had recently faced were linked in a massive conspiracy leading back to Volkoff, now known as Alexa Lukin, the wife of [[Aleksander Lukin (Earth-616)|Aleksander Lukin]].{{r|Captain America Vol 9 19}}\n\nHaving been stationed by the Dryad in [[Madripoor]] in order to monitor the Watchdogs, [[Natalia Romanova (Earth-616)|Black Widow]] discovered Crossbones and Sin's faction of Neo-Hydra working closely with the Watchdogs. Contacting the Dryad and Misty, the three met up with Thunderbolt Ross, whom Natasha had previously discovered was still alive.{{r|Captain America Vol 9 20}}\n\nContacting Sharon and Toni, Dryad and Misty watched as Ross explained to Sharon that he'd survived using an [[Life-Model Decoy|L.M.D.]] and explained that Lukin had helped with the war against Hydra, informing the Americans on various Hydra sleeper cells. Having become suspicious of her, Ross began looking into her, which caused Lukin to \"kill two birds with one shield\". However, the transmission shortly cut off after this.\n\nDuring these events, Sharon and Toni watched on as Steve, Bucky and Sam engaged Selene in combat to recover the [[Blood Marine]], a mystical gem made from Sharon's extracted soul, though Agatha quickly arrived with a new recruit for the Daughters; the Wakandan princess, [[Shuri (Earth-616)|Shuri]].\n\nExplaining that she and Agatha knew each other through their shared usage of the Mystic Arts, Shuri stated that Agatha filled her in on everything going on with Selene and Sharon's soul, and that it would be an honor to help her. Sharon accepted her help, and ordered Toni to help her get into the Iron Patriot armor. Agatha then teleported Shuri, Sharon, and herself to the location of the battle with Selene.{{r|Captain America Vol 9 #22}}\n\nAt some point, the Daughters went from a hidden team to being publicly known. They were instantly recognized by a young girl, [[Manisha Bashur (Earth-616)|Manisha Bashur]], after responding to a request for help from Misty Knight, who had been protecting Manisha from her father, the supervillain [[Garabed Bashur (Earth-616)|Black Box]]. Many of the Daughters engaged Black Box's forces in the heart of Harlem, successfully protecting Manisha.{{r|Women of Marvel Vol 2 #1}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = *The Daughters have two unnamed members who have appeared in [[Captain America Vol 9 9|issue 9]], [[Captain America Vol 9 12|issue 12]], and [[Captain America Vol 9 19|issue 19]]:\n** A Caucasian brunette wearing glasses and a choker resembling [[Victoria Hand (Earth-616)|Victoria Hand]], sans the red streak in her hair.\n** A woman sporting a mohawk and wearing a black tank top, who in issue 9 she is depicted as a Caucasian red-head resembling [[Robin Braxton (Earth-616)|Gladiatrix]], but in issue 12 she is depicted as a white-haired African-American resembling [[Ororo Munroe (Earth-616)|Storm]]. She is subsequently depicted again in issue 19 with her African-American design.\n*In [[Captain America Vol 9 22|issue 22]], a list of Daughters is shown on a chalkboard. Two sheets of names are shown, with a total of 16 members. However, most names are obscured or barely legible. Aside from the confirmation of [[Natalia Romanova (Earth-616)|Black Widow]] as a Daughter, only previously known Daughters can be seen on the list.\n| Links                   = * [[Wikipedia:Daughters of Liberty|''Daughters of Liberty'' at Wikipedia]]\n}}\n[[Category:Historical Organizations]]\n[[Category:American Organizations]]"
                }
            }
        }
    ],
    "page_id": "1322957"
}