{
    "pageid": 20527,
    "ns": 0,
    "title": "Daydreamers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Daydreamers (Earth-616) from Daydreamers Vol 1 1 0001.JPG\n| Name                    = Daydreamers \n| Aliases                 = \n\n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile throughout various realities \n\n| Leaders                 = [[Franklin Richards (Earth-616)|Franklin Richards]] \n| CurrentMembers          = \n| FormerMembers           = [[Tana Nile (Earth-616)|Tana Nile]], [[Theodore Sallis (Earth-616)|Man-Thing]], [[Howard the Duck (Earth-616)|Howard the Duck]], [[Arthur Maddicks (Earth-616)|Artie Maddicks]], [[Leech (Earth-616)|Leech]] \n| Allies                  = \n| Enemies                 = \n\n| Origin                  = The Daydreamers were a loose collection of individuals sharing in a common adventure. They have never officially recognized themselves by the name ''Daydreamers'', and no one else has referred to them by that name either.\n\n| PlaceOfFormation        = [[Massachusetts Academy|Xavier's School for Gifted Youngsters]]\n| PlaceOfDissolution      = [[Man-Thing's Swamp]], [[Florida (State)|Florida]] [[Everglades]]\n| Creators                = J.M. DeMatteis; Scott Lobdell\n| First                   = Generation X #20\n| Last                    = Daydreamers #3\n\n| HistoryText             = Several years ago, the [[X-Men (Earth-616)|X-Men]] engaged in another of their long-standing battles against their arch-foe, [[Max Eisenhardt (Earth-616)|Magneto]]. During the fight, the X-Men's leader, [[Charles Xavier (Earth-616)|Charles Xavier]] rendered Magneto catatonic with a massive surge of psionic energy. A portion of Magneto's internal rage and aggression entered the Professor's subconscious mind, and soon gave birth to a corporeal psychic entity known as [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]]. Onslaught cut a bloody swath of destruction across the state of [[New York]] and it took the combined strength of America's strongest heroes to end his threat once and for all. The super-hero teams known as the [[Avengers (Earth-616)|Avengers]] and the [[Fantastic Four (Earth-616)|Fantastic Four]] valiantly gave their lives to defeat this powerful villain.\n\nThe deaths of [[Reed Richards (Earth-616)|Mister Fantastic]] and the [[Susan Storm (Earth-616)|Invisible Woman]] left their young son, [[Franklin Richards (Earth-616)|Franklin Richards]], an orphan. Franklin's grandfather, the time-traveling warlord known as [[Nathaniel Richards (Earth-616)|Nathaniel Richards]], brought Franklin to the [[Massachusetts (State)|Massachusetts]] branch of [[Xavier's School for Gifted Youngsters]]. He asked co-headmaster, [[Sean Cassidy (Earth-616)|Sean Cassidy]] to watch over Franklin and to take care of him in the aftermath of this terrible tragedy. Sean agreed and vowed to do everything within his power to ease Franklin's suffering. He provided Franklin with a room inside the school's [[Bio-Sphere]] where he was introduced to two other [[Homo superior|mutant]] children, [[Arthur Maddicks (Earth-616)|Artie Maddicks]] and the former [[Morlocks (Earth-616)|Morlock]] known as [[Leech (Earth-616)|Leech]]. Franklin, Artie and Leech became fast friends and before long, they were virtually inseparable. The children often interacted with Sean and fellow instructor [[Emma Frost (Earth-616)|Emma Frost]], as well as the school's student body – [[Generation X (Earth-616)|Generation X]]. \n\nDuring this same time period, an alien from the planet [[Rigel-3]] named, [[Tana Nile (Earth-616)|Tana Nile]], crash-landed on the planet Earth. The kids discovered her and brought her inside their Bio-Sphere tree-house. They were careful to not let Emma or Sean become aware of Tana's presence, and Leech would frequently run back and forth between the tree-house and the school in order to sneak some food for his new alien friend.\n\nWhile the kids continued to administer aid to Tana, the fifth member of their non-group came into their lives. An alien known as [[Howard the Duck (Earth-616)|Howard the Duck]] had recently given the mutants [[Jonothon Starsmore (Earth-616)|Chamber]] and [[Angelo Espinosa (Earth-616)|Skin]] a ride back from [[Los Angeles]]. Upon arriving at the school, Howard met the kids who immediately warmed to the idea of playing with a talking duck. Howard had no interest in associating with even more \"hairless apes\", but found that he could not bring himself to leave. \n\nNot long after the Christmas holiday, Sean Cassidy's evil brother, [[Thomas Cassidy (Earth-616)|Black Tom]] attacked the school. Tom wanted revenge against Cassidy for stealing his niece [[Theresa Rourke (Earth-616)|Theresa]] away from him, and decided to manifest his vengeance by killing all of Sean's charges. Tom raided the Bio-Sphere, but Howard the Duck managed to keep the plant-like villain at bay by lighting him on fire. \n\nThe stress of the situation became too strong for Franklin Richards and he subconsciously desired a means of escape. To that end, he inadvertently used his innate mutant powers to summon the swamp-guardian known as the [[Theodore Sallis (Earth-616)|Man-Thing]] to the school. Howard the Duck had encountered the Man-Thing on several occasions and realized that the muck-monster was the focal point to a dimensional gateway called the [[Nexus of All Realities]]. Acting on instinct, Howard grabbed the kids, as well as Tana Nile, and dived inside the Man-Thing's vegetative body.\n\nUpon exiting the Nexus, the group found themselves in a strange, alien environment. Although none of them were aware of it at the time, Franklin's mutant powers interacted with the event horizon of the Nexus creating a unique pocket dimension inside of Franklin's mind. As Franklin had yet to come to terms with the death of his parents, his subconscious mind created this reality as a virtual safety zone for himself and his fellow ''Daydreamers''.\n\nThe world they found themselves, Nevernever-Narniozbia, was a colorful landscape populated by people and creatures from various fantasy literary works. Notably though, many of the denizens of this world bore stark resemblances to several heroes and villains from Franklin's home dimension. The King of Nevernever-Narniozbia was cast in the likeness of [[Victor von Doom (Earth-616)|Doctor Doom]], while the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] resembled the Wicked Witch of the East from the Wizard of Oz. Instead of Munchkins, the Daydreamers met dozens of small homunculi that looked remarkably a lot like the [[Benjamin Grimm (Earth-616)|Thing]]. \n\nAs the group surveyed this strange dimension, a black, shadowy figure known only as the ''Dark Hunter'' arrived aboard a sailing sky-ship and began hunting them down. With an air of mystery, the Hunter declared that he \"...was for Franklin Richards only\". The Daydreamers were committed towards keeping Franklin away from the Dark Hunter, and they sought refuge in the care of a bizarre transvestite version of [[Stephen Strange (Earth-616)|Doctor Strange]]. Strange confessed that he was unable to send them back to Earth, but he was capable of sending them to another plane of existence. With a wave of Strange's magic wand, the Daydreamers left Nevernever-Narniozbia and arrived in another alien realm. \n[[File:Daydreamers Vol 1 1.jpg|left|200px]]\nThe land they arrived in possessed all of the trappings of a Dr. Seuss storybook. They attempted to fit in, but their failure to speak perpetually in rhyme earned them a night in prison, courtesy of the Cadence Police. \n\nThe Dark Hunter meanwhile, managed to track them down to Seuss-land where he resumed his pursuit of Franklin Richards. Tana Nile broke her fellow Daydreamers out of prison and they found themselves racing for their lives once again. \n\nWith nowhere else to turn, they decided to take their chances with the Nexus. They dove inside of the Man-Thing's body, which transported them to yet another alternate plane of existence. This world was a simulacrum of Howard the Duck's home planet, [[Duckworld]]. In this reality, Howard was hailed as a great hero of his people and he came from a happy idyllic life, patterned after a 1950s family television sitcom. \n\nOnce again the Dark Hunter tracked them down and they soon began to realize the Hunter's true nature. The Dark Hunter was a figment of Franklin's imagination and represented all of his repressed pain and grief over the loss of his family. The only way that the Daydreamers could ever return to their home dimension was for Franklin to come to terms with his own inner turmoil. After a traumatic emotional breakdown, he finally accepted that his parents were gone, and the walls of the pocket dimension he had created for himself began to dissipate. \n\nThe Daydreamers entered the Nexus of All Realities and arrived back on Earth. The kids returned to the Xavier School while the Man-Thing, Howard the Duck and Tana Nile all went their separate ways.\n\n| Equipment               = [[Franklin Richards (Earth-616)|Franklin's]] blue ball \n| Transportation          = [[Theodore Sallis (Earth-616)|Man-Thing]]'s ability to traverse the multiverse plus Franklin's incredible powers \n| Weapons                 = \n\n| Notes                   = The Daydreamers unofficially first appeared in {{cl|Generation X Vol 1 20}} and officially in {{cl|Daydreamers Vol 1 1}}\n\n| Trivia                  = \n| Recommended             = \n* {{cl|Generation X Vol 1 20}}\n* {{cl|Generation X Vol 1 21}}\n* {{cl|Generation X Vol 1 22}}\n* {{cl|Generation X Vol 1 23}}\n* {{cl|Generation X Vol 1 24}}\n* {{cl|Generation X Vol 1 25}}\n* {{cl|Daydreamers Vol 1 1}}\n* {{cl|Daydreamers Vol 1 2}}\n* {{cl|Daydreamers Vol 1 3}}\n\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "20527"
}