{
    "pageid": 1434890,
    "ns": 0,
    "title": "Deathloks (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Deathloks from 2020 Force Works Vol 1 2 001.jpg\n| ImageSize               = 250px\n| Name                    = Deathloks\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Lingares]]\n\n| Leaders                 = Formerly [[M.O.D.O.K. Superior (Earth-616)|M.O.D.O.K.]], [[James Rhodes (Earth-616)|Jim Rhodes]]\n| CurrentMembers          = \n| FormerMembers           = Countless unnamed Deathloks, [[James Rhodes (Earth-616)|Jim Rhodes]]\n| Allies                  = [[Force Works (Earth-616)|Force Works]]\n| Enemies                 = [[Force Works (Earth-616)|Force Works]], [[M.O.D.O.K. Superior (Earth-616)|M.O.D.O.K.]], [[Ultimo (Earth-616)|Ultimo]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Lingares]]\n| PlaceOfDefunction       = [[Lingares]]\n| Creators                = Matthew Rosenberg; Juanan Ramírez\n| First                   = 2020 Force Works Vol 1 1\n| Last                    = 2020 Force Works Vol 1 3\n\n| HistoryText             = The Deathloks were an army of cyborgs created by [[M.O.D.O.K. Superior (Earth-616)|M.O.D.O.K.]] when he set out to capture [[Ultimo (Earth-616)|Ultimo]] after awakening him from a slumber under the island of [[Lingares]]. After causing Ultimo's reactivation and failing to stop him on his own,{{r|2020 Force Works Vol 1 3}} M.O.D.O.K. approached the locals of Lingares under the pretense of offering them help in stopping the giant robot. The initial batch of Deathloks were made using fallen countrymen.{{r|2020 Force Works Vol 1 2}} Due to the ongoing [[Iron Man 2020 (Event)|robot revolution]], the Deathloks decided to rebel against M.O.D.O.K.'s control and but continued confronting Ultimo, albeit to destroy him and prevent him from falling under M.O.D.O.K.'s control.{{r|2020 Force Works Vol 1 3}} When the Deathloks couldn't stop Ultimo, they turned to abducting living people to turn them into their own.\n{{r|2020 Force Works Vol 1 2}}\n\n[[Force Works (Earth-616)|Force Works]] was deployed in Lingares to investigate a nuclear explosion cuased by M.O.D.O.K. in his attempts to contain Ultimo. Shortly after they reached the island, they were swarmed and overwhelmed by the Deathloks.{{r|2020 Force Works Vol 1 1}} They were defeated and taken prisoners, and while [[James Rhodes (Earth-616)|War Machine]] was taken to be transformed into a Deathlok, the rest of the team managed to break free and help the other prisoners escape. During this scuffle, the Deathloks confronted both Ultimo and Force Works. After M.O.D.O.K. liberated War Machine, he defeated the Deathloks surrounding his teammates.{{r|2020 Force Works Vol 1 3}}\n\nM.O.D.O.K. and Force Works joined forces and engaged Ultimo, resulting in his defeat. However, M.O.D.O.K. usurped Ultimo's decapitated body and rechristened himself UltiM.O.D.O.K., forcing Force Works to retreat to a bunker. The Deathloks breached the bunker, but, after examining M.O.D.O.K.'s files on them, War Machine connected himself to the command processor of one of the Deathloks that reigned over the rest, and commanded them against UltiM.O.D.O.K., forcing him into a magma-filled fissure created by [[Daisy Johnson (Earth-616)|Quake]]. As a result, all of the Deathloks also fell into the fissure and were destroyed. Even Rhodes attempted to jump into the fissure due to being affected by the command processor's programming, but he was stopped by his teammates and returned to normal afterwards.{{r|2020 Force Works Vol 1 3}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Deathloks]]"
                }
            }
        }
    ],
    "page_id": "1434890"
}