{
    "pageid": 499568,
    "ns": 0,
    "title": "Death Riders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Death Riders (Earth-616) from Captain America Comics Vol 1 39 0001.jpg\n| Name                    = Death Riders\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = [[Imperial Japan (Earth-616)|Imperial Japan]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = Terrorist group organized by Imperial Japan during World War II\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mike Sekowsky\n| First                   = Captain America Comics Vol 1 39\n| Last                    = Captain America Comics Vol 1 39\n\n| HistoryText             = The Death Riders were a group of [[Imperial Japan (Earth-616)|Imperial Japanese]] saboteurs who were active during [[World War II]]. They wore hooded costumes to conceal their nationality and rode on motorcycles as their primary mode of transport. In the summer of 1944, they were charged with destroying Crawford Munitions Factory, which was busy building special bombers to be used in bombing attacks on Tokyo for the war effort. They had attacked on the very night that US military official Lieutenant Hale was marrying Mary Crawford, daughter of Harry Crawford, owner of the plant. The attack on the building where the wedding was taking place was spotted by Private [[Steven Rogers (Earth-616)|Steve Rogers]] and [[James Buchanan Barnes (Earth-616)|James Barnes]] who went into action as Captain America and Bucky and forced the Death Riders to retreat. Cap and Bucky managed to knock one of the Riders off his bike and unmask him.\n\nChasing after the other Riders on a motorcycle, Captain America and Bucky lost the group, but knowing their intended target went back to town to help with stopping the fire started by the gang. The Death Riders then returned shortly thereafter and kidnapped Harry and his daughter while managing to elude capture a second time. Bringing the Crawfords to the Death Rider's secret hideout, their leader demanded to know when the guards changed at the plant. Even through fear of torture, both Crawfords refused to reveal the time the guards changed.\n\nDeciding to attack the plant anyway, the Death Riders were accosted by Captain America and Bucky who led Lt. Hale and the workers to defend the plant. Taking three of the gang's robes and motorcycles, Captain America, Bucky, and Lt. Hale posed as members of the Death Riders and tricked some of their members into bringing them back to their secret hideout under the pretense that the base was destroyed. There, Cap, Bucky and Hale revealed their true identities and quickly rounded up the rest of the gang and saved Harry and Mary.{{r|Captain America Comics Vol 1 39}}\n\nThe Death Riders were summarily disbanded and the fate of its individual members is unrecorded. \n\n| Equipment               = \n| Transportation          = Each member of the Death Riders rode their own motorcycle.\n| Weapons                 = The Death Rider's primary weapons were torches which they threw at their targets. Their leader used a whip to torture their prisoners.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "499568"
}