{
    "pageid": 624492,
    "ns": 0,
    "title": "Defenders (Valkyrior) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "\n{{Marvel Database:Team Template\n| Image                   = Defenders (Earth-616) from Fearless Defenders Vol 1 12 001.jpg\n| ImageSize               = 400 px\n| Name                    = Defenders \n| Aliases                 = [[Valkyrior]]\n| EditorialNames          = [[Fearless Defenders Vol 1|Fearless Defenders]]\n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Misty Knight's Safehouse, [[New York City]]; formerly [[Asgardia]] \n\n| Leaders                 = [[Mercedes Knight (Earth-616)|Misty Knight]]; former [[Brunnhilde (Earth-616)|Valkyrie]]\n| CurrentMembers          = [[Elsa Bloodstone (Earth-616)|Elsa Bloodstone]], [[Clea (Earth-616)|Clea]], [[Mercedes Knight (Earth-616)|Misty Knight]], [[Frankie Raye (Earth-616)|Nova]], [[Ren Kimura (Earth-616)|Ren]], [[Annabelle Riggs (Earth-616)|Annabelle Riggs]], [[Hippolyta (Earth-616)|Warrior Woman]]\n| FormerMembers           = [[Danielle Moonstar (Earth-616)|Dani Moonstar]], [[Brunnhilde (Earth-616)|Valkyrie]]\n| Allies                  = \n| Enemies                 = [[Doom Maidens (Earth-616)|Doom Maidens]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Asgardia]]\n| Creators                = Cullen Bunn; William Sliney\n| First                   = Fearless Defenders Vol 1 3\n| Last                    = \n\n| Quotation               = If there's one thing I've learned, it's--'''--the Defenders always turn up!'''\n| Speaker                 = [[Thursday Rubinstein (Earth-616)|Ruby Thursday]]\n| QuoteSource             = Fearless Defenders Vol 1 9\n\n| HistoryText             = One night, [[Mercedes Knight (Earth-616)|Misty Knight]] stopped some mercenaries from smuggling ancient [[Asgardian]] artifacts, though they manage to get away with their primary target. Misty took the recovered artifacts to [[Annabelle Riggs (Earth-616)|Dr. Annabelle Riggs]], who was excavating a viking burial site and inadvertently awakened the dead vikings with one the artifacts. Misty battled the vikings and was soon joined by [[Brunnhilde (Earth-616)|Valkyrie]], who sensed the commotion. When the fight was over, Valkyrie agreed to take Annabelle and Misty to [[Asgardia]] to seek council on the matter.{{r|Fearless Defenders Vol 1 1}}\n\nThe mercenaries kidnapped [[Danielle Moonstar (Earth-616)|Dani Moonstar]] and brought her to [[Caroline Le Fay (Earth-616)|Caroline Le Fay]], who wanted to become a [[Valkyrie]] like Dani. In Asgardia, the [[Freyja Freyrdottir (Earth-616)|All-Mother]] explained to [[Brunnhilde (Earth-616)|Valkyrie]], Misty, and Annabelle that the dead Vikings signalled the return of the [[Doom Maidens]]: corrupted Valkyries, who come to fill the void left by Valkyrie's inability to assemble a new [[Valkyrior]]. [[Hela (Earth-616)|Hela]], aware of the Doom Maidens' return, brought [[Hippolyta (Earth-616)|Hippolyta]] from the Underworld to help set things right.{{r|Fearless Defenders Vol 1 2}}\n\nThe All-Mother teleported Valkyrie, Misty, Annabelle, and Hippolyta to Harrowpoint Island, Washington, where Caroline le Fey had taken Dani Moonstar to use her in a ritual to summon the Doom Maidens. Once inside le Fey's chamber, the heroes discovered that the Doom Maidens had already arrived. During the subsequent battle, Annabelle managed to free Dani before the Doom Maidens halted their fighting, recognizing Valkyrie as their \"sister\".{{r|Fearless Defenders Vol 1 3}}\n\nThe heroes retreated to Misty's safe house in [[New York City]] as the Doommaidens gave chase. There, Valkyrie had a vision from long ago of herself leading an attack on [[Odin Borson (Earth-616)|Odin]]. Valkyrie decided to take Dani and Hippolyta and lead the Doommaidens away from the city, while Misty and Annabelle called [[Heroes for Hire (Knight & Wing) (Earth-616)|Heroes for Hire]] for help.{{r|Fearless Defenders Vol 1 4}}\n\n===Age of Ultron===\n[[James Howlett (Earth-61112)|Wolverine (Logan)]] and [[Susan Storm (Earth-61112)|Invisible Woman (Sue Storm)]] tried to assassinate [[Ultron (Earth-616)|Ultron]]'s creator, [[Henry Pym (Earth-616)|Henry Pym]] to prevent Ultron from taking over the world. In the divergent timeline created by Pym's death, Morgan le Fay and her husband Dr. Doom conquered half the planet. Le Fey and Doom's daughter, Caroline, recruited Hippolyta to seek revenge for abandoning her as a child. In [[Latveria]], Caroline and Hippolyta discovered that Doom had died and was replaced by Ares, Hippolyta's father. Hippolyta defeated Ares and took back command of the [[Amazons]], who were subdued by him.{{r|Fearless Defenders Vol 1 4AU}}\n\n===Post-Age of Ultron===\nIn Descanso de Deus, Brazil, Valkyrie, Hippolyta, and Moonstar ascended to a mountaintop mesa littered with stone carvings that mark an arena. They soon confronted Caroline Le Fay, Mr. Raven, and the Doom Maidens astride their demonic dragons, which douse the three with hellfire before Hippolyta heaves a stone carving at one of the dragons, knocking it out of the sky. The Doom Maidens dismount and attack, and Valkyrie, Hippolyta, and Moonstar fended them off before realizing that they were outnumbered. Moments later, Misty and Annabelle arrived on the scene with a battalion of superheroes, including Hellcat, Tigra, Black Cat, Spider-Woman, She-Hulk, Elektra, Storm, Thundra, Tarantula, Black Widow, Captain Marvel, and Colleen Wing.\nThe heroes launched themselves into the fight and managed to subdue the Doom Maidens, even as Thundra questioned Annabelle's continued presence. In the midst of the fighting, Moonstar spotted Caroline and confronted her, fighting and subduing Mr. Raven before Caroline explained that Moonstar is \"the battery\" that powers the ritual to awaken the Doom Maidens. She then explained that Valkyrie brought Moonstar to Brazil in order to power the Valkyrie's transformation into the maiden of rage. Valkyrie then transformed and destroyed [[Hermotha]], leaving She-Hulk to prepare to battle the newly awakened Maiden of Rage. \n\n| Equipment               = Various equipment.\n| Transportation          = \n| Weapons                 = Various weaponry.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Asgardian Organizations]]"
                }
            }
        }
    ],
    "page_id": "624492"
}