{
    "pageid": 1481196,
    "ns": 0,
    "title": "Department of Extranormal Motor Vehicles (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Department of Extranormal Motor Vehicles (Earth-616) from Fantastic Four Vol 6 11 001.jpg\n| Name                    = Department of Extranormal Motor Vehicles\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Manhattan]], [[New York City]], [[New York (State)|New York]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Dan Slott; Kevin Libranda\n| First                   = Fantastic Four Vol 6 11\n| History                 = The DEMV was the Department of Extranormal Motor Vehicles. After it came to the agency's attention that [[Franklin Richards (Earth-616)|Franklin]] and [[Valeria Richards (Earth-616)|Valeria Richards]] of the [[Fantastic Four (Earth-616)|Fantastic Four]] were not permitted to drive any of the team's vehicles, agents [[Harriet Underhill (Earth-616)|Harriet Underhill]] and [[Tobias Cobb (Earth-616)|Tobias Cobb]] paid the Richards family a visit to notify them of that, and returned two days later to administer them a full driver's exam.\n\nUnderhill administered Valeria's exam, and Cobb did Franklin's. Valeria performed flawlessy, whereas Franklin did not. During the exam, the emergency autopilot of each sibling's Fantasticar kicked in and they passed through a dimensional rift into the [[Microverse]], where the Fantastic Four confronted the would-be invader [[Gargantua (Microverse) (Earth-616)|Gargantua]]. During the confrontation, Valeria tinkered with the Fantasticar's systems to create a way to seal Gargantua's dimensional rifts, preventing the Microverse from destroying the regular universe. On the other hand, Franklin stepped out of the vehicle, leaving Cobb behind with the Fantasticars' shields on, and convinced Gargantua to desist her efforts of conquest. Since this incident took place during the exam, Underhill failed Valeria for doing everything she did while piloting the Fantasticar, while Cobb passed Franklin since he had pulled over at the first sign of trouble and ensured his passenger's safety.{{r|Fantastic Four Vol 6 11}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1481196"
}