{
    "pageid": 15651,
    "ns": 0,
    "title": "Desert Sword (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Desert Sword (Earth-616) from All-New Official Handbook of the Marvel Universe A to Z Vol 1 3 001.JPG\n| Name                    = Desert Sword\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n\n| BaseOfOperations        = [[Iraq]]\n\n| Leaders                 = \n| CurrentMembers          = [[Razer (Earth-616)|Black Raazer]], [[Sirocco (Earth-616)|Sirocco]]\n| FormerMembers           = [[Aminedi (Earth-616)|Aminedi]], [[Abdul Qamar (Earth-616)|Arabian Knight]], [[Veil (Desert Sword) (Earth-616)|Veil]]\n| Allies                  = \n| Enemies                 = [[Freedom Force (Earth-616)|Freedom Force]]\n\n| Origin                  = Created by the government of Iraq to serve as its superhuman team\n| PlaceOfFormation        = [[Iraq]]\n| PlaceOfDissolution      = \n| Creators                = Fabian Nicieza; Kirk Jarvinen\n| First                   = New Mutants Annual Vol 1 7\n| Last                    = \n\n| HistoryText             = Freedom Force begins a commando assignment into Iraq, to obtain the German scientist Reinhold Kurtzmann and bring him to the Allied forces. The team stops an Iraqi tank patrol and begins taking out the guards, killing everyone. They find the location they were heading for to obtain the doctor, but find it empty. Too late, they realize that they are trapped, and Crimson Commando is injured and Super Sabre is beheaded. As Blob and Pyro cry out for the villains to show themselves, a group appears out of thin air, announcing itself to be the Desert Sword.\n\nThe two teams engage in a running battle through the city, with Freedom Force losing ground. Dr. Kurtzmann is killed.\n\nOutnumbered and outclassed, Pyro and Blob are surrounded by Desert Sword while on the other side of Kuwait City, Avalanche and Crimson Commando are dying at the feet of Sirocco and Aminedi. Pyro and Blob fight as hard as they can, succeeding in burning Veil to death. Avalanche and Crimson Commando narrowly escape with their lives, with Avalanche bringing the armless Commando to the lift point. Blob and Pyro almost succeed in defeating Desert Sword, but as they call for an evacuation, they find that the American force, led by Avalanche, has recognized the hopelessness of the situation. The Americans abandon Blob and Pyro in the heart of enemy territory, telling them to contact an American unit through the Kuwaiti resistance. Blob and Pyro are surrounded by the remaining members of Desert Sword. Several Iraqi helicopters close in on them. With few options left, they surrendered.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * http://www.marvel.com/universe/Desert_Sword\n* http://en.wikipedia.org/wiki/Desert_Sword\n}}"
                }
            }
        }
    ],
    "page_id": "15651"
}