{
    "pageid": 395657,
    "ns": 0,
    "title": "Deterrence Research Corporation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Deterrence Research Corporation (Earth-616) from Giant-Size Spider-Man Vol 1 4 0001.jpg\n| Name                    = [[Deterrence Research Corporation]]\n| Aliases                 = DRC\n\n| Leaders                 = [[Moses Magnum (Earth-616)|Moses Magnum]], Ivor Carlson\n| CurrentMembers          = Ross Holden, Mr. Kraye, Eric Salter\n| FormerMembers           = Moses Magnum, Eric Lazar\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = Deterrence Research Corporation Tower (formerly Magnum Building), various other bases around the world\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Gerry Conway; Ross Andru\n| First                   = Giant-Size Spider-Man Vol 1 4\n\n\n| History                 = The Deterrence Research Corporation (DRC) was formed by [[Moses Magnum (Earth-616)|Moses Magnum]]. He was able to make it into the world's largest independent weapons manufacturer. When the DRC was hired to develop a toxic biochemical gas they tested it on kidnapped victims. The [[Frank Castle (Earth-616)|Punisher]] and [[Spider-Man (Peter Parker)|Spider-Man]] learned of this and managed to shut down the operation, but Magnum escaped.{{r|Giant-Size Spider-Man #4}}\n\nAmong the victims of the gas were the son and grandson of [[Amanda Sheridan (Earth-616)|Amanda Sheridan]], head of Sheridan Industries. She hired various agents to kill Moses Magnum, but all failed. Eventually she hired [[Luke Cage (Earth-616)|Luke Cage]] to protect [[Samantha Sheridan (Earth-616)|her granddaughter Samantha]] who was in Japan at the same time as Moses Magnum. Magnum was on Katsyu Shima island running a mining operation in order to tap the Earth's core for potential energy. To help him with this he tried to kidnap Samantha Sheridan who was a geophysicist. Cage managed to stop him and in the ensuing struggle Moses fell through a fissure in the Earth to his apparent death.\n\nAfter Magnum's \"death\" the DRC was able to avoid prosecution for his crimes and became even more powerful. Through stolen [[S.H.I.E.L.D. (Earth-616)|SHIELD]] files the new president Ivor Carlson was able to learn about [[Drydock]], the headquarters of the [[Guardians of the Galaxy (Earth-691)|Guardians of the Galaxy]]. With the help of renegade [[National Aeronautics and Space Administration (Earth-616)|NASA]] scientist Eric Salter he planned to send a rocket to Drydock and rob it of its futuristic weapons and technology. The Guardians learned of this and tried to steal the stolen files, but the DRC had hired [[Leroy Jackson (Earth-616)|Hammer]] and [[John Anvil (Earth-616)|Anvil]] (whose synthecon chain they were somehow able to fix) as security. With the help of Spider-Man the Guardians were able to destroy the files and break Hammer and Anvil's chain.\n\nAmanda Sheridan was satisfied with the apparent death of Moses Magnum, but DRC decided to punish her for her actions against Magnum with a corporate takeover of Sheridan Industries. Amanda was able to stop them and so they sent Hammer and Anvil with a once again fixed chain to eliminate her. She was saved by the arrival of [[Jessica Drew (Earth-616)|Spider-Woman]] who defeated Hammer and Anvil. The DRC tried one last tact to stop her by ordering her employee Eric Lazar, who was actually a DRC employee, to kill her, but he was stopped by Spider-Woman.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Companies]]\n[[Category:Laboratories]]"
                }
            }
        }
    ],
    "page_id": "395657"
}