{
    "pageid": 694803,
    "ns": 0,
    "title": "Dog Company (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Dog Company (Earth-616) from Combat Casey Vol 1 30 001.jpg\n| Name                    = Dog Company\n| Aliases                 = Doggies\n\n| Leaders                 = Formerly [[Captain Rocke (Earth-616)|Captain Rocke]] \n| CurrentMembers          = \n| FormerMembers           = [[Henry Casey (Earth-616)|Combat Casey]], [[Penny Pennington (Earth-616)|Penny Pennington]], Buggsie, Georgie, Roanhorse\n\n| Identity                = Public\n| Affiliation             = {{m|United States Army (Earth-616)|U.S. Army}}\n| Allies                  = [[United States Army (Earth-616)|U.S. Army]]\n| Enemies                 = [[People's Liberation Army (Earth-616)|People's Liberation Army]], North Korean Army, [[National Socialist German Workers Party (Earth-616)|Nazis]] and [[Imperial Japan (Earth-616)|Imperial Japan]]\n\n| Origin                  = \n| Status                  = Defunct\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile through [[Europe]] and [[Africa]] during the 1940s, [[Korea]] during the 50s.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Bob Powell\n| First                   = Combat Casey #29\n| Last                    = \n\n| HistoryText             = Dog Company was an infantry unit within the [[United States Army (Earth-616)|United States Army]] that participated in campaigns in Europe and Africa during [[World War II]] and fought heavily in Korea during the [[Korean War]]. The unit was under the command of [[Captain Rocke (Earth-616)|Captain Rocke]]. Its two most well known members were [[Henry Casey (Earth-616)|Henry \"Combat\" Casey]] and [[Penny Pennington (Earth-616)|Penny P. Pennington]]. Other members of the unit include tank enthusiast Buggsy,{{r|Combat Casey #29}} Georgie who still believed in [[Santa Claus (Earth-616)|Santa Claus]],{{r|Combat Casey #31}} and Apache American Roanhorse.{{r|Combat Casey #33}}\n\nThe earliest recorded mission of Dog Company occurred in North Africa sometime in 1943 they clashed with [[National Socialist German Workers Party (Earth-616)|Nazi]] forces.{{r|Combat Casey #33}} Most of Dog Company's missions during the war took place in the South Pacific where the unit liberated Futsu Island{{r|Combat Casey #30}} and later rescued Captain Rocke from enemy soldiers on an unspecified atoll.{{r|Combat Casey #31}} Dog Company also helped liberate Yoku atoll.{{r|Combat Casey #32}}\n\nDog Company was reformed by Captain Rocke during the Korean War, including Combat and Penny among his troops once again. Their first recorded mission was when Combat, Penny, and a tank enthusiast named Buggsie used an enemy tank to attack enemy forces.{{r|Combat Casey #29}} The unit then sabotaged enemy shells in order to get past artillery guns, then defended a Korean town from being burned down by communist forces.{{r|Combat Casey #30}} In another clash they detonated a bridge to keep enemy forces from following, later destroying a dam the enemy built on a river to try and get away.{{r|Combat Casey #31}} Later they used weather balloons as a means of crossing over land mines to capture an enemy force they were after.{{r|Combat Casey #32}} They then came to the aid of another town that were being robbed by communist troops. Using sheep skins to disguise themselves, Combat, Penny and Dog Company capture the enemy forces in the act. Later thanks to training from Apache American solider Roanhorse, Combat and Penny were able to use smoke signals to warn Dog Company of an enemy attack.{{r|Combat Casey #33}} Combat later prevented Dog Company from being lured into a trap in the town of Kumchow set by communist forces. During an influential battle along the border between the North and South Korea, Combat and Penny discovered Major Mung's plans to build a giant dragon effigy to scare South Korean soldiers, and helped the South Koreans in constructing an even larger dragon against the one constructed by their communist foes.{{r|Combat Casey #34}} Later the pair were able to capture important plans from the North Korean army, using a K-9 dog to get the plans to Dog Company.{{r|Battle #61}}\n\n| Equipment               = Standard issue equipment\n| Transportation          = Standard issue transportation\n| Weapons                 = Standard issue weapons\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "694803"
}