{
    "pageid": 289630,
    "ns": 0,
    "title": "Dorma Clones (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = Dorma Clones\n| Image                   = Dorma Clones (Earth-616) from Namor the Sub-Mariner Vol 1 19 001.png\n| Name                    = \n| EditorialNames          = \n| Aliases                 = Dorma\n\n| Status                  = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Atlantis (Modern)|Atlantis]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = \n\n| Origin                  = Clones of Lady Dorma\n| PlaceOfFormation        = Vyrra's laboratory\n| PlaceOfDefunction       = Vyrra's laboratory\n| Creators                = John Byrne\n| First                   = Namor the Sub-Mariner Vol 1 13\n| Last                    = Namor the Sub-Mariner Vol 1 54\n\n| HistoryText             = \nAs time went on, [[Vyrra (Earth-616)|Vyrra]] tried to keep himself alive through science, but he could only hold off death for so long and wished to return home and be buried in Atlantis. Vyrra formed a plan by which he would exhume [[Dorma (Earth-616)|Lady Dorma]]'s corpse from her grave and clone her, at which Namor would be so happy to see her he would forgive Vyrra's past mistakes. The clone was perfect and was aged to the appropriate age, but the downside was she had the mind of a newborn. This process was repeated eight times, which left him with a group of mindless clones.{{r|Namor the Sub-Mariner Vol 1 19}} This was when some Atlantean scouts discovered one of the clones, and recognized her as their king’s deceased wife.{{r|Namor the Sub-Mariner Vol 1 13}}\n\nThey then reported back to [[Namor McKenzie (Earth-616)|Namor]] concerning their unusual discovery. Namor and [[Namorita Prentiss (Earth-616)|Namorita]] traveled to Lady Dorma's grave, only to find it empty. They followed the trail which led them to Vyrra's secret lab. Namor confronted the scientist and forced him to reveal his true intentions and why he created them. Vyrra then accidentally revealed the true origin of Namorita, that she was a clone. Namorita swam from the cave, distraught about her origin, so Namor followed and tried to console his young cousin.{{r|Namor the Sub-Mariner Vol 1 19}}\n\nWhen Namor left, Vyrra realized that he would soon return and destroy his lab. Vyrra used one of machines to transfer his mind into one of the Dorma clones. Killing his old body in the process, Vyrra fled in the new body and hid from sight. Vyrra left a note requesting that his body be buried in Atlantis, which Namor refused out of anger at his actions. This left Vyrra angry at his refusal, and he placed his old body in stasis. All the clones were killed.{{r|Namor the Sub-Mariner Vol 1 21}}{{r|Namor the Sub-Mariner Vol 1 54}}\n\nVyrra, in his new body, swam from the cave but came across the Lemurian known as [[Llyra Morris (Earth-616)|Llyra]]. He then led her back to his cave, where Llyra was in shock, as she was the one that killed the Lady Dorma. In the cave, Vyrra revealed his true identity and Llyra told the scientist that she was pregnant and needed his help. Llyra's plan was to accelerate the growth of the child to adulthood.{{r|Namor the Sub-Mariner Vol 1 52|53}}\n\nVyrra then copied Llyra's mind and placed it in the child. Llyra then told Vyrra that she would carry out his request of having his body buried in Atlantis. Vyrra had also secretly transferred his mind into the body as well. The child aged to sixteen years in the matter of minutes, and when the process was done, Llyra snapped the scientist's neck. [[Llyron McKenzie (Earth-616)|Llyron]], now possessing the minds of both of them, followed Vyrra's last request and buried his body in Atlantis with a suitable monument commemorating his life.{{r|Namor the Sub-Mariner Vol 1 54}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Clones of Dorma]]"
                }
            }
        }
    ],
    "page_id": "289630"
}