{
    "pageid": 12776,
    "ns": 0,
    "title": "Dragon Lords of Kakarantharnia (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Dragon_Lords_from_Iron_Man_Vol_1_274.png\n| Name                    = Dragon Lords of Kakarantharnia\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Chen Hsu (Earth-616)|Chen Hsu]]\n| CurrentMembers          = \n| FormerMembers           = [[Fin Fang Foom (Earth-616)|Fin Fang Foom]], [[Chi Chan (Earth-616)|Chi Chan]], [[Axonn-Karr (Earth-616)|Axonn-Karr]], [[Wu Pong (Earth-616)|Wu Pong]]\n| Allies                  = \n| Enemies                 = [[Mandarin (Earth-616)|Mandarin]], [[Anthony Stark (Earth-616)|Iron Man]], [[James Rhodes (Earth-616)|War Machine]]\n\n| Origin                  = [[Makluans]]\n| PlaceOfFormation        = [[Kakaranthara]]\n| PlaceOfDissolution      = \n| Creators                = John Byrne; Paul Ryan; \n| First                   = Iron Man Vol 1 272\n| Last                    = \n\n| HistoryText             = The Dragon Lords of Kakarantharnia were a group of [[Makluans]] who had become bored of the tranquility of their peaceful world. Taking a massive starship, they headed to the stars. In search of exciting worlds, ones of war, violence, and destruction.\nHearing about Earth, they headed to the most violent world in the Milky Way. On their way, cosmic radiation penetrated their shields and damaged their star drive. The [[Makluan Starship|ship]]ship crashed into Earth, in ancient China. Where it wiped out a town and burrowed deep into the Earth. Prior to crashing, the [[Chen Hsu (Earth-616)|captain]] and 9 of his crew divested themselves of the [[Mandarin's Rings|rings]] which focused the energies into the ship's control functions. Which were set upon the central control dias. So that if necessary, a single survivor could harness the power to control the ship. Upon emerging from the Earth where the starship borrowed, one of them was slain by a Chinese mounted warrior. The remaining fifteen fled from the valley (valley of dragons) using the morning mists as cover.{{r|Iron Man Vol 1 272}}{{r|Iron Man Vol 1 274}}\n\nIt took them a long time to learn how to take human form and it endure it. Five more of the crew died, before they took human forms. Though they wore that form grudgingly at first, they came to appreciate the human arts of bloodshed and destruction. In time they likewise came to learn the power in manipulating human wealth.{{r|Iron Man Vol 1 274}} 3,000 years later, Chen Hsu their captain taught the [[Mandarin (Earth-616)|Mandarin]], teaching him how to use the rings, and helped him conquer a third of China.{{r|Iron Man Vol 1 260|269}}{{r|Iron Man Vol 1 274}} He then sent a telepathic call to the rest of the crew, who were scattered across Asia. They answered his call, reverting to their dragon forms and taking flight. Some of them had not seen each other in centuries. Joyous shots filled their minds, great was the jubilation as they headed back the Valley of the Dragons.{{r|Iron Man Vol 1 273}} Upon their arrival in the Valley of the Dragons, they roared as once and the mountains trembled.{{r|Iron Man Vol 1 274}}\n\nThey reverted to human form, when meeting the Mandarin and Iron Man (who was actually [[James Rhodes (Earth-616)|James Rhodes]]. As the rings no longer fit their dragon fingers, since they continued to grow and therefore doubled and then tripled their size, they had to take human form. The Dragon Lords wanted to bring about their rule over Earth, and demanded that the Mandarin turn over his rings to them. In exchange for his service, they offered him wonders and infinite pleasures. The Mandarin defied him, and resisted their attempt to force the rings of his hands. He attacked the Dragon Lords and upon [[Anthony Stark (Earth-616)|Iron Man]]'s arrival, it was the latter who fought the dragons. James Rhodes in his Iron Armor suit attempted to help and was blown far away. The battle between the Dragon Lords and Iron Man seesawed back and forth, and then the Mandarin who had stepped away from the battle, returned to the fight in earnest. When Iron Man pushed his suit's power into the rings, a great nuclear explosion was the result and the Dragon Lords appeared to have been vaporized.{{r|Iron Man Vol 1 274|275}}\n\n| Equipment               = [[Mandarin's Rings|Makluan rings]]\n| Transportation          = [[Makluan Starship]]\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "12776"
}