{
    "pageid": 845713,
    "ns": 0,
    "title": "Dragon Riders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Dragon_Masters_(Earth-616)_from_Fantastic_Four_Annual_Vol_1_16.jpg\n| Name                    = Dragon Riders\n| Aliases                 = \n\n| Status                  = Active\n| Alignment               = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Rammatpolen]]\n\n| Leaders                 = [[Ral Dorn (Earth-616)|Ral Dorn]]\n| CurrentMembers          = \n| FormerMembers           = [[Skagerackrakor (Earth-616)|Skagerackrakor]], [[Draconus (Earth-616)|Dragon Man]]\n| Allies                  = [[Fantastic Four (Earth-616)|Fantastic Four]]\n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Fantastic Four Annual #16\n| Last                    = \n\n| HistoryText             = The Dragon Riders originate from the extra-dimensional world of [[Rammatpolen]]. The Dragon Riders use dragons as mounts in their journeys through time and space. \n\nWhen youthful [[Ral Dorn (Earth-616)|Ral Dorn]] was accused of murdering the current generation of dragons, the Dragon Riders were ordered by the Dragon Lord [[Skagerackrakor (Earth-616)|Skagerackrakor]] to follow after Dorn after he fled to Earth and bring him to justice. After a number of failed attempts to kill Ral, their conflict attracted the attention of the [[Fantastic Four (Earth-616)|Fantastic Four]]. The FF agreed to help Ral locate and partner with the android [[Draconus (Earth-616)|Dragon Man]]. This led to another conflict that ended with Ral escaping with Dragon Man and the [[Susan Storm (Earth-616)|Invisible Girl]]. \n\nAgreeing to work with the Fantastic Four to prove Ral's innocence, the Dragon Riders helped return Ral, Dragon Man and Sue to Rammatpolen to face the charges against him. There he faced Skagerackrakor in trail by combat. Skagerackrakor tried to cheat by using a secret grenade, but ended up blowing up his own Dragonstaff. Ral won the fight and Skagerackrakor confessed to poisoning the dragons. He also confessed that he had unleashed all of Rammatpolen's dragons on Earth in order to destroy it. Ral Dorn, the Fantastic Four, and all the Dragon Riders succeeded in rounding up the dragons and bringing them back to Rammatpolen. Dorn was made the new Dragon Lord. {{r|Fantastic Four Annual #16}}\n\n| Equipment               = \n| Transportation          = Each Dragon Rider rides a dragon which is mentally linked.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "845713"
}