{
    "pageid": 457100,
    "ns": 0,
    "title": "Druids of Rockhenge (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Druids of Rockhenge (Earth-616) from Sub-Mariner Comics Vol 1 3 001.jpg\n| Name                    = Druids of Rockhenge\n| Aliases                 = Druids of Black Moors, [[Druids]]\n| Status                  = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Rockhenge,  [[Ireland]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Cestis\n| Allies                  = [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n| Enemies                 = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Gabriele; Alex Schomburg\n| First                   = Sub-Mariner Comics #3\n| Last                    = Sub-Mariner Comics #3\n\n| HistoryText             = [[File:Cestis (Earth-616) from Sub-Mariner Comics Vol 1 3 001.jpg|thumb|left|182px|Cestis]]\nThe Druids of Black Moors were a sect of Druids that resided in [[Ireland]] thousands of years ago. A peace loving civilization, they lived and practiced their religion around a formation known as Rockhenge, which was similar to that of Stonehenge in England. When one of their elders foretold of a great flooding that was coming, they constructed crude diving equipment and developed an undersea dwelling where they would live out the centuries in peace.\n\nIn 1941, they were discovered by a group of [[National Socialist German Workers Party (Earth-616)|Nazis]] who convinced the Druids -- particularly the headstrong Cestis -- that the British were warmongers that sought to enslave the entire world. Tricked into believing the Nazis were peace-loving, the Druids invited them to hide their aircraft in their hidden domain shortly after France was liberated from Nazi control. This allowed Nazi forces to continue to launch blitzkriegs against Britain, disappearing in a veil of pea-soup fog whenever British forces attempted to capture them.\n\nThe mysterious disappearances of the Nazi fighters led the British authorities to summon the aid of the [[Namor McKenzie (Earth-616)|Sub-Mariner]] to investigate. Namor located the hidden location of the Druids home and was almost slain by them before being stopped by Nazi agents who wished to torture their enemy first. Namor broke free and convinced the Druids that the Nazis were the true enemy. Fed up of the Nazis using up their food supplies, the Druids were convinced of the Nazis' duplicity and agreed to help Namor revolt against them. Cestis was slain in the conflict.\n\nAfter Namor prevented another invasion of Britain, he returned to the Druid's undersea home with weapons for the Druids to fight back against their former allies. With the Nazi forces wiped out with Namor's aid, the Druids moved their home four miles west of its original location in the hopes that they would return to living their lives in peace; however, they would offer their aid to Namor in the future should he ever need it.{{r|Sub-Mariner Comics #3}}\n\nIf Namor has ever sought out the Druids remains to be seen, their present activities or if they still exist remains unrevealed.\n\n| Equipment               = The Druids have fashioned crude diving equipment that would allow them to breath underwater for an extended, but undisclosed period of time. They have also constructed a series of underwater dwellings, both domed and made of rock. They have also developed an adequate undersea farming system as well.\n| Transportation          = Their homes were mobile, allowing them to move them to any location underwater that they saw fit.\n| Weapons                 = Although pacifists by nature, the Druids of Black Moors had access to weapons such as swords, daggers, and maces.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Druidism]]\n[[Category:Druids]]\n[[Category:Irish Organizations]]"
                }
            }
        }
    ],
    "page_id": "457100"
}