{
    "pageid": 556206,
    "ns": 0,
    "title": "Dwarf Men of Devil-Tree Plateau (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Dwarf Men of Devil-Tree Plateau (Earth-616) from Tex Taylor Vol 1 8 0001.jpg\n| Name                    = Dwarf Men of Devil-Tree Plateau\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Devil-Tree Plateau, [[Nevada (State)|Nevada]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Tex Taylor (Earth-616)|Tex Taylor]], [[Alkali Ike (Earth-616)|Alkali Ike]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Tex Taylor #8\n| Last                    = Tex Taylor #8\n\n| HistoryText             = The Dwarf Men of Devil-Tree Rock are an ancient civilization that has existed on Devil-Tree Rock, Navada for centuries, seemingly undisturbed by modern man. They appear to be an offshoot of Mayan tribes, who apparently due to their living conditions have come to be dwarfish in size, and also bred a breed of horses befitting their size. They worshipped an unnamed goddess who was depicted to have normal human size with blond hair. In every succeeding generation, there was a member of their tribe who grew to the normal size of a human being and they were revered as the tribe's leader.\n\nDuring the days of the American Frontier, Devil-Tree Plateau was investigated by Professor Carl Sturgis and his daughter Jessica who had received evidence of a previously undiscovered breed of dwarf horses. They climbed the plateau and were captured by the dwarf men. Jessica suffered a blow to the head and was rendered amnesic. She was viewed as their legendary goddess and was posed to be married to their leader.\n\nTwo months later, Jessica's fiancée Quentin came searching for her and hired [[Tex Taylor (Earth-616)|Tex Taylor]] and [[Alkali Ike (Earth-616)|Alkali Ike]] to help find her and her father. They travelled up Devil-Tree Plateau, and the inhabitances at the top tried to keep them at bay by causing rock slides. When this failed, they captured Tex and the others and threw them in a dungeon. The dwarves considered Tex's horse [[Fury (Horse) (Earth-616)|Fury]] to be a gift from the gods and offered it to Jessica and their leader during the wedding ceremony. This ceremony also asked for a sacrifice and so Tex was brought up to be killed on an altar. However, Fury bit through Tex's bonds and he managed to knock Jessica out, restoring her memory. After fighting off the dwarves leader, he and the others escape and fled back to the ground, avoiding another rock slide, which sealed off the pass to the top of the plateau. Tex and the others vowed never to speak of the encounter because how unbelievable it was.{{r|Tex Taylor #8}}\n\nThe fate of the dwarf men is unknown.\n\n| Equipment               = \n| Transportation          = The dwarf men rode a breed of horse which also had stunted growth.\n| Weapons                 = The dwarf men carried primitive weapons such as spears and axes carved out of stone.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Western Teams]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "556206"
}