{
    "pageid": 2932,
    "ns": 0,
    "title": "Earth Force (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Earth Force (Earth-616) from Thor Vol 1 395 cover.jpg\n| Name                    = Earth Force\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]]\n\n| Leaders                 = \n| CurrentMembers          = [[Winston Manchester (Earth-616)|Skyhawk]], [[Kyle Brock (Earth-616)|Earth Lord]], [[Pamela Shaw (Earth-616)|Wind Warrior]]\n| FormerMembers           = \n| Allies                  = [[Thor Odinson (Earth-616)|Thor (Odinson)]]\n| Enemies                 = [[Bloody Claws (Earth-616)|Bloody Claws]], [[Seth (Earth-616)|Seth]]\n\n| Origin                  = A group of intensive care patients who were bestowed amazing superpowers by the Egyptian death god [[Seth (Earth-616)|Seth]] to unwittingly do his bidding.\n| PlaceOfFormation        = [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Tom DeFalco; Ron Frenz\n| First                   = Thor #395\n\n| HistoryText             = Earth Force was born when three individuals from three separate walks of life were fighting for their lives while inside the same New York hospital. The [[Ennead|Heliopolitan]] death god, [[Seth (Earth-616)|Seth]], brought these mortals to [[Abydos|his realm]] and bestowed upon them the sign of Aton. This special mark gave them incredible powers and they were told they were to be “a force to protect and preserve the Earth.” However, this power was to come at a price: Earth Force was ordered to kill the [[Asgardian]], [[Hogun (Earth-616)|Hogun]], who also happened to be in the same hospital as they were after he was seriously injured in a fight with [[Matthew Murdock (Earth-616)|Daredevil]] and the police. When Earth Force returned to the hospital, they clashed with [[Thor Odinson (Earth-616)|Thor]] who was protecting his fellow Asgardian. Even though Earth Force had Thor beaten, Earth Lord and Wind Warrior felt that they should reevaluate their actions and decided to leave, taking a belligerent Skyhawk with them.{{Citation}}\n\nEarth Force returned and asked Thor for redemption after realizing that Seth was evil and merely using them to serve his foul plans. Thor agreed and together they fought the armies of Seth for the liberation of [[Asgard]] and the defense of all life everywhere. Earth Force confronted their manipulator, and even though they tried their best, Seth was too powerful for them and he left the three individuals at death’s door once more. After Seth’s ultimate defeat, the Gods of [[Celestial Heliopolis|Heliopolis]] restored the lives of Earth Force and returned them to their hospital beds mere moments after they were kidnapped by Seth. Earth Lord noticed that he still had the glowing sign of Aton in his hand and presumed that Wind Warrior and Skyhawk retained the mark as well.{{Citation}}\n\nEarth Force had not been seen until a confrontation between [[Jackie Lukus (Earth-616)|Bloodaxe]] and [[Stephen Strange (Earth-616)|Doctor Strange]] was brought to the attention of police and special task force, [[Code: Blue (Earth-616)|Code: Blue]]. Kyle Brock was among the police officers at the scene, and when no one was looking, he transformed into Earth Lord once more. He sent a silent signal to the other members of Earth Force, and together with Code: Blue, the two teams along with Doctor Strange were able to stop Bloodaxe before any serious damage was done to others.{{Citation}}\n\nFollowing the registration-initiated \"[[Civil War (Event)|Civil War]],\" Skyhawk registered as a superhero with the US government and was apparently assigned to work in [[Washington (State)|Washington state]] as part of the [[50-State Initiative (Earth-616)|50-State Initiative]]. Whether the other two members of the original Earth Force were assigned there with him, or if they even registered, is unrevealed.{{r|Civil War: Front Line Vol 1 11}}\n\n==Members==\n*[[Winston Manchester (Earth-616)|Skyhawk]] - Winston Manchester was a businessman working in New York, who had been hospitalized. His powers were magically given to him by the Egyptian god, Seth. Skyhawk possesses super strength and the power of flight, by using his powerful underarm-to-ribcage wings.\n*[[Kyle Brock (Earth-616)|Earth Lord]] - Kyle Brock was a police officer from New York who had been shot and hospitalized. Kyle Brock powers were magically endowed to him by the Egyptian god, Seth. As Earth-Lord, Brock has the ability to draw strength and mass from the ground to become a giant with superhuman physical attributes, and can return to his normal  at will. His costume is made from enchanted metal and fabric that grow and shrink as he changes size.\n*[[Pamela Shaw (Earth-616)|Wind Warrior]] - Pamela Shaw was a housewife who lives in New York, she had attempted suicide after her baby had died and she was hospitalized. Pamela Shaw's powers were magically endowed by the Egyptian god Seth. As Wind Warrior, she has the ability to transform her body to become winds and whirlwinds, with power ranging up to tornado force. Wind Warrior has the ability to glide on the winds.\n*[[Winston Manchester (Skrull) (Earth-616)|Skyhawk Skrull]] - A Skrull infiltrator in the team. Took over the identity of Winston Manchester aka Skyhawk.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = *{{cl|Thor Vol 1 395}} - {{cl|Thor Vol 1 400}}, {{cl|Thor Vol 1 456}}\n}}"
                }
            }
        }
    ],
    "page_id": "2932"
}