{
    "pageid": 15544,
    "ns": 0,
    "title": "Emissaries of Evil (Electro) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Daredevil Annual Vol 1 1.jpg\n| ImageText               = Fighting Daredevil on the cover of Daredevil Annual # 1\n| Name                    = Emissaries of Evil\n| Aliases                 = \n| EditorialNames          = Electro and his Emissaries of Evil\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Maxwell Dillon (Earth-616)|Electro]]\n| CurrentMembers          = \n| FormerMembers           = [[Maxwell Dillon (Earth-616)|Electro]]. [[Melvin Potter (Earth-616)|Gladiator]], [[Vincent Patilio (Earth-616)|Leap-Frog]], [[Manuel Eloganto (Earth-616)|Matador]], [[Wilbur Day (Earth-616)|Stilt-Man]]\n| Allies                  = \n| Enemies                 = [[Matthew Murdock (Earth-616)|Daredevil]]\n\n| Origin                  = \n| PlaceOfFormation        = [[New York City]]\n| PlaceOfDissolution      = [[New York City]]\n| Creators                = Stan Lee; Gene Colan\n| First                   = Daredevil Annual #1\n| Last                    = Giant-Size Daredevil #1\n\n| HistoryText             = [[Maxwell Dillon (Earth-616)|Electro]] decided to form the Emissaries of Evil in order to get revenge against [[Matthew Murdock (Earth-616)|Daredevil]]. {{r|Daredevil Annual Vol 1 1}} He tracked down the [[Wilbur Day (Earth-616)|Stilt-Man]], following a battle which had left the electrical systems of the [[Stilt-Man's Suit]] shorted out. {{r|Daredevil Vol 1 27}} Electro found the Stilt-Man trapped in the waters of a river and rescued him. He took the Stilt-Man to his home, and used an artificial electrical storm to restore power to the suit. He then had Wilbur Day recuperate in his home. The Stilt-Man was his first recruit to the team. {{r|Daredevil Annual Vol 1 1}}\n\nElectro next contacted and recruited the most powerful enemies of Daredevil: the [[Melvin Potter (Earth-616)|Gladiator]], [[Vincent Patilio (Earth-616)|Leap-Frog]], and the [[Manuel Eloganto (Earth-616)|Matador]]. {{r|Daredevil Annual Vol 1 1}} Gladiator was at the time living in [[Europe]] as a member of the [[Maggia (Earth-616)|Maggia]]. Electro contacted the Maggia in Europe in his attempt to get to the Gladiator. {{r|Daredevil Annual Vol 1 1}}\n\nThe Matador was the last member to join, and met Electro at the streets of [[New York City]]. Their meeting was overheard by Daredevil, who learned of the existence of the Emissaries. He challenged Electro and the Matador to fight him on the street. Electro managed to injure Daredevil, and left him seemingly unconscious in the street. The Matador wanted to finish off their foe, but Electro considered this fight to only be a warning to Daredevil. {{r|Daredevil Annual Vol 1 1}} The fight left Daredevil dizzy and disoriented. {{r|Daredevil Annual Vol 1 1}}\n\nDaredevil spend the next day searching for the Emissaries. The Matador challenged him to a fight in the docks of New York City. Daredevil defeated him, but the villain escaped by swimming away. Hours later, Daredevil was approached in an alley by the Stilt-Man. Daredevil injured his leg in their fight, but still managed to defeat the Stilt-Man. Hero and villain escaped, after destroying the wall of a building. {{r|Daredevil Annual Vol 1 1}}\n\nThe following night, the Leap-Frog went searching for Daredevil in a park. He was ambushed by Daredevil, but managed to escape. He challenged Daredevil to follow him, and led the hero to a trap. The rest of the Emissaries were waiting for Daredevil in largest electric power plant in New York City, where the high-voltage lines served to confuse his super senses.{{r|Daredevil Annual Vol 1 1}}\n\nA battle followed, where Daredevil fought every member of the Emissaries. The team was rather disorganized and Daredevil was able to use one member against the other. Electro accidentally knocked out the Stilt-Man, and the Matador accidentally knocked out the Leap-Frog. The fight left the villains dizzy and disoriented. Daredevil used a coil of wire as a lasso to tie up the dizzy Electro, Gladiator, Leap-Frog, and Matador. There was no need to also tie up the Stilt-Man, who was unconscious. The villains tried to use their combined strength to break through the wire, but Daredevil connected the wire to a power transformer. The transformer increased Electro's electricity and shocked the other three villains into submission. Electro's own strength was insufficient for him to escape. Daredevil promised that the police would release them, before transporting them to a prison. He thanked them for the workout.{{r|Daredevil Annual Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = *[[Wikipedia:Emissaries_of_Evil|Emissaries of Evil article at Wikipedia]]\n}}\n[[Category:Emissaries of Evil]]"
                }
            }
        }
    ],
    "page_id": "15544"
}