{
    "pageid": 845818,
    "ns": 0,
    "title": "Empirikul (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Empirikul (Earth-616) from Doctor Strange Vol 4 5 001.jpg\n| ImageSize               = 250px\n| Name                    = Empirikul\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Imperator (Earth-616)|Imperator]]\n| CurrentMembers          = [[Eyebots]], [[Witchfinder Wolves]]\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = Magic users\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jason Aaron; Kevin Nowlan\n| First                   = Doctor Strange Vol 4 1\n\n| HistoryText             = The Empirikul was an army of robots and beasts led by the [[Imperator (Earth-616)|Imperator]]. The army was motivated by the death of their leader's parents at the hands of the magic authorities, the [[Blood Monks (Earth-616)|Blood Monks]], when the Imperator was just a baby in his home dimension.{{r|Doctor Strange Vol 4 7}} This event caused the Imperator and his loyal robots to embark on a crusade across dimensions to \"purify\" all magic users by killing them. Some of their victims included Ice Duchess, Crimson Gypsy, Dr. Warlock, and [[Szandor Sozo (Earth-616)|Magister Szandor Sozo]].{{r|Doctor Strange Vol 4 1}}\n\nWhen they reached the dimension of [[Stephen Strange (Earth-616)|Doctor Strange]], the Empirikul assaulted several magical landmarks of the [[Earth]] until they reached the strongest of them all, Strange's [[Sanctum Sanctorum]].{{r|Doctor Strange Vol 4 5}} The Imperator confronted Doctor Strange himself and defeated him, even after the sorcerer had siphoned all of Earth's magic to empower himself.{{r|Doctor Strange Vol 4 6}} The most prominent magic users of this dimension were defeated and brought to the front of the Sanctum Sanctorum along with Strange to be sacrificed. However, the old mage [[Monako (Earth-616)|Monako]] interfered and teleported Strange and his colleagues away to safety, at the cost of his own life.{{r|Doctor Strange Vol 4 7}}\n\nThe Empirikul razed the Sanctum Sanctorum and searched the Earth for the sorcerers while the Imperator rested in their mothership. When he returned, the Imperator confronted the one threat of the Sanctum that none of his minions had managed to combat, the so-called [[Mister Misery (Earth-616)|Thing in the Cellar]]. While he was battling this creature, Doctor Strange and the other sorcerers arrived, armed with several artifacts which contained the last traces of magic in the world.{{r|Doctor Strange Vol 4 9}}\n\nStrange, The Thing in the Cellar, and the Imperator all dueled while the magicians outside battled the robots and beasts. After being weakened and blinded by the milled powder of the [[Yao (Earth-616)|Ancient One]]'s skull, the Imperator fell to the combined power of Doctor Strange and The Thing in the Cellar. The Imperator's fall severed his connection to the rest of the Empirikul and his mothership, causing all of the army to shut down.{{r|Doctor Strange Vol 4 10}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * The word Empirikul is a play on words. It is a different spelling of the word \"empirical\" meaning ''concerned with, or verifiable by observation or experience'', while also mashing the words \"cull\", which means to selectively harness or kill, and \"imperial\", which is anything relating to an empire, together.\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "845818"
}