{
    "pageid": 14544,
    "ns": 0,
    "title": "Enchanters (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Enchanters (Earth-616) from Thor Vol 1 143 001.png\n| Name                    = Enchanters\n| Aliases                 = \n| Status                  = Active \n| Identity                = Secret \n| Reality                 = Earth-616\n| BaseOfOperations        = [[Ringsfjord]]\n\n| Leaders                 = \n| CurrentMembers          = [[Magnir (Earth-616)|Magnir]], [[Brona (Asgardian) (Earth-616)|Brona]], and [[Enrakt (Earth-616)|Enrakt]]\n| FormerMembers           = [[Forsung (Earth-616)|Forsung]]\n| Allies                  = \n| Enemies                 = Asgardians\n\n| Origin                  = Magic users\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby;\n| First                   = Thor #143\n| Last                    = \n\n| HistoryText             = The origins of the Enchanters remain unknown. There are four who call themselves brothers, but whether they are part of a larger race, etc. remains unclear. Whether they are truly native to Asgard is uncertain.\n\nOdin read from the Book of Enchanters, instructing Thor of the Day of Three Worlds, in which he must stake all on the life of another.{{r|Thor Vol 1 129}}\n\nThe youngest of the Enchanters, Enrakt was still training and was left behind when his older brothers plotted against Asgard.{{r|Thor Vol 2 20}}\n\nBalder and Sif were sent to Ringsfjord to seek out the Enchanters, who sent their Living Talisman to battle them before appearing themselves. Forsung turned the ground below them to quicksand and Sif teleported them away to escape it. They went to Earth to seek out Thor; Brona and Magnir followed them to Earth, while Forsung traveled to Asgard to challenge Odin.{{r|Thor Vol 1 143}}\n\nBrona and Magnir, aided by their Living Talismans (Living Talismen?) confronted  Balder, Sif, and Thor, challenging them to a fight to the death. The Enchanters levitated a piece of the ground into the air, taking Thor with them, while leaving Balder and Sif on the ground. Thor battled the two Enchanters inconclusively. Meanwhile, Forsung and his own Living Talisman confronted Odin, challenging him to combat for the supremacy of Asgard, with the Odinsword as the prize. So that none could interfere, Odin removed the non-physical powers of all of his subjects while Forsung disclaimed the use of his Living Talisman. This caused the Enchanters and Thor to return to the Earth, allowing Balder and Sif to join the fight. Balder defeated Magnir and Thor dropped Brona.  Odin and Forsung flew through the air as they grappled, glowing with a blinding light.{{r|Thor Vol 1 144}}\n\nThor and his allies turned the now powerless Brona and Magnir over to the New York Police Department, while Odin reappeared in Asgard, having slain Forsung in combat. Odin then crushed Forsung's Living Talisman and banished Brona and Magnir to the Lost Limbo of Infinity Unending.{{r|Thor Vol 1 145}}\n\nAs Kurse sought vengeance on Malekith, Malekith cast an illusion that made Kurse believe he overpowered Hela and briefly took control of Hel. Malekith also made him believe Thor was actually Malekith. Kurse assaulted Thor, and summoned \"the Ravagers from the realms of Ice and Death\" --including Forsung (with his Living Talisman), Fafnir of Nastrond, Fafnir the giant, a trio of Ice Dwarves, an Ice Giant, the Midgard Serpent, and Nidhogg--to finish him off.{{r|Thor Vol 1 486}}\n\nAs the Ravagers attacked Thor, he was assisted by the High Evolutionary and his Godpack. Forsung managed to fell the High Evolutionary, and several of the Godpack began to fall before the onslaught, so Odin sent Beta Ray Bill, Fandral, and Volstagg to assist Thor and his allies.{{r|Thor Vol 1 487}}\n\nAfter further battle, the true Hela appeared and eliminated Malekith's illusions. Hela then returned the Ravagers to Hel.{{r|Thor Vol 1 488}}\n\nEnrakt searched endlessly to locate the Lost Limbo of Eternity Unending for years, but once he was reunited with his brothers, he found the realm even more difficult to escape than to locate and enter. Eventually they located the dimension of Ceranda, finding Thor present there as well. Enrakt used [[Ceranda]]'s magical fire pit to transfer his astral essence across the dimensional gulf and to enter the hammer of Thor. Once inside, he became its new master, but his physical body died due to being so distant from its soul.  Enrakt then traveled with Thor to Earth after burying Ceranda.  Enrakt split his astral essence, invading and reanimating Ceranda's corpse. However, his powers were virtually exhausted by his recent efforts and so he had to wait until they were recovered to gain his vengeance.\n\nAs Thor defended shock jock Chucky Diamond from attackers, Enrakt caused Mjolnir to fail to return to Thor's hand and instead fly towards Diamond's head. Thor stopped the hammer in the nick of time, and it briefly manifested a monstrous face, taunting him.\n\nWhile Thor battled the Absorbing Man, Enrakt caused Mjolnir to become lodged in a wall, preventing it from returning to Thor. When Jake Olson tried to use the hammer to turn back into Thor, Enrakt emerged from the hammer (transforming Ceranda's form into a likeness of his own) and caused Olson to have a heart attack.  Brona and Magnir appeared in Asgard confronting Odin as he prepared for the Odinsleep (and after he was drugged by Tarakis), teleporting him away. Meanwhile Enrakt confronted the Warriors Three on Earth as they stood guard over Mjolnir.  Enrakt overpowered the Warriors Three then transformed a group of humans into monstrous creatures which he sent to devour them. In the distraction, Jake Olson grabbed Mjolnir and turned back into Thor and battled Enrakt. The Enchanter taunted him with an image of Odin struggling against Brona and Magnir before blasting Thor to the ground.  Enrakt caught Thor's hammer and hurled it back at him before departing to join the battle against Odin.\n\nThor used Mjolnir to return to normal the people mutated by Enrakt. The Scarlet Witch then used the residue on Enrakt remaining within Mjolnir to locate him, and sent Thor to join Odin against them. The Enchanters absorbed Odin's strongest energy attacks and used that energy to assault him, but Thor arrived and pulled the Enchanters from him. Enrakt then transformed the ground beneath their feet into an immense serpent which swallowed them whole.  Though Thor and Odin were powerless to escape Enrakt's serpent creation, the Scarlet Witch arrived and allowed them to do so. Dividing up their foes, Odin easily bested Brona with a knee to the face and crushed his Living Talisman, the Scarlet Witch trapped Magnir within solid rock, and Thor fought Enrakt. Unaware that the Scarlet Witch had cast a spell of invisible protection around Mjolnir, making it impossible for him to control, Enrakt grabbed the hammer and tried to unleash the anti-force at Thor, but Thor directed it back at him. Thor then battered Enrakt into submission. Thor prepared to execute Enrakt, but Odin told him to unmask the Enchanter instead, revealing Ceranda as the body in Enrakt's armor.  Thor and Odin returned with the Enchanters  to Asgard. Odin banished Brona and Magnir back to the Lost Limbo of Infinity Unending (after confirming that they had no further brethren to come after them), while Ceranda (left in a lifeless state without Enrakt to animate her) was to be placed under the Glass of Everlasting Honor.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = [[Living Talisman (Magical Weapon)|The Living Talismans]]\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Asgardian Organizations]]"
                }
            }
        }
    ],
    "page_id": "14544"
}