{
    "pageid": 2934,
    "ns": 0,
    "title": "Enclave (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Plagiarism|[http://www.marveldirectory.com/groupsandteams/enclave.htm Enclave on the Marvel Directory]}}\n{{Marvel Database:Team Template\n| Image                   = Enclave (Earth-616) from Fantastic Four Vol 1 66 001.jpg\n| ImageSize               = 250px\n| Name                    = Enclave\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Unknown; formerly [[Beehive]] ([[Costa Perdita]], [[South America]]), the [[Beehive]] on a rocky plateau on a small island in the North [[Atlantic Ocean]], an undisclosed location in [[Europe]], a base in an undisclosed location in the [[America]]n Midwest, [[Bronx|South Bronx]], [[Genosha]]\n\n| Leaders                 = [[Carlo Zota (Earth-616)|Carlo Zota]]; formerly [[Theodore Goodrich (Earth-616)|Ted Goodrich]]\n| CurrentMembers          = \n| FormerMembers           = [[Wladyslav Shinski (Earth-616)|Crucible]], [[Jerome Hamilton (Scientist) (Earth-616)|Jerome Hamilton]], [[Maris Morlak (Earth-616)|Maris Morlak]], [[Stella Webb (Earth-616)|Stella Webb]], [[Theodore Goodrich (Earth-616)|Ted Goodrich]]\n| Allies                  = [[Ayesha]], [[Maximus]]\n\n| Enemies                 = [[X-Men (Earth-616)|X-Men]], [[Wendell Vaughn (Earth-616)|Quasar]], [[Fantastic Four (Earth-616)|Fantastic Four]], [[Adam Warlock (Earth-616)|Adam Warlock]], [[Bruce Banner (Earth-616)|Hulk]], [[Inhumans]], [[Avengers (Earth-616)|Avengers]], [[Peter Parker (Earth-616)|Spider-Man]], [[Thunderbolts (Earth-616)|Thunderbolts]], Government of [[Genosha]], [[Masked Raider III (Earth-616)|Masked Raider]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four Vol 1 66\n\n| HistoryText             = The roots of the Enclave date back to the age of [[Camelot]], when a group of renegade occultists created the [[Eternity Mask]] to oppose [[Arthur Pendragon (Earth-616)|King Arthur]]. The mask persisted in time, and so did the occultists, evolving into the three-manned [[Scientists Guild (Earth-616)|Scientists Guild]] during the 1930s, also known as the the Three Xs. They were comprised of [[Jerome Hamilton (Scientist) (Earth-616)|Jerome Hamilton]], [[Carlo Zota (Earth-616)|Carlo Zota]], and [[Maris Morlak (Earth-616)|Maris Morlack]].\n\nBy the late 1950s, the Scientists Guild had welcomed geneticist [[Wladyslav Shinski (Earth-616)|Wladyslav Shinski]] into their ranks, and were subjected to his longevity treatments to extend their lifespan, during which they intended to fulfill their objective to use science to create a benevolent world dictatorship under their rule. Shinski believed that the world must be controlled by a race of perfect humans, and intended to build this idea on [[Phineas Horton (Earth-616)|Phineas Horton]]'s [[Jim Hammond (Earth-616)|Human Torch]]. Shinski also believed that the Scientists Guild needed to evolve into a new form, and they rebranded themselves as the Enclave.{{r|Marvel Comics Vol 1 1000}} \n\nOver the period of a year, each scientist faked his own death and then rendezvoused with the others on a small island in the North [[Atlantic Ocean]]. On this unnamed island, a friend of Hamilton's, archaeologist [[Daniel Damian (Earth-616)|Daniel Damian]], had discovered ruins of a technologically advanced stronghold (now believed to be an abandoned outpost of the [[Deviants (Race)|Deviants]]) and told Hamilton of his find. The four Enclave scientists used the scrap metal in the ruins to create their own Citadel of Science, which they nicknamed the [[Beehive]]. After about a decade of work, the Beehive was fully operational, and it became one of the foremost scientific research facilities on [[Earth]].{{r|Fantastic Four Vol 1 66}}\n\nWorking together, and using the abandoned technological devices they found there, the Enclave scientists created a number of scientific breakthroughs, including anti-gravity transmitters, molecular bond-severing blades, and a teleportation machine with a 2,000 mile range. The first project upon which they pinned their hopes of effecting their goals, however, was in the field of genetics. Their plan was to create a vastly powerful new race of human beings under their control with which to subjugate the rest of humanity. For almost a decade, the four scientists labored, bioengineering human DNA molecules to create life, irradiating it with various energies to imbue it with power, and chemically accelerating its growth. When their prototype reached maturity, it escaped its incubation chamber before they could set it free. Due to its rapid maturation, they were unable to place within the creature's mind the proper safeguards enabling them to control it. The creature, referred to only as \"[[Him]],\" manifested its various energy-manipulating powers, causing its creators to flee before they could even learn what it looked like. Using the teleportation machine, Hamilton kidnapped noted sculptor [[Alicia Masters (Earth-616)|Alicia Masters]] and brought her to the Beehive to sculpt Him's likeness. After he persuaded her to do as they asked, Hamilton was conscience-stricken and insisted he accompany her into the chamber where Him was. In the meantime, Alicia Masters' friends, the [[Fantastic Four (Earth-616)|Fantastic Four]], realized she was missing and managed to locate the Beehive. Just before the Fantastic Four rescued Masters and escaped through the Enclave's teleportation machine, Hamilton was seemingly killed in a rockslide caused by one of Him's energy discharges. Zoto warned Him that the energy necessary for flight would cause the total destruction of the Beehive. Believing them to be evil, Him flew off in defiance of the warning. Him later became known as [[Adam Warlock (Earth-616)|Adam Warlock]].{{r|Fantastic Four Vol 1 #66|67}}\n\nWhile all four scientists survived the great damage the Beehive sustained by Him's manifestation of power, Hamilton was left for dead. Waking up in the wreckage and left blind by the incident, Hamilton donned the Eternity Mask, which had also been left behind in the wreckage, and decided to wage war against the Enclave as the vigilante Blind Justice.{{r|Marvel Comics Vol 1 1000}} In addition to the structural damage, the Enclave lost most of the mercenaries they employed as guards in the Beehive, but they nevertheless began to rebuild their facilities. When it was completed, they undertook their second genetic experiment, a duplication of the first which they hoped to keep under control. When the second creature reached maturity, the Enclave enlisted the unwilling aid of [[Stephen Strange (Earth-616)|Dr. Stephen Strange]], a former famed surgeon. The Enclave wanted Strange to use their remote-controlled laser to perform brain surgery on the creature to ensure that it would obey them. Despite their precautions, the creature regained control of its own mind shortly after it emerged from its cocoon-like womb, and released sufficient energies to cause the Beehive's island base to break up and sink beneath the sea. The creature, calling itself [[Ayesha (Earth-616)|Paragon]], created a new cocoon for itself and went inside to complete its metamorphosis.{{r|Incredible Hulk Annual Vol 1 6}} When it finally emerged, it called itself [[Her]].{{r|Marvel Two-In-One Vol 1 61}}\n\nThe three Enclavers managed to survive the flooding of their island-base and fled to mainland [[Europe]] where they established a new temporary headquarters. Acquiring funds by selling certain inventions to [[Hydra (Earth-616)|Hydra]], the Enclave helped finance the [[Security University]], an institution advertised to provide the progeny of ambassadors, politicians, and business tycoons with a secure collegiate environment. In reality, the Enclave sought to use the students to acquire classified industrial, political, and military information. To do so, the Enclave hired the [[Monocle (Spy) (Earth-616)|Monocle]], a [[:Category:Germans|German]] who invented various means of data-extracting thought hypnosis. At the same time the Enclave learned of the existence of the genetically advanced [[Inhumans (Inhomo supremis)|Inhumans]] and decided to conquer them in order to take control of their technology. Using a variation of their teleportation machine, they captured [[Medusalith Amaquelin (Earth-616)|Medusa]] of the Inhumans' Royal Family to use as a hostage. The Enclave then decided to terminate the Security College project, feeling it to be a risky failure. When the Monocle refused to abandon the project and allowed its true purpose to be discovered, the Enclave detonated the Monocle's escape-shuttle, thereby killing him.{{r|Fantastic Four Vol 1 207}}\n\nShortly thereafter, the Enclave launched their first attack on the Inhumans, using hired mercenaries as their militia. The Enclave was aided in their war effort by the renegade Inhuman [[Maximus Boltagon (Earth-616)|Maximus]], who sabotaged his own people's defense systems, and by an outbreak of disease among the Inhumans caused by a reaction to Earth's increasing pollution. The Enclave's first war against the Inhumans ended when Maximus betrayed the Enclave and helped turn the Enclave's weapons against them. Medusa was freed in the process.{{r|Fantastic Four Vol 1 240}} None of the three principal Enclavers were taken captive in the defeat, only their mercenary soldiers. A short time later, the Enclave was contacted once more by Maximus, this time from the moon, where the Inhumans had moved their island to escape Earth's pollution. The Enclave's second war against the Inhumans was a secret one, as Maximus, possessing the body of his brother [[Blackagar Boltagon (Earth-616)|Black Bolt]], permitted them to infiltrate the Inhumans' city. There they launched an attack on [[Earth]] designed to get Earth to retaliate against the Inhumans. The plot failed, due to the intervention of the [[Avengers (Earth-616)|Avengers]], and for the first time two of the Enclave members, Morlak and Zota, were taken into custody by the authorities and tried for their treacherous acts.{{r|Fantastic Four Annual Vol 1 12}}\n\nDue to his infirmity, Shinski had not gone to the Moon with his colleagues and hence avoided imprisonment. He eventually acquired the minimal resources to build a makeshift teleportation machine enabling him to free his fellows. Attempting to secretly fly out of [[JFK Airport]], the Enclave was discovered by the police. As they tried to escape, they skidded their plane into [[Jamaica Bay]], sending Shinsky's latest project to the bottom of the bay. Investigation of the plane wreck led the Avengers to find yet another cocoon, which turned out by coincidence to be the dormant [[Jean Grey (Earth-616)|Jean Grey]], who had no connection to the Enclave. From a hospital bed, Shinsky claimed that the tank they were carrying only contained certain chemical compounds, which were rendered inert by the waters of the bay. Following recovery from their injuries, the three Enclavers were sent to prison.{{r|Avengers Vol 1 263}}\n\nThe Enclave later obtained both financial backing and the assistance of an agent named Frank from the group known as [[AIM]]. In exchange, they were to capture [[Ayesha (Earth-616)|Kismet]] and turn her over to AIM. Shinsky had a stroke and was confined to a bed, requiring intravenous therapy after suffering heart and lung damage. In a new base somewhere in the American Midwest, they rebuilt their Transfer Grid. Morlak and Zota used the Grid to travel to [[Project P.E.G.A.S.U.S. (Earth-616)|Project: Pegasus]], where they abducted the cocoon containing the healing form of Kismet. After removing Kismet from the cocoon, they placed it around Shinsky, curing him of his ailments. While Shinsky was overjoyed at seeing his only \"daughter,\" Morlak and Zota planned to extract some of Kismet's DNA and inject themselves, in hopes of turning into metahumans. Frank, however, assaulted Morlak and Zota, preventing them from betraying AIM as they had intended. Kismet stopped Frank from killing Shinsky, but Frank revealed himself to be an Adaptoid and adapted Kismet's original powers as Paragon. As the two fought, Shinsky infected and destroyed the Paragon Adaptoid with a genetic virus, which had been designed as a failsafe should Kismet attack them. Kismet then created more healing cocoons for the three Enclavers, and decided to stay with them and nurture her \"parents.\"{{r|Quasar Vol 1 57}}\n\nSome time after the defeat of the Paragon Adaptoid, the Enclave were each transformed into powerful metahumans, as they had previously desired. Their advanced minds turned them away from their former plans of world conquest, although their desire to cure the ills of humanity remained. They soon found that they could not leave each other's immediate presence (with 10 meters), or suffer power loss and great pain. Testing their powers over the next few days, the trio proved themselves by stopping a dangerous tornado, saving dying patients, bringing rain to a drought region, curing deadly jungle diseases, disposing of nuclear waste, revitalizing rain forests, etc. However, they were unaware of the long-term effects of their actions, and several places suffered even worse fates from their overcompensating. Kismet tried to stop them, but their actions caused a volcano to erupt. With her aid, they averted the disaster, and they accepted her advice to learn more about their powers by investigating their source. She accompanied them out into space.{{r|Cosmic Powers Unlimited Vol 1 2}}\n\nThe Enclave's powers eventually faded and they returned to Earth. Wanting to get their operations back up and running again, the Enclave hired the [[Tinkerer]] to reconstruct their Transfer Grid. Fallen on hard times, the Enclave operated out of a building in the South [[Bronx]], where they designed control chips which they implanted in criminals and other dregs of society in order to use them as drones. They also built a robot, the [[Remote]], which they used to acquire needed technology from other companies. The Remote killed a security guard in the process of looting [[Micron Labs]], and his silhouette as he left made witnesses think he was Spider-Man. This drew both [[Peter Parker (Earth-616)|Spider-Man]] and the [[Thunderbolts (Earth-616)|Thunderbolts]] to investigate. The Thunderbolts fought the Remote and then followed it back to the Enclave, while Spider-Man followed the Thunderbolts. With their most recent components, they completed work on their [[Bio-Modem]], a beam able to control the minds of others, and their Transfer Grid. When the heroes confronted them, they used their Bio-Modem to take control of their minds, but Spider-Man and [[Abner Jenkins (Earth-616)|Mach-1]] managed to set-up interference to the Modem's power and they freed the others. The heroes then destroyed the Remote. The members of the Enclave fled through the Grid, using its Omni-Retrieval function to take their equipment (including the Grid) with them.{{r|Spider-Man Team-Up Vol 1 7}}\n\nSeeking for a way to jumpstart their efforts to bioengineer their master race, Morlak and Shinsky came upon the idea of usurping the creative genius of [[Reed Richards (Earth-616)|Reed Richards]]. Presumably with the aid of Zota, they designed a device to do just this. Possibly hoping to pique Richards' interest, they traveled to the monastery of the Tibetan [[Monks of Doom (Earth-616)|Monks of Doom]], the same sect that had constructed the armor of [[Victor von Doom (Earth-616)|Doctor Doom]]. Slaughtering many of the monks, they enslaved the rest, and had them forge a pair of armored suits similar to those worn by Doom. In [[Stockholm]], [[Sweden]], Morlak, as Crucible, attacked a scientific symposium, injuring all present. As intended this drew him into a conflict with Reed Richards, during which he used a decoy device (thought to be a bomb) to drive away the Thing and their ally, [[Alyssa Moy (Earth-616)|Alyssa Moy]]. As he fought Richards, Crucible activated a device that drained Richards inventive genius, transferring it into himself. He then escaped, unseen.{{r|Fantastic Four Vol 3 5}}\n\nMorlak and Shinsky then relocated to [[Genosha]] where they set up shop and began using the war torn nation as a proving grounds for their weapons and tactics. At the same time, they began gathering and experimenting on the Genoshan people, hoping to transform them into their master race. At some point, they captured Kismet and managed to brainwash her into serving them. Altering her appearance and powers, they renamed her Ayesha (\"She who must be obeyed\").{{r|Fantastic Four Vol 3 11}}\n\nSeeking a means to oppose Crucible, the Genoshan government sent the [[Press Gang (Earth-616)|Press Gang]], alongside [[Peter Petruski (Earth-616)|Trapster]], to capture Reed Richards. The remaining members of the Fantastic Four traveled to Genosha in pursuit of Reed, but were confronted and defeated by Ayesha. She brought them to Crucible, who swapped their minds with a trio of his Genoshan accomplices, [[Jomo Kimane (Earth-616)|Jomo Kimane]], [[Farisa Mansour (Earth-616)|Farisa Mansour]], and [[Harry Soong (Earth-616)|Harry Soong]]. The three heroes, trapped in powerless bodies, escaped from Crucible's prison.{{r|Fantastic Four Vol 3 11}}\n\nThe powerless heroes were reunited with Reed and, along with Genoshan Chief Magistrate Anderson, stormed Crucible's base. Ben, Johnny, and Sue fought their powered counterparts and reclaimed their bodies. Meanwhile, Reed entered the inner sanctum and discovered the Enclave's human guinea pigs. Morlak revealed his identity and confronted Richards, but soon began to crack under the stress of caused by the continued influx of thoughts and ideas from Reed Richards' stolen inventive genius. Just then Shinsky appeared, also wearing Crucible armor, and blasted Morlak, killing him. Shinsky pronounced Morlak as unworthy of claiming the cosmos and of serving as Ayesha's consort. He named himself as the true Crucible, with Morlak as just his lackey. Mister Fantastic managed to stun Crucible, who fled when the rest of the Fantastic Four, having regained their powers, arrived. Crucible located Ayesha who had been fighting Anderson. The magistrate surprised both of them with a Black Hole Grenade, which generated a miniature event horizon, pulling the three of them in, apparently ending the threat of Crucible forever.{{r|Fantastic Four Vol 3 12}}\n\nA new incarnation of the Enclave was established years later by the scientist [[Theodore Goodrich (Earth-616)|Ted Goodrich]], who unearthed the abandoned Beehive, and intended to follow in the steps of the original group. Goodrich funded his new operation selling the idea of the original Enclave as a rumor to think tanks conferences. Following an invasion on Earth by the Mad Titan [[Thanos (Earth-616)|Thanos]] during which the Inhuman king Black Bolt detonated a [[Terrigen Bomb]] that swept the Earth, millions of unsuspecting humans were encased in cocoons to undergo Terrigenesis due to their latent Inhuman lineage. Goodrich's Enclave set out to analyse these new Inhumans, and came into conflict with the [[Bruce Banner (Earth-616)|Hulk]] after abducting the recently-surfaced Inhuman [[Randall Jessup (Earth-616)|Randy Jessup]], an agent of [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] and subordinate of the Hulk's alter-ego, Bruce Banner.{{r|Indestructible Hulk Vol 1 19.INH}}\n\nWhen Jessup was brought to the Beehive and was toured around the facility, he recognized the instability of its power source. After the Hulk arrived to retrieve Jessup, Randy mutated into his own monstrous form and joined forces with the Hulk to destroy the Beehive's power source. In a desperate attempt to salvage something before his plans were foiled, Goodrich desperately began chipping away an Inhuman cocoon. He managed to pierce the cocoon, but both Goodrich and his assistant [[Stella Webb (Earth-616)|Stella Webb]] were pulled into it by the Inhuman within and were seemingly consumed. The remaining members of the Enclave were all accidentally teleported away during the destruction of the Beehive's power source. Following this incident, the rest of Bruce Banner's team took over the Beehive and as they defected from S.H.I.E.L.D.{{r|Indestructible Hulk Vol 1 20}}\n\nCarlo Zota eventually resurfaced and established a new Enclave on his own.{{r|Marvel Comics Vol 1 1000}} Continuing with their mission, the Enclave attempted to create a new perfect human to help them save the world. Their project involved the refurbishing of the hyper-intelligent cybernetic amalgamation called [[Michael Korvac (Earth-691)|Korvac]]. However, upon reactivation, Korvac deemed that the scope of the Enclave's objective, to seek a better Earth, was arrogant and selfish. Korvac renounced the Enclave and sought to turn himself into a god to create a better universe instead.{{r|Iron Man Vol 6 2}}\n\n| Equipment               = \n*'''[[Beehive|The Beehive]]:''' Also known as the Citadel of Science, this was the Secret Fortress of the Enclave, built on an island that apparently once served as a Deviant fortress. Work was initiated on it nearly two decades before the start of the modern era. It was one of the most technologically advanced facilities on the planet at its time. It served as the creation place of [[Adam Warlock (Earth-616)|Him]], who nearly destroyed it, and [[Ayesha (Earth-616)|Paragon]], who sunk it beneath the waves.\n| Transportation          = \n*'''Transfer Grid:''' A teleportation device that allows beings wearing a special electronic bracelet to access the Grid, allowing them teleport to or from anywhere on Earth.\n\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * [[Jack Kirby]]'s originally intended for the Enclave to be a riff on Objectivism. \"Him\" would've been created as a true Objectivist, deciding to kill his creators for being unable to put up with their flaws instead of being prompted to kill them due to their plans of world subjugation. These details were abandoned when [[Stan Lee]] revised Kirby's plot.<ref>{{cite web|url=http://www.cbr.com/comic-legends-how-was-warlocks-first-appearance-re-written/|title=Comic Legends: How Was Warlock's First Appearance Re-Written|work=CBR|first=Brian|last=Cronin|date=11 February 2017|accessdate=3 March 2017}}</ref>\n| Links                   = \n}}\n[[Category:Terrorist Organizations]]\n[[Category:Think Tanks]]"
                }
            }
        }
    ],
    "page_id": "2934"
}