{
    "pageid": 1476083,
    "ns": 0,
    "title": "Escape from New Jersey Experience (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Escape from New Jersey Experience (Earth-616) from Captain Marvel Vol 10 17 001.jpg\n| Name                    = Escape from New Jersey Experience\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Escape from New Jersey Building]], [[Jersey City]], [[New Jersey]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Kelly Thompson; Francesco Manna\n| First                   = Captain Marvel Vol 10 17\n| History                 = The Escape from New Jersey Experience was a escape room company run by a man named [[Nexus (Ken) (Earth-616)|Ken]] who went by the alias of The Nexus. When [[Kamala Khan (Earth-616)|Ms. Marvel]] decided to surprise [[Carol Danvers (Earth-616)|Captain Marvel]] and her friends after being invited to their game night, she called the Escape from New Jersey Experience and managed to book a session since they were super heroes. As soon as one of Ken's employees told him they were heroes, Ken agreed to host for them, and told the rest of the staff to go home so he could deal with them personally.\n\nWhen Captain Marvel and her friends arrived, Ken welcomed them and sealed inside inside a near-impenetrable room laced with [[Vibranium|Antarctic Vibranium]] that began to fill with water. The group managed to escape, blasting the door to the room with their combined firepower, and confronted Ken. He tried to subdue them with telepathy to no avail, in the process explaining that he only wanted to have his fifteen minutes of fame, and Captain Marvel knocked him out. Afterward, Ken was apprehended by authorities from [[Raft|The Raft]], who took him away with a psychic dampener. As he was being taken away, Ken rejoiced on the fact that Captain Marvel considered him a threat big enough to be imprisoned at The Raft.{{r|Captain Marvel Vol 10 17}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Telepaths]]"
                }
            }
        }
    ],
    "page_id": "1476083"
}