{
    "pageid": 2939,
    "ns": 0,
    "title": "Externals (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{MessageBox |Message = It has been suggested that this article should be split up into two pages - please join the discussion on the [[Talk:Externals (Earth-616)|talk page]].}}\n{{Marvel Database:Team Template\n| Image                   = Externals (Earth-616) from Excalibur Vol 4 12 001.jpg\n| ImageSize               = 250px\n| Name                    = Externals\n| Aliases                 = High Lords,{{r|X-Force #10}} [[X-Ternals]]{{r|Gambit Vol 3 14}}\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = [[Gideon (Earth-616)|Gideon]], [[Absalom (Earth-616)|Absalom]], [[En Sabah Nur (Earth-616)|Apocalypse]],{{r|X-Men: Future History: Messiah War Sourcebook #1}}{{r|Powers of X #3}} [[Burke (Earth-616)|Burke]], [[Selene Gallio (Earth-616)|Selene]]; Possibly [[Samuel Guthrie (Earth-616)|Cannonball]],{{r|X-Men: Future History: Messiah War Sourcebook #1}}\n| FormerMembers           =  [[Crule (Earth-616)|Crule]], [[Nicodemus (Mutant) (Earth-616)|Nicodemus]], [[Garbha-Hsien (Earth-616)|Saul]], [[Candra (Earth-616)|Candra]]\n| Allies                  = \n| Enemies                 = [[X-Force (Earth-616)|X-Force]] \n\n| Origin                  = A group of immortal [[Homo superior|mutants]] (deemed a sect){{r|X-Force #10}}<!-- , club,{{r|X-Force #37}}(that will go into the notes later) a subspecies -->\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Fabian Nicieza; Rob Liefeld; Mark Pacella\n| First                   = X-Force #10\n| Last                    = \n\n| Quotation               = Forever vying for political and monetary control over the destiny of this planet. Each of us aware that to truly gain such complete control requires mastery over time itself. For what sense is there in gaining power over your own destiny?\n| Speaker                 = [[Garbha-Hsien (Earth-616)|Saul]]\n| QuoteSource             = X-Force Vol 1 23\n\n| HistoryText             = \n===Origins and Early Years===\nThe Externals are a loose-knit group of nine, possibly ten members of an immortal subspecies of [[Homo superior|mutants]] that not only share immortality but a connection to each other that separates them from other immortals.{{r|X-Force #10}}{{r|X-Force #37}}{{r|X-Force #52|54}}{{r|Cable #150|154}}\n\nBecause the Externals' origins are scattered throughout history, as far as [[Selene Gallio (Earth-616)|Selene]]{{r|X-Necrosha #1}} born 17,000 years ago, [[En Sabah Nur (Earth-616)|Apocalypse]]{{r|Rise of Apocalypse #2}} who was born 5,000 years ago, along with Saul,{{r|X-Force #37}} Crule{{r|X-Force #12}}{{r|X-Force #23}} and Nicodemus'{{r|X-Force #20}} claims making them far older than him, it is unknown prior to their first known gathering{{r|Excalibur Vol 4 11}} when they first banded together.\n\n====High Lords====\nThough unknown when same of these Externals banded together, likely [[Garbha-Hsien (Earth-616)|Saul]], [[Nicodemus (Mutant) (Earth-616)|Nicodemus]] and possibly but to a lesser extent [[Crule (Earth-616)|Crule]] did the earliest. But together they manipulated events behind the scenes on a global scale, with the goal of political and monetary control over the destiny of Earth.{{r|X-Force #10}}{{r|X-Force #14}} \n\nTheir earliest known activity was during the mid-to-late 12th century C.E., when [[Candra (Earth-616)|Candra's]] fellow Externals wanted her to join their High Lords, she declined preferring not to share her power and play the \"power broker\" alone. Fearing the wrath of the others she formed a plan to extract the life energy of her own immortal heart into a stone.{{r|X-Men Vol 2 #60}} But despite this she summoned Selene, Saul, Crule, Nicodemus, and En Sabah Nur to aid her in a ritual to extract the life energy of her own immortal heart into a stone.{{r|X-Men Vol 2 #60}}{{r|Excalibur Vol 4 11}} While the ritual took place, Nur felt as he sunk the blade into her heart that he could have taken her power, and some that it was theft to place a shared thing into a stone where she could hide it from them, though none moved against her.{{r|X-Men Vol 2 #60|61}}{{r|Excalibur Vol 4 11}}\n\n===Stealing Power===\nNear the end of the 19th century Saul and Nicodemus in addition to [[Burke (Earth-616)|Burke]], [[Gideon (Earth-616)|Gideon]], and [[Absalom (Earth-616)|Absalom]] had become a form of authority overseeing the other Externals. They kept the peace and opposed anyone who interfered with their plans, but especially expected to kill any who would dare kill another External, taking their power and potentially godhood.{{r|Gambit Vol 3 #14}}{{r|X-Force #53}}{{r|Cable #154}}\n\nIn 1897 when they learned that Candra planned to stop En Sabah Nur's rise to power and take his ability to fold space for herself. Unwilling to physically act against her, they instead sent [[Nathaniel Essex (Earth-616)|Dr. Nathan Milbury]], who worked for En Sabah Nur, to deal with Candra.{{r|Gambit Vol 3 #12|14}}\n\nAfter Candra made it to En Sabah Nur’s sanctum beneath the pyramids outside of [[Banī-Mazā]] in [[Egypt]], with the help of her [[Thieves Guild (Earth-616)|Thieves Guild]] she began to translate the text. Dr. Nathan Milbury, with a time traveling [[Remy LeBeau (Earth-616)|Gambit]] and [[Jacob Gavin, Jr. (Earth-616)|Courier]], arrived to stop her via Milbury’s transport ship. Choosing to bring down En Sabah Nur's sanctum instead of fighting and stealing his powers, delaying his gratification to a later day, Milbury quickly overpowered Candra with his new-found metamorphic abilities. Defeated, she begged for him to stop, and as he did he revealed the five High Lords who appeared as the reason behind her loss. Candra tried to explain herself but her actions against a fellow External, even one as radical as En Sabah Nur, they would not allow. For their greater glory awaited the Millennial Dawn,{{r|X-Force Vol 1 #12}}{{r|X-Force #17}}{{r|X-Force #25}} and Candra put that at risk so they punished her.{{r|Gambit Vol 3 #13|14}}\n\n===Modern days===\nIn more recent years, the Externals were searching for their next member. Gideon long believed the next External was the hero [[Roberto Da Costa (Earth-616)|Sunspot]], and had positioned himself in Sunspot's life even before his heroic career. Later, when Sunspot's team, the [[New Mutants (Earth-616)|New Mutants]], was at a point of collapse, Gideon orchestrated the death of Sunspot's [[Emmanuel Da Costa (Earth-616)|father]] in order to allow Sunspot to leave the team and join him. Unaware of Gideon's true purpose and actions, Sunspot agreed.{{r|New Mutants #98|99}}{{r|X-Force #10}}\n\n===The Gathering===\nAt the same point the time-travelling mutant [[Nathan Summers (Earth-616)|Cable]] had taken leadership of the New Mutants and renamed them [[X-Force (Earth-616)|X-Force]], as he believed, based on his travels through time, that the mutant [[Samuel Guthrie (Earth-616)|Cannonball]] might be an External. When Cannonball was killed by the villain [[Karl Lykos (Earth-616)|Sauron]] and later revived, the Externals sensed Cannonball to potentially be one of their own as well came together to discuss it.{{r|X-Force #8|10}}\n\nGideon sent Crule to kill Cable, so that the Externals could easily capture Cannonball, but Crule was defeated. X-Force then confronted Gideon, revealing the truth and freeing Sunspot. Cannonball was made to promise not to interfere with Externals' affairs, although later Saul kidnapped three of X-Force's members in order to blackmail Cannonball into joining them. X-Force nevertheless defeated Saul and Gideon.{{r|X-Force #14|15}}{{r|X-Force #23}}\n\n===Legacy Virus===\nMonths later, several Externals peaceably sought Cannonball to join them yet again. They hoped that Cannonball might hold a key to solving the Legacy Virus that killed their members Nicodemus and Burke, but Cannonball could not help them.{{r|X-Force #37}}\n\n===Murdered by Selene===\nLater still, Gideon sent a distress call to X-Force after being betrayed by the External Selene. For reasons of her own, Selene was suddenly killing the remaining members of the Externals, absorbing their life forces. Despite the efforts of X-Force, Selene ultimately escaped, but not before summarily dismissing the assumption that Cannonball was an External, calling into question Cable's conclusion and the reasons for it.{{r|X-Force #52|54}}\n\n===[[The Newer Mutants]]===\nThe Externals were later revealed to be alive and well once again, only now they are at the mercy of a mysterious new killer who was somehow connected to the [[Glossary:Timestream|timestream]]. To investigate this odd occurrence, Cable assembled a new team of mutants in hopes of discovering the killer's identity. Initial suspicions were directed towards Selene, given her complex history with both her own kind and the X-Men. While aware of the killer's presence, having sensed the death of fellow External Candra, she laughed aloud at Cable's assumption that Selene herself was the last of her kind. Nicodemus, Absalom, and Crule then revealed themselves to be alive.{{r|Cable #150}}\n\n===External Gateway===\nApocalypse summoned through their shared psychic-link fellow Externals Saul, Candra, Selene, Nicodemus, Absalom, Crule and Gideon to the Eternal Caldera of [[Krakoa (Earth-616)|Krakoa]]. There he revealed his plans sacrifice them, but they were unwilling to go along with his belief of what their purpose should be nor willing to sacrifice themselves for his goals. Apocalypse would force them to be sacrificed by playing his trump card in a newly enhanced [[Julio Richter (Earth-616)|Rictor]]. After Gideon and Selene choose to stand with Apocalypse, Rictor unintentionally killing Saul, Candra and Nicodemus in an explosive wave of lava. A weakened Absalom was allowed to live for Apocalypse needed four for the ritual to transform their ancient bones into a gateway to [[Otherworld]] and to [[Arakko (Earth-616)|Arakko]].{{r|Excalibur Vol 4 12}} \n\nApocalypse's plans were temporarily halted by Candra, who used a similar ritual he was attempting and one they used long ago to place her energy into her Heart-Gem and hide it in [[Avalon (Otherworld)|Avalon's]] [[Starlight Citadel]]. [[Remy LeBeau (Earth-616)|Gambit]] who had been sent to Avalon with the rest of [[Excalibur (Earth-616)|Excalibur]] by Apocalypse happened to find the Gem. Apocalypse opened the gateway so Rictor could telepathically warn [[Elizabeth Braddock (Earth-616)|Captain Britain]], she asked Gambit to throw the Gem through the gate. Despite Candra's protests he did and with the Gem finding its mark, the ritual was done.{{r|Excalibur Vol 4 12}}\n\nWith Saul, Crule, Nicodemus, and Candra's ancient bones, containing their life energy, turned into the stones that power the [[External Gate]],{{r|X-Men Vol 5 12}} trapping them and allowing the whole of Krakoa to enter Otherworld as Apocalypse planned.{{r|Excalibur Vol 4 12}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * The Externals shares a psychic-link with each other that allows them to not only sense each other and where, but can call on each other at will from great distances.{{r|Excalibur Vol 4 11}}{{r|Excalibur Vol 4 12}} But also when one rises from the dead and when one is killed by another External.{{r|X-Force #9|10}}{{r|X-Force #53}}{{r|Cable Vol 1 150}}{{r|Cable Vol 1 152|154}} This ability seems stronger with the eldest among the Externals.\n\n* It was revealed that the Externals can only die at the hands of a fellow External, and in doing so that External absorbs the essence of their brethren gaining godhood.{{r|X-Force #53|54}}{{r|Cable #153|154}}\n** But when an External kills another and fails to kill all the other Externals, he/she losses the power they gained and the fallen Externals come back to life.{{r|X-Force #54}}{{r|Cable #150}}{{r|Cable #151}}{{r|Cable #154}}\n\n* Whether or not [[Samuel Guthrie (Earth-616)|Cannonball]] is an External remains a point of contention.{{r|X-Men: Future History: Messiah War Sourcebook #1}} Sam Guthrie's future versions, including a conversation with Graymalkin where we learn that Cannonball lived well into the 24th century,{{r|X-Force #10}} were shown to survive into the future. Besides this, the other Externals also sensed that Cannonball was one of them.{{r|X-Force #10}}\n\n* When answering [[Doop (Earth-616)|Doop]], Cable stated that Cannonball wasn't an External and that it was only a rumor.{{r|Cable Vol 1 151}} The ambiguity of Cannonball's status as an External was used as a source of humor years later. After he rapidly recovered from a Purifier attack, one of the X-Men's students, [[David Alleyne (Earth-616)|David]], asked Beast about it, and McCoy said Sam was immortal. David admitted after witnessing Cannonball's resurrection that he wasn't sure if McCoy was joking or not.{{r|New X-Men Vol 2 28}}\n* The Externals immortality does not become active when their mutant powers do, but rather when they meet their first death.{{r|X-Force #10}}\n** This would explain why Nicodemus and Saul, though in incredible shape,{{r|X-Force #20}} are physically older then the rest of their fellow Externals.{{r|X-Force #10}}\n\n| Trivia                  = * At one point it was revealed that each External was claimed to represent an intangible concept: Burke fortitude, Absalom despair, Nicodemus wisdom, Saul patience, Gideon opportunity, Crule ferocity, Candra guile, Selene corruption, and Cannonball hope.{{r|X-Force #37}} Although Apocalypse's concept has yet to be revealed, speculation by fans is it's either destruction or evolution.\n* Cable believed the group had gone by both \"Externals\" and \"High Lords\", preferring the former over the latter.{{r|X-Force #10}}. Other than Cable calling Cannonball and his future Apocalypse \"High Lord\",{{r|X-Force #8}}{{r|X-Force #25}} only the six that had banded together called themselves the \"High Lords\".{{r|X-Force #8|10}}{{r|X-Force #12}}{{r|X-Force #14}}{{r|X-Force #21|22}}{{r|X-Force #25}}{{r|X-Force #37}}\n** Though the six had become a type of authority among the other Externals and they possibly used the title High Lords to represent that, the High Lords are not a separate group but a moniker they began using most likely when they started to band together.\n** Other than calling Cannonball \"High Lord\", most likely in hopes he would join them, they have never referred to Selene, Candra, or Apocalypse as such nor have they referred to themselves using that moniker, with the possible exception of Apocalypse.\n* The Externals share many similarities with the [[Eternals (Homo immortalis)|Eternals]], mostly similar names and being immortals.\n\n| Links                   = * http://en.wikipedia.org/wiki/Externals\n}}\n[[Category:Externals]]"
                }
            }
        }
    ],
    "page_id": "2939"
}