{
    "pageid": 251486,
    "ns": 0,
    "title": "Fall People (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Fall People from Official Handbook of the Marvel Universe Vol 2 19 001.JPG\n| Name                    = Fall People\n| Aliases                 = Fall Tribe \n\n| Leaders                 = [[Tongah (Earth-616)|Tongah]]\n| CurrentMembers          = [[Barok (Earth-616)|Barok]], [[Emuel (Earth-616)|Emuel]], [[Fahe (Earth-616)|Fahe]], [[Gronk (Earth-616)|Gronk]], [[Khonsah (Earth-616)|Khonsah]], [[Kronak (Earth-616)|Kronak]], [[Lodah (Earth-616)|Lodah]], [[Mathal (Earth-616)|Mathal]], [[Mela (Earth-616)|Mela]], [[Nereel (Earth-616)|Nereel]], [[Sarak (Earth-616)|Sarak]], [[Seesha (Earth-616)|Seesha]], [[Character Index/S#Selma|Selma]], [[Shakan (Earth-616)|Shakan]], [[Sher-La (Earth-616)|Sher-La]], [[Tatia (Earth-616)|Tatia]], [[Tinta (Earth-616)|Tinta]],  [[Tukuk (Earth-616)|Tukuk]], [[W'Kandro (Earth-616)|W'kandro]], [[Yada (Earth-616)|Yada]]\n| FormerMembers           = \n\n| Identity                = Public \n| Affiliation             =\n| Allies                  = [[Ka-Zar]], [[Zabu]], [[Shanna]], [[X-Men]]\n| Enemies                 = [[Swamp Men]], [[Sheenarians]]\n\n| Origin                  = A Human tribe that lives in the Savage Land\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Savage Land]]\n| PlaceOfFormation        = [[Savage Land]], [[Antarctica]]\n| PlaceOfDissolution      = \n\n| Creators                = Gerry Conway; Barry Windsor-Smith\n| First                   = Astonishing Tales #3\n\n| History                 = \n===Overview===\nThe '''Fall People''' are a [[human]] hunter-gatherer society that live in the [[Savage Land]]. Their appearance and culture is similar to the Native Americans. [[Ka-Zar]] was very friendly with the Fall People, and their chieftain [[Tongah (Earth-616)|Tongah]] was his best friend.{{r|Official Handbook of the Marvel Universe Vol 2 #19}}\n\n===Events===\nThe Fall People are the descendants of the humans of the empire of [[Atlantis]]. When the empire fell the people were scattered throughout the land forming their own tribes.{{r|Official Handbook of the Marvel Universe Vol 2 #19}}\n\nThe Fall People were attacked by the [[Sun-People]] who worshiped the god [[Garrok]].{{r|Astonishing Tales #3}} Tongah the Tribes chieftain teamed up with Ka-Zar to stop the Sun-People's queen [[Zala Dane (Earth-616)|Zaladane]] from destroying the home of the [[Lizard Men (Vala Kuri)|Lizard Men of Vala Kuri]].{{r|Astonishing Tales #4}} Working together they were able to stop the queen and restore peace between the Sun-People freeing the Fall People.{{r|Astonishing Tales #5}}\n\nLater Ka-Zar and Zabu accompanied Tongah home to his village, when they encounter an angry god. Tongah related the legend of Damon and Lelania, who came to Earth, and to the Savage Land, 5000 years ago, only to have Lelania apparently killed, and Damon driven mad. Damon rampaged and brought savage storms to the land, and then must have slept since then, but has now awoke and was rampaging again. The Heroic Trio valiantly tried to fight the god, but the struggle seems useless. Tongah's people take shelter from the storm in a nearby cave, and his siblings, [[Emuel (Earth-616)|Emuel]] and [[Tatia (Earth-616)|Tatia]], get drawn deep into the cave by a strange light.{{r|Astonishing Tales #6}} Inside the cave, Emuel and Tatia find a space ship, and the body of Lelania. Lelania has taken over Tatia's body. She convinced Damon to cease his rampage, and the two of them then left for the stars. With their sister now gone, Tongah and Emuel returned to their home.{{r|Astonishing Tales #7}}\n\n[[Iranda (Earth-616)|Queen Iranda]], a powerfully sorceress used her magic to kidnap and turn members of the Fall Tribe into [[Lizard Men (Iranda)|Lizard-Men]]. Ka-Zar comes to rescue the villagers but is attacked by the the Lizard Men. He is barely able to escape but when he does, he takes Iranda's crown with him. With her crown gone, at moon-rise her enchantment wears off and she becomes a Lizard being as well. After she dies, her enchantments fade and the Lizard-Men turn back into the missing warriors from the village.{{r|Astonishing Tales #8}}\n\n[[Malgato (Earth-616)|Malgato]] tried to convince the Fall People that Ka-Zar's willing sacrifice was required to maintain the Savage Land's warm climate. Ka-Zar ignored his warning and when he took Shanna to the village of the Fall People they were angry he did not accept the honor of being sacrifices. When a triceratops rampaged through the village, the Fall People were convinced that Ka-Zar's blasphemy had doomed them and turned on them. Shanna went to Malgato and learned he was using robots to trick the superstitious locals. She stopped him and made an agreement with the Fall People to only sacrifice animals in the future.{{r|Ka-Zar Vol 2 #2}}\n\t\t\nTongah and the Fall People helped Ka-Zar defeated [[Maa-Gor (Earth-616)|Maa-Gor]] and the [[Homo neanderthalensis|Man-Apes]] who had teamed up with [[Juan Meroz (Earth-616)|El Tigre]] to gain god like powers.{{r|Ka-Zar Vol 2 #4|5}}\n\t\t\n[[Sheeas (Earth-616)|Sheeas]] the leader of the [[Lizard People (Earth-616)|Lizard People]] a splinter group of the [[Zebra People]] raised an army of Zombies to help her take control of her people. Tongah and the Fall People helped Ka-Zar defeat the threat to the Savage Land.{{r|Ka-Zar Vol 2 #12|13}}\n\nTongah of the Fall People was befallen by a madness possibly caused by the proximity of Vibranium while out hunting with Ka-Zar, which caused Ka-Zar to travel to London to find a scientist who could help combat the illness.{{r|Ka-Zar Vol 2 #14}} During Ka-Zar's absence, Tongah discovered that the Savage Land was being invaded by the [[Sheenarians]]. Tongah attacked and killed their commander, for which they demanded Tongah's life.{{r|Ka-Zar Vol 2 #15}} Tongah accompanied Ka-Zar to the Sheenarians' home dimension to prevent further invasions.{{r|Ka-Zar Vol 2 #16}} There, he was captured by the [[Kramen]] who syphoned off his life energy, rapidly aging him.{{r|Ka-Zar Vol 2 #19}}\n\nWhen the [[X-Men (Earth-616)|X-Men]] were visiting the Savage Land after escaping from [[Max Eisenhardt (Earth-616)|Magneto]]'s Antarctic lair, [[Piotr Rasputin (Earth-616)|Colossus]] saved [[Nereel (Earth-616)|Nereel]] of the Fall People and a female friend of hers from a T-Rex that was attacking them. Nereel became especially fond of Colossus, and the two girls took the X-Man off for a romantic rendez-vous, claiming that it was part of a Tribal custom to honor their friend that had not survived the dinosaur attack.{{r|X-Men Vol 1 #114|115}}{{r|Classic X-Men Vol 1 21}}\n\nSome time later, the X-Men including Colossus revisited the Savage Land when it and its people were apparently destroyed by the scavenger [[Terminus]]. However, Nereel and a number of other Savage Land natives had been saved by the other-dimensional ruler [[M'Rinn (Earth-616)|M'Rinn]]. Colossus was reunited with Nereel, who now had a son named [[Peter (Nereel) (Earth-616)|Peter]]. Colossus is Peter's father, though Colossus was not told this.{{r|X-Men Annual Vol 1 12}}\n\nThe X-Men rescue the Fall People when Zaladane returned to conquer the Savage Land.{{r|Uncanny X-Men #250}}\n\n[[Wolverine]], [[Rogue]], and [[Jubilee]] were sent on a mission to search the Savage Land to confirm or deny rumors that [[Magneto]] might still be alive. As Wolverine stalked through the forest, he rescued a group of Fall People who had been kidnapped by the [[Savage Land Mutates (Earth-616)|Savage Land Mutates]].{{r|Wolverine Vol 2 #69}}\n\nThe Fall People helped the X-Men take on [[Karl Lykos (Earth-616)|Sauron]].{{r|X-Men Unlimited #6}}\n\nTongah helped Ka-Zar evacuate the Fall People.{{r|Sensational Spider-Man Vol 1 #13}} He then listened the tale of the legendary [[Chtylok (Earth-616)|Chtylok]], as told by [[Mathal (Earth-616)|Mathala]].{{r|Sensational Spider-Man Vol 1 #15}}\n\n[[File:Saurians from Ka-Zar Vol 4 1 001.jpg|350px|right|thumb]]\nA woman from the Fall People married a member of the [[Saurians]] at a ceremony held in the Savage Land.{{r|Ka-Zar Vol 4 #1}}\n\nThey were invited to join the [[United Council of Tribes (Earth-616)|United Council of Tribes]]. It was created by the Zebra People to bring peace to [[Pangea (Savage Land)|Pangea]]. A member of the tribe was present when [[Torran]] of the [[Ethereals (Savage Land)|Ethereals]] crashed the meeting.{{r|Ka-Zar Vol 4 #1|5}}\n \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Savage Land Tribes]]"
                }
            }
        }
    ],
    "page_id": "251486"
}