{
    "pageid": 980961,
    "ns": 0,
    "title": "Fang Gang (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Power Man and Iron Fist Vol 3 12 Textless.jpg\n| ImageSize               = 250px\n| Name                    = Fang Gang\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Harlem]], [[New York City]]\n\n| Leaders                 = \n| CurrentMembers          =  \n| FormerMembers           = [[Lonnie Lincoln (Earth-616)|Lonnie Lincoln]], [[Raymond Jones (Earth-616)|Piranha Jones (Raymond Jones)]], [[Mortimer Norris (Earth-616)|Mortimer Norris]], [[Cornell Stokes (Earth-616)|Cottonmouth (Cornell Stokes)]], [[Mariah Dillard (Earth-616)|Black Mariah (Mariah Dillard)]], [[Dontrell Hamilton (Earth-616)|Dontrell Hamilton]]\n| Enemies                 = \n\n| Origin                  = Street gang formed in [[Harlem]], [[New York]]\n| PlaceOfFormation        = [[Harlem]], [[New York]]\n| PlaceOfDissolution      = \n| Creators                = David Walker; Sanford Greene\n| First                   = Power Man and Iron Fist Vol 3 10\n| Last                    = Power Man and Iron Fist Vol 3 10\n\n| HistoryText             = Years ago, shortly after superhumans first started appearing in [[New York City]] in the [[Silver Age|Modern Age]], a young [[Dontrell Hamilton (Earth-616)|Dontrell Hamilton]] gathered five other young criminals together to form a street gang and increase their personal strength. He was inspired to do so by the supervillain group known as the [[Sinister Six (Earth-616)|Sinister Six]], which joined forces in order to fight the vigilante known as [[Peter Parker (Earth-616)|Spider-Man]], their common enemy.<!-- {{r|Power Man and Iron Fist Vol 3 10}} -->\n\nDontrell meet up with his girlfriend [[Mariah Dillard (Earth-616)|Mariah Dillard]], social outcasts [[Lonnie Lincoln (Earth-616)|Lonnie Lincoln]], an albino, and [[Mortimer Norris (Earth-616)|Mortimer Norris]], who was deformed, and partners in crime [[Raymond Jones (Earth-616)|Raymond Jones]] and [[Cornell Stokes (Earth-616)|Cornell Stokes]] to form his gang. He believed that if they could come up with a gimmick like super villains had, they could take over crime in [[Harlem]]. Lincoln had the idea to fill-in their teeth so they all were fangs. Jones, Stokes and Norris followed him in this idea. In their next meeting, Norris came up with a name and the '''Fang Gang''' was born.<!-- {{r|Power Man and Iron Fist Vol 3 10}} -->\n\nHowever, before the Gang could actually do anything, their temporal alliance fell apart to infighting. Mortimer made advances towards Mariah, causing Dontrell and him to come to blows. Lonnie insulted Mariah’s her weight when he tried to calm Dontrell, causing both of them to leave the gang. The four remaining members of the Fang Gang went their separate ways.{{r|Power Man and Iron Fist Vol 3 10}}\n\n===Legacy===\nWhile Dontrell's plans for the Fang Gang never went to fruition, the individual members of the group would all have a part to play in the criminal world of New York City.\n\n*Mortimer went to work for the [[Maggia (Earth-616)|Maggia]], until he was exposed to a radioactive isotope he was stealing for them. Mutated further, he called himself '''[[Mister Fish]]''' and attempted to form a power base to overthrow his former employees in the Maggia, but was stopped by [[Luke Cage (Earth-616)|Power Man]]. He was seemly killed during the battle, {{r|Power Man #29}} but survived and became a low-level supervillain.\n\n* Mariah became known as '''[[Black Mariah]]''', and became the leader of the [[Rat Pack (Black Mariah's) (Earth-616)|Rat Pack]], a street gang that focused primarily on stealing. {{r|Hero for Hire #5}} She remained a low-level crime boss during her career.\n\n* Raymond and Cornell took the names they got after fanging their teeth, '''[[Piranha Jones]]''' and '''[[Cottonmouth]]''', respectively. They kept on working together for a while, rejecting Dontrell for his failure in keeping the Fang Gang together. But they would eventually go on their own paths.{{r|Power Man and Iron Fist Vol 3 11}}\n\n** Raymond become a minor crime boss in the [[South Bronx]], a small and unimportant part of a bigger criminal world.{{r|Power Man Vol 1 30|31}} Years later, Jones got himself killed by a bomb set off by Tombstone when he attempt to overthrow a weakened Lonnie Lincoln as crimelord of Harlem.{{r|Power Man and Iron Fist Vol 3 12}}\n\n** Cornell, however, fared far better than his former partner. A few years after the failure of the Fang Gang, heroin trade rised in New York. Taking advantage of this new opportunity, Cottonmouth created a criminal enterprise centered around the heroin trade. He quickly become a leading drug lord, controlling most of the city's heroin trade.{{r|Power Man #18}} He tried to recruit Power Man into his organization, but he eventually gathered enough evidence to take down Strokes.{{r|Power Man #20}} Even after allying himself with the likes of the [[Rivals (Earth-616)|Rivals]] or the [[New Pride (Earth-616)|New Pride]]{{r|Shadowland: Power Man #1}}{{r|Power_Man_and_Iron_Fist_Vol_3_11}}, Cottonmouth never came close to his initial success.\n\n* Dontrell came to be known as '''[[Cockroach Hamilton]]''', a hitman for hire. He was primarily employed by Piranha Jones, his former peer in the Fang Gang, and often fought Power Man.{{r|Power Man Vol 1 30}} Dontrell always resented his former friends because of their success in the criminal world compared to his. He always thought that, had the Fang Gang could have remained together, they could have governed the underworld since superpowered criminals and vigilantes weren't as abundant when they formed.{{r|Power Man and Iron Fist Vol 3 10|11}}\n\n* Lonnie took the name '''[[Tombstone]]''' and become a professional thug, being hired by bigger fish for dirty work. He avoided getting caught by intimidating witnesses out of testifying against him. However, Spider-Man would expose Tombstone with tapes taken by reporter [[Joseph Robertson (Earth-616)|Robbie Robertson]].{{r|Spectacular Spider-Man #137|142}} Tombstone tried to get revenge on Robertson, only to be shot and exposed to the chemical [[Diox-3]], which gave him super strength.{{r|Web of Spider-Man Vol 1 68}} Using his experience with the underworld and his newfound power, Tombstone sought to ascend in the criminal hierarchy and make a name for himself. Cappable of clashing both wits and strength with the likes of the [[Wilson Fisk (Earth-616)|Kingpin]] and Spider-Man, Lonnie was by far the most successful member of the Fang Gang, climbing the criminal ladder far better than any of his once-equals. He eventually became one of the most powerful and notorious crimelords the city had ever seen.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]\n[[Category:Gangs]]"
                }
            }
        }
    ],
    "page_id": "980961"
}