{
    "pageid": 295238,
    "ns": 0,
    "title": "Fantastic Four (Onslaught Reborn) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = \n| Name                    = Fantastic Four\n| Aliases                 = FF\n\n| Status                  = Active\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Baxter Building\n\n| Leaders                 = [[Reed Richards (Onslaught Reborn) (Earth-616)|Mr. Fantastic]]\n| CurrentMembers          = [[Reed Richards (Onslaught Reborn) (Earth-616)|Mr. Fantastic]], [[Susan Storm (Onslaught Reborn) (Earth-616)|Invisible Woman]], [[Jonathan Storm (Onslaught Reborn) (Earth-616)|Human Torch]], [[Benjamin Grimm (Onslaught Reborn) (Earth-616)|Thing]]\n| FormerMembers           = \n| Allies                  = [[Avengers (Onslaught Reborn) (Earth-616)|Avengers]], [[Rebecca Barnes (Heroes Reborn) (Earth-616)|Bucky]] \n| Enemies                 = [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]], [[Robert Bruce Banner (Onslaught Reborn) (Earth-616)|Hulk]], [[Masters of Evil (Onslaught Reborn) (Earth-616)|Masters of Evil]]\n\n| Origin                  = Created when Franklin Richards attempted to flee an attack from Onslaught by creating another pocket universe to escape into.\n| PlaceOfFormation        = Second Counter-Earth\n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Onslaught Reborn Vol 1 #2\n| Last                    = Onslaught Reborn Vol 1 #5\n\n| HistoryText             = Some time ago, [[Franklin Richards (Earth-616)|Franklin Richards]], in a bid to save his family the [[Fantastic Four (Earth-616)|Fantastic Four]] and their allies from destruction when they sacrificed their lives to destroy [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]], he created a pocket universe for them to exist in where they were \"reborn\" into new lives similar to their past ones. Eventually, through intervention of the [[Celestials]], Franklin would bring his parents and their allies back home. Ultimately this Earth would also be transported into the [[Earth-616]] reality and be placed on the opposite side of the sun and be dubbed [[Counter-Earth (Heroes Reborn)|Counter-Earth]].\n\nFollowing [[Decimation|M-Day]], the combined mutant energies that were exorcised from the mutant population by the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] would lead to the rebirth of Onslaught. Onslaught would seek revenge against Franklin Richards, whom it held responsible for his defeat.\n\nIn order to escape Onslaught, Franklin would create a new pocket universe, this time escaping into it himself, however Onslaught would follow after the boy. Franklin would create a world very much similar to that of Counter-Earth, this time however instead of pulling his family and their allies into this reality, he instead created versions of them that copies of the \"reborn\" versions of themselves.\n\nLike all Franklin's previous creation, the people populated in these worlds while existing suddenly have memories and a past that predate their existence. As such, it is presumable that the Fantastic Four of this world share a similar origin and past adventures as the original Fantastic Four experienced when they were \"reborn\" ''(See [[Fantastic Four  Vol 2 1|Fantastic Four (Heroes Reborn)]].)''\n\nWhen Franklin first arrived on this new Earth, he would be chased by Onslaught and would seek out the aid of the Fantastic Four and the [[Avengers (Onslaught Reborn) (Earth-616)|Avengers]]. Although they doubted Franklin's claim to be their son from an alternate universe, with the real threat of Onslaught, the Fantastic Four and Avengers would work together with the [[Masters of Evil (Onslaught Reborn) (Earth-616)|Masters of Evil]] to destroy Onslaught. In the end, they would succeed in knocking Onslaught into the Negative Zone, although [[Rebecca Barnes (Heroes Reborn) (Earth-616)|Bucky]] would sacrifice herself to accomplish this goal.\n\nWith Onslaught defeated Franklin would return to his native reality just moments before he left, leaving the Fantastic Four and the other beings of his new reality to live new lives.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "295238"
}