{
    "pageid": 11139,
    "ns": 0,
    "title": "Fantastic Force (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Fantastic_Force_Vol_1_1.jpg\n| ImageSize               = 300px\n| Name                    = Fantastic Force\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Wakandan Embassy (New York City)|Wakandan Embassy]], [[Baxter Building]], [[New York City]]\n\n| Leaders                 = Formerly [[Black Panther (T'Challa)|Black Panther]], [[Franklin Richards (Earth-6311)|Psi-Lord]]\n| CurrentMembers          = \n| FormerMembers           = [[Tara Richards (Earth-6311)|Huntrara]], [[Devlor (Earth-616)|Devlor]], [[N'Kano (Earth-616)|Vibraxas]], [[Jennifer Walters (Earth-616)|She-Hulk]], [[Black Panther (T'Challa)|Black Panther]], [[Human Torch (Johnny Storm)|Human Torch]], [[Franklin Richards (Earth-6311)|Psi-Lord]]\n| Allies                  = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Secret Defenders (Earth-616)|Secret Defenders]], [[Kargul (Earth-6311)|Warlord Kargul]], [[Issac Sandor (Earth-616)|Professor Isaac Sandor]], [[Paul Alvarez (Earth-616)|Paul Alvarez]], [[Sonia Wu (Earth-616)|Sonia Wu]], [[Steven Rogers (Earth-616)|Captain America]]\n| Enemies                 = [[Super-Adaptoid (Earth-616)|Super-Adaptoid]], [[Morgan Le Fay (Earth-616)|Morgan Le Fay]], [[Slorioth (Earth-616)|Slorioth]], [[Jonathan Storm (Earth-721)|Vangaard]], [[Ulysses Klaw (Earth-616)|Klaw]], [[Paul Duval (Earth-616)|Grey Gargoyle]], [[Genetic Council (Earth-616)|Inhuman Genetic Council]], [[Phillip Masters (Earth-616)|Puppet Master]], [[Advanced Idea Mechanics (Earth-616)|A.I.M]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Baxter Building]], [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Tom Brevoort; Mike Kanterovich; Dante Bastianoni\n| First                   = Fantastic Force #1\n| Last                    = Fantastic Force #18\n\n| HistoryText             = \n===Formation===\n\nThe genesis of the group known as Fantastic Force had its beginnings with the machinations of [[Nathaniel Richards (Earth-616)|Nathaniel Richards]], who sought to put a stop to the being known as [[Jonathan Richards (Earth-967)|Hyperstorm]], a powerful being that threatened all history.{{r|Fantastic Four #406}}<ref group=\"note\"> [[Jonathan Richards (Earth-967)|Hyperstorm]] was first revealed as this threat in {{cl|Fantastic Four #406}}. In at least [[Earth-967|one possible future]], Hyperstorm was the child of [[Franklin Richards (Earth-967)|Franklin Richards]] and [[Rachel Summers (Earth-967)|Rachel Summers]] per {{cl|Fantastic Four #414}}.</ref> In order to prevent this, Nathaniel traveled to the [[Glossary:Modern Age|modern age]] of [[Earth-616]] and took young [[Franklin Richards (Earth-616)|Franklin Richards]], son of [[Reed Richards (Earth-616)|Mister Fantastic]] (Nathaniel's son) and the [[Susan Storm (Earth-616)|Invisible Woman]] of the [[Fantastic Four (Earth-616)|Fantastic Four]]. Nathaniel replaced Franklin with a [[Franklin Richards (Earth-6311)|teenaged counterpart]] who was trained in the control of his powers by Nathaniel.{{r|Fantastic Four #376}} This version of Franklin spent years in the realm known as [[Elsewhen]] where he was trained by Nathaniel, his supposed aunt [[Tara Richards (Earth-6311)|Huntara]] and Elsewhen's ruler [[Kargul (Elsewhen)|Warlord Kargul]].{{r|Fantastic Four #390}} Soon after this switch, Huntara came to the modern age to try and preserve the timeline and prevent Nathaniel or the Fantastic Four from disrupting the proper course of history.{{r|Fantastic Four #377}} Eventually, the teenaged Franklin (now calling himself Psi-Lord) was reunited with Huntara and the pair began working together for their mutual goals.{{r|Fantastic Four #389|390}}\n\nNot long after this, the people of [[Wakanda]] began experimenting with a process to regenerate their supply of [[Vibranium]] in order to maintain their economic dependence on the rare substance. The first test resulted in an explosion that killed many and endowed a young Wakandan youth named [[N'Kano (Earth-616)|N'Kano]] with uncontrollable vibrational powers. The [[T'Challa (Earth-616)|Black Panther]] equipped him with a suit to regulate these powers.{{r|Fantastic Force #14|15}} He then sought out his allies to train the boy. He first visited the [[House of Agon (Earth-616)|Inhuman Royal Family]] to assist him but, being in exile at the time, they were unable to help. They also placed a young [[Inhumans (Inhomo supremis)|Inhuman]] known as [[Devlor (Earth-616)|Devlor]].{{r|Fantastic Four #391}} Psi-Lord, Huntara, as well as the Black Panther and his charges sought the assistance of the Fantastic Four, arriving at the team's [[Four Freedoms Plaza|headquarters]] in the middle of their fight with the [[Reed Richards (Earth-944)|Dark Raider]]. Although the Dark Raider was defeated the Fantastic Four split up due to a number of personal differences among the members of the team.{{r|Fantastic Four #392}}<ref group=\"note\">During this period of time, the [[Fantastic Four (Earth-616)|Fantastic Four]] were dealing with much internal strife. At the time it was believed [[Reed Richards (Earth-616)|Mister Fantastic]] had died during a battle with [[Victor von Doom (Earth-616)|Dr. Doom]] in {{cl|Fantastic Four #381}}. Believing that her husband was still alive somewhere in time and space the [[Susan Storm (Earth-616)|Invisible Woman]] left the group to search for her husband. While the [[Jonathan Storm (Earth-616)|Human Torch]] left the group after learning that the \"child\" his estranged wife [[Lyja (Earth-616)|Lyja]] was carrying was really a [[Sha'Barri]] assassin, as seen in {{cl|Fantastic Four #390}}-{{cl|Fantastic Four #391|391}}. The Fantastic Four were eventually drawn back together during the events of {{cl|Fantastic Four #397}}-{{cl|Fantastic Four #399|399}} and Reed was found alive and well, a prisoner of Hyperstorm in {{cl|Fantastic Four #406}}</ref>\n\nDeciding to take matters into his own hands and seeking to fill the void caused by the Fantastic Four breaking up, the Black Panther decided to finance and back a new group, dubbed the Fantastic Force. He then recruited Psi-Lord, Huntara, N'Kano (now calling himself Vibraxas), and Devlor. He set the group up in a loft located in the SoHo district of Manhattan. However this was not a smooth transition as Vibraxas had a massive superiority complex over the others, particularly Devlor, whose mannerisms and behavior offended N'Kano's sensibilities. Not long after the group was formed, the Black Panther was called to speak to the United Nations. The announcement reached his old foe [[Ulysses Klaw (Earth-616)|Klaw]] who sought to get revenge against the Panther for past defeats. When Klaw attacked the loft, he had to face off against the newly formed Fantastic Force. The group scored their first victory by putting aside their differences and fighting together as a team. Klaw was easily defeated and handed over to the authorities. In the aftermath of the battle each member agreed that they should remain together as a team, for better or for worse.{{r|Fantastic Force #1}}\n\n===Early Adventures=== \n\nThe earliest adventure of the Fantastic Force occurred when they came to the aid of [[Empire State University]] professor [[Issac Sandor (Earth-616)|Issac Sandor]], whose new Omnivirus became targeted by [[Zarathustra (Earth-616)|Zarathustra]], an agent of [[Lord Moses (Earth-616)|Lord Moses]] a powerful being who sought to create a Biblical apocalypse in order to create a new paradise on Earth for his followers. Although the team managed to stop the attack, Zarathustra managed to escape with the Omnivirus. Psi-Lord vowed to Sandor that they would recover it at all costs. Also during this adventure the Fantastic Force came into contact with [[Daily Globe]] reporter [[Paul Alvarez (Earth-616)|Paul Alvarez]], whose association with the group would lead to shocking revelations later.{{r|Fantastic Force #2}} While Vibraxas got first hand experience with American bigotry, Psi-Lord sought to put Devlor into high school to get an education and learn about human culture. Devlor soon became a target of the [[Genetic Council (Earth-616)|Inhuman Genetic Council]] who saw his ability to change between human and bestial forms as an aberration. They sent the [[Uys (Earth-616)|Seeker]] to apprehend him leading to a battle with Fantastic Force. Ultimately, the Seeker became convinced that Devlor was destined to be \"the One\", and left to report that Devlor was killed when resisting apprehension.{{r|Fantastic Force #3}}<ref group=\"note\">What exactly \"the One\" was destined to become is never fully explained as [[Fantastic Force Vol 1|Fantastic Force]] was ultimately cancelled before this plot threat could be resolved.</ref>\n\nWhen [[Advanced Idea Mechanics (Earth-616)|Advanced Idea Mechanics]] lost control of their latest [[Super-Adaptoid (Earth-616)|Super-Adaptoid]] it went on a rampage through New York City. The Fantastic Force teamed up with [[Steven Rogers (Earth-616)|Captain America]] to halt the rampage. They banished the Adaptoid to an dimensional void saving thousands of lives in the process. This victory gained Fantastic Force a great deal of popularity among New Yorkers.{{r|Fantastic Force #4}} The group later teamed up with the [[Secret Defenders (Earth-616)|Secret Defenders]] to battle [[Slorioth (Earth-616)|Slorioth]].{{r|Secret Defenders #25}} The group was later attacked by the symbiote known as [[Dreadface (Earth-616)|Dreadface]] that sought to take control of Psi-Lord's body and powers. However, Huntara forced the creature out of his body and banished it to another dimension. She also revealed that if Franklin was ever to lose control of his powers, per instructions from Warlord Kargul, she would destroy him.{{r|Fantastic Force #5}} The group later stopped a jewel heist carried out by the [[Paul Duval (Earth-616)|Grey Gargoyle]]. Not long after this, Vibraxas learned of an escalating street gang war between the Wakandan Lords and Sons of Sinanju, the Fantastic Force ventured into Manhattan's Korean district to stop a gun fight. This led to a clash with the super-powered Japanese American gang leader calling himself [[Michio Ishimori (Earth-616)|Go-Devil]]. While the gang war was stopped, Vibraxas accidentally killed a member of the Sons of Sinanju in self-defense, an act that both mortified and shamed N'Kano who strictly followed the doctrine of Wakandan culture that revered all life.{{r|Fantastic Force #6}}\n\nThe group was later approached by [[Lyja (Earth-616)|Lyja]] the estranged ex-wife of the Fantastic Four's [[Jonathan Storm (Earth-616)|Human Torch]]. She told them how the Torch was visited by an burning effigy of his sister the [[Susan Storm (Earth-616)|Invisible Woman]] warning him of a coming doom. Although she tried to join the newly reformed Fantastic Four on this mission she was left behind and sought the Fantastic Force's help tracking them down. They were also visited by the burning effigy telling the group to aid the Fantastic Four on the moon. Instead of blindly following it, Huntara detected that it was a holographic projection. The Fantastic Force followed the projection to its source, Castle Doom in Latveria, and learned that it was the product of Nathaniel Richards and his machinations. The group stopped Huntara from slaying Nathaniel and Psi-Lord lead his group to the moon. There they assisted the Fantastic Four in rescuing the Invisible Woman who was trapped in the [[Negative Zone]] following the groups battle with [[Aron (Earth-616)|Aron the Rogue Watcher]]. Huntara used her abilities to save Sue and soon both groups use a transporter to follow the [[Watchers]] who were poised to do battle against the enigmatic [[Celestials]].{{r|Fantastic Force #9}}<ref group=\"note\">The Fantastic Four battle [[Aron (Earth-616)|Aron the Rogue Watcher]] in {{cl|Fantastic Four #398}}-{{cl|Fantastic Four #399|399}}</ref> Learning that Aron was still on the lose, Fantastic Force left Devlor behind to help with the conflict between the Watchers and Celestials and joined the [[Benjamin Grimm (Earth-616)|Thing]], [[Scott Lang (Earth-616)|Ant-Man]] and [[Kristoff Vernard (Earth-616)|Kristoff Vernard]] traveled to a secret hideout between Mars and Jupiter. There they battled Aron, who used a device to pull various Fantastic Four villains out of the past to battle the heroes. They eventually stopped Aron's plot to try and destroy the universe and create a new one which he could control. While at the same time, the Fantastic Four dealt with the conflict with the Celestials. Upon their return to Earth, the members of Fantastic Force attended a funeral for [[Reed Richards (Earth-616)|Mister Fantastic]] who was believed to be deceased at the time.{{r|Fantastic Four #400}}<ref group=\"note\">Mister Fantastic seemingly perished battling Doctor Doom in {{cl|Fantastic Four #381}} however it was later revealed that they were actually prisoners of Hyperstorm and rescued by the Fantastic Four in {{cl|Fantastic Four #406}}-{{cl|Fantastic Four #409|409}}</ref>\n\n===Atlantis Rising===\nNot long after this the sorceress [[Morgan Le Fay (Earth-616)|Morgan Le Fay]] has used her mystical powers to raise the contentment of [[Atlantis]] from the ocean floor. Simultaneously, Nathaniel Richards failed to breach the [[Watcher's Citadel]] on the [[Blue Area of the Moon]], activating it's automated defenses. These defenses threatened to destroy the Inhuman city of [[Attilan]] which existed on the moon at the time. Learning that a human was responsible, the Inhuman military corps known as the [[Crimson Cadre (Earth-616)|Crimson Cadre]] traveled to Earth with an [[Atmo Gun]] to destroy humanity. While they had departed, the Fantastic Four came to the rescue of Attilan, shrinking it in size and bringing it aboard their ship the [[Stealth-Hawk]].{{r|Fantastic Four: Atlantis Rising #1}} When the Crimson Cadre materialized on the Hawaiian islands, Fantastic Force faced off against them. During the battle [[Arkadine Arcadius (Earth-616)|Lord Arcadius]] attempted to convince Devlor to join their side, but he refused and Crimson Cadre was eventually defeated and trapped within a [[Negative Barrier|Negative Zone Barrier]]. Returning home the Fantastic Force received a shot when they were visited by Paul Alvarez, who was convinced that their teammate Huntara was his long lost sister Maria.{{r|Fantastic Force #8}}\n\nAs this was happening, Nathaniel Richards succeeded in stealing the shrunken city of Attilan from the Fantastic Four while they were busy battling [[Maximus Boltagon (Earth-616)|Maximus]] and his renegade Inhumans, but was forced to take a brainwashed [[Jonathan Storm (Earth-616)|Human Torch]] with him.{{r|Fantastic Four #401}} Seeking to learn the truth about Huntara's past, the Fantastic Force tracked Nathaniel to the [[Castle Doom (Doomstadt)|Castle of Doctor Doom]]<ref group=\"note\">After the apparent demise of Doctor Doom and Mister Fantastic in {{cl|Fantastic Four #381}}, Nathaniel Richards took up residence there and was posing as Doctor Doom as part of his great plan to save the timeline.</ref>, there Nathaniel refused to answer Huntara's question and the Force was caught in a battle with the brainwashed Human Torch until Psi-Lord could use his powers to reverse the process. Still looking for answers, the elder Richards refused to provide any, stating that his plans were intended for defeating a great evil and that Franklin had an important role in the eventual conflict. Refusing to side with his grandfather, Psi-Lord was blasted by Nathaniel causing his mental powers to flare out of control. Nathaniel then tried to escape with Attilan but became a prisoner of [[Triton (Earth-616)|Triton]], Morgan le Fay's slave who also absconded with Attilan. When Franklin's powers finished flaring out of control they soon discovered this attack had a shocking side effect, a portion of his personality was now a physical manifestation of his younger self, latter dubbed the [[Tattletale (Franklin Richards Aspect) (Earth-616)|Tattletale]].{{r|Fantastic Force #9}}\n\nEventually, Fantastic Force joined the Fantastic Four, the [[Namor McKenzie (Earth-616)|Sub-Mariner]] and [[Thor Odinson (Earth-616)|Thor]] on a final strike against Morgan le Fay and her Inhuman allies. During the ensuing battle Franklin also manifested yet another personality, the [[Ego-Spawn (Earth-616)|Ego-Spawn]]. Ultimately, Morgan le Fay was defeated but Atlantis remained risen and Attilan was restored to its normal size on its surface.{{r|Fantastic Four: Atlantis Rising #2}}\n\n===The New Fantastic Force===\n\nWith Franklin's powers flaring out of control and forming yet another construct (the [[Avatar (Franklin Richards Aspect) (Earth-616)|Avatar]]), he turned over the reigns of control to his uncle the Human Torch who took on leadership of the group. The Black Panther also returned to the team after learning of the death of a youth at the hands of Vibraxas. The Torch decided to get the team back on track by locating and recovering the stolen Omnivirus before it could be used for evil means. With the help of Ego-Spawn, the group tracked Lord Moses and Zarathustra back to their hideout located beneath Mount Ararat in Turkey. Leaving Franklin behind, the group battled Zarathustra again before being captured by Lord Moses.{{r|Fantastic Force #10}} Learning that Lord Moses had stolen nuclear warheads and sought to use them with the Omnivirus to create a Biblical apocalypse, Fantastic Force broke free from their bonds and renewed their battle. During the fight, Devlor managed to climb onto one of the warheads moments before it was launched in an attempt to disable it. He was exposed to the Omnivirus, trapping him in his bestial form. Unable to destroy the missile himself, Devlor abandoned it while the Torch destroyed it with a nova blast. In the confusion, Lord Moses and Zarathustra managed to escape. Returning back to their headquarters, Huntara detected that Franklin had ventured back to Elsewhen and that there was a great danger there. The group instantly traveled to Elsewhen where they discovered it was under threat by the powerful reality destroying being known as [[Jonathan Storm (Earth-721)|Vangaard]].{{r|Fantastic Force #11}}\n\nDuring the course of the battle, Devlor seemingly perished at the hands of Vangaard and Franklin and his composites seemingly sacrificed their lives trying to destroy their foe with anti-matter energy. However the key to defeating Vangaar came when Huntara read his mind and learned that he was Johnny Storm from an [[Earth-721|alternate reality]]. Having the Human Torch confront Vangaard one on one, he managed to re-awaken his long lost humanity. Realizing that Elsewhen's time was still not yet finished, Vangaard departed without further incident.{{r|Fantastic Force #12}} As it turned out, Devlor was only pushed forward in time and Franklin was rescued by Warlord Kargul's men; had his mind restored; and provided new Psycho-Armor to regulate his powers. With Huntara deciding to stay behind, Fantastic Force returned to their native reality. There they were greeted by Johnny's longtime friend [[Wyatt Wingfoot (Earth-616)|Wyatt Wingfoot]] who asked for their help in finding out what was wrong with his ex-girlfriend the [[Jennifer Walters (Earth-616)|She-Hulk]]. Unaware that she was under the possession of [[Esteban Corazón de Ablo (Earth-616)|Diablo]], they stopped her from stealing an ancient statue called the Guardian of Chthon. Suspecting that she was under the influence of the [[Phillip Masters (Earth-616)|Puppet Master]], the group confronted him at his home. There they were embarrassed to learn that the Puppet Master was trying to turn over a new leaf and sheepishly departed after being chastised by his step-daughter [[Alicia Masters (Earth-616)|Alicia]]. Having worked well together with the She-Hulk, Fantastic Force offered her membership on the team, something she accepted. However, they would not find out she was still under Diablo's thrall until it was too late.{{r|Fantastic Force #13}}\n\nCalled to Wakanda so that Vibraxas could stand trial for the murder of the gang youth, Fantastic Force learned of the Vibranium accident that gave him his power and took the life of his mother. However, the victims of the accident were not dead, only transformed into a massive gestalt comprised of Vibranium and human flesh that was later dubbed the [[Mound Monster (Earth-616)|Mound Monster]].{{r|Fantastic Force #14}} Although the Mound Monster was ultimately stopped by the team, a combination of the battle and the on going mutagenic effects of the Omnivirus was appearing to have a fatal affect on Devlor. To make matters worse, because of the negative image created by Vibraxas killing a youth, the Black Panther was forced to pull funding from the group.{{r|Fantastic Force #15}} Rushed back to the United States, Devlor was put on life support as Professor Sandor tried in vein to try and cure him. Accepting the inevitable, the group paid their final respects and Devlor seemingly passed away. However much to their surprise his human form was reborn out of the carcass of his former form, and apparently incapable of transforming anymore. It was also at this time that Johnny returned to the Fantastic Four, returning leadership back to Psi-Lord.{{r|Fantastic Force #16}}\n\n===Disbanding===\nForced to move in with the She-Hulk, the remaining members of Fantastic Force were finally vulnerable to Diablo's trap and were kidnapped thanks to his thrall the She-Hulk. Soon they learned that Diablo was attempting to manipulate Psi-Lord into helping him defeat [[Mephisto (Earth-616)|Mephisto]].{{r|Fantastic Force #17}} While Psi-Lord was tricked into thinking he was reliving past memories, the other members of Fantastic Force managed to break free and stop Diablo's plan before it could come to fruition. With news that the Fantastic Four's Mister Fantastic had been found alive and well, Franklin returned to his family, spelling the end of Fantastic Force. {{r|Fantastic Force #18}} Not long after this, Franklin was restored back to childhood by [[Jonathan Richards (Earth-967)|Hyperstorm]].{{r|Fantastic Four #413}} Ultimately, Hyperstorm's threat was ended by the Fantastic Four.{{r|Fantastic Four #414}} \n\nLearning that Franklin was captured by the psychic entity known as [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]], the Black Panther, Devlor, Vibraxas, and Huntara reunited and reformed Fantastic Force during the [[Onslaught (Event)|Onslaught]] crisis to assist. When Franklin attempted to use his mutant powers to send a distress to his family, Onslaught intercepted it and used it to send constructs of the Fantastic Four's greatest foes against the heroes assembled at the [[Four Freedoms Plaza]]. The members of Fantastic Force came to the aid of the Fantastic Four and their allies in fighting off this invasion.{{r|Fantastic Four #416}} \n \n| Equipment               = ... {{r|Marvel Encyclopedia #Fantastic Four}}{{r|Official Handbook of the Marvel Universe: Teams 2005 Vol 1 1}}{{r|Official Handbook of the Marvel Universe A to Z Vol 1 4}}\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = <references group=\"note\" />\n| Trivia                  = \n}}"
                }
            }
        }
    ],
    "page_id": "11139"
}