{
    "pageid": 451450,
    "ns": 0,
    "title": "Fascist Italy (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Kingdom of Italy\n| Aliases                 = Italian Social Republic\n\n| Leaders                 = Formerly [[Benito Mussolini (Earth-616)|Benito Mussolini]]\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazi Germany]]\n| Enemies                 = [[David Rand (Earth-616)|Ka-Zar]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Italy]] 1922-1945\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Ben Thompson\n| First                   = Marvel Mystery Comics #15\n\n| History                 = The Kingdom of [[Italy]] was a member of the Axis powers and ally to [[National Socialist German Workers Party (Earth-616)|Nazi Germany]] in [[World War II]]. It was led by Italian Prime Minister [[Benito Mussolini (Earth-616)|Benito Mussolini]]. After the military defeat of Italy at the hands of the allied powers in 1943, the fascist regime survived as a puppet state to Nazi Germany in the northern part of Italy, the so-called Italian Social Republic. It ended with the capitulation of Germany  in 1945. \n\nBelow are the recorded accounts of Italy's encounters with the worlds wartime super-humans and other notables:\n\n=== 1940 ===\n\nIn December of 1940, Benito Mussolini or an imitator (strangely calling himself \"Benny Musciline\") worked personally with [[Adolf Hitler (Earth-616)|Adolf Hitler]] or a likewise imitator (calling himself \"Adolf Hiccup\") to coerce the [[Jim Hammond (Earth-616)|Human Torch's]] sidekick [[Thomas Raymond (Earth-616)|Toro]] to work for them in Slaveland using impostors of his deceased parents. The Torch followed after his ward and deliver a humiliating defeat, burned off \"Hiccup's\" mustache onto \"Benny's\" forehead. Realizing the errors of his way, Toro rejoined his partner in crippling the weapons manufacturing operations in Slaveland.{{r|Human Torch #3}}\n\n=== 1941 ===\n\n1941 saw many clashes between Fascist Italy and the African adventurer [[David Rand (Earth-616)|Ka-Zar]], as Italy's attempted expansion in the African region encroached on the hero's territory in the [[Belgian Congo]]. The first such encounter occurred in January of '41 when a [[Royal Air Force (Earth-616)|Royal Air Force]] pilot was flying Ka-Zar back home at the end of an adventure to America. They ended up in a dog fight with Italian fighter planes, while the British plane was shot down it succeeded in destroying all the Italian fighters.{{r|Marvel Mystery Comics #15}} \n\nLater, in June of that year, Italian forces occupying [[Ethiopia]] found one of their supply trains smashed by Ka-Zar and his animal allies.{{r|Marvel Mystery Comics #20}} In July, an Italian base preparing for an attack on British colonies in [[Kenya]] also felt the wrath of Ka-Zar and his allies. One night they stole the base's ammunition and used it to detonate a nearby dam flooding the valley the base was located, drowning all the soldiers within.{{r|Marvel Mystery Comics #21}} \n\nBy August of that year, the joint venture between the Nazis and Italy saw the construction of vast air fields in the Belgian Congo. To this end, Nazi planes dusted large tracts of jungle with poison gas to kill all the plants an animals to allow for Italian forces to clear the land and build bases. This earned the ire of Ka-Zar once more who snuck into the base wearing a stolen Italian uniform. Spotted, the hero stole a tank and wiped out the base,{{r|Marvel Mystery Comics #22}} ultimately stealing a Nazi plane and gassing the rest of the soldiers.{{r|Marvel Mystery Comics #23}}\n\n=== 1942 ===\n=== 1943 ===\n=== 1944 ===\n=== 1945 ===\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Governments]]\n[[Category:Italian Organizations]]\n[[Category:European Organizations]]\n[[Category:Empires and Civilizations]]\n[[Category:Historical Organizations]]"
                }
            }
        }
    ],
    "page_id": "451450"
}