{
    "pageid": 642664,
    "ns": 0,
    "title": "Fatalists (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Fatalists (Earth-616) from Sub-Mariner Comics Vol 1 38 0001.jpg\n| Name                    = Fatalists\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile on [[Earth]], previously [[Pluto (Planet)|Pluto]] (supposedly)\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Sub-Mariner Comics #38\n| Last                    = Sub-Mariner Comics #38\n\n| HistoryText             = The Fatalists were apparently beings that came from the planetoid [[Pluto (Planet)|Pluto]], and were sent to Earth in 1955 to try and sell death-rays to a one of the worlds governments in a plot to wipe out the human race, presumably to take over the planet. However, despite the fact that the world was going through the Cold War, none of the world governments were interested in purchasing the guns realizing that their destructive power could wipe out all life on the planet. \n\nLearning of the Fatalists' mission, but not believing their Plutonian background, [[Betty Dean (Earth-616)|Betty Dean]] summoned her sometime ally the [[Namor McKenzie (Earth-616)|Sub-Mariner]] to help stop them before they found a government willing to buy the destructive weapons. Namor, not seeing these beings as a threat to [[Atlantis]] refused to do so. However as Namor began to question his judgement he was approached by the Fatalists who sought to sell him the weapons. Refusing to be part of their plans Namor attacked but was blasted by one of their death-rays. The Fatalists then tossed Namor in the ocean, unaware that the waters would revive him.\n\nThe Fatalists then went to a nearby island nation and kidnapped the rulers son in order to ransom him, threatening to kill the boy if his father did not purchased their weapons. The ruler, like all other world leaders, refused to buy them for the same reasons even at the risk of losing is son. The boy however was saved by Namor, who used the death-rays to seemingly slaughter the Fatalists. However the Fatalists survived and were last seeing being pulled back into the air, supposedly back to the Pluto to face their rulers wrath for their failures.\n\nThe Fatalists have not been seen since, and the so-called Plutonians seemingly abandoned their attempts to conquer Earth. After the defeat of the Fatalists, Namor recovered the death-rays in the hopes of using them to conquer the surface world but found that they no longer worked.{{r|Sub-Mariner Comics #38}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Fatalists were armed with death-ray devices that could kill living creatures with a single shot. However the weapons appeared to have a lesser effect on those with enhanced strength, merely stunning Namor in a weakened state and were completely ineffective against the hero when at his peak strength.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "642664"
}