{
    "pageid": 851879,
    "ns": 0,
    "title": "Fire Patrol (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Burner_Patrol_(Earth-616)_from_Fantastic_Four_Vol_1_294.jpg\n| Name                    = Fire Patrol\n| Aliases                 = Burner Patrol\n\n| Status                  = Active\n| Alignment               = \n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = [[Central City]], [[California (State)|California]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Fantastic Four #294\n| Last                    = \n\n| HistoryText             = [[Harvey Jessup (Earth-616)|Harvey Jessup]], a scientist from [[Central City]], [[California (State)|California]], was colleagues with [[Reed Richards (Earth-616)|Reed Richards]]. While Richards went on to become the leader of the super-heroes known as the [[Fantastic Four (Earth-616)|Fantastic Four]], Jessup began using his expertise in nuclear energy to work for the [[Roxxon Energy Corporation (Earth-616)|Republic Oil and Gas Company]] (later known as Roxxon). When Jessup's manager pressured him to cut corners in the building of a nuclear reactor, Jessup refused and was then fired. With nuclear disarmament talks between the United States and Russia were not making any progress, Jessup became afraid that the world was going to be destroyed in a nuclear war. Harvey was later inspired when watching a new interview with the Fantastic Four, wherein Reed Richards expressed an interest in field-effect phenomena. This inspired Harvey to use F.E.P. to protect his people from nuclear attack. For the next six years, Harvey Jessup worked on a device he would later call the Salvation Machine. The intention was that the device would place a protective dome around Central City where time inside the dome would move slower than outside, eventually the dome would be dropped once it was safe to venture outside. When Jessup's invention was complete, he activated the device, surrounding Central City with a massive black dome that kept it separated from the outside world. Either by accident or design, the Salvation Device did the opposite it intended: It sped up time within the dome, so much so that for every second that went by outside an entire month passed within. {{r|Fantastic Four #293}}\n\nWith fifty loyal technicians, Jessup rounded up the people of Central City and placed them in a state of suspended animation. Taking on the role of Great Coordinator, Jessup began advancing his society. Jessup maintained a centuries old life thanks to being placed in suspended animation, only being taken out when absolutely necessary. His followers formed a religion based on the Fantastic Four. They then began building up the city into a massive utopia. {{r|Fantastic Four #294}} However, Harvey began to suspect something was wrong, but would not consider lowering the dome for fear that his theory of nuclear Armageddon proved to be true. {{R|Fantastic Four #295}} Hundreds of years passed within the dome and it was eventually breached by the [[Avengers (Earth-616)|Avenger]] known as [[Anthony Stark (Earth-616)|Iron Man]], who remained within Central City, hunted by Jessup's minions for three weeks before escaping back outside. {{r|Fantastic Four #293}} This prompted Jessup to create an army to defend his utopia, and engineered later generations into protectors of the realm: the [[Clobber Patrol (Earth-616)|Clobber Patrol]], the Fire Patrol, the [[Wing Patrol (Earth-616)|Wing Patrol]], and [[Head Patrol (Earth-616)|Head Patrol]]. The patrols were based upon the [[Benjamin Grimm (Earth-616)|Thing]], [[Jonathan Storm (Earth-616)|Human Torch]], Mister Fantastic, and the [[Susan Storm (Earth-616)|Invisible Woman]] respectively. The Fire Patrol were diminutive beings that could burst into flame, becoming amorphous fire balls at will.\n \nHundreds more years passed and the dome was breached by the [[Jennifer Walters (Earth-616)|She-Hulk]], who had recently replaced the Thing as a member of the Fantastic Four at the time. {{r|Fantastic Four #293}} Jessup had his minions subdue her, but his daughter [[Murna Jessup (Earth-616)|Murna]] protested, realizing that there was something not right about her father's plan. In response, Jessup had Murna exiled and the She-Hulk placed in suspended animation. {{R|Fantastic Four #295}} \n\nAfter centuries had passed within the dome, the Fantastic Four and their ally [[Wyatt Wingfoot (Earth-616)|Wyatt Wingfoot]] ended up breaching the dome to find their missing comrade, and discovered the civilization Jessup created within. {{R|Fantastic Four #293}} After battling with the various patrols, the Fantastic Four were greeted by [[Livia (Earth-616)|Princess Livia]] puppet ruler of the people. They were brought to the Grand Controller, who Richards had figured out was his old colleague. At first believing that they were impostors, Jessup decided to try and destroy the Fantastic Four instead of losing his position as a savior. {{r|Fantastic Four #294}} The Invisible Woman was able to protect them with their invisibility powers and they were soon assisted in escaping by Murna. Murna in turn helped the Fantastic Four confront her father and free She-Hulk. During the ensuing battle against the Grand Coordinator, Murna was able to mind link Harvey with Reed Richards and force him to see the truth. Realizing the errors of his ways, Jessup agreed to let the people of Central City go free from suspended animation and go their own way with the Fantastic Four. Harvey died soon after, and the Fantastic Four freed Jessup's prisoners. Reed then used the Salvation Machine to send the future world of Central City deep into the future where it hopefully could thrive in peace.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "851879"
}