{
    "pageid": 444063,
    "ns": 0,
    "title": "Fire-Men (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Fire-Men (Earth-616) from Marvel Mystery Comics Vol 1 14 0001.jpg\n| Name                    = Fire-Men\n| Aliases                 = \n\n| Status                  = \n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]; [[Tibet]]\n\n| Leaders                 = \n| CurrentMembers          = Many unnamed followers\n| FormerMembers           = Kalif, Culfra, Ronald\n| Allies                  = [[Jim Hammond (Earth-616)|Human Torch]]\n| Enemies                 = [[Fire-Monsters]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Carl Burgos\n| First                   = Marvel Mystery Comics #14\n| Last                    = Marvel Mystery Comics #15\n\n| HistoryText             = The Fire-Men who supposedly have their origins among the lamas of Tibet. Learning to master fire, each of its senior members learned how to become impervious to flame and heat. It is told that for many centuries the Fire-Men were charged with the responsibility of protecting the [[Homo sapiens|human race]] from the [[Fire-Monsters]]. In the late 1930's, a wealthy man named Ronald was on a scientific expedition and got separated from his team. He was rescued from the mountains by the Fire-Men and learned all of their secrets.\n\nHe eventually returned to his home in [[New York City]], where he was -- or so has been accused of -- attempting to use the Fire-Men's secrets to use against humanity. This brought members Kalif and Culfra to their temple in New York. When they destroyed the home of Ronald, they clashed with the android [[Jim Hammond (Earth-616)|Human Torch]] who failed to prevent Kalif from slaying Ronald.\n\nInvited to the temple to talk, Kalif attempted to explain to the Torch the reasons why he slew Ronald and the role of the Fire-Men. The Torch did not believe him until he dropped into a pit with one of the Fire-Monsters, whom the Torch single-handedly destroyed. Now believing Kalif, the Human Torch lent his services to their aid.{{r|Marvel Mystery Comics #14}}\n\nThe threat of the Fire-Monsters hit New York when a series of crimes involving the creatures struck the area. As it turned out, Fire-Men member Culfra was using the beasts to carry out his crimes hoping that the Human Torch would be blamed for them. When Kalif learned the truth, Culfra fatally shot him, but not before the Torch had his suspicions confirmed. The Human Torch destroyed the Fire-Monsters in Culfra's control and defeat Culfra, turning him over to the authorities to stand trial for his murders.{{r|Marvel Mystery Comics #15}}\n\nCulfam was placed in jail where he befriended the criminal known as the [[Parrot (Earth-616)|Parrot]]. Teaching the Parrot his knowledge of fire, the two attempted to break out of jail together. During the escape, the Parrot betrayed Culfam leaving him to be shot and recaptured by the prison guards. Later, while being interrogated by the Human Torch and [[Thomas Raymond (Earth-616)|Toro]], Culfam attempted to warn the Torch of the Parrot's plans before dying.{{r|Marvel Mystery Comics #24}}\n\nThe current activities of the remaining Fire-Men remain unrevealed.\n\n| Abilities               = Fire-Men who have completed their training would become resistant to flames as well as heat. Kalif showed the ability to handle a fireball thrown by the Human Torch, as well as be able to subdue him while the hero's flames were ignited. Muttering a special chant, a Fire-Man could make flames burn blue, that would burn faster and stronger than conventional flames. These blue flames were incapable of being controlled by the Human Torch. \n| Equipment               = Fire-Men had access to special gases that they could use to put out flames. Presumably, all their clothing are fireproofed.\n| Transportation          = \n| Weapons                 = The Fire-Men sometimes wield Flame Whips, devices that create whip tails of flame. A flame whip has been shown to create two separate whip-tails. The full number of tails it can create remains unrevealed. \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "444063"
}