{
    "pageid": 12171,
    "ns": 0,
    "title": "Fireproof Natives (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Fireproof Natives (Earth-616) from Fantastic Four Vol 1 9 001.jpg\n| Name                    = \n| Aliases                 = Fireproof Natives\n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Africa]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Jonathan Storm (Earth-616)|Human Torch (Johnny Storm)]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four #9\n| Last                    = Fantastic Four #9\n\n| HistoryText             = The Fireproof Natives lived in the jungle, somewhere in [[Africa]]. They ingested a potion, giving them immunity to flame. [[Namor McKenzie (Earth-616)|Sub-Mariner]] arranged for the natives to attack the [[Jonathan Storm (Earth-616)|Human Torch]] after Namor had feigned the production of a movie starring the [[Fantastic Four (Earth-616)|Fantastic Four]]. Namor sent the Human Torch to Africa to film scenes with a local tribe.<!-- {{r|Fantastic Four #9}} -->\n\nThe natives were not frightened by the Human Torch. They captured him in and placed him in a bamboo cage. Torch later regained his strength, burned through the cage, and flew away. The natives tried to seize him again, but the Torch continued flying into a nearby volcano, where he triggered an eruption. The eruption caused the natives to evacuate their village, and the resulting lava destroyed all of their potion.{{r|Fantastic Four #9}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Fireproof Natives possessed normal human strength. \n;Immunity to Fire: The members of this tribe formerly possessed a magical potion which rendered them immune to flame. They could not be harmed or even feel pain from fire, and could swallow flames down their throat\n;Flameproof Spears: The members of this tribe also possessed spears which had been dipped in the flameproof potion.\n| Notes                   = \n| Trivia                  = \n| Links                   = * [http://www.marvunapp.com/Appendix3/fireproofnatives.htm Fireproof Natives at the Marvel Appendix]\n}}\n[[Category:Silver-Age Characters]]\n[[Category:African Tribes]]"
                }
            }
        }
    ],
    "page_id": "12171"
}