{
    "pageid": 482432,
    "ns": 0,
    "title": "Firing Squad (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Firing Squad (Earth-616) from Sub-Mariner Comics Vol 1 7 0001.jpg\n| Name                    = Firing Squad\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Danny Poll (Earth-616)|Danny Poll]] (Deceased)\n| CurrentMembers          = \n| FormerMembers           = [[Danny Poll (Earth-616)|Danny Poll]], unnamed members\n| Allies                  = \n| Enemies                 = [[Thomas Halloway (Earth-616)|Angel]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gustav Schrotter\n| First                   = Sub-Mariner Comics Vol 1 7\n| Last                    = Sub-Mariner Comics Vol 1 7\n\n| HistoryText             = In the year 1927, Private Danny Poll became jealous of his superior officer Lieutenant Callen due to their rivaling affections for a girl name Marie. Not liking being spoken down to by a low ranking officer, Callen started a fight. Mad with rage, Poll attempted to bash Callen's brains out with a rock, but the two were pulled apart by other military staff. For attempting to kill his superior officer, Poll was court-martialed and was spared the firing squad due to the fact that they were not in a war. Instead, Poll was sentenced to 15 years in solitary confinement. As Danny rotted in prison, he vowed to get revenge unaware that Callen married Marie, and the two actually attempted to get Danny freed from prison but were unsuccessful due to the red tape.\n\nDanny was freed in the fall of 1942 and began thinking up how to get revenge against Callen for putting him behind bars. Unable to get the idea of a firing squad out of his head, Danny spotted a bank robbery in progress and noted the mobsters' sloppy execution. Thinking he could train the crooks to be more efficient, Danny jumped on the back of their vehicle and rode to their farmhouse hideout. There, Danny found that one of the mobsters carelessly left his tommy gun in the car. Entering the house, he overheard an altercation brewing between the mobsters and their boss who insisted on taking 50% of their haul even though he did nothing on the job. Danny burst in and shot the mob leader dead, then made the gang an offer they could not refuse: Let him give them military training to make them more efficient, and he will split all of their ill gotten gains evenly. The mobsters accepted the offer and the Firing Squad was born.\n\n[[File:Danny Poll (Earth-616) from Sub-Mariner Comics Vol 1 7 0001.jpg|thumb|114px|Danny Poll]]\nAfter extensive training and creating their own uniforms, the Firing Squad robbed a bank. They were opposed by the [[Thomas Halloway (Earth-616)|Angel]], but they managed to escape. However, Danny managed to accidentally drop his wallet at the scene of the crime. The Angel used this to track Danny down to his room at the Hotel Regent. There, the hero clashed with the Firing Squad but was tossed out of the 10th floor window of the hotel room. Danny then began plotting his next scheme: This one targeting Callen (now a Major) who recently inherited his family's fortune. Knowing that Callen now had a son, he intended to kidnap the boy for ransom and then murder Callen when the ransom was paid.\n\nUnaware that the Angel had survived and overheard this, the Firing Squad had to face the hero and the police at the Callen home. During the fight, Danny was confronted by Marie, and this reunion -- plus the realization that she had married Callen and birthed the child he had come to kidnap -- distracted Danny enough to be captured by the authorities but the rest of his mob managed to escape. \n\nWhen Danny was brought to court, the rest of the Firing Squad stormed the court house and freed their leader. They also managed to capture Cullen's son and make a clean getaway. They later sent a ransom note demanding that they get paid $50,000 for the safe release of the Callen child, the money to be delivered to their farmhouse by Callen himself. There, Callen was put through a mock trial and \"sentenced\" to death by firing squad. However, before they could execute Callen, the Angel once more intervened.\n\nDuring the fight, the police arrived with Marie, and while the Angel sent Callen and his son to safety, Marie confronted Danny. When Danny attempted to shoot Callen, Marie stood in the way of his bullets and was fatally wounded instead. Realizing the horrible mistake he had made, Danny then walked into the cross fire between his gang and the police and was mowed down. The Angel then helped the authorities round up the rest of the gang, who crumbled easily with their leader now dead.{{r|Sub-Mariner Comics Vol 1 7}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Firing Squad were originally armed with tommy guns. However, when they were led by Danny Poll, they began wielding military rifles.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "482432"
}