{
    "pageid": 2942,
    "ns": 0,
    "title": "First Line (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = First Line (Earth-616) from Official Handbook of the Marvel Universe Teams 2005 Vol 1 1 001.jpg\n| Name                    = First Line\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Originally Rocky Mountains, [[Colorado (State)|Colorado]]; later [[Carmody Institute]]\n\n| Leaders                 = Originally [[Patrick Carney (Earth-616)|Yankee Clipper]], later [[Velmax (Earth-616)|Effigy]], [[Robert Paine (Earth-616)|Black Fox]]\n| CurrentMembers          = \n| FormerMembers           = [[Robert Paine (Earth-616)|Black Fox]], [[Blackjack (Earth-616)|Blackjack]], [[Doctor Mime (Earth-616)|Doctor Mime]], [[Velmax (Earth-616)|Effigy]], [[William Carmody (Earth-616)|Eternal Brain]], [[Firefall (First Line) (Earth-616)|Firefall]], [[Flatiron (Russell) (Earth-616)|Flatiron]], [[Frankenstein's Monster (Earth-616)|Frank]], [[Katyusha (Anya) (Earth-616)|Katyusha]], [[Liberty Girl (Beverly) (Earth-616)|Liberty Girl]], [[Makkari (Earth-616)|Major Mercury]], [[Timothy Carney (Earth-616)|Kid Justice/Mr. Justice]], [[Morph (First Line) (Earth-616)|Morph]], [[Nightingale (Earth-616)|Nightingale]], [[Sam Matonabbe (Earth-616)|Oxbow]], [[Pixie (Eternal) (Earth-616)|Pixie]], [[Positron (Veronica) (Earth-616)|Positron]], [[Rapunzel (Earth-616)|Rapunzel]], [[Rebound (Earth-616)|Rebound]], [[Reflex (First Line) (Earth-616)|Reflex]], [[Riot-Act (Earth-616)|Riot Act]], [[Squire (Earth-616)|Squire]], [[Ian Fitzwilliam Dare (Earth-616)|Templar]], [[Vulcan (First Line) (Earth-616)|Vulcan]], [[Walkabout (Earth-616)|Walkabout]], [[Patrick Carney (Earth-616)|Yankee Clipper]], [[Yeti (Inhuman) (Earth-616)|Yeti]], others unspecified \n| Allies                  = [[Cassandra Locke (Earth-700)|Dr. Cassandra Locke]], [[Monster Hunters (Earth-616)|Monster Hunters]], [[Thor Odinson (Earth-616)|Thor]], [[Nicholas Fury (Earth-616)|Nick Fury]], [[Stephen Strange (Earth-616)|Doctor Strange]], [[Fred MacRae (Earth-616)|Cap'n Hip]], [[Autumn MacRae (Earth-616)|Sunshine]], [[Aphrodite Ourania (Earth-616)|Venus]]\n| Enemies                 = [[Skrulls]], [[Zuhn (Earth-616)|Chimera]], [[Red Front (Earth-616)|Red Front]], [[Plan Chu (Earth-616)|Yellow Claw]], [[Rumor (WWII) (Earth-616)|Rumor]], [[Luke Garrow (Earth-616)|Howler]], [[Typhoon (Lost Generation) (Earth-616)|Typhoon]], [[Axis (Earth-616)|Axis]], [[Scythe (Lost Generation) (Earth-616)|Sythe]], [[Nocturne (Earth-616)|Nocturne]], [[Nathaniel Richards (Kang) (Earth-6311)|Kang]], [[Kro (Earth-616)|Warlord Kro]], [[Deviants (Race)|Deviants]], \n\n| Origin                  = \n| PlaceOfFormation        = [[Long Island]], [[New York]] \n| PlaceOfDissolution      = [[Skrulls|Skrull]] battleships in orbit over Earth's Moon\n| Creators                = Roger Stern; John Byrne\n| First                   = Marvel: The Lost Generation #12 \n| Last                    = Marvel: The Lost Generation #1 \n\n| HistoryText             = ===Origins===\n\nThe First Line was a group of super-heroes who were active from the 1950s until the 1980s. Their roots began in 1953, when engineer [[Patrick Carney (Earth-616)|Patrick Carney]] began working at Operation: Deep Freeze, the project that kept the 1950s [[William Burnside (Earth-616)|Captain America]] and [[Jack Monroe (Earth-616)|Bucky]] in stasis, compelling him to hope that someone would take the place of his childhood hero. One night while driving home, he nearly ran over [[Cassandra Locke (Earth-700)|Cassandra Locke]], a time traveler from the 22nd Century of [[Earth-700]] who had been traveling through the Cold War era to learn what she could about Earth's interactions with [[Skrulls]] during the end of the 20th Century. Fatally wounded, Locke told Carney of his future destiny and the threat of the Skrulls, passing along her data disc and telling him to hide it aboard the Apollo 11 rocket that was destined to land on the moon in the future, so that the people of her era could recover it. Locke died while being treated in a charity hospital, passing along her time traveling Tachyon Belt to Carney. Although Carney could not activate its time travel capabilities, he learned how to use it to boost his strength and became the costumed hero Yankee Clipper.{{r|Marvel: The Lost Generation #1}}\n\n[[File:First Line (Earth-616) and Monster Hunters (Earth-616) from Marvel The Lost Generation Vol 1 2 0001.png|thumb|left|Black Fox, Yankee Clipper, Miss Liberty, and Agent Jacob Scott circa 1958]]\nYankee Clipper was the founder of the First Line, taking the name as he believed that the group was America's \"First Line of Defense\" against those who would endanger the country. The founding members included the costumed crime fighters [[Robert Paine (Earth-616)|Black Fox]], [[Liberty Girl (Beverly) (Earth-616)|Liberty Girl]] and the precognizant healer known as [[Nightingale (Earth-616)|Nightingale]]. The group was formed when the heroes were gathered by Defense Department agent [[Velmax (Earth-616)|Jacob Scott]], who unknown to them was a Skrull spy named Velmax who had been stranded on Earth since 1947 and been gathering information for an impending Skrull invasion and was using his position in the Defense Department to locate his ship after it was taken into government property. They went to investigate a \"security breach\" and encountered the [[Monster Hunters (Earth-616)|Monster Hunters]] who had detected a monster in the area. While the team battled the mutated humans, \"Scott\" attempted to secure the ship and found it about to be stolen by another [[Zuhn (Earth-616)|Skrull spy]] along with criminals [[Blackjack (Earth-616)|Blackjack]] and [[Scythe (Lost Generation) (Earth-616)|Scythe]]. The spy escaped and Velmax was blasted by the ship's defenses, causing him to shift back to his Skrull form. After being healed by Nightingale, Velmax pretended that the defense system had mutated him like the monster they fought earlier, joined the group taking on the name Effigy, and brought the group into official standing with the United States government.{{r|Marvel: The Lost Generation #2}} After this mission, Black Fox decided to retire from heroics to marry his girlfriend Miriam. However, when she was murdered before his eyes by the villain named [[Nocturne (Earth-616)|Nocturne]], the Black Fox returned to the group darker and grittier than before.{{r|Marvel: The Lost Generation #8}}\n\n===1960s===\nBy the spring of 1961, the team added the [[Eternals (Race)|Eternal]] [[Pixie (Eternal) (Earth-616)|Pixie]] to their ranks. Also joining the team as an honorary member was Yankee Clipper's brother [[Timothy Carney (Earth-616)|Tim]], who went under the name Kid Justice. Upon hearing the news of the United States' plans to launch a rocket to the moon by the end of the decade, Yankee Clipper confided in his kid brother to carry out the mission Cassandra charged him with in the event that something happened to him. The group were dispatched to San Francisco where they assisted the [[Fred MacRae (Earth-616)|Hipster]] in battling the [[Plan Chu (Earth-616)|Yellow Claw]] who was attempting to manipulate the amnesiac [[Namor McKenzie (Earth-616)|Sub-Mariner]] in one of his attempts at conquering the world. The group foiled Yellow Claw's plans unaware that they were being observed by Cassandra Locke. Accepting defeat, Yellow Claw detonated his base seemingly slaying himself and Sub-Mariner, but both later resurfaced alive. Cassandra flipped backward in time, the blast seriously injuring her and sending her to her fateful meeting with Patrick Carney almost a decade into the past. The team was saved from the explosion thanks to Yankee Clipper's belt creating a force-field.{{r|Marvel: The Lost Generation #3}}\n\n[[File:First Line (Earth-616) from Marvel The Lost Generation Vol 1 4 0001.png|thumb|294px|Team circa 1969: Mister Justice, Nightingale, Blackjack, Firefall, Pixie, Effigy and Oxbow]]\nIn late 1963 Kid Justice was awarded full membership on the team and began training with Black Fox and Yankee Clipper. Pixie had also recruited Aboriginal Canadian strong man [[Sam Matonabbe (Earth-616)|Sam Matonabee]] who later joined team as Oxbow. In addition to this, Effigy took on the role of leader. On November 21, Nightingale received a premonition that something was to happen the next day in Dallas Texas. Suspecting that [[John F. Kennedy (Earth-616)|President Kennedy]] might be in danger, the group flew to Dallas. There they clashed with two super-powered criminals: the shape-changing Chimera and the [[Luke Garrow (Earth-616)|Howler]]. The pair were attempting to steal a newly developed guidance system that was developed by [[Stark Industries (Earth-616)|Stark Industries]]. While most of the team battled Howler, Effigy battled Chimera alone. On fatally wounding Chimera he learned that his foe was really his commanding officer Zuhn, who had been secretly recovering in a Skrull med-pod that was in the custody of the US military. By this time, Effigy had come to enjoy his life on Earth, putting him at odds with his mission, and he secretly disposed of Zuhn's body so nobody would suspect. While this was happening, Liberty Girl was mortally wounded by Howler. Cassandra Locke also appeared in this time, marking the first meeting between the First Line and the time traveller. The tachyon belts that both Locke and Yankee Clipper wore reacted when in close proximity sending both into the future. Effigy took control of the team and left Dallas, making the team unable to prevent Lee Harvey Oswald from assassinating President Kennedy.{{r|Marvel: The Lost Generation #4}}\n\nIn the mid-60s, the group expanded their ranks to include Pixie's fellow Eternal [[Makkari (Earth-616)|Makkari]] who operated under the name Major Mercury, the man-monster [[Frankenstein's Monster (Earth-616)|Frank]] and the flying [[Rebound (Earth-616)|Rebound]]. The group was later approached by the [[Asgardians|Asgardian]] thunder god [[Thor Odinson (Earth-616)|Thor]], who had been sent to Earth by his father [[Odin Borson (Earth-616)|Odin]] to deal with an impending crisis. This crisis turned out to be the work of [[National Socialist German Workers Party (Earth-616)|Nazi]] war-criminal the [[Rumor (WWII) (Earth-616)|Rumor]] who was using his powers to manipulate the [[Olympians|Olympian]] love goddess [[Aphrodite Ourania (Earth-616)|Venus]] into turning children into an obedient army. The group stopped the Rumor with the assistance of Thor and the solo heroes Hippy (formally the Hipster) and [[Autumn MacRae (Earth-616)|Sunshine]].{{r|Marvel: The Lost Generation #5}}\n\nBy 1969 the group expanded further to include Russian defector [[Katyusha (Anya) (Earth-616)|Katyusha]], reformed criminal Blackjack, and the flame wielding [[Firefall (First Line) (Earth-616)|Firefall]]. Having reached adulthood, Kid Justice -- having become dedicated to proving that he was as great a hero as his older brother -- changed his identity to Mister Justice. With the announcement of the Apollo 11 mission to the Moon, Justice used his leverage and government connections to have the data disc passed onto him by his brother to be planted on the Apollo lander. However this proved to be an unnecessary effort as Effigy had learned that Skrull spies were attempting to sabotage the Apollo mission to ruin the human race's faith in space travel. Effigy by this time had repaired his Skrull saucer to allow them to fly to the Moon and the team went to intercept the Skrulls. However the Skrulls had hired on human super-villains including Howler, Scythe, [[Positron (Veronica) (Earth-616)|Positron]], [[Typhoon (Lost Generation) (Earth-616)|Typhoon]] and [[Axis (Earth-616)|Axis]]. While Effigy went to confront his fellow Skrulls aboard their vessel, the First Line battled the villains. Having completely embraced his human identity, Velmax slew the other Skrulls and destroyed their ship, while Howler, Axis and Typhoon were slain in battle. With Positron and Scythe as their prisoners the First Line returned to Earth, with Effigy warning them of the danger of the Skrulls.{{r|Marvel: The Lost Generation #6}}\n\n===1970s===\nIn the following decade more super-heroes joined the ranks of the First Line, including the armour wearing [[Ian Fitzwilliam Dare (Earth-616)|Templar]], energy wielding [[Vulcan (First Line) (Earth-616)|Vulcan]], kinetic energy manipulator [[Reflex (First Line) (Earth-616)|Reflex]] and the armored [[Flatiron (Russell) (Earth-616)|Flatiron]]. When the investigation into the Watergate scandal was beginning, some of the team went up against their old foe Nocturne who attacked the team with a group of [[Zombies]] disguised as the [[World War II]] heroes the [[Invaders (Earth-616)|Invaders]] and the [[Johann Shmidt (Earth-616)|Red Skull]]. Meanwhile, Nixon was pressuring the First Line to fall in line with his government, threatening Effigy and Black Fox the identities of the team would be revealed to the public if they were not kept in line. In order to get Nixon off their back, Black Fox convinced Effigy to shut the president down by revealing his involvement in Watergate. After much thinking Effigy did just that, becoming the informant known as Deep Throat who exposed Nixon's involvement to Washington Post writer Bob Woodward. Also during this turbulent time Templar retired from the group in order to get married.{{r|Marvel: The Lost Generation #7}} Later that decade, Black Fox and Pixie worked together with apprentice magician [[Stephen Strange (Earth-616)|Doctor Strange]] to stop Nocturne from stealing the alchemy secrets hidden the castle of 19th century alchemist [[Esteban Corazón de Ablo (Earth-616)|Diablo]], they also prevented Diablo from escaping from his prison.{{r|Marvel: The Lost Generation #8}}\n\n===1980s===\n[[File:First Line (Earth-616) from Marvel The Lost Generation Vol 1 12 0001.png|thumb|left|1980s: Katyusha, Pixie, Templar, Reflex and Vulcan]]\nFollowing the impeachment of Richard Nixon, the First Line went underground and operated on mostly covert missions. By the 80s, Positron had reformed and joined the team, starting a relationship with Blackjack. When Mr. Justice went to rescue American diplomats who were being held as prisoners in the Middle Eastern nation of [[Halwan]] he was captured and tortured. Effigy then sought out the help of the [[William Carmody (Earth-616)|Eternal Brain]] to assist on a mission to rescue Mister Justice. During the mission, Blackjack was killed by the warrior [[Scimitar (Earth-616)|Scimitar]]. Also during the battle the group was visited by Cassandra Locke who was still in the earlier stages of her investigation into the past. However, Mister Justice managed to escape on his own and the First Line was forced to retreat. Angry at the outcome of the mission the Black Fox quit the team and went into retirement.{{r|Marvel: The Lost Generation #9}}\n\nWith the Eternal Brain joining the group, they were invited to use the Carmody Institute as their secret headquarters. At some point during this period the team battle the time traveling [[Nathaniel Richards (Kang) (Earth-6311)|Kang the Conqueror]] although the details of this battle are unknown. The group also expanded further including the hair growing [[Rapunzel (Earth-616)|Rapunzel]], the [[Inhumans (Inhomo supremis)|Inhuman]] [[Yeti (Inhuman) (Earth-616)|Yeti]] and the shape-shifting [[Morph (First Line) (Earth-616)|Morph]]. The Eternal Brain also began growing a new body and built the robot [[Walkabout (Earth-616)|Walkabout]] in order to fight with the team, hidden inside the robot's massive frame. The group's base was infiltrated by CIA agent [[Nicholas Fury (Earth-616)|Nick Fury]] as well as an army of [[Deviants (Race)|Deviants]] led by [[Kro (Earth-616)|Warlord Kro]] who had come seeking to kill Pixie. During the battle with the Deviants, the team was visited once more by Cassandra Locke at one of the earliest points in her trips through time. After the battle was over, she warned the team of the impending Skrull invasion of Earth. However when they questioned the authenticity of her claims she decided to travel further back in time to try and see what she could do in the past to prevent the invasion from succeeding. Sometime later, the Yeti left the team for reasons that are unknown. He went to live in solitude in the Himalayas mountains outside of the Inhumans' Great Refuge.{{r|Marvel: The Lost Generation #10}}\n\n[[File:First Line (Earth-616) from Marvel The Lost Generation Vol 1 9 (Cover).png|thumb|202px|Flatiron, Reflex, Black Fox, Oxbow, Pixie, Positron, Blackjack and Nightingale circa 1980s]]\nA few years later, members of the First Line battled Nocturne again, this time in New York City's [[Baxter Building]] where Nocturne had created a alchem-tech virus that threatened to consume the city. However, the team destroyed the virus and seemingly slew Nocturne, but not before the top seven floors of the building were destroyed in the process. Also during this time, as part of their invasion plans, a female Skrull was sent to seduce the Yeti, the purpose of this plot is unspecified, but was likely a means to stop the team from interfering with their invasion plans. Meanwhile, a Skrull spy captured by scientist [[Reed Richards (Earth-616)|Reed Richards]] was turned over to Effigy for questioning, who learned of the impending invasion. During this time the group included the mysterious [[Doctor Mime (Earth-616)|Doctor Mime]].{{r|Marvel: The Lost Generation #11}} In 1986, the Yankee Clipper reappeared, having been launched forward in time from 1963. He was quickly reunited with his brother Mr. Justice and the rest of the team. However, finding himself a man out of time Clipper decided to retire and accustom himself to the future time he found himself in, Pixie came to his aid to help him fit in.{{r|Marvel: The Lost Generation #1}}\n\nWhen the invasion finally came, the First Line gathered all their surviving members past and present as well as their various foes to work together to stop the invasion, boarding the mothership in an attempt to stop it. Among those involved in the battle included Nightingale, Flatiron, Reflex, Oxbow, Pixie, Mister Justice, Black Fox, Firefall, Positron, Templar, Effigy, Vulcan, as well as new additions [[Squire (Earth-616)|Squire]] (the son of Templar), [[Truth MacRae (Earth-616)|Gadfly]] the mutant daughter of Hippy and Sunshine, the biologically engineered [[Atlanteans|Atlantean]] warrior [[Mako (First Line) (Earth-616)|Mako]] and the foul mouthed [[Riot-Act (Earth-616)|Riot-Act]] as well as their old foe Nocturne. Also aboard the ship, fighting for the Skrulls was the Yeti. The battle was witnessed by Cassandra Locke who was arriving on her first jump into the past and witnessed the battle. Effigy was mortally wounded trying to set warp-feed phase-shifters to destruct. Dying he reverted back into his Skrull form before Pixie and Oxbow telling them he tried to be a good American before he died. Pixie then set the destruct sequence, the resulting explosion destroyed the entire alien fleet and seemingly slew all those who had not already died in battle.{{r|Marvel: The Lost Generation #12}}\n\n===Legacy===\nWith the death of the First Line, the people of Earth believed that the group simply vanished without a trace, unaware of the fact that they saved the world. The [[Daily Bugle|Daily Bugle's]] [[John Jonah Jameson (Earth-616)|J. Jonah Jameson]] referred to the group as \"cowards\" for suddenly disappearing.{{r|Marvel: The Lost Generation #1}}\n\nHowever, although the team was decimated there were a number of survivors. This included Yankee Clipper who was not present during the battle and have apparently remained in retirement.{{r|Marvel: The Lost Generation #1}} The Yeti managed to escape back to Earth and resumed living in solitude in the Himalayas.{{r|Marvel: The Lost Generation #7}} Due to her nature as an Eternal, Pixie survived the exploding ship and returned to Earth.{{r|Marvel: The Lost Generation #1}} Also surviving was the Eternal Brain, who was seemingly slain, but survived because he was also secretly an member of the Eternals.{{r|Marvel Zombies Destroy! #1}} Also alive is the Eternal Makkari, who was also not present during the battle. It is possible that Frank might in all actuality be the original Frankenstein's Monster, however any connection between the two is speculative at best at this time.{{r|Official Handbook of the Marvel Universe A to Z Vol 1 4}}\n\nA number of members of the First Line are unaccounted for, and their fates are unknown, such as Reflex, who was seen during the final battle but his ultimate fate is unknown, and he may have survived and escaped prior to the Skrull ships exploding.{{r|Marvel: The Lost Generation #12}} The fates of Rapunzel, Doctor Mime, Morph, Katyusha and Rebound were not present in the final battle, and their fates are unknown.\n\nIn at least the future of Earth-700, the data collected by Cassandra Locke was placed on the Apollo 11 mission by the First Line ended up in the hands of Cassandra's lover [[Eugene Omega-20 (Earth-700)|Eugene Omega-20]] who exposed that the Skrulls of that era were still plotting to conquer the Earth under the auspices that they were trying to forge peace.{{r|Marvel: The Lost Generation #1}}\n\n| Equipment             = \n| Transportation          = [[Skrull Scoutship (First Line)|Skrull Scoutship]], various conventional automobiles, aircraft and spacecraft. Some of their vehicles may have been provided by [[Makkari|Major Mercury]].\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n==Recommended Readings==\n* [[Marvel: The Lost Generation Vol 1|Marvel: The Lost Generation #12-1]] (the limited series is numbered in reverse; #12 is actually the first issue, #11 the second issue, etc.)\n\n| Links                   = \n* [[Wikipedia:Marvel: The Lost Generation|Marvel: The Lost Generation article at Wikipedia]]\n* [https://web.archive.org/web/20080820020606/http://www.lostgenerationhandbook.com The Lost Generation: Unofficial Handbook]\n*[https://web.archive.org/web/20080820020606/http://www.lostgenerationhandbook.com Unofficial Guide to the Lost Generation Universe]\n*[http://www.marvunapp.com/Appendix6/first_line.html Marvel: The Lost Generation] at Appendix to the Handbook of the Marvel Universe\n* [[:Category:First Line members|First Line roster]]\n* OHMU Teams 2005, 2005, MARVEL COMICS GROUP © \n}}\n[[Category:Lost Generation]]"
                }
            }
        }
    ],
    "page_id": "2942"
}