{
    "pageid": 484214,
    "ns": 0,
    "title": "Fish Brothers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Fish Brothers (Earth-616) from Marvel Mystery Comics Vol 1 39 0001.jpg\n| Name                    = Fish Brothers\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Connecticut (State)|Connecticut]]\n\n| Leaders                 = \n| CurrentMembers          = Carpo, Spiko, Bungo, Tuno\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Thomas Halloway (Earth-616)|Angel]]\n\n| Origin                  = Born with green scales and amphibious abilities. Possibly mutants.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gustav Schrotter\n| First                   = Marvel Mystery Comics Vol 1 39\n| Last                    = Marvel Mystery Comics Vol 1 39\n\n| HistoryText             = The Fish Brothers were all brothers born with the same grotesque deformities: Fish scales instead of skin and amphibious qualities that allowed them to survive on land as well as underwater. The quartet of brothers were made fun of since they were young, and as adults, the only jobs they were able to secure were at the circus freakshow. Longing to be human again, one of the four brothers began studying medicine so that he could perform operations to graft normal human skin onto the bodies of himself and his brothers.\n\nThis brother completed his training by early 1943, and they went to work: returning to their Connecticut home, they constructed a lower level below the water near the property. To the untrained eye, it appeared as nothing more than a mirror reflection of the upper levels of the house on the water. They then began capturing men who were fishing on the waters near their home. Locking them up in a dungeon, the fishermen were kept alive, and in good health until it was time to perform a skin graft, the process proved fatal. Since the brothers stopped harvesting skin as soon as their victim died, they had to capture many fishermen.\n\nTheir activities stumped local law enforcement and attracted the attention of the [[Thomas Halloway (Earth-616)|Angel]] who flew down to investigate. While searching the Fish Brothers' house, he was attacked, easily subdued underwater, and dragged into the house. He was then pushed ahead of the others to have his skin harvested for grafting as well. In the lab where the Fish Brothers' horrific procedure were carried out, the hero learned of their history and what they were up to. The Angel then broke free from his bonds and beat the Fish Brothers into submission. He then turned them over to the authorities.{{r|Marvel Mystery Comics Vol 1 39}}\n\nThe subsequent fate of the Fish Brothers remains unrevealed.\n\n| Equipment               = The Fish Brothers had surgical equipment to carry out their grizzly operations.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "484214"
}