{
    "pageid": 5815,
    "ns": 0,
    "title": "Folding Circle (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Folding Circle (Earth-616) from New Warriors Vol 1 22 001.jpg\n| ImageSize               = 300\n| Name                    = [[Folding Circle]]\n| Aliases                 = Children of the Pact\n\n| Status                  = Active\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Aaron Chord (Earth-616)|Midnight's Fire]]; Formerly [[Diego Casseas (Earth-616)|Left Hand]], [[Dwayne Taylor (Earth-616)|Night Thrasher]]\n| CurrentMembers          = [[Aaron Chord|Midnight's Fire]], [[Min Li Ng (Earth-616)|Silk Fever]],  [[Eric Conroy (Earth-616)|Bloodstrike]],  [[Conrad Mack (Earth-616)|Smiling Tiger]]\n| FormerMembers           = [[Diego Casseas (Earth-616)|Left Hand]], [[Dwayne Taylor (Earth-616)|Night Thrasher]]\n| Allies                  = \n| Enemies                 = [[Tai (Well of All Things) (Earth-616)|Tai]], [[New Warriors (Earth-616)|New Warriors]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Fabian Nicieza; Mark Bagley\n| First                   = New Warriors #21\n| Last                    = \n\n| HistoryText             = In 1966 during the [[Vietnam War]], an American recon patrol in Cambodia stumbled upon the ancient, hidden temple of a cult known as the Dragon's Breadth, which had remained hidden for centuries. It had been built upon a well-spring of raw, primal energy called the \"Well of All Things\". The inhabitants decided to breed a superior race that would one day unite with the ways of the west. They believed that this union would produce children capable of harnessing the power of the Well. The members of the recon patrol were to be the fathers of these children. Most of the patrol agrees to this plan.Diego Casseas, one of the other members of the recon patrol now calling himself the Left Hand, stole the power of the Well from his own child. \n\nLeft Hand then gathered the other children of the pact including Midnight's Fire into a group called the Folding Circle;[[Diego Casseas (Earth-616)|Left Hand]], [[Dwayne Taylor (Earth-616)|Night Thrasher]], [[Aaron Chord (Earth-616)|Midnight's Fire]], [[Min Li Ng (Earth-616)|Silk Fever]], [[Eric Conroy (Earth-616)|Bloodstrike]].\n\nThe New Warriors and the Circle join up at the Cambodian temple where it all started. The Circle attempts to take control of the Well away from Tai, who intends to sacrifice everyone but herself in order to gain power. Both teams suffer losses as Tai knocks out several of the more durable members. Tai is seemingly slain by an Uzi to the chest wielded by New Warriors leader Night Thrasher. Casseas also apparently dies. The surviving members of the Circle escaped in an Avengers Quinjet, an aircraft originally stolen by the New Warriors.The remaining members of the Folding Circle later crash in Madripoor and attempted to usurp the role of Aardwolf a mutant crime lord. They succeed, but were later taken down by Night Thrasher and Silhouette.\n\n===The Folding Circle===\n* [[Diego Casseas (Earth-616)|Left Hand]] - (Diego Casseas), the leader of the Folding Circle, possesses the ability to manipulate [[:Glossary:Darkforce|Darkforce]] energies, a power he stole from his comatose daughter.\n\n* [[Eric Conroy (Earth-616)|Bloodstrike]] - (Eric Conroy), is a mutate who worked as an enforcer for a Chicago crime family before being recruited into the Folding Circle. He possesses superhuman strength and durability.\n\n* [[Aaron Chord (Earth-616)|Midnight's Fire]] - (Aaron Chord), is a mystical mutate possessing enhanced physical attributes and healing ability. He is the brother of [[Silhouette]] and an enemy of Night Thrasher.\n\n* [[Min Li Ng (Earth-616)|Silk Fever]] - (Min Li Ng), originally joined the [[Force of Nature]] as the merciless killer [[Firewall]]. After being told the true source of her powers she joined the Folding Circle. Silk Fever is a mystical mutate with pyrokinetic powers, and her body appears to be on fire.\n\n*[[Conrad Mack (Earth-616)|Smiling Tiger]] - (Conrad Mack), is a mystical mutate with enhanced senses. He only speaks in feral growls, and wears a bodysuit with razor sharp claws.\n\n==Infiltrators==\n*[[Dwayne Taylor (Earth-616)|Night Thrasher]] - (Dwayne Michael Taylor), is a skilled martial artist who infiltrated the group in order to destroy it.\n\n* [[Silhouette Chord (Earth-616)|Silhouette]] - (Silhouette Chord), is a mystical mutate with the power to physically interface with the Darkforce dimension. Like Night Thrasher, she infiltrated the group in order to destroy it.\n\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * http://en.wikipedia.org/wiki/Folding_Circle\n* http://members.fortunecity.com/jsc2593/circle.html\n\n}}"
                }
            }
        }
    ],
    "page_id": "5815"
}