{
    "pageid": 14548,
    "ns": 0,
    "title": "Followers of the Light (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Followers.jpg\n| Name                    = Followers of the Light\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = [[Sanctuary of Light|Shogun Sanctuary]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Basque (Earth-616)|Basque]], [[Charn (Earth-616)|Charn]], [[Sherna (Earth-616)|Sherna]], [[Doctor Tambura (Earth-616)|Dr. Tambura]]\n| Allies                  = Agents of the Light ([[Richard Carson (Earth-616)|Richard Carson]], [[Genji Odashu (Earth-616)|Genji Odashu]], [[Ilongo Savage (Earth-616)|Ilongo Savage]])\n| Enemies                 = Followers of Darkness, [[Maur-Kon (Earth-616)|Maur-Kon]], [[Mech-Monster (Earth-616)|Mech-Monster]], [[Rok-Korr (Earth-616)|Rok-Korr]]; [[Douglas Birely (Earth-616)|Doctor Demonicus]], [[Cerberus (Robot) (Earth-616)|Cerberus]], [[Hand of Five (Earth-616)|Hand of Five]], [[Starchild (Earth-616)|Starchild]]\n\n\n| Origin                  = [[Lumina (Race)|Lumina]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = Shogun Sanctuary\n| Creators                = Doug Moench\n| First                   = Shogun Warriors Vol 1 1\n| Last                    = Shogun Warriors Vol 1 16\n\n| HistoryText             = The '''Followers of the Light''' were members of the alien [[Lumina (Race)|Lumina]] race who had committed themselves to preventing members of the alien [[Myndai]] race from continuing to control the planet [[Earth]].\n\nApproximately 175,000 years ago,{{r|Marvel Atlas Vol 1 1|; Japan entry}} members of the Myndai race came to Earth and conquered the planet. Believing that Earth being under the control of these '''Followers of Darkness''' meant that evil was running rampant on a defiled planet, some members of the Lumina race felt that a balance had been tipped and that they had to react. These Lumina, the first to call themselves the Followers of the Light, travelled to Earth where they fought the Myndai in the '''Great Chaos Wars''' that allegedly lasted for eons. The wars eventually ended with the defeat of the Followers of Darkness who were trapped in their underground base in a state of suspended animation.{{r|Shogun Warriors Vol 1 1}}\n\nWith the immediate Myndai threat ended, most of the Lumina left Earth but a few Followers of the Light remained to act as sentinels against the possible revival of [[Maur-Kon (Earth-616)|Lord Maur-Kon]] and his '''Dark Agents'''. These Followers built a fortress stronghold (later known as the [[Sanctuary of Light|Shogun Sanctuary]]) in a secluded mountain range in what is now [[Japan]]. To compensate for their diminished forces, the Followers used their advanced technology to create the three [[Shogun Warriors (Earth-616)|Shogun Warrior robots]] - Raydeen, Combatra and Dangard Ace.{{r|Shogun Warriors Vol 1 1}}\n\nAt some point, the Followers began construction of a [[Samurai Destroyer (Earth-616)|fourth robot]] but it was never finished and the incomplete frame was sealed away beneath the Sanctuary.{{r|Fantastic Four Vol 1 226}}\n\nAs the [[Homo sapiens|human race]] became intelligent, the Followers began to use their technology to monitor them and identify prospective warriors who would best be able to pilot the Shogun Warriors. However, since the Followers of Darkness remained asleep, generations of potential pilots never had to be summoned.{{r|Shogun Warriors Vol 1 1}}\n\nEventually, in the early 21st century, Maur-Kon and his followers were awakened. Within hours, they resumed their attempt to claim Earth by creating the elemental monster '''Rok-Korr''' and sending it towards [[Tokyo]] on a mission of evil and destruction. The Followers of the Light reacted by summoning their three current warrior prospects to be their '''Agents of the Light'''. Although shocked to have been teleported to Shogun Sanctuary without warning, the three humans agreed to pilot Raydeen against Rok-Korr and managed a partial victory by decoying it away from the city. The Followers then showed the humans the other two Shogun Warrior robots and further testing determined which were the best pairings between the humans and the robots.{{r|Shogun Warriors Vol 1 2}}\n\nThe Followers provided support to their Agents of the Light in their subsequent battles against the second monster created by the awakened Dark Agents, the '''Mech-Monster''', and against the three monsters created by Doctor Demonicus.{{r|Shogun Warriors Vol 1 4|14}}\n\nSoon afterwards, the Followers of the Light were taken by surprise when a giant alien monster attacked Shogun Sanctuary. Basque, Charn and Sherna died before their Agents could arrive but Dr. Tambura survived long enough to urge them to continue on by themselves before dying. The Agents were able to use their Shogun Warriors to kill the monster when it attacked them, then they buried the bodies of the Followers in graves marked with ankhs on a mountaintop overlooking the ruins of Sanctuary.{{r|Shogun Warriors Vol 1 16}}\n\nA month later, the Agents of the Light and the [[Fantastic Four (Earth-616)|Fantastic Four]] confronted the alien '''Primal One''' who had sent the monster that killed the Followers. During the battle, the Primal One was revealed to be nothing more than a high-tech avatar that Maur-Kon was using to conceal his identity. Once exposed, Maur-Kon was swiftly defeated and taken into custody by the [[Charter Federation (Earth-616)|Charter Federation]] forces that his false Primal One had summoned, under false pretenses, to help him destroy the Shogun Warriors.{{r|Shogun Warriors Vol 1 20}}\n\n| Equipment               = * [[Raydeen (Earth-616)|Raydeen]]\n* [[Combatra (Earth-616)|Combatra]]\n* [[Dangard Ace (Earth-616)|Dangard Ace]]\n* Keyhole-shaped communicator pendants. \n* Orbital satellite\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "14548"
}