{
    "pageid": 25593,
    "ns": 0,
    "title": "Force Four (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Force Four (Earth-616) from Power Pack Vol 1 50 001.png\n| Name                    = Force Four\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Kymellia II]]\n\n| Leaders                 = \n| CurrentMembers          = [[Oninay (Earth-616)|Firemane]], [[Enbe (Earth-616)|Thunderhoof]], [[Ydrai (Earth-616)|Team Leader]]\n| FormerMembers           = [[Kym (Earth-616)|Ghostmare]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jon Bogdanove; Tod Smith\n| First                   = Power Pack #50\n\n| HistoryText             = The Force Four are a team of four elite Kymellian sorcerers; some of the few Kymellians left who have learned to master their powers. The young heroes [[Power Pack (Earth-616)|Power Pack]] met them when they visited [[Kymellia II]] to attend the funeral for the Smartship Friday (who later turned out to be fine though). They had been ordered to hang around with the human children during their stay at Kymellia II. At first, the Force Four acted friendly towards the kids, showing them around Kymellia II and, along with [[Byrel Whitemane (Earth-616)|Byrel Whitemane]], teached them more about Kymellian history.{{Citation}}\n\nLater however, it turned out Power Pack had been set up by the Kymellian technocrat to face the Force Four in combat, under the guise of a training session. Despite their opponents only being children,  Force Four did not hold back and attacked the team with all their strength (though Thunderhoof objected this approach, stating that they should not be fighting children). They captured Julie while she was in her cloud form, and trapped the other Power Pack members in a force field. However, Power Pack was able to turn the tides on them and eventually defeated the Force Four, much to the dismay of the technocrat.{{Citation}}\n\nAfterwards, the team sought out Power Pack to congratulate them on their victory and apologize for the fighting, stating they had no idea Power Pack was being tricked.{{Citation}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = The Force Four are an homage to the Fantastic Four with similar powers and names (often \"pig latin\" versions of their Fantastic Four counterparts).\n| Links                   = \n* http://www.marvunapp.com/Appendix/force4pp.htm\n}}"
                }
            }
        }
    ],
    "page_id": "25593"
}