{
    "pageid": 837059,
    "ns": 0,
    "title": "Four Horsemen of the Apocalypse (Axi-Tun) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Four Horsemen of the Apocalypse (Axi-Tun) (Earth-616) from Giant-Size Fantastic Four Vol 1 3 0001.jpg\n| Name                    = Four Horsemen of the Apocalypse\n| Aliases                 = \n\n| Status                  = \n| Alignment               = \n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formally planet [[Tun]], Earth, the [[Stranger's World]]\n\n| Leaders                 = \n| CurrentMembers          = [[Linbythoum_(Earth-616)|War]], [[Yentron (Earth-616)|Pestilence]], [[Krowtanem (Earth-616)|Famine]], [[Rowregyynac (Earth-616)|Death]]\n| FormerMembers           = \n| Allies                  = [[Grom (Earth-616)|Overmind]]\n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Wendell Vaughn (Earth-616)|Quasar]], [[Stranger (Cosmic Being) (Earth-616)|Stranger]]\n\n| Origin                  = [[Alien]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Marv Wolfman; Gerry Conway; Rich Buckler\n| First                   = Giant-Size Fantastic Four Vol 1 3\n| Last                    = \n\n| HistoryText             = The Four Horsemen of the Apocalypse are members of the [[Axi-Tun]] race,{{r|Official Handbook of the Marvel Universe #5|; Humanoid Aliens entry}} a race of beings from the planet [[Tun]]. They are [[Linbythoum (Earth-616)|Linbythoum]], [[Yentron (Earth-616)|Yentron]], [[Krowtanem (Earth-616)|Krowtanem]] and [[Rowregyynac (Earth-616)|Rowregyynac]], known as War, Pestilence, Famine, and Death respectively.{{r|FF: Fifty Fantastic Years #1}} They scoured the universe and became a scourge to all they encountered, earning them their biblical names. They sought to conquer the planet [[Earth]] because, as it was considered the nexus in the circle of civilized worlds, it had to fall first before those other planets could be conquered. When they attempted to conquer the Earth centuries ago, they initially found it easy pickings as it was populated by savage primitives. However, they were eventually opposed by a race even mightier than their own that defended the people of Earth and, after a century-long battle, drove the Four Horsemen from the planet. They fled back to Tun, where their defeat was seen as weakness and they were exiled from their homeworld.\n\nSeeking to regain favor from their people, the Four Horsemen returned to conquer Earth in the modern age when they were convinced that the beings that defeated them in the past had left the Earth. Upon their arrival, Pestilence unleashed a plague that caused the entire population of Manhattan to go into a deep sleep for 48 hours. When the citizens awoke their city was under siege by rodents, disease, and strange creatures. While the city panicked the [[Fantastic Four (Earth-616)|Fantastic Four]] came to the aid of New Yorkers and clashed with Pestilence directly. When the [[Benjamin Grimm (Earth-616)|Thing]] resisted the debilitating disease that Pestilence was unleashing upon him, he caused the alien to vanish with a single blow. The FF's leader [[Reed Richards (Earth-616)|Mister Fantastic]] speculated that the Thing, by resisting Pestilence's infection, had become a living anti-body that Pestilence could neither subdue or control so he had been forced to vanish. Reed then split up the team to tackle the other members of the Four Horsemen. \n\nThe [[Jonathan Storm (Earth-616)|Human Torch]] and [[Medusalith Amaquelin (Earth-616)|Medusa]] went to Africa where they found that War was escalating a combat zone by providing weapons to both sides of the conflict. Johnny and Medusa stopped the warring sides and clashed with War, defeating him in combat. But before he vanished, War removed his mask showing all gathered the real face of war: themselves. In Cambodia, Mister Fantastic and the Thing clashed with Famine, who was making the people of the country starve even though there was an abundance of food. After forcing the people to eat bowls of rice, Reed smothered Famine with his own body, until their foe vanished as well. A reference to an ancient curse that Famine had made during their battle had caused Reed to deduce that the beings that defeated the Four Horsemen in the past had set up protection devices to banish them from Earth provided they were opposed. The group reunited and traveled to Mount Everest where they found Death. He created death constructs of each member of the Fantastic Four. Realizing that fighting their own death images would be lethal, the FF switched opponents, destroying three of these horrifying death parodies of themselves. Medusa then threw the Thing-construct into Death's body, striking another victory for the heroes as Death was banished from the Earth as well.{{r|Giant-Size Fantastic Four #3}}\n\nThe Four Horsemen were later captured by the [[Stranger (Cosmic Being) (Earth-616)|Stranger]] and imprisoned on his [[Stranger's World|laboratory world]]. When the the Stranger's world was under attack by the being known as the [[Grom (Earth-616)|Over-Mind]], this foe freed the Four Horsemen and other captives. The Four Horsemen were later defeated by the [[Glossary:Protectors of the Universe|Protector of the Universe]] known as [[Wendell Vaughn (Earth-616)|Quasar]].{{r|Quasar #16}}\n\nIf the Four Horsemen were re-incarcerated or if they managed to escape remains uncertain. The group has not been seen in many years.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Stranger Experiment]]"
                }
            }
        }
    ],
    "page_id": "837059"
}