{
    "pageid": 256954,
    "ns": 0,
    "title": "Fraternity of Raptors (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Fraternity of Raptors (Earth-616) from All-New Guardians of the Galaxy Vol 1 6 001.jpg\n| ImageSize               = 250px\n| Name                    = Fraternity of Raptors\n| Aliases                 = Raptors\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly [[Gyre (Raptor) (Earth-616)|Gyre]], [[Robert Rider (Earth-616)|Talon-R]], [[Shir Ydrn Talonis (Earth-616)|Talon]]\n| CurrentMembers          =  \n| FormerMembers           = [[Robert Rider (Earth-616)|Talon-R]], [[Ratha'kon (Earth-616)|Ratha'kon]], [[Razor (Raptor) (Earth-616)|Razor]], [[Gyre (Raptor) (Earth-616)|Gyre]], [[Shir Ydrn Talonis (Earth-616)|Talon]], [[Kyte (Earth-616)|Kyte]], [[Strel (Earth-616)|Strel]], numerous unnamed members<br>'''Hosts:''' [[Christopher Powell (Earth-616)|Chris Powell]] ([[Razor (Raptor) (Earth-616)|Razor]]),<br>[[H'jke Jeeku (Earth-616)|H'jke Jeeku]] ([[Shir Ydrn Talonis (Earth-616)|Talon]]),<br>Unnamed [[Kree]] archeologist ([[Gyre (Raptor) (Earth-616)|Gyre]]),<br>[[N'zyr (Earth-616)|Plutonia]] ([[Kyte (Earth-616)|Kyte]]),<br>[[Mentor (Imperial Guard) (Earth-616)|Mentor]] ([[Strel (Earth-616)|Strel]])\n| Allies                  = [[Gabriel Summers (Earth-616)|Emperor Vulcan]], [[Shi'ar]], [[Blastaar (Earth-616)|Blastaar]], \n| Enemies                 = [[Nova Corps (Earth-616)|Nova Corps]], [[Guardians of the Galaxy (Earth-616)|Guardians of the Galaxy]], [[Christopher Powell (Earth-616)|Darkhawk (Chris Powell)]], [[Lilandra Neramani (Earth-616)|Lilandra Neramani]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = War of Kings: Darkhawk Vol 1 1\n| Last                    = Wolverine: Infinity Watch Vol 1 5\n\n| HistoryText             = \n<!-- Plagiarism: Comic Vine -->\nThe members of the Fraternity of Raptors all possess an [[Raptor Amulet|amulet]] and [[Raptor Armor|suit of armour]]. The Fraternity of Raptors protects the long term interests of the [[Shi'ar Empire]] in a mission they call \"The Great Purpose.\" The raptors armor make use of a stream of information called the Datasong which provides them with information about past and future events.{{Citation}}\n\n<!-- Plagiarism: Comic Vine -->\nEventually, the Fraternity grew too powerful and each member was sealed in patches of dark matter throughout Shi'ar territory. After the [[Secret Invasion|Skrull secret invasion]], several Raptors were freed. They are contining their mission and destroying anyone who stands in their way.{{Citation}}\n\nTalon and Razor were successful in assassinating former Empress Lilandra of the Shi'ar Empire. Darkhawk eventually defeated Razor and Talon and both were banished to Null Space. The Sphinx later arranged for Darkhawk to fight a third member of the Raptors named Gyre who Darkhawk also defeated and banished to [[Null Space]]. Talon later returned and convinced Mentor and Plutonia of the Shi'ar Imperial Guard to become raptors using two amulets. Mentor became Strel and Plutonia became Kyte. Talon was last seen posing as the Shi'ar adviser Araki.{{Citation}}\n\nMentor and Plutonia have been seen in the interim in their normal forms. This may indicate Strel and Kyte have been defeated or it may indicate that like the humans the raptor armor was never meant to work with their respective species thus Mentor and Plutonia never lost their free will. Also Talon has shown the ability to shape shift so Strek and Kyte may just be masquerading as their hosts.{{Citation}}\n\n=== All-New Guardians of the Galaxy ===\nAfter the Multiverse was reset, the Fraternity had become an independent crew of murderous zealots operating under the radar of the [[Shi'ar Empire]] and its [[Kallark (Earth-616)|current emperor]] in pursuit of becoming a predominant paramilitary authority throughout the universe. Lacking the Raptor Android armor technology of the true fraternity, their first step was the collection and acquisition of items of power scattered across the galaxies.\n\nOne search in particular led them to the decimated remains of [[Xandar]] former home base of the [[Nova Corps (Earth-616)|Nova Corps]].{{r|All-New Guardians of the Galaxy Vol 1 11}} Initially coming there looking for remnants of the [[Glossary:Nova Force|Nova Force]], all they found was the last Denarian class Nova still on active duty; [[Robert Rider (Earth-616)|Robbie Rider]]. Whom they took aboard their return ship and brainwashed him into service of their corrupted cause through '''Simulated Reality''' integration. Accepting him as one of their own over the years of mental conditioning that followed, Robbie rechristened himself as Talonar; in which he offered to secure a pair of [[Nega-Bands]] from an impounded Nova Corps detainment facility.{{r|Free Comic Book Day Vol 2017 All-New Guardians of the Galaxy}} \n\nHe was beaten to the punch however when [[Peter Quill (Earth-616)|Star Lord]] and his [[Guardians of the Galaxy (Earth-616)|crew]] unknowingly stole the [[Milano|raptor vessel]] he was after. In the mean time, two raptor designates Canorus and Aceptar were dispatched to [[Earth]] on his orders to obtain the known Raptor Amulet from [[Christopher Powell (Earth-616)|Chris Powell]]. The tables were turned however for in re-activating the [[Razor (Raptor) (Earth-616)|Razor Android]] it merged with its previous host and they were now taking the fight to them.{{r|Darkhawk Vol 1 51}}\n\nTracking back to the Guardians issue, Talonar takes a squadron of Raptors to battle in order to claim his prize, in the skirmish he managed to poison rocket with toxin tipped claws before making off with one half of the bands.{{r|All-New Guardians of the Galaxy Vol 1 #6}} Hearing of this, Quill went in search of Talonar and the two clashed in epic battle, each bearing half the power the Nega Bands where they eventually crashed landed on a planetoid as they kept losing their power mid-fight. Though Robbie had Quill on the ropes for a moment, Star-Lord got the upper hand in the end of the skirmish; in exchange for the antidote, his half of the bands and the assassin's life. \n\nPeter opted to spare him and relinquish his find for the cure to his toxin, on his word Peter gave up his band; right before chucking it through a portal into Ultron afflicted territory.{{r|All-New Guardians of the Galaxy Vol 1 8}} It is soon revealed The Raptors have established a sizable spy operation within the galaxy, particularly within the resettling Nova Corps.\n\nDeep cover operatives of whom helped them undermine the Nova Corps as well as hide behind the few crooked Novas' shady dealing while relaying sensitive information coming their way to the Raptors.{{r|Guardians of the Galaxy Vol 1 146}} They even paid some of the more corrupt corpsmen to purposely release Thanos from their custody while falsifying a report that he escaped.{{r|Guardians of the Galaxy Vol 1 148}} When news came of a membership revocation on part of the corps, the splinter cell of Raptors were ordered to pave the way for invasion of [[Spirit of Xandar|The Rock]] by causing internal structural damage while their main forces were on their way to decimate the perceived weakened Nova Corps.{{r|Guardians of the Galaxy Vol 1 149}} This information was falsified however and instead the invading force was decimated by [[Scott Lang (Earth-616)|Ant-Man]] and a Nova Force empowered [[Rocket Raccoon (Earth-616)|Rocket]].{{r|Guardians of the Galaxy Vol 1 150}}\n\nAfter learning of that the [[Power Stone]] was on the planet [[Xitaung]],{{r|Guardians of the Galaxy Vol 1 150}} a contingent of Raptors tried to seize it, leading to a three way battle between the Raptors, the Nova Corps, and a group of [[Chitauri]] lead by [[Warbringer (Earth-616)|Warbringer]] for the Power Stone. The Guardians of the Galaxy intervened and were able to take control of the Power Stone, causing Xitaung's destruction and forcing the Raptors to retreat.{{r|Infinity Countdown Vol 1 1|3}}\n\nSeeking to liberate the [[Raptor Armor|the real Raptors]] from the [[Tree of Shadows]], the [[Fraternity of Raptors (Earth-616)|Fraternity of Raptors]] took Talon-R to the Shi'ar Outpost IV so he could open a doorway to the [[Null Space]] with the power of his [[Nega-Bands]]. To their surprise, the real Raptors were already free and no longer needed to bond with a living being to work. The freed Raptors killed all the pretenders save for Talon-R, who used the Nega-Bands to protect himself.{{r|Infinity Countdown: Darkhawk Vol 1 1}} \n\nNeeding a living being to serve as the willing tribute of a ritual that would unlock the true power of the [[Ratha'kon (Earth-616)|Starhawk]] within their ranks,{{r|Infinity Countdown: Darkhawk Vol 1 2}} Gyre convinced Talon-R to join them in their quest to bring order to the galaxy.{{r|Infinity Countdown: Darkhawk Vol 1 1}} With a subdued Chris Powell serving as the forced tribute, Gyre completed the ritual and transformed Talon-R into the Dark Starhawk using Chris' [[Raptor Amulet]].{{r|Infinity Countdown: Darkhawk Vol 1 2}}\n\nRobbie and the Raptors planned to raze Earth but were confronted by Chris, Robbie's brother Nova, and [[Death's Head (Styrakos)|Death's Head]]. An intense fight broke out when Nova trying his best to reason with his brother, but his words fell on deaf ears. Robbie then killed Gyre, preferring to carrying out his own version of order in the universe. Moments later, Death's Head rigged the power core of the Kree ship the Raptors stole to explode, wiping out the Raptors except for Robbie, though he was stunned. Chris took the opportunity to reclaim his Raptor Amulet. Though badly injured, Robbie was able to flee by striking his Nega-Bands together.{{r|Infinity Countdown: Darkhawk Vol 1 3|4}}\n\nRobbie later assembled a new contingent of Raptors and obtained a new ship. He witnessed the Infinity Stones leave Earth after [[Adam Warlock (Earth-616)|Adam Warlock]] gave them sentience and noted that one Stone remained on Earth and that the Raptors needed to find the Stones' new wielders.{{r|Infinity Wars: Infinity Vol 1 1}}\n\nRobbie and a team of Raptors tracked down the possessor of the [[Time Stone]], escaped convict [[Hector Bautista (Earth-616)|Hector Bautista]], and kidnapped him. [[James Howlett (Earth-616)|Wolverine]] and [[Loki Laufeyson (Ikol) (Earth-616)|Loki]] attempted to rescue Hector, but they were overwhelmed by the Raptors' superior numbers. Loki decided to retreat back to Earth and convinced Robbie's mother [[Gloria Rider (Earth-616)|Gloria Rider]] to talk some sense into him. However, Robbie unintentionally killed his mother when he thought she was one of Loki's illusions. Gloria's death was reversed when Hector went back in time. Then the [[Chitauri]] warrior [[Warbringer (Earth-616)|Warbringer]] appeared to claim the Time Stone and damaged to the Raptors' ship to the point where it started to self-destruct. Robbie, Gloria, Wolverine, Loki, and Hector managed to flee to Earth, leaving Warbringer and the Raptors to perish when the ship exploded.{{r|Wolverine: Infinity Watch Vol 1 2|5}}\n\n| Equipment               = Body Armor, Glider Wings, Body Armor. Former equipment: [[Raptor Amulet]], [[Raptor Armor]]\n| Transportation          = \n| Weapons                 = Energy beams, Razor Claws, Cable Grapples\n\n| Notes                   = * The [[Tree of Shadows]] is the repository for all of the amulets that empower the Fraternity of Raptors. The tree is guarded by seemingly demonic creatures. When an amulet finds a host, the host swaps places with a raptor in Null Space and is imprisoned in a crystal hanging from the tree. The hosts eventually die and are left to rot in their crystalline prisons.\n\n* When Talon banished Chris Powell to Null Space to be replaced by Razor, he grabbed Chris's Darkhawk Amulet and uttered the command \"Go! Leave! Depart!\". Later after Darkhawk took control of Razor's form, he banished Talon to [[Null Space]] and freed Talon's host via the same command. Darkhawk would later use this command again to banish Gyre to Null Space and free his host. \n\n| Trivia                  = * Raptors were not designed to be used by humans. Many of the older races such as the Kree, Skrull and Shi'ar are compatible with the Raptor armor thus giving the raptor complete control of their host. Chris Powell having free will when he became Darkhawk made him something of an anomaly. If he had been from an older race, Razor would have controlled the raptor armor from the beginning. Chris's anger management issue was one of the reasons he was able to supplant Razor and reassert control of the Raptor armor.\n| Links                   = \n}}\n[[Category:Shi'ar Organizations]]"
                }
            }
        }
    ],
    "page_id": "256954"
}