{
    "pageid": 2945,
    "ns": 0,
    "title": "Frightful Four (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Frightful Four (Earth-616) from Fantastic Four Vol 1 644 001.jpg\n| ImageSize               = 250px\n| Name                    = Frightful Four\n| Aliases                 = Frightful Foundation, Frightful Five\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Subterranean Manhattan headquarters; formerly Queens water tower; Wizard's suburban New York home and cabin; various others\n| Leaders                 = [[Bentley Wittman (Earth-616)|The Wizard]]\n| CurrentMembers          = \n| FormerMembers           = [[Medusalith Amaquelin (Earth-616)|Madame Medusa/Medusa]], [[Peter Petruski (Earth-616)|Paste-Pot Pete/Trapster]], [[Reed Richards (Counter-Earth) (Earth-616)|The Brute]], [[Benjamin Grimm (Earth-616)|Thing]], [[Jonathan Storm (Earth-616)|Human Torch]], [[Abner Jenkins (Earth-616)|Beetle]], [[Blastaar (Earth-616)|Blastaar]], [[Maxwell Dillon (Earth-616)|Electro]], [[Llyra Morris (Earth-616)|Llyra]], [[Anthony Masters (Earth-616)|Taskmaster]], [[Frank Payne (Earth-616)|Constrictor]], [[Wade Wilson (Earth-616)|Deadpool]], [[Morris Bench (Earth-616)|Hydro-Man]], [[Mary MacPherran (Earth-616)|Titania]], [[Ulysses Klaw (Earth-616)|Klaw]], [[Punisher (Galactus' Robot) (Earth-616)|Punisher]], [[Lyra (Earth-8009)|Lyra]], [[Bentley Wittman (Clone) (Earth-616)|Bentley-23]], [[Carnage (Symbiote) (Earth-616)|Carnage symbiote]], [[Karlin Malus (Earth-616)|Karl Malus/Superior Carnage]], [[Dirk Garthwaite (Earth-616)|Wrecker]], [[Eliot Franklin (Thunderball) (Earth-616)|Thunderball]], [[Marci Camp (Earth-616)|Bulldozer]], [[Gazelle (Scratch) (Earth-616)|Gazelle]], [[Vertigo (Salem's Seven) (Earth-616)|Vertigo]], [[Reptilla (Earth-616)|Reptilla]], [[Thundra (Earth-715)|Thundra]], [[William Baker (Earth-616)|Sandman]], [[Sharon Ventura (Earth-616)|She-Thing]]\n| Allies                  = \n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Spider-Man (Peter Parker)|Spider-Man (Peter Parker)]], [[Otto Octavius (Earth-616)|Spider-Man (Otto Octavius/\"Peter Parker\")]], [[Avengers (Earth-616)|Avengers]], [[Thaddeus Ross (Earth-616)|Red Hulk]]\n\n| Origin                  = When the [[William Baker (Earth-616)|Sandman]] and [[Peter Petruski (Earth-616)|Trapster]] escaped prison together they rescued a helpless [[The Wizard (Earth-616)|Wizard]], adrift due to his malfunctioning anti-gravity discs, along the way. Together they formed an alliance dedicated to humiliating their mutual enemies, the Fantastic Four, by becoming an evil, mirror counterpart. Determined to form their own quartet, the criminal trio went through a series of brief recruits, none of whom proved satisfactory as a fourth member. \n| PlaceOfFormation        = [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four #36\n| Last                    = \n\n| HistoryText             = ===Origins===\n[[File:Frightful Four (Earth-616) from Fantastic Four Vol 1 36 001.jpg|thumb|left|200px|The original Frightful Four (from left to right): Madame Medusa, the Wizard, Paste-Pot Pete, and the Sandman.{{r|Fantastic Four #36}}]] The genesis of the Frightful Four began with three villains who commonly battled the [[Fantastic Four (Earth-616)|Fantastic Four's]] youngest member the [[Jonathan Storm (Earth-616)|Human Torch]]. The [[The Wizard (Earth-616)|Wizard]], the [[William Baker (Earth-616)|Sandman]] and [[Peter Petruski (Earth-616)|Paste-Pot Pete]] were all defeated at the hands of the Torch.<ref>At that point in time in {{cl|Strange Tales #118}} ([[The Wizard (Earth-616)|Wizard]], {{cl|Strange Tales #115}} ([[William Baker (Earth-616)|Sandman]], and {{cl|Strange Tales #124}} ([[Peter Petruski (Earth-616)|Paste Pot Pete]]</ref> During his last clash with the Human Torch, the Wizard was sent floating uncontrollably into the upper atmosphere when one of his anti-gravity disks failed to work.{{r|Strange Tales #118}} This coincided with a break out by the Sandman and Paste-Pot Pete who had hijacked a plane to escape. While flying through the air, they spotted the Wizard during his ascent and rescued him from suffocation in the upper atmosphere. Realizing that they all had unique powers and a mutual hatred of the Fantastic Four, the Wizard suggested that they form a group that would be the evil counterparts to the Fantastic Four.\n\nNeeding a fourth member to their group, the Wizard had heard of a strange woman hiding out on a remote island on the Mediterranean who had complete control of her hair. Travelling there, the Wizard convinced [[Medusalith Amaquelin (Earth-616)|Madame Medusa]] to join their ranks. Her past a mystery, Medusa agreed to join them and the Frightful Four was born.{{r|Fantastic Four #36}} In order to keep Medusa under their control, the Wizard implanted a device that kept her lost memories from resurfacing.{{r|X-Men First Class Vol 2 #15}} Their formation came just after the Fantastic Four's [[Reed Richards (Earth-616)|Mister Fantastic]] and [[Susan Storm (Earth-616)|Invisible Girl]] had announced that they were engaged to be married. After an engagement party, the Frightful Four attacked the Fantastic Four's [[Baxter Building]] headquarters. Although they incapacitated the [[Benjamin Grimm (Earth-616)|Thing]], Mister Fantastic, and the Invisible Girl they were too late to stop the Thing's girlfriend [[Alicia Masters (Earth-616)|Alicia Masters]] from sending out a signal flare to the Human Torch who was away from the building at the time. Although the Frightful Four used anti-gravity disks to end the Fantastic Four in the same way the Wizard almost perished, the Torch came to their rescue. Outclassed by the veteran heroes, the Frightful Four decided to retreat in the ensuing battle, setting their anti-gravity craft to self-destruct providing cover for the group to escape.{{r|Fantastic Four #36}} The Frightful Four were later pulled forward in time by [[Aron (Earth-616)|Aron the Rogue Watcher]] to battle the future Fantastic Four and their allies [[Fantastic Force (Earth-616)|Fantastic Force]]. When Aron's plot to destroy the universe to recreate his own reality was stopped, the Frightful Four were returned to their appropriate time and place with no memory of what happened.{{r|Fantastic Four #400}}\n\n===Early Schemes===\nRegrouping after their first defeat, the Wizard quickly organized a new plan to destroy their mutual enemies. During this period Paste-Pot Pete reinvented himself with a new name, the Trapster, in an attempt to sound more menacing. They captured the Invisible Girl and kept her prisoner on deserted military outpost in the South Pacific. When the Fantastic Four came to rescue their teammate they fell into the evil FF's trap. While the heroes rescued Sue, the Wizard activated his q-bomb while his team fled the scene. While the Fantastic Four survived thanks to one of the Invisible Girl's invisible force-fields, the radiation from the blast stripped them of their powers.{{r|Fantastic Four #38}} The Frightful Four then returned to the Baxter Building to confirm if the Fantastic Four were dead or not. However they fled the scene when they confused the arrival of the [[Asgardians|Asgardian]] warrior [[Balder Odinson (Earth-616)|Balder the Brave]] on Earth to be the Human Torch.<ref>{{cl|Journey into Mystery #116}}: [[Balder Odinson (Earth-616)|Balder]] was called to Earth to defend [[Thor Odinson (Earth-616)|Thor's]] lover [[Jane Foster (Earth-616)|Jane Foster]] from the [[Amora (Earth-616)|Enchantress]] and [[Skurge (Earth-616)|Executioner]] while Thor was away from Earth participating in the \"Trial of the Gods\" against [[Loki Laufeyson (Earth-616)|Loki]].</ref> The Fantastic Four survived the assault, and eventually restored their powers.<ref>The [[Fantastic Four (Earth-616)|Fantastic Four]] survived the blast as seen in {{cl|Fantastic Four #39}} and restored their powers battling [[Victor von Doom (Earth-616)|Dr. Doom]] in {{cl|Fantastic Four #40}}</ref>\n\n[[File:Frightful Four (Earth-616) with the Thing from Fantastic Four Vol 1 42.jpg|thumb|286px|The Frightful Four and the Thing.{{r|Fantastic Four #42}}]] However following the restoration of their powers, the Fantastic Four's Thing was angered that he once again lost his humanity and quit the team. Slipping out of town on the back of a truck, the Thing fell asleep as the vehicle crossed over into New Jersey and a bumpy road threw him from the flat bed. The sleeping Thing was discovered by the Frightful Four who quickly kidnapped their sleeping enemy. By this time the Wizard had developed an ID machine and used it to change the Thing's personality so that he was evil. Although the Frightful Four bickered and fought among themselves, the group were able to defeat the remaining members of the Fantastic Four came to rescue their friend, they were easily captured with the aid of the Thing. The Wizard then reminded the Thing that Mister Fantastic was responsible for his transformation, sending the Thing into a frenzy.{{r|Fantastic Four #41}} When the Fantastic Four attempted to break free another fight broke out. While Mister Fantastic and the Invisible Girl managed to escape, the Human Torch was captured and apparently enthralled by the ID machine as well.{{r|Fantastic Four #42}} In reality the ID machine was damaged by the Invisible Girl and the Torch was only pretending to be under the Wizard's thrall, allowing his teammates to capture the Thing and escape. Mister Fantastic then created a device to restore the Thing back to normal. When the Frightful Four finally saw through the Torch's trick and attacked the Baxter Building, the Thing had full recovered and turned the tide of battle. While the male members of the group were apprehended, Medusa managed to escape in their anti-gravity ship.{{r|Fantastic Four #43}}\n\n[[File:Frightful Four (Earth-616) Trapster Wizard and the Beetle from Amazing Spider-Man Vol 1 657.jpg|thumb|left|280px|The Beetle with the Wizard and Trapster during his short lived stint with the Frightful Four.{{r|Amazing Spider-Man #657}}]] While the Sandman and Trapster were arrested, but the Wizard managed to escape by feigning an injury and fleeing while being transported to the hospital. The Wizard then tracked Medusa down to [[Xavier's School for Gifted Youngsters]] in Westchester County where she was under the protective care of the [[X-Men (Earth-616)|X-Men]]. During the ensuing battle, the X-Men's leader [[Charles Xavier (Earth-616)|Professor X]] discovered that Medusa was being mechanically controlled by the Wizard. Removing the device from the base of her neck allowed Medusa to fight off the Wizard's influence and defeat him in battle and he was apprehended.{{r|X-Men First Class Vol 2 #15}} The Frightful Four then began the first of many searches for a new member. They selected the [[Abner Jenkins (Earth-616)|Beetle]] to join their group. However, the Beetle's membership proved to be short lived when the Fantastic Four and [[Peter Parker (Earth-616)|Spider-Man]] delivered a group a quick defeat when the Invisible Girl used her powers to turn the Wizard, Trapster and Beetle's pants transparent to embarrass them.{{r|Amazing Spider-Man #657}} The Wizard, Trapster and Sandman found themselves imprisoned at State Penitentiary and instantly began plotting a breakout.{{r|Fantastic Four #45}} Shortly thereafter, the Wizard and Sandman staged a break-out, while the Sandman escape the Wizard was recaptured, confident that with the Sandman now free their freedom was eventually assured.{{r|Fantastic Four #57}}\n\n===Seeking Replacements===\nWhen all the members of the Frightful Four were free from prison they regrouped and began plotting against the Fantastic Four again. Rejoining them was Medusa who, unknown to the Wizard and the others, had since recovered her memory and was now an ally of the Fantastic Four. By this point Mister Frantastic and the Invisible Girl had a son, named [[Franklin Richards (Earth-616)|Franklin]], and were seeking a babysitter to care for the boy whenever they were on a mission. When they agreed to visit the witch known as [[Agatha Harkness (Earth-616)|Agatha Harkness]] at her home in [[Whisper Hill]], the Fantastic Four were attacked by their evil counterparts. It was during this battle that Medusa revealed her true allegiances and turned on the Wizard and his allies. The Frightful Four proved no match for Harkness, who was a powerful mystic, and easily trounced the remaining members of the Frightful Four, securing her job as Franklin's caretaker.<ref>{{cl|Fantastic Four #94}}: [[Reed Richards (Earth-616)|Mister Fantastic]] and the [[Susan Storm (Earth-616)|Invisible Girl]] had their son [[Franklin Richards (Earth-616)|Franklin]] in {{cl|Fantastic Four Annual #6}}. [[Medusalith Amaquelin (Earth-616)|Medusa's]] memories were restored in {{cl|Fantastic Four #44}}. She became an ally of the [[Fantastic Four (Earth-616)|Fantastic Four]] after they helped reunite her with her fellow [[Inhumans]] in {{cl|Fantastic Four #45}}-{{cl|Fantastic Four #46|46}}</ref> This Frightful Four made an attempt to force Medusa to rejoin their ranks upon learning that her lover -- [[Blackagar Boltagon (Earth-616)|Black Bolt]], ruler of the [[Inhumans]] -- was incapable of speech without destroying anything in his path. The Wizard at this point had converted his ID machine into a ray gun in the hopes of making it a more practical weapon. The evil FF convinced Medusa that Quadranium-99 could cure Black Bolt. In exchange for the material, Medusa promised to rejoin their ranks. This plan ultimately failed when Medusa figured out that the Wizard was fooling her and that the Quadranium was going to be used to power his new ID ray. Medusa then fled from their ship with the Quadranium and returned it to the United Nations facility in France where it had been stolen from.{{r|Marvel Super-Heroes #15}}\n\n[[File:Frightful Four (Earth-616) Trapster, Wizard, Sandman, Blastaar from Fantastic Four Worlds Greatest Comic Magazine Vol 1 10`.jpg|thumb|300px|Trapster, Wizard, Sandman and Blastaar.{{r|Fantastic Four: World's Greatest Comics Magazine #10}}]] Without Medusa, the Frightful Four once again attempted to recruit a fourth member into their group. At the recommendation of the Sandman they attacked the Baxter Building to access their portal to the [[Negative Zone]] to free his onetime ally [[Blastaar (Earth-616)|Blastaar]]. While the other members of the Fantastic Four were already in the Negative Zone trying to stop [[Victor von Doom (Earth-616)|Doctor Doom]] from acquiring the [[Cosmic Control Rod]] belonging to Negative Zone leader [[Annihilus (Earth-616)|Annihilus]], the Frightful Four attacked. They easily incapacitated the Invisible Girl and pulled Blastaar from the Negative Zone. They did not anticipate that the young boy named [[Richard Jones (Earth-616)|Rick Jones]] was present and were unprepared when he clashed his [[Nega-Bands]] together summoning his ally [[Mar-Vell (Earth-616)|Captain Marvel]] to Earth. Despite this surprise attack the Frightful Four succeeded in defeating Captain Marvel.<ref>{{cl|Fantastic Four: World's Greatest Comics Magazine #9}}: The [[William Baker (Earth-616)|Sandman]] teamed up with [[Blastaar (Earth-616)|Blastaar]] in {{cl|Fantastic Four #62}}, a union ended when Blastaar was defeated and returned to the Negative Zone in {{cl|Fantastic Four #63}}</ref> However the addition of Blastaar proved to be short lived as an insult towards the Negative Zone angered Blastaar sufficiently that he attacked his comrades. During the ensuing battle, the rest of the Fantastic Four returned home and defended it from the invaders. While Blastaar was knocked back into the Negative Zone, the rest of the Frightful Four were easily defeated and turned over to the authorities.{{r|Fantastic Four: World's Greatest Comics Magazine #10}}\n\nThe Frightful Four reunited once again and attempted to manipulate the Negative Zone once again. To this end they captured Spider-Man and hypnotized him into joining their ranks. They used Spider-Man to infiltrate the Baxter Building when only the Human Torch was home. The Torch was easily subdued allowing the Wizard to gain access to the Negative Zone portal. This plan backfired when Annihilus attempted to use this intrusion to free himself from the Zone and onto Earth. Ultimately the Torch freed Spider-Man from the Frightful Four's control and the pair subdued their foes. Spider-Man then used his scientific know-how to deactivate the Negative Zone portal before leaving the Frightful Four with the Torch to turn over to the authorities.{{r|Marvel Team-Up #2}}\n\n===Thundra===\n[[File:Frightful Four (Earth-616) Wizard, Thundra, Sandman, Trapster from Fantastic Four Vol 1 130.jpg|thumb|left|306px|The Wizard, Thundra, Sandman, and Trapster.{{r|Fantastic Four #130}}]] The Frightful Four soon obtained their first new recurring member, [[Thundra (Earth-715)|Thundra]], a [[Femazons (Earth-715)|Femazon]] of the alternate future of [[Earth-715]]. The Wizard had promised her the opportunity to battle the most powerful man on Earth in exchange for helping them destroy the Fantastic Four. The quartet attack the Thing at a construction site. Although their attack was interrupted by Medusa, who had come to the Thing's aid, Thundra provided them with the upper hand and both the Thing and Medusa were subdued.{{r|Fantastic Four #129}} Thundra's membership was not without its own troubles as she did not wish to allow the Frightful Four to eliminate the Thing as she viewed men as inferiors. While the evil FF conceded on that point for now, they attacked the Baxter Building, subduing both the Thing and Mister Fantastic. When they discovered the Invisible Girl with her son Franklin, Thundra refused to allow any harm come to the child and fought back against her opponents. Ultimately the Fantastic Four broke free and fought their evil counterparts into retreat once again. In the aftermath of the battle the Invisible Girl left the group over differences with Mister Fantastic, taking their child with her, Medusa then took her place on the team.{{r|Fantastic Four #130}}\n\nHowever Thundra was not finished with the Thing, seeking to utterly crush him once and for all she challenged him to a one-on-one fight to the finish. In order to force the Thing to agree to the battle, Thundra captured his girlfriend Alicia Masters and left her in the hands of the Frightful Four through the duration of the battle. While the battle took place at Shea Stadium, the Thing was briefly transformed back into human form by Mister Fantastic so that Thundra would forfeit the battle and flee. Meanwhile, the Human Torch rescued Alicia, forcing the Frightful Four to once again flee the scene.{{r|Fantastic Four #133}} The Frightful Four later broke into the Baxter Building waiting to ambush the Fantastic Four after they seemingly lost the Invisible Girl to their sometimes foe the [[Namor McKenzie (Earth-616)|Sub-Mariner]]. Although the Frightful Four had the upper hand, Thundra's continued differences with the group -- particularly their constant sexism toward her -- prompted her to turn on them. Thundra then helped free the Fantastic Four and defeat her former comrades. The Wizard, Trapster and Sandman were then contained at the Baxter Building before the Fantastic Four went on to battle the Sub-Mariner who appeared to be calling for another invasion of the surface world.{{r|Fantastic Four #148}} As it turned out these was merely a mock battle that was staged so that Mister Fantastic and the Invisible Girl could reconcile their marriage after a lengthy separation.{{r|Fantastic Four #149}}\n\n[[File:Frightful Four (Earth-616) welcome the Brute into their ranks from Fantastic Four Vol 1 177.jpg||thumb|The Brute is welcomed into the ranks of the Frightful Four.{{r|Fantastic Four #177}}]] After escaping captivity again, the three founding members of the Frightful Four reformed, and during an extended absence of their foes put out a classified ad seeking a new fourth member, telling all applicants to meet at the Baxter Building. The Fantastic Four and their ally the [[Impossible Man (Earth-616)|Impossible Man]] soon learned of this and rushed to their headquarters to confront the Frightful Four.{{r|Fantastic Four #176}} While the Impossible Man was distracted by a television, the Fantastic Four were quickly defeated and incapacitated. The Frightful Four then began screening potential members. They rejected the powerless [[Oscar Kincaid, Jr. (Earthh-616)|Osprey]], and the heroic [[Drew Daniels (Earth-616)|Texas Twister]] before Thundra came crashing in on them. Thundra warned her former teammates that the Fantastic Four were off limits, but she was quickly subdued and made a prisoner along side her new allies. The Wizard and the others then rejected the pyrophobic [[Griffin Gogol (Earth-616)|Captain Ultra]], before they were attacked by [[Greer Grant (Earth-616)|Tigra]] who briefly freed the Fantastic Four. This escape attempt was then quashed by the most promising recruit to potentially join up with the Frightful Four: the [[Reed Richards (Counter-Earth) (Earth-616)|Brute]], Reed Richard's double on the distant world of [[Counter-Earth (High Evolutionary)|Counter-Earth]]. The Brute helped defeat the Fantastic Four and their allies, securing himself as a member of the group.{{r|Fantastic Four #177}} The Frightful Four then attempted to hold their heroic counterparts hostage for a massive ransom. When the governments of the United States refused to pay the ransom the Wizard decided that it was time to finally kill his hated foes. However, before he could activate his device the broadcast day had ended cutting off the television transmission that kept the Impossible Man preoccupied through out the entire battle. Seeking to boost the signal, the Impossible Man attempted to boost the signal causing a power surge powerful enough to temporarily cut the power in the Baxter Building to allow the Fantastic Four and their allies to break free. The Frightful Four were easily trounced by the good FF, Thundra, and Tigra. The Wizard, Trapster and Sandman were captured once again, while the Brute was seemingly lost in the Negative Zone.<ref>{{cl|Fantastic Four #178}}: In reality the real [[Reed Richards (Earth-616)|Mister Fantastic]] was caught in the [[Negative Zone]] and his [[Counter-Earth (High Evolutionary)|Counter-Earth]] [[Reed Richards (Counter-Earth) (Earth-616)|double from Counter-Earth]] took his place among the [[Fantastic Four (Earth-616)|Fantastic Four]]. The reason the Counter-Earth Reed was able to fool the Fantastic Four was because their Reed had lost the use of his powers in {{cl|Fantastic Four #177}}. The Fantastic Four eventually learned the truth and rescued their true leader from the Negative Zone in {{cl|Fantastic Four #183}} with the Brute being stranded there in his place.</ref>\n\n===More Failed Recruitment===\n[[File:Frightful Four (Earth-616) Electro joins the group from Peter Parker the Spectacular Spider-Man Vol 1 40.jpg|thumb|left|308px|Electro join the group.{{r|Peter Parker, The Spectacular Spider-Man #40}}]] The Frightful Four were quickly incarcerated again, but just as quickly broke free while being processed by the authorities thanks to the Wizard's ingenuity.{{r|Marvel Team-Up #58}} The group then began seeking out yet another member. They selected Spider-Man's longtime foe [[Maxwell Dillon (Earth-616)|Electro]]. After succeeding in a test run of his powers,{{r|Peter Parker, The Spectacular Spider-Man #39}} they admitted Electro into their group.{{r|Peter Parker, The Spectacular Spider-Man #40}} Seeking to get revenge against both Spider-Man and the Fantastic Four, the new Frightful Four went to the Statue of Liberty. Electro then used one of the Wizard's devices that imitated the Human Torch's powers in order to trick Spider-Man into meeting them there. Expecting the Human Torch, Spider-Man was instead ambushed and overpowered by the Frightful Four who easily defeated the wall-crawler.<ref>{{cl|Peter Parker, The Spectacular Spider-Man #42}}: [[Peter Parker (Earth-616)|Spider-Man]] and the [[Jonathan Storm (Earth-616)|Human Torch]] had used the Statue of Liberty as a meeting place since {{cl|Strange Tales Annual #2}}</ref> The Tapster then disguised himself as Spider-Man in order to infiltrate the Baxter Building where he easily subdued the Human Torch and the Thing before disabling the security systems. The Frightful Four then made an attack on Mister Fantastic and the Invisible Girl, but the real Spider-Man managed to break free and join the fray. With the regrouped Fantastic Four, the evil Frightful Four were easily defeated and once again turned over to the authorities.{{r|Fantastic Four #218}}\n\n[[File:Frightful Four (Earth-616) Trapster, Sandman, Wizard, Llyra from Amazing Spider-Man Vol 1 214.jpg|thumb|300px|Trapster, Sandman, Wizard and Llyra{{r|Amazing Spider-Man #214}}]] The Wizard was later broken out of [[Ryker's Island]] prison by the Sub-Mariner's foe [[Llyra Morris (Earth-616)|Llyra]]. Llyra required the Wizard to defeat his old foe and he agreed to assist her provided that he help her destroy his old foe Spider-Man. While Llyra posed as a new tenant that Peter Parker would find attractive. Tracking the wall-crawler with a special device to his [[410 Chelsea Street|civilian home]] Llyra and the Wizard attempted to trap him by setting the apartment building ablaze.{{r|Amazing Spider-Man #213}} Spider-Man managed to save his fellow tenants, foiling the Wizard's plans. Llyra had the Wizard break out his fellow Frightful Four members, Sandman and the Trapster to help in her plot to get revenge against the Sub-Mariner. Llyra's activities got the attention of her prey who came to New York. The Sub-Mariner detected Llyra's presence and attacked the hotel where Peter Parker and his fellow tenants were put up for the night. This led to a battle between Sub-Mariner, Spider-Man and the Frightful Four. The villains then blasted the two heroes with a weapon provided by Llyra.{{r|Amazing Spider-Man #214}} [[File:Frightful Four (Earth-616) Taskmaster, Constrictor, and Deadpool from Deadpool Vol 3 35.jpg|thumb|left|294px|Taskmaster, Constrictor, and Wade Wilson.{{r|Deadpool Vol 3 35}}]]The device succeeded in transferring Spider-Man's Spider-Sense to the Sub-Mariner. Despite this handicap, the two heroes defeated the Frightful Four. While the Wizard and his cohorts were turned over to the authorities, Namor took Llyra into his possession to answer for her crimes in [[Atlantis]].{{r|Amazing Spider-Man #215}} The Wizard attempted to revive the Frightful Four by hiring an entirely new members. This time around he hired the [[Anthony Masters (Earth-616)|Taskmaster]], [[Frank Payne (Earth-616)|Constrictor]] and mercenary [[Wade Wilson (Earth-616)|Wade Wilson]]. This new iteration of the Frightful Four lasted for only one mission, wherein they attacked the Baxter Building only to be driven away by the Thing and his godson Franklin.{{r|Deadpool Vol 3 35}}\n\nThe Wizard formed yet another version of the team which included [[Morris Bench (Earth-616)|Hydro-Man]], [[Mary MacPherran (Earth-616)|Titania]], and [[Ulysses Klaw (Earth-616)|Klaw]]. Their attack on the Fantastic Four coincided with the end of the so-called [[Inferno (Event)|Inferno]] crisis. At this time the Fantastic Four was led by the Thing and included the Human Torch, and [[Sharon Ventura (Earth-616)|She-Thing]]. With the Human Torch incapable of controlling his flame powers due to the Inferno, and the recent departure of their teammate [[Crystalia Amaquelin (Earth-616)|Crystal]], Mister Fantastic and the Invisible Woman returned to the ranks of the group. The Frightful Four attacked just as Mister Fantastic used a device to restore the Torch back to normal. During the battle, the Thing was knocked into the same device, the resulting explosion resulted in the Thing being reverted back to his human form.<ref>{{cl|Fantastic Four #326}}: [[Reed Richards (Earth-616)|Mister Fantastic]] and the [[Susan Storm (Earth-616)|Invisible Woman]] left the [[Fantastic Four (Earth-616)|Fantastic Four]] to spend time raising their son [[Franklin Richards (Earth-616)|Franklin]] in {{cl|Fantastic Four #306}}. They left the [[Benjamin Grimm (Earth-616)|Thing]] in charge of [[Sharon Ventura (Earth-616)|Ms. Marvel]] (who later became She-Thing in {{cl|Fantastic Four #310}}), [[Crystalia Amaquelin (Earth-616)|Crystal]], and the [[Jonathan Storm (Earth-616)|Human Torch]] in that very issue. Crystal left the team in {{cl|Fantastic Four Annual #21}}. The Torch's powers were increased by the [[Inferno (Event)|Inferno]] in {{cl|Fantastic Four #322}} through {{cl|Fantastic Four #325|325}}</ref> The Wizard allowed the Fantastic Four to defeat them and his team retreated. When the Fantastic Four tracked their evil counterparts to their hideout, it was right into the Wizard's trap. The Wizard had discovered that [[Aron (Earth-616)|Aron the Rogue Watcher]] was observing the Fantastic Four. Aron incapacitated the Fantastic Four and arrived with his minion the [[Draconus (Earth-616)|Dragon Man]].{{r|Fantastic Four #327}} However Aron was only interested in collecting the Fantastic Four's DNA samples and quickly teleported away. With the Four defeated, the Wizard and his minions placed them in cryogenic suspension tubes. However they were located by Ben Grimm, who freed his comrades and freed them. The Fantastic Four then quickly defeated the Frightful Four. But, when they attempted to bring the group to the authorities both teams were teleported to another dimension. There they were confronted by Aron who revealed that he had created [[Fantastic Four (Clones) (Earth-616)|clones of the Fantastic Four]] to control and do his bidding and he incapacitated both teams.<ref>{{cl|Fantastic Four #328}}: [[Aron (Earth-616)|Aron]] was collecting DNA samples from the [[Fantastic Four (Earth-616)|Fantastic Four]] beginning in {{cl|Fantastic Four #321}}</ref> \n\nThe Fantastic Four and the Frightful Four were then placed in suspended animation while the clones of the heroes ran amok.{{r|Fantastic Four #329}}{{r|Fantastic Four #330}}{{r|Fantastic Four #331}}{{r|Fantastic Four #332}} Eventually the Human Torch's powers allowed him to free himself from cryogenic suspension. When he placed Aron in suspension and freed his comrades a fail-safe not only freed the Frightful Four, but teleported the Fantastic Four clones to Aron's hideout in the Rocky Mountains. The Frightful Four were forced to team up with their enemies to stop the clones that suddenly attacked. During the course of the battle Aron freed himself. He then revealed that he had changed his plans, he teleported the Frightful Four to the [[Vault (Prison)|Vault]] prison and the Fantastic Four back home. Aron then disappeared with his clones intent on monitoring their dreams for his own amusement.{{r|Fantastic Four #333}} Not long after this, the Wizard and the Trapster reunited and sought to bring the Sandman back into the fold.{{r|Amazing Spider-Man Annual #24}} [[File:Frightful Four (Earth-616) Trapster, Dreadknight, Wizard, Man-Bull from Amazing Spider-Man Chaos in Calgary Vol 1 4.jpg|thumb|302px|Trapster, Dreadknight, Wizard and Man-Bull.{{r|Amazing Spider-Man: Chaos in Calgary #4}}]]When they found the Sandman they offered him to rejoin them, but the Sandman was making an effort to reform at the time. When he refused the Wizard threatened to inform the authorities of his location, as the Sandman was still wanted at the time, but the Sandman warned the Wizard that the biggest mistake he could make was being in the same prison as him if that happened. The Wizard then conceded, allowing the Sandman to go his own way.{{r|Spectacular Spider-Man Annual #10}} The Wizard and the Trapster later recruited [[Bram Velsing (Earth-616)|Dreadknight]] and the [[William Taurens (Earth-616)|Man-Bull]]. This new incarnation smuggled themselves into Canada in order to kidnap Nobel Prize winning physicist Dr. Cargill during his appearance at the Calgary Stampede. This kidnapping attempt was foiled by Spider-Man (who was there in his civilian identity Peter Parker, then a photographer for the [[Daily Bugle]]), the visiting [[Rangers (Earth-616)|Rangers]] and the novice hero [[Joline Cargill (Earth-616)|Turbine]].{{r|Amazing Spider-Man: Chaos in Calgary #4}}\n\n[[File:Frightful Four (Earth-616) from Fantastic Four Unlimited Vol 1 5 001.jpg|thumb|left|Klaw, Wizard, Red Ghost, and Miss Thing.{{r|Fantastic Four Unlimited #5}}]]\nFollowing the defeat of the short-lived [[Fearsome Foursome (Earth-616)|Fearsome Foursome]], the Wizard was angered that a group formed using a similar name to his own creation. As such the Wizard broke out of the Vault and gathered a new Frightful Four which consisted of Klaw, Miss Thing, and the [[Ivan Kragoff (Earth-616)|Red Ghost]] and his [[Super-Apes (Earth-616)|Super-Apes]]. With none of the members seeking to to be a subordinate, the Wizard decided that they would compete to see who was fit to rule by attacking the Fantastic Four. At the time the FF were reeling from the apparent death of their leader Mister Fantastic and included [[Scott Lang (Earth-616)|Ant-Man]] among their ranks at the time. Luring the Fantastic Four to the Wizard's home, each member battled a different member of the Fantastic Four. The group was ultimately defeated when the Wizard, while battling the Human Torch, trapped his foe in a pocket of non-causality. When the Torch goaded the Wizard into attacking him, the Wizard's Wonder-Gloves caused feed back to the non-causality field. This in turn sent a wave across the house revitalizing the Fantastic Four. Utterly defeated, this incarnation of the Frightful Four fled and parted ways following their defeat.<ref>{{cl|Fantastic Four Unlimited #5}}: The short-lived [[Fearsome Foursome (Earth-616)|Fearsome Foursome]] battled the [[Fantastic Four (Earth-616)|Fantastic Four]] in {{cl|Fantastic Four #387}}. At the time [[Reed Richards (Earth-616)|Mister Fantastic]] was presumed to have died in a battle against [[Victor von Doom (Earth-616)|Doctor Doom]] in {{cl|Fantastic Four #381}}. However he appeared alive and well in {{cl|Fantastic Four #407}}.</ref>\n\n===Half-Stable===\nWhat followed was an extended period of time where the Wizard and the Trapster worked for a prolonged period together usually changing up the other two members of the group during each scheme. Meanwhile, during his time away from the Frightful Four, the Sandman had redeemed himself as a hero, becoming a member of [[Silvija Sablinova (Earth-616)|Silver Sable's]] [[Wild Pack (Earth-616)|Wild Pack]],{{r|Silver Sable and the Wild Pack #1}} as well as becoming a reserve member in the Avengers.{{r|Avengers #329}} Disturbed by this trend, the Wizard kidnapped the Sandman and exposed him to his newly rebuilt ID machine. This restored the Sandman's previous persona, and although he did not rejoin the Wizard at this point, this would cause the Sandman to eventually return to his criminal ways.{{r|Peter Parker: Spider-Man Vol 1 #12}} The Wizard, Trapster and Sandman then got involved in what a staged attempt on the life of [[Stewart Ward (Earth-616)|Senator Stewart Ward]]. This attempt was to boost Ward's popularity, an orchestrated event that was made successful with the interference of Spider-Man and the Fantastic Four. However the attempt ruined the Sandman's precarious cover, ruining any further pretensions that he had reformed for good.{{r|Amazing Spider-Man Vol 2 #4}} The Wizard and Trapster's part on Senator Ward's scheme were later foiled by Spider-Man.{{r|Amazing Spider-Man Annual #1999}}\n\nThe Wizard and Trapster then formed a new version of the Frightful Four which included She-Thing and the [[Punisher (Galactus' Robot) (Earth-616)|Punisher]] robot. They took over the [[Keewazi (Earth-616)|Keewazi]] reservation in Silver Rock Springs, Oklahoma, seeking to find the location of lost gold and jewels of the [[Manidoog]] god [[Tomazooma (Manidoog God) (Earth-616)|Tomazooma]]. This plot was foiled by the Fantastic Four when they were summoned by their ally [[Wyatt Wingfoot (Earth-616)|Wyatt Wingfoot]] and they were apprehended.{{r|Fantastic Four Vol 3 #29}} Also during this time, the Wizard sought to get revenge against Deadpool for bungling a previous Frightful Four mission. Working with former failed Frightful Four inductees the Taskmaster and Constrictor, as well as Deadpool's ex-girlfriend the shapeshifter known as [[Vanessa Carlysle (Earth-616)|Copycat]] who posed as Titania. ultimately their plan came to fruition when Deadpool exposed the plot and the blew up his home the [[Deadlounge]], although Deadpool survived.<ref>{{cl|Deadpool Vol 3 45}}: The culmination of this plot began in {{cl|Deadpool Vol 3 38}} through {{cl|Deadpool Vol 3 45|45}} primarily involved the [[Frank Payne (Earth-616)|Constrictor]] and [[Vanessa Carlysle (Earth-616)|Copycat]] (posing as Titania) living with [[Wade Wilson (Earth-616)|Deadpool]] for a period of time.</ref>\n\n[[File:Frightful Four (Earth-616) Wizard, Salamandra, Hydroman and the Trapster from Fantastic Four Vol 1 514.jpg|thumb|left|The Wizard, Salamandra, Hydro-Man and the Trapster.{{r|Fantastic Four #514}}]] The Wizard later formed yet another incarnation of the Frightful Four along with the Trapster. This group also included the Wizard's estranged ex-wife [[Salamandra (Earth-616)|Salamandra]]. To this end, the Wizard wanted to exploit his daughter [[Cole Wittman (Earth-616)|Cole]] to lure the Fantastic Four into a trap.{{r|Fantastic Four #514}} The Wizard also re-recruited Hydro-Man onto the team after he was defeated in a battle against Spider-Man and the Human Torch.{{r|Fantastic Four #512}}{{r|Fantastic Four #513}} The Wizard then boosted Hydro-Man's powers but made him dependent on the Wizard to live. The Wizard's next part of his scheme was to secure Cole's loyalty by manipulating her into a romance with the Human Torch. The end result of this hook-up was that Cole would help the Frightful Four infiltrate the Baxter Building and then the Wizard plotted for her to get injured making it appear that the Fantastic Four were responsible. Cole held up her end of the mission, having succeeded in arranging a meeting with the Torch after romancing him on an online chatroom. Once admitted into the Baxter Building, she used her special transporter ring to get the Frightful Four past the Baxter Building's security systems.<ref>{{cl|Fantastic Four #514}}: The [[Peter Petruski (Earth-616)|Trapster]] managed to escape, although how is unexplained, he was seen again in {{cl|Secret War #3}}</ref> During the course of the battle the Wizard realized that his daughter had the ability to control the gravity of objects although it affected her personal mass in the process. This caused him to abruptly change his plans and when the Trapster attempted to eliminate his daughter as planned, the Wizard turned on the Trapster, trapping him in a temporal loop seemingly forever. After filming the defeat of the Fantastic Four for a world audience the Wizard then teleported his team away. Back at base, Cole was disgusted that her father would see her as merely an experiment and fled seeking out the Fantastic Four to cure herself of her condition and defeat her father and his minions.{{r|Fantastic Four #515}} In the ensuing battle, Hydro-Man and Salamandra, the Wizard and Cole seemingly perished when she increased her mass to a massive level causing them to slam into the waters outside of New York City.<ref>{{cl|Fantastic Four #516}}: With the exception of [[Cole Wittman (Earth-616)|Cole]] all members were seen again. [[Morris Bench (Earth-616)|Hydro-Man]] in {{cl|Marvel Knights: Spider-Man #6}}, [[Salamandra (Earth-616)|Salamandra]] in {{cl|Fantastic Four: Foes #1}} and both the [[The Wizard (Earth-616)|Wizard]] in {{cl|Secret War #3}}</ref>\n\nThe Frightful Four remained disbanded for a time, although some of its members would work again in the future. Both the Wizard and the Trapster were pawns in [[Lucia von Bardas (Earth-616)|Lucia von Bardas']] revenge scheme against [[Nicholas Fury (Earth-616)|Nick Fury]] for previously overthrowing her as ruler of [[Latveria]]<ref>See {{cl|Secret War #1}} through {{cl|Secret War #5|5}}</ref> The Wizard, Trapster, Klaw, Hydro-Man, Salamandra, and the Red Ghost were all among a group of super-villains who were gathered by the [[Phillip Masters (Earth-616)|Puppet Master]] and the [[Mad Thinker (Julius) (Earth-616)|Mad Thinker]] who were attempting to gather an army of villains to battle the Fantastic Four. This was a failed endeavor as none of the gathered villains wished to participate and left, unknowingly leaving the DNA samples that the two organizers of this plan really sought. These DNA sampled ended up in the hands of the Fantastic Four who came to believe that they would die within two year unless they permanently incarcerated their foes.{{r|Fantastic Four: Foes #1}} The Wizard, Klaw, Hydro-Man and Red Ghost were all among those captured and placed in a new Vault prison built in the Negative Zone.{{r|Fantastic Four: Foes #5}} When the Mad Thinker staged a massive breakout they were opposed by the Fantastic Four, the [[Jennifer Walters (Earth-616)|She-Hulk]] and [[Hercules Panhellenios (Earth-616)|Hercules]]. When the fighting was too much both the Wizard and Red Ghost agreed to return to their cells. The only former member of the Frightful Four to escape that day was the Klaw.{{r|Fantastic Four: Foes #6}}\n\n[[File:Frightful Four (Earth-616) Wizard, Titania, Trapster, Hydroman from Fantastic Four Vol 1 549.jpg|thumb|298px|Wizard, Titania, Hydro-Man and the Trapster.{{r|Fantastic Four #549}}]] Sometime late the Wizard regrouped the Frightful Four along with the Trapster, Hydro-Man and Titania and once again sought to eliminate the Fantastic Four. It was during this period that Mister Fantastic and the Invisible Woman were on their second honeymoon on the moon of [[Titan (Moon of Saturn)|Titan]] while their spots in the Fantastic Four were filled by the [[T'Challa (Earth-616)|Black Panther]] and his wife [[Ororo Munroe (Earth-616)|Storm]]. While Reed was away getting assistance on Earth to decipher a strange meteor he discovered the Wizard planted a bomb on his shuttle before going to Titan with his team and taking the Invisible Woman hostage. He then issued a challenge to the Fantastic Four to face him.<ref>{{cl|Fantastic Four #547}}: Following the events of the [[Civil War (Event)|Super-Hero Civil War]], [[Reed Richards (Earth-616)|Mister Fantastic]] and the [[Susan Storm (Earth-616)|Invisible Woman]] decided to take time away from the team to focus on their marriage choosing the [[T'Challa (Earth-616)|Black Panther]] and [[Ororo Munroe (Earth-616)|Storm]] to be their successors at the end of {{cl|Fantastic Four #543}}</ref> Suspecting a trap the Black Panther had the group remotely access Reed's ship causing the bomb to go off and the group went to Titan in another vessel. When the Fantastic Four arrived, the Wizard and his allies were not prepared to face the Black Panther and Storm fighting alongside Mister Fantastic, the Thing, and the Human Torch. However, the Wizard had a surprise of his own: a fifth member he had hidden, Klaw.{{r|Fantastic Four #548}} The Frightful Four' secret weapon was defeated by the Thing thanks to some [[Vibranium]] earplugs that made him immune to Klaw's powers. The rest of the group were easily trounced. A vengeful Invisible Woman then threatened to end the Wizard's life by using her powers to cause him a heart attack, and the fear of her doing so caused the Wizard to faint in fear. The Fantastic Four then left Titan to attend to other matters.{{r|Fantastic Four #549}}\n\n===Fall of the Hulks===\nFor years the Wizard had been part of a group of super-criminal geniuses known as the [[Intelligencia (Earth-616)|Intelligencia]] which included the [[Samuel Sterns (Earth-616)|Leader]], [[George Tarleton (Earth-616)|MODOK]], the Red Ghost, and the Mad Thinker. The end result of their scheme was to use a combination of gamma radiation and cosmic energy to create an army of super-powerful beings like the [[Bruce Banner (Earth-616)|Hulk]] to conquer the world.<ref>{{cl|Fall of the Hulks: Alpha #1}}: The actual end game of this scheme was not revealed until {{cl|Fall of the Hulks: Red Hulk #4}}. For the sake of clarity on events pertaining to the Frightful Four will be referenced here, for more on these events see [[Fall of the Hulks]].</ref> One of their pawns in this scheme was the mysterious [[Thaddeus Ross (Earth-616)|Red Hulk]], who ultimately betrayed the Intelligencia to work with Bruce Banner, the Hulk's alter ego.{{r|Fall of the Hulks: Gamma #1}} \n\nDuring the initial planning phase of this plan the Wizard sought to reform his Frightful Four after learning that Thundra was back in his native time, he planned on using her in this latest incarnation.{{r|Fall of the Hulks: Alpha #1}} The Wizard then gathered Klaw and the Trapster and approached Thundra asking her to rejoin their group. By this point she had allied herself with the Red Hulk and summoned him. The three villains were no match for the Hulk and Thundra and fled.{{r|Fall of the Hulks: Red Hulk #2}} Soon the Intelligencia learned that Thundra had a daughter, with DNA taken from the Hulk, in the future of [[Earth-8009]]. This daughter, [[Lyra (Earth-8009)|Lyra]], had come to the modern age after being shunned in her own era. When it appeared that Lyra held animosity toward her mother and the Wizard seemingly convinced her to join his Frightful Four after sending the savage [[Elizabeth Ross (Earth-616)|Red She-Hulk]] upon her to illustrate that the world feared Hulks. Lyra joined the group, but the Wizard and his cohorts were unaware that this was only a means to find her missing friend, the original She-Hulk, Jennifer Walters.<ref>{{cl|Fall of the Hulks: The Savage She-Hulks #1}}: [[Jennifer Walters (Earth-616)|She-Hulk]] went missing in action battling [[Leonard Samson (Earth-616)|Doc Samson]] in {{cl|Incredible Hulk #600}}.</ref> \n\nPart of the Intelligencia's plot was to kidnap the 10 greatest minds in the world. The Frightful Four were then sent to capture Mister Fantastic of the Fantastic Four. Although their attack on the Baxter Building was complicated with interference from the Red Hulk, the Frightful Four were successful in their mission.{{r|Hulk Vol 2 #19}} Lyra soon betrayed the Frightful Four after finding the She-Hulk imprisoned aboard the Intelligencia's helicarrier,{{r|Fall of the Hulks: The Savage She-Hulks #1}} and freeing her.{{r|Fall of the Hulks: The Savage She-Hulks #2}} Ultimately, the Intelligencia's plans began falling apart thanks to the interference of the Red Hulk and Bruce Banner.<ref>See [[Fall of the Hulks]]</ref> This ended with a final battle between the true Hulk and his red counterpart. During the ensuing clash the Wizard, Trapster, Klaw, the Red Ghost, and Mad Thinker all attempted to rob the US Treasury, but their attempt was interrupted by the two warring behemoths.{{r|Hulk Vol 2 #24}}\n\n===Fractured===\nAround this time the Fantastic Four discovered that the Wizard was creating clones of himself. One, the young boy known as [[Bentley Wittman (Clone) (Earth-616)|Bentley-23]] was recovered and taken in by the group.{{r|Fantastic Four #570}} Mister Fantastic became determined to raise the boy in the hopes that he would become something greater than the original Wizard. When Richards later formed his [[Future Foundation (Earth-616)|Future Foundation]], Bentley-23 was among the founding class.{{r|Fantastic Four #579}} By this point the Wizard was becoming mentally unstable,{{r|FF #1}} due to a tumor growing in his brain.{{r|Fantastic Four #610}}\n\nThe members of the Frightful Four went their own ways only to be hunted down by the She-Hulk and Lyra and imprisoned at the old [[Gamma Base]] in Death Valley, Nevada. The Trapster was captured in Las Vegas, the Wizard in Monte Carlo,{{r|She-Hulks #1}} the Red Ghost in St. Petersberg,{{r|She-Hulks #2}} and the Mad Thinker and Klaw in Switzerland.{{r|She-Hulks #3}}{{r|She-Hulks #4}} The Wizard briefly broke out and attempted to get revenge against Lyra, but he was quickly recaptured.{{r|She-Hulks #4}}\nThe various members of the Frightful Four soon broke free but did not officially reform. The Wizard, Red Ghost and Klaw remained with the Intelligencia inventing the Zero Cannon. They were soon infiltrated by the [[Dmitri Smerdyakov (Earth-616)|Chameleon]] (who took Klaw's place) and were attacked by [[Otto Octavius (Earth-616)|Doctor Octopus']] [[Sinister Six (Earth-616)|Sinister Six]] which included Sandman among their ranks. The Intelligencia barely survived the encounter.{{r|Amazing Spider-Man #676}} The Wizard, Klaw, Red Ghost and Trapster were also present during an Intelligencia meeting aboard a ship on the North Sea. This meeting was interrupted by the mercenary Deadpool, but they again survived the encounter.{{r|Deadpool Vol 4 #55}}\n\n[[File:Frightful Four (Earth-616) Medusa, Wizard, Blastaar, and Bentley-23 from FF Vol 2 5.jpg|thumb|left|Medusa, Wizard, Blastaar, and Bentley-23.{{r|FF Vol 2 #5}}]]\nThe Wizard soon became obsessed with proving himself to his clone, Bentley-23, coming to regard him as a son. During a period in which the Fantastic Four were missing in action, four replacements were selected to act in their stead: Ant-Man, Medusa, She-Hulk and pop-star [[Darla Deering (Earth-616)|Darla Deering]]. To this end, the Wizard sought to create the polar opposite to the Fantastic Four. Enslaving Medusa again, he also recruited Blastaar and absconded with Bentley to form a new Frightful Four.<ref>{{cl|FF Vol 2 #5}}: The [[Fantastic Four (Earth-616)|Fantastic Four]] were lost in time and space in {{cl|Fantastic Four Vol 4 #2}} & {{cl|FF Vol 2 #2}}, they eventually returned in {{cl|Fantastic Four Vol 4 #16}}.</ref> Creating a bizarre version of the Baxter Building in the Negative Zone, the Wizard transported the real building there as well. The replacement Fantastic Four and the Future Foundation then went on a rescue mission to free Bentley. Bentley turned against his own father helping the group free Medusa and incapacitated Blastaar. With his Frightful Four \"family\" defeated, the Wizard was turned over to Black Bolt, king of the Inhumans, for punishment.{{r|FF Vol 2 6}}\n\n[[File:Frightful Four (Earth-616) from Superior Carnage Vol 1 3 001.jpg|thumb|right|Wizard, Klaw, and the Superior Carnage]]\n===Superior Carnage===\nWith his mind further addled by the Black Bolt, the Wizard decided to form yet another Frightful Four in order to prove himself one last time for his \"son\" Bentley-23.{{r|Superior Carnage #2}} Inspired by the United States using the [[Venom (Symbiote) (Earth-616)|Venom symbiote]] to create [[Eugene Thompson (Earth-616)|Agent Venom]], the Wizard recruited the Klaw and broke into a maximum security penitentiary to liberate [[Cletus Kasady (Earth-616)|Carnage]] to create the opposite. While the [[Carnage (Symbiote) (Earth-616)|Carnage symbiote]] was alive, it's host Cletus Kasady was brain dead at the time, thus forcing Klaw to incapacitate it.<ref>{{cl|Superior Carnage #1}}: [[Cletus Kasady (Earth-616)|Cletus]] was rendered into this state by the [[Kaine Parker (Earth-616)|Scarlet Spider]] in {{cl|Minimum Carnage: Omega #1}}</ref> The Wizard also enlisted the aid of crippled criminal scientist [[Karlin Malus (Earth-616)|Karl Malus]] to try and contain the Carnage symbiote. This proved impossible since it was grafted to a brain-dead host, and so the Wizard had it forcibly grafted to Malus instead.{{r|Superior Carnage #2}} Enslaving Malus and the symbiote as a new \"Superior\" Carnage, the Wizard's Frightful Four was now complete. His first step to grander schemes was attacking New York City hall and taking control of it from mayor [[John Jonah Jameson (Earth-616)|J. Jonah Jameson]]. Although they successfully stormed city hall and took it over they were soon opposed by [[Otto Octavius (Earth-616)|Spider-Man]] and his [[Spiderlings (Earth-616)|henchmen]].<ref>{{cl|Superior Carnage #3}}: This version of Spider-Man was really [[Otto Octavius (Earth-616)|Doctor Octopus]] who took over the body of the original [[Peter Parker (Earth-616)|Spider-Man]] in {{cl|Amazing Spider-Man #700}} and took over the heroes role in {{cl|Superior Spider-Man #1}}. Octavius as Spider-Man formed an army of henchmen in {{cl|Superior Spider-Man #13}}</ref>\n\nDuring the course of the battle the Wizard's mind probe device learned that the Spider-Man he was fighting was really Doctor Octopus in Spider-Man's body. The new Superior Carnage managed to free himself and seemingly slew Klaw, disbursing his sound form. The resulting sonic blast blasted the Carnage symbiote from the body of Karl Malus and it grafted itself on the Wizard instead.{{r|Superior Carnage #4}} Spider-Man proved no match against the Carnage/Wizard symbiosis and it seemingly slew Karl Malus. The battle seemed to be in the Wizard/Carnage's favor until Klaw intervened with another sound blast before his consciousness was seemingly lost forever in the so-called sound wall. Although the Wizard was recaptured and the Carnage symbiote contained, the authorities quickly discovered that the experience cured the Wizard of the tumor that was slowly eating away at his mind.{{r|Superior Carnage #5}}\n\n[[File:Frightful Four (Earth-616) Wizard, Bulldozer, Wrecker, Thunderball from Fantastic Four Vol 5 3.jpg|thumb|left|Wizard, Bulldozer, Wrecker & Thunderball.{{r|Fantastic Four Vol 5 #3}}]]\n===The Fall of the Fantastic Four===\nRecently it was revealed that the so-called [[Quiet Man (Earth-616)|Quiet Man]] had apparently been manipulating the Fantastic Four and their foes for years due his obsession with the Invisible Woman and the perception that Mister Fantastic stole her from him during their collage years. The full scope of these manipulations and how they might have effected the Frightful Four and its individual members over the years is as yet unexplained.{{r|Fantastic Four Vol 5 #14}} However, the Quiet Man quickly began setting off a series of events that he hoped would ultimately discredit and destroy the Fantastic Four. This began with an army of creatures that invaded New York.{{r|Fantastic Four Vol 5 #1}} This battle ended with the Human Torch losing his powers thanks to a device that Reed used to incapacitate the invaders.{{r|Fantastic Four Vol 5 #2}} While the Fantastic Four were still reeling from this loss, the Quiet Man hired the Wizard to form new versions of the Frightful Four to attack the group.{{r|Fantastic Four #642}} This first group of attackers consisted of members of the [[Wrecking Crew (Earth-616)|Wrecking Crew]] including the [[Dirk Garthwaite (Earth-616)|Wrecker]], [[Eliot Franklin (Thunderball) (Earth-616)|Thunderball]] and [[Marci Camp (Earth-616)|Bulldozer]].{{r|Fantastic Four Vol 5 #3}} This incarnation of the Frightful Four was defeated thanks to the combined efforts of the Fantastic Four and their FF back-ups. However, as a result of the battle [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|SHIELD]] took possession of the Baxter Building and custody of the Future Foundation children.{{r|Fantastic Four Vol 5 #4}}\n\nThe Quiet Man then continued his campaign against the Fantastic Four, eventually framing the Thing for the murder of the Puppet Master.{{r|Fantastic Four Vol 5 #8}} Found guilty the Thing was incarcerated at Rykers Island. The Quiet Man also orchestrated events so that Mister Fantastic and the Invisible Woman began working for one of his alter-egos, the futurist John Eden.{{r|Fantastic Four #9}} The Wizard was next dispatched to Chicago with a Frightful Four consisting of the female members of the [[Salem's Seven (Earth-616)|Salem's Seven]]: [[Gazelle (Scratch) (Earth-616)|Gazelle]], [[Vertigo (Salem's Seven) (Earth-616)|Vertigo]] and [[Reptilla (Earth-616)|Reptilla]]. Mister Fantastic had to face off this group alone, and challenge due to the magical nature of their powers. However he defeated this new incarnation of the evil FF with the assistance of the [[Wanda Maximoff (Earth-616)|Scarlet Witch]].{{r|Fantastic Four Vol 5 #10}} By this point the Quiet Man was reaching his end game, using his [[Avengers (Onslaught Reborn) (Earth-616)|Avengers]] from [[Counter-Earth (Heroes Reborn)|Counter-Earth]] to capture Franklin Richards,{{r|Fantastic Four Vol 5 #12}} the Wizard was charged with overseeing the manipulation of the boy's powers for a full out invasion of Earth.{{r|Fantastic Four Vol 5 #13}} This reunited the Wizard with Bentley-23, whom he tried to convince to join the Quiet Man.{{r|Fantastic Four Vol 5 #14}}\n\nWhen the Quiet Man launched his invasion of mutated creatures all over Earth, Bentley-23 turned on his creator and helped free Franklin and the other members of the Future Foundation and escape.{{r|Fantastic Four #642}} This act of rebellion impress the Wizard who gave his clone his blessing.{{r|Fantastic Four #643}} Later, the Wizard recruited a new Frightful Four team consisting of She-Thing, Thundra, and the Sandman to assist in fighting the Quiet Man's invasion of Earth.{{r|Fantastic Four #644}} Ultimately the Fantastic Four ended the Quiet Man's invasion once and for all.{{r|Fantastic Four #645}}\n\n| Equipment               = \n| Transportation          = Various vehicles built by Wizard. \n| Weapons                 = Individual members' weapons.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "2945"
}