{
    "pageid": 278868,
    "ns": 0,
    "title": "Gamma Corps: Black (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Gamma Corps Black (Earth-616) from Incredible Hulk Vol 1 601 001.jpg\n| Name                    = Gamma Corps: Black\n| Aliases                 = [[Gamma Corps]]\n\n| Status                  = Defunct\n\n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[John Ryker (Earth-616)|General Ryker]]\n| CurrentMembers          = \n| FormerMembers           = [[Rana Philips (Earth-616)|Aberration]], [[Morass (Earth-616)|Morass]], [[Erin Cicero (Earth-616)|Axon]]\n| Allies                  = \n| Enemies                 = [[Lyra (Earth-8009)|Lyra]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Greg Pak; Ariel Olivetti\n| First                   = Incredible Hulk #601\n| Last                    = \n\n| HistoryText             = After the success of the first [[Gamma Corps (Earth-616)|Gamma Corps]], [[Norman Osborn (Earth-616)|Norman Osborn]] ordered General [[John Ryker (Earth-616)|John Ryker]] to create a new Gamma Corps, composed of female \"volunteers\". These so-called volunteers were all mentally unstable ex-soldiers waiting on death row. The trio were taken to the Origins Corporation to be used in their gene therapy program. General Ryker then sent the team to capture [[Lyra (Earth-8009)|Lyra]], the [[earth-8009|alternate universe]] She-Hulk, so they could harvest her DNA.\n\nThey the trio attacked and killed Lyra's fellow [[A.R.M.O.R.]] agents and took her personal computer, [[Boudicca (Earth-8009)|Boudicca]], which drove her to hunt them down, first killing [[Morass (Earth-616)|Morass]] by drying out her [[Glob]]-like body.\n\nThe remaining pair headed for a small nearby town, attempting to hold the people hostage in order to make Lyra surrender. In the battle Lyra badly hurt [[Rana Philips (Earth-616)|Aberration]], causing her body to mutate into a tumorous mess, and then killed her with a metal pipe through the head. [[Erin Cicero (Earth-616)|Axon]] then threatened to electrocute the whole town unless Lyra surrendered.\n\nAxon absorbed most of Lyra's bio-electric energy, absorbing her powers. Lyra then made Axon angry, causing the stolen powers to weaken. Axon was then killed remotely by General Ryker's troops.\n\n===Gamma Corps: Black===\n* [[Rana Philips (Earth-616)|Aberration]] - (Private Rana Philips), was an [[Abomination]]/human hybrid experiment, similar to the original Gamma Corps member [[Nichole Martin (Earth-616)|Mess]]. Philips was a more slender female version of the [[Emil Blonsky (Earth-616)|original Abomination]]. Private Philips was incarcerated after her commanding officer used her as a scapegoat for his torture of prisoners of war, inciting her to kill him. Private Philips was sentenced to death, leaving her nothing to lose by being altered by Ryker's experiment.\n\n* [[Morass (Earth-616)|Morass]] - (Name Unrevealed), was a [[Glob]]/human hybrid experiment.  The unnamed woman was given the abilities of the original [[Joseph Timms (Earth-616)|Glob]], she appeared look like more slender female version of the original Glob. Morass was arrested for unknown reasons, and sentenced to death, leaving her nothing to lose by being altered by the Origins Corporation gene therapy program.\n\n* [[Erin Cicero (Earth-616)|Axon]] - (Staff Sergeant Erin Cicero), is an [[Zzzax]]/human hybrid experiment. Staff Sergeant Cicero appeared as more slender female version of the original human hybrid of [[Thaddeus Ross (Earth-616)|Zzzax]]. After being the sole-survivor of her squad from an insurgent ambush in [[Symkaria]], she suffered PTSD, leaving her paranoid. Cicero believed everyone around her was an enemy, leading her to kill her own family and three police officers. Cicero was sentenced to death, leaving her nothing to lose being altered by Ryker's experiment. Axon was the most vicious of the trio, as she attacked and electrocuted a wounded [[A.R.M.O.R.]] agent for fun.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "278868"
}