{
    "pageid": 1294854,
    "ns": 0,
    "title": "Gamma Flight (Alpha Flight Space Program) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Gamma Flight Vol 1 1 Textless.jpg\n| ImageSize               = 250px\n| Name                    = Gamma Flight\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile; formerly [[Alpha Flight Low-Orbit Space Station]]\n\n| Leaders                 = [[Eugene Judd (Earth-616)|Puck]]; formerly [[Walter Langkowski (Earth-616)|Walter Langkowski]], [[Henry Gyrich (Earth-616)|Henry Gyrich]]\n| CurrentMembers          = [[Carl Creel (Earth-616)|Absorbing Man]], [[Delbert Frye (Earth-616)|Del Frye]], [[Leonard Samson (Earth-616)|Doc Sasquatch]], [[Charlene McGowan (Earth-616)|Dr. McGowan]],  [[Eugene Judd (Earth-616)|Puck]], [[Richard Jones (Earth-616)|Rick Jones]], [[Mary MacPherran (Earth-616)|Titania]]\n| FormerMembers           = [[Jacqueline McGee (Earth-616)|Jackie McGee]], [[Romesh Dalton (Earth-616)|Romesh Dalton]], [[Walter Langkowski (Earth-616)|Walter Langkowski]]\n| Allies                  = [[Elizabeth Ross (Earth-616)|Harpy]], [[Bruce Banner (Earth-616)|Hulk]], [[Jennifer Walters (Earth-616)|She-Hulk]], [[Dionne Fortean (Earth-616)|Stockpile]]; formerly {{m|Alpha Flight (Space Program) (Earth-616)|Alpha Flight}}, \n| Enemies                 = [[Avengers (Earth-616)|Avengers]], [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight]], [[Green Spring (Earth-616)|Green Spring]], [[United States Hulkbuster Force (Earth-616)|United States Hulkbuster Force]]; formerly [[Bruce Banner (Earth-616)|Hulk]], [[United States Hulk Operations (Earth-616)|U.S. Hulk Operations]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Ewing; Joe Bennett\n| First                   = Immortal Hulk Vol 1 8\n| Last                    = \n\n| HistoryText             = After apprehending the [[Bruce Banner (Earth-616)|Hulk]] on behalf of [[Reginald Fortean (Earth-616)|General Fortean]] of the [[United States Hulk Operations (Earth-616)|U.S. Hulk Operations]] and delivering him to the authorities, the green monster disappeared without a trace, having been confined to the covert [[Shadow Base Site A]]. Concerned by the vanishing of Bruce Banner, Avengers member and [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight]] commander [[Carol Danvers (Earth-616)|Captain Marvel]] decided to form a task force headed by the depowered [[Walter Langkowski (Earth-616)|Walter Langkowski]] to locate him, this team became known as Gamma Flight, and it was initially comprised of Langkowski.{{r|Immortal Hulk Vol 1 8}}\n\nTogether with reporter [[Jacqueline McGee (Earth-616)|Jackie McGee]], Gamma Flight approached the Hulk when his energy signature was detected in [[Los Diablos Missile Base]], where he was fighting the [[Carl Creel (Earth-616)|Absorbing Man]], who had become possessed by the spirit of [[Brian Banner (Earth-616)|Brian Banner]], who was in turn being controlled by the [[One Below All (Multiverse)|One Below All]]. Using the Absorbing Man's powers, Brian made him soak up all the gamma radiation on the site in order to open a [[Green Door]], which sent everybody on the scene to [[Below-Place]], the One Below All's dwelling.{{r|Immortal Hulk Vol 1 10}} In Below-Place, Puck convinced the Absorbing Man to use his powers to empower the Hulk with gamma radiation, resulting in him defeating the One Below All and returning everybody back to [[Earth]]. In the afthermath, Puck invted the Absorbing Man into the team. He accepted, and requested to bring his wife [[Mary MacPherran (Earth-616)|Titania]] as well.{{r|Immortal Hulk Vol 1 13}}\n\nAfterward, the Hulk teamed-up with [[Leonard Samson (Earth-616)|Doc Samson]] to investigate the now-abandoned Shadow Base Site A.{{r|Immortal Hulk Vol 1 16}} He left behind Samson after the base collapsed, and he was picked up by Gamma Flight when they appeared to investigate.{{r|Immortal Hulk Vol 1 18}} Together with Samson, Gamma Flight continued following the Hulk, arriving at the scene of a battle he had with a Shaow Base-controlled [[Richard Jones (Earth-616)|Rick Jones]]. The team retrieved the [[Gamma-Activated Tissue]] left behind from the battle which had been used by Shadow Base to mutate Jones.{{r|Immortal Hulk Vol 1 20}} The team took the tissue to the [[Alpha Flight Low-Orbit Space Station|Alpha Flight Space Station]], but they were raided by General Fortean shortly afterward. Using a [[Redeemer Armor]], he teleported into the station and attacked Gamma Flight, leaving Langkowski as the only casualty. Fortean then retrieved the tissue and teleported away.{{r|Immortal Hulk Vol 1 21}}\n\nIn retaliation for Fortean's attack, Gamma Flight tracked Fortean's translocator signal and teleported to its source, [[Area 51|Shadow Base Site B]]. However, due to their use of psychics, Shadow Base was expecting their attack and surrounded them on the spot. The tables were turned when the Hulk and his allies appeared to retaliate against Fortean as well.{{r|Immortal Hulk Vol 1 22}} Gamma Flight teamed up with green goliath to take down Fortean,{{r|Immortal Hulk Vol 1 23}} resulting in the Hulk seizing command of Shadow Base. In the aftermath, Samson defected from Alpha Flight and joined the Hulk to keep an eye on him.{{r|Immortal Hulk Vol 1 24}}\n\nAs part of his objective to bring down the global status quo,{{r|Immortal Hulk Vol 1 26}} the Hulk waged war against [[Roxxon Energy Corporation (Earth-616)|Roxxon]].{{r|Immortal Hulk Vol 1 27}} In retaliation, Roxxon orchestrated an attack of four giant monsters on [[Phoenix (Arizona)|Phoenix]], [[Arizona (State)|Arizona]].{{r|Immortal Hulk Vol 1 29}} When Gamma Flight noticed energy signatures of Hulks and his allies as well as the giant monsters, they flew to the city to help contain the monsters. Titania single-handedly killed the monsters codenamed [[Bradbury (Roxxon Bio-Asset) (Earth-616)|Bradbury]],{{r|Immortal Hulk Vol 1 30}} while the Absorbing Man intercepted a fight between the Hulk and [[Xemnu (Earth-616)|Xemnu]], who had arrived to contain the monsters but was secretly working with Roxxon to give the Hulk bad publicity.{{r|Immortal Hulk Vol 1 31}}\n\nFollowing Roxxon and Xemnu's defeat, the Hulk was hailed as a national hero. He was invited to [[Georgeville]], where the [[Samuel Sterns (Earth-616)|Leader]] manipulated Rick Jones to overcharge the Hulk with gamma radiation, making him detonate and destroy the town.{{r|Immortal Hulk Vol 1 35}} Gamma Flight appeared to restrain the Hulk's evident distress, since he had reverted to his more childish personality due to the Leader's scheming.{{r|Immortal Hulk Vol 1 36}} Following an arduous against Titania and the Absorbing Man, the Hulk was subdued by Puck using a laser gun to shoot him in the head.{{r|Immortal Hulk Vol 1 37}}\n\nUnder [[Henry Gyrich (Earth-616)|Henry Gyrich]], Gamma Flight aimed to monitor [[Glossary:Gamma Mutates|Gamma Mutates]]. However, Hulk, was in Gamma Flight's custody, was able to escape from Alpha Flight's [[Alpha Flight Low-Orbit Space Station|space station HQ]] right in front of Gamma Flight.{{r|Immortal Hulk Vol 1 40}} Gyrich scolded Gamma Flight for Hulk's escape, resulting in Gamma Flight quitting rather than work for Gyrich.{{r|Immortal Hulk Vol 1 42}} Later, Puck, Jackie McGee, Dr. McGowan, Rick Jones, Del Frye, and a resurrected Samson in Sasquatch's body decided to reform Gamma Flight to aid the Hulk.{{r|Immortal Hulk Vol 1 46}}\n\nAfter picking up Absorbing Man and Titania, Gamma Flight teleported to Manhattan where the Hulk and the Harpy were battling the [[Avengers (Earth-616)|Avengers]]. Gamma Flight requested that Hulk and Harpy be placed in their custody, but Captain Marvel told them that they no longer had the authority to go after Hulk. So, Gamma Flight fought the Avengers to help Hulk and Harpy. After Harpy talked with She-Hulk who both learned that they had seen the Green Door, which allowed Gamma Mutates come back from the dead, She-Hulk decided to turn on her fellow Avengers and aid her cousin. Gamma Flight, She-Hulk, Harpy, and Hulk then teleported away to a warehouse in [[Brooklyn]].{{r|Immortal Hulk Vol 1 47}} After Gamma Flight parted ways with Hulk, Jackie McGee chose to remain with Hulk, Betty, and She-Hulk and left the team.{{r|Immortal Hulk Vol 1 48}}\n\nDue to choosing to aid Hulk instead of apprehend him, Gamma Flight became wanted by the Alpha Flight Space Program and forced to go on the run. Shortly after Samson and Absorbing Man retrieved supplies and equipment from [[Shadow Base Remote Facility FN34]], most of Gamma Flight traveled to [[Austin]], [[Texas (State)|Texas]] to aid a Gamma Mutate running amuck. Samson was able to talk down the mutate and learned that her name was [[Dionne Fortean (Earth-616)|Dionne]] but was called Stockpile by the organization she escaped from, [[Green Spring (Earth-616)|Green Spring]]. While Puck and Absorbing Man were teleported by Dr. McGowan, she was unable to teleport Stockpile as well. After that, Skaar appeared seemingly repowered to retrieve Stockpile for Green Spring.{{r|Gamma Flight Vol 1 1}}\n\nSkaar fought Gamma Flight who managed to temporarily subdue Skaar with help from Stockpile. When Dr. McGowan couldn't teleport anyone back and forth due to a lack power, Absorbing Man used his powers to turn himself into a translocator, allowing him and Puck to teleport back to Austin to help fight Skaar. When the [[United States Hulkbuster Force (Earth-616)|United States Hulkbuster Force]] arrived to break up the fight, Skaar focused his attention on them instead. When Gamma Flight and Stockpile tried to teleport away through Creel, damage done to Creel by Skaar caused them seemingly disintegrate.{{r|Gamma Flight Vol 1 2}}\n\nGamma Flight and Dionne were transported to an astral plane-like dimension for gamma energy connected to the [[Below-Place]]. After fighting off gamma-mutated creatures and zombies, Dionne revealed that they were in [[Thomasville]], [[Texas (State)|Texas]] where Green Spring conducted experiments with gamma mutation that turned the citizens into zombies. They then met [[Reginald Fortean (Earth-616)|General Fortean]]'s spirit who revealed that someone was using his identity to use Green Spring to create an army of gamma mutates. Then everyone was teleported to Gamma Flight's hideout by [[Charlene McGowan (Earth-616)|Dr. McGowan]], and Dionne stated that she would help Gamma Flight bring down Green Spring.{{r|Gamma Flight Vol 1 3}}\n\n| Equipment               = \n| Transportation          = Translocator; formerly [[Alpha Flight Squadron Jet]]\n| Weapons                 = [[Absorbing Man's Ball and Chain]]\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:International Organizations]]"
                }
            }
        }
    ],
    "page_id": "1294854"
}