{
    "pageid": 500663,
    "ns": 0,
    "title": "Gargoyles (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Gargoyles (Earth-616) from Captain America Comics Vol 1 41 0001.jpg\n| Name                    = Gargoyles\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Vichy]], [[France]]\n\n| Leaders                 = Unnamed Nazi member\n| CurrentMembers          = \n| FormerMembers           = Unnamed members, Unnamed Nazi member\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Vince Alascia\n| First                   = Captain America Comics Vol 1 41\n| Last                    = Captain America Comics Vol 1 41\n\n| HistoryText             = The Gargoyles where mental patients in an insane asylum located in Vichy, France during the 1940s. As [[World War II]] progressed into the year 1944, the people of Vichy became resistant to the [[National Socialist German Workers Party (Earth-616)|Nazis]] that occupied France at the time. In response, the newly appointed Nazi governor of Vichy took the insane asylum patients and dressed them in luminescent gargoyle costumes. Then he had them unleashed at night to attack and kill French citizens. As part of this ruse, all Germans ignored the creatures and then slathered the gargoyle statues around the city with blood making the more superstitious members of town believe that the stone gargoyles were coming to life to kill them. When a group of prominent citizens came to the governor for assistance, he suggested that since the Gargoyles did not attack Germans, then perhaps they would begin acting more German.\n\nSuspecting some kind of trick, the leader of a local [[French Resistance (Earth-616)|French Resistance]] movement then called in the assistance of [[Steven Rogers (Earth-616)|Captain America]] and [[James Buchanan Barnes (Earth-616)|Bucky]]. Investigating the town, they spotted one of the Gargoyles being led by a Nazi agent. Fighting them off, they ended up at the local Notre Dame cathedral where they stumbled upon the governor's operation. Initially tied to the bell to die, the two heroes broke free and, fighting for their freedom, caused the release of the Gargoyles who promptly attacked their masters. In the melee, the the Nazi soldiers and Gargoyles slaughtered each other putting an end to their threat.{{r|Captain America Comics Vol 1 41}}\n\n| Equipment               = Each member of the Gargoyles wore a costume resembling their name sake. Each costume was covered in luminescent paint to cause them to glow in the dark. The costumes had large sharp talons.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = The Gargoyle,Pierre Duval & French Resistance Fighters in Journey Into Mystery#54(9/59)4th story[[http://www.marvunapp.com/Appendix5/duvalpierrewwii.htm]] could be in this story. \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "500663"
}