{
    "pageid": 447780,
    "ns": 0,
    "title": "Gemba Tribe (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Gemba Tribe (Earth-616) from Daring Mystery Comics Vol 1 5 001.jpg\n| Name                    = Gemba Tribe\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = Devil-Flower\n| Enemies                 = [[Trojak (Earth-616)|Trojak]], [[Balu (Earth-616)|Balu]], [[Edith Alton (Earth-616)|Edith Alton]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = \n| PlaceOfFormation        = Somewhere in Africa\n| PlaceOfDissolution      = \n\n| Creators                = Joe Simon\n| First                   = Daring Mystery Comics #5\n\n| History                 = [[File:Gemba Tribe (Earth-616) from Daring Mystery Comics Vol 1 5 002.jpg|thumb|left|Gembian spies]]\nThe Gemba Tribe was a group of savages that lived in the jungles of Africa. Living on a remote island, they worshiped the Devil-Flower that had the power of life and death. The tribe would manipulate the flower, which (through unknown means) could show them visions of what was happening in other locations as well as enthrall animals to do their bidding.\n\nWhen [[Jerry Alton (Earth-616)|Jerry Alton]], the sister of [[Edith Alton (Earth-616)|Edith]] became ill, the jungle hero [[Trojak (Earth-616)|Trojak]] sought the nectar from the Devil-Flower to heal Jerry. With their spies overheard this quest, the Gemba Tribe feared that collecting the nectar would kill their god. The Gembian people attacked Trojak and Edith either directly or setting animals such as hyenas, crocodiles, and a gorilla after them. \n\nHowever, they failed to stop Trojak and Edith from collecting the nectar, apparently killing the Devil-Flower. Chasing after the two explorers, the Gambians were unable to follow them into the water after their boats were sabotaged by Trojak's tiger companion [[Balu (Earth-616)|Balu]].{{r|Daring Mystery Comics #5}}\n\nThe fate of the Gemba Tribe following the apparent death of their idol remains unrevealed.\n| Equipment               = The Gemba people utilized the Devil-Flower, a massive plant that gave off fumes that could allow them to peer into locations far away from their village and enthrall animals to do their bidding. The nectar of the flower had healing properties, but apparently in harvesting it, the plant would die.\n| Transportation          = The Gemba people travel from their isolated island by boat.\n| Weapons                 = Most Gemba tribes people are armed with spears.\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:African Tribes]]"
                }
            }
        }
    ],
    "page_id": "447780"
}