{
    "pageid": 685132,
    "ns": 0,
    "title": "Genetic Council (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Genetic Council (Earth-616) from Fantastic Four Atlantis Rising Vol 1 1 0001.jpg \n| Name                    = Genetic Council\n| Aliases                 = [[Council of Elders]],{{r|Fantastic Four #58}}, The [[Council]],{{r|Fantastic Four Unlimited #2}} The [[Elders]],{{r|Marvel Graphic Novel #39}} Inhumans Genetics Council,{{r|Inhumans: The Great Refuge #1}} Genetics Council,{{r|All-New Official Handbook of the Marvel Universe A to Z #6}} Genetic Council of [[Attilan]],{{r|Silent War #1}} Council of Genetics,{{r|Avengers Assemble #1|; [[Alpha Primitives]]' entry}} the Council of Four,{{r|Fantastic Four Unlimited #2}} \"Gang of four\"{{r|Fantastic Four Unlimited #2}}\n\n| Leaders                 = ''Monarchs:'' Formerly [[Agon (Earth-616)|Agon]], [[Phaeder (Earth-616)|Phaeder]], [[Randac (Earth-616)|Randac]]; presumably all [[:Category:Attilan Monarchs|Attilan Monarch]];<br>''Speakers:''{{r|Fantastic Four Unlimited #2}} [[Atrophus Lohn (Earth-616)|Chief justice Atrophus Lohn]]<!-- Chief justice is a title as well -->;''Chancellors:'' [[Arkadine Arcadius (Earth-616)|Chancellor Arcadius]];<br>''Other leaders:'' [[Minius Gerion (Earth-616)|Minius Gerion]], [[Zhime Krepit (Earth-616)|Zhime Krepit]]\n<!-- Titles Kings/Queen, chief justice, chancellor -->\n| CurrentMembers          = \n| FormerMembers           = [[Randac (Earth-616)|Randac]];\n----\n[[Agon (Earth-616)|Agon]], [[Phaeder (Earth-616)|Phaeder]];\n----\n[[Thernon (Earth-616)|Thernon]], [[Kitang (Earth-616)|Kitang]];\n----\n[[Arkadine Arcadius (Earth-616)|Chancellor Arcadius]], [[Targon (Earth-616)|Targon]], [[Sapphiras (Earth-616)|Sapphiras]], [[Furgar (Earth-616)|Furgar]], [[Porcal (Earth-616)|Porcal]], [[Cynas (Earth-616)|Cynas]], [[Videmus (Earth-616)|Videmus]];\n----\n[[Atrophus Lohn (Earth-616)|chief justice Atrophus Lohn]], [[Minius Gerion (Earth-616)|Minius Gerion]], [[Zhime Krepit (Earth-616)|Zhime Krepit]];\n----\npresumably all [[:Category:Attilan Monarchs|Attilan Monarch]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = Council's Forces:{{r|Fantastic Four Unlimited #2}} [[Crimson Cadre (Earth-616)|Crimson Cadre]], [[Uys (Earth-616)|Seeker II]], [[Leonus (Earth-616)|Leonus]], [[Timberius (Earth-616)|Timberius]], [[Falcona (Earth-616)|Falcona]], [[Pinius (Earth-616)|Pinius]], [[Felor (Earth-616)|Felor]], [[Burrowers (Earth-616)|Burrowers]]\n----\n[[Morgan Le Fay (Earth-616)|Morgan Le Fay]]\n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]]; [[Fantastic Force (Earth-616)|Fantastic Force]]\n\n| Origin                  = Inhuman government{{r|Official Handbook of the Marvel Universe Vol 2 6|; [[Inhomo supremis|Inhumans]]' entry}} making decisions concerning the use of the [[Terrigen Mists]] and the fate of the [[Inhomo supremis|Inhumans]]\n| Reality                 = Earth-616\n| Status                  = \n| BaseOfOperations        = [[Council Tower]];{{r|Fantastic Four Unlimited #2}} Royal Inner Circle;{{r|Marvel Graphic Novel #39}} [[Attilan]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Marvel Graphic Novel #39\n\n| History                 = \n===Unregulated Terrigenesis===\nThe [[Inhumans (Inhomo supremis)|Inhumans]] were a genetically modified offshoot of humanity that were created by the [[Kree]] centuries ago and lived in isolation. When [[Randac (Earth-616)|Randac]], the leader of the Inhumans, discovered that exposure to the [[Terrigen Mist]] caused their race to gain fantastic powers, the Inhumans began to indiscriminately expose themselves to [[Terrigenesis]].{{r|Official Handbook of the Marvel Universe Vol 2 6|; [[Inhomo supremis|Inhumans]]' entry}}\n\n===Creation under Randac===\nThis eventually led to many monstrosities being created. As such, the Genetics Council was formed as a means of enforcing selective breeding practices among the Inhumans to ensure that their people maintained useful transformations.{{r|Marvel Graphic Novel #39}} Since its creation <!-- by -->from [[Randac (Earth-616)|Randac]]'s era, the Genetic Council was also the government of [[Attilan]], and the major legislative, judicial and executive body.{{r|Official Handbook of the Marvel Universe Vol 2 6|; [[Inhomo supremis|Inhumans]]' entry}}\n\nThe Genetics Council operated separate of the Inhuman monarchy, their authority eventually superseding the authority of the crowned king.{{r|Marvel Graphic Novel #39}} As the majority of the council were elders of the Inhuman race, they were often left in charge during periods in which the royal family was absent.{{r|Fantastic Four #59}}\n\n===Agon's reign===\n====Agon/Phaeder feud====\nEarly members of the Inhumans Genetic Council included [[Agon (Earth-616)|Agon]] and [[Phaeder (Earth-616)|Phaeder]]. Phaeder was to be punished for unethical experimentation, but faked his death before fleeing [[Attilan]].{{r|Marvel Two-In-One #72}}\n\n====Black Bolt====\nOver 100 years ago, Agon began to experiment with how early one could be exposed to the Terrigen Mist. To test this, the [[Surgeon Supreme (Earth-616)|Surgeon Supreme]] acquired [[Lockjaw (Earth-616)|Lockjaw]]'s mother and tested Terrigenesis in the womb, and produced Lockjaw and his siblings.{{r|Lockjaw Vol 1 4}} With this success, ge exposed his son [[Blackagar Boltagon (Earth-616)|Black Bolt]] to the mists while he was still in utero.{{r|Official Handbook of the Marvel Universe #2}}{{r|Secret Invasion: Inhumans #3}} When Black Bolt was born it was soon discovered that the boy's vocal chords were incredibly powerful and that even the most utter whisper would could shatter a mountain.{{r|Thor #148}} The Genetics Council ruled that Black Bolt was too dangerous and had him locked in a soundproof room until the boy could master his powers.{{r|Marvel Graphic Novel #39}}\n\nBolt was eventually released on his 19th birthday when he did master this control.{{r|Thor #149}} However, Agon was accidentally killed not long thereafter when Black Bolt was forced to use his voice to destroy an invading Kree ship. The ship crashed into a building where Bolt's mother and father were at, killing them both. Black Bolt then took up the Inhuman throne shortly thereafter.{{r|Avengers #95}}\n\n===Black Bolt's reign===\nOver the ensuing decades, the Genetics Council operated behind the scenes of Inhuman society, being the final word on any unions and reproduction that occurred within their hidden refuge.{{r|Marvel Graphic Novel #39}}\n\nMember of the Council, the [[Atrophus Lohn (Earth-616)|chief justice Atrophus Lohn]]{{r|Marvel Graphic Novel #39}} and his inner circle gathered more and more power surrendered from the rest of the Council.{{r|Fantastic Four Unlimited #2}}\n\n====Council Corruption====\nBy the modern age, the Genetics Council continued to operate behind the scenes, even during turbulent periods as Black Bolt's brother [[Maximus Boltagon (Earth-616)|Maximus]] made frequent attempts for the Inhuman throne, and attacks from various outside forces.{{r|Instances are many, refer to [[Blackagar Boltagon (Earth-616)|Black Bolt]] and [[Maximus Boltagon (Earth-616)|Maximus]] for details.}} When Attilan was decimated in order for the Inhumans to be free of a [[Negative Barrier|Negative Zone Barrier]] around their land, the Genetics Council were left in charge while the [[House of Agon (Earth-616)|royal family]] ventured out into the world.{{r|Fantastic Four #59}}\n\nThey later allowed [[Crystalia Amaquelin (Earth-616)|Crystal]] of the royal family marry the \"mutant\" known as [[Pietro Maximoff (Earth-616)|Quicksilver]],{{r|Marvel Graphic Novel #39|: [[Crystalia Amaquelin (Earth-616)|Crystal]] and [[Pietro Maximoff (Earth-616)|Quicksilver]] were married in {{cl|Fantastic Four #150}}. Originally it was believed that Pietro was a mutant, but it was later revealed he was not in {{cl|Uncanny Avengers Vol 2 4}}.}} They also agreed to allow them to have a child, a girl named [[Luna Maximoff (Earth-616)|Luna]], who was born a normal human after the Inhumans had relocated to the [[Blue Area of the Moon]].{{r|Marvel Graphic Novel #39}}\n\n====Black Bolt and Medusa's marriage====\nThey later consented to Black Bolt and Medusa being married, but forbid them to reproduce, fearing that their child might be as destructive as Black Bolt, insane as his brother Maximus, or both.{{r|Marvel Graphic Novel #39|: [[Blackagar Boltagon (Earth-616)|Black Bolt]] and [[Medusalith Amaquelin (Earth-616)|Medusa]] were married in {{cl|Fantastic Four Annual #18}}.}}\n\n====Popular dissent towards the Council====\nAt that point, the Council included an inner circle{{r|Fantastic Four Unlimited #2}} of seemingly four old Inhumans, led by the [[Atrophus Lohn (Earth-616)|chief justice Atrophus Lohn]], who led the whole Council with [[Minius Gerion (Earth-616)|Minius Gerion]] and [[Zhime Krepit (Earth-616)|Zhime Krepit]]{{r|Official Handbook of the Marvel Universe A-Z Update #3|; [[Ahura Boltagon (Earth-616)|Ahura]]'s entry}} (possibly part of this inner circle). They were more and more opposed by the people, seemed senile and were even known as '''The Elders'''.{{r|Marvel Graphic Novel #39}}\n\nHowever the Inhumans began to protest against the increasingly rigid Genetics Council and their controlled breeding rules. This became a more contested issue when a young Inhuman woman, [[Tally (Earth-616)|Tally]], committed suicide after it was arranged that she was to marry someone other than the man she loved. When it turned out that Medusa was pregnant with Black Bolt's child, the council ordered that she abort the child. When Medusa refused, but received no support from her husband, she and the rest of the royal family fled to Earth where Medusa eventually gave birth to her son{{r|Marvel Graphic Novel #39}} [[Ahura Boltagon (Earth-616)|Ahura]].{{r|Fantastic Four Unlimited #2}}\n\nAfter the child's birth, Medusa was convinced to return with her powerful offspring and turn him over to the Genetics Council for examination. The Genetics Council declared the boy too dangerous,{{r|Marvel Graphic Novel #39}} as the [[Atrophus Lohn (Earth-616)|chief justice]] intended to grasp total power of the Inhumans and arranged to have the boy turned over to the genetics expert [[Skip Ash (Earth-616)|Skip Ash]], from Earth, in order to receive Ash's advanced gene-altering technology. The chief justice intended to retrieve Ahura eventually.{{r|Official Handbook of the Marvel Universe A-Z Update #3|; [[Ahura Boltagon (Earth-616)|Ahura]]'s entry}}\n\nHowever the boy's ship crashed and he was instead taken by a rural family who raised the boy. Later when the Royal Family located the boy, and discovered why he was sent to Earth, they decided to keep him there to continue living on in secret.<ref>{{cl|Fantastic Four Unlimited #2}}: The search for [[Ahura (Earth-616)|Ahura]] occurred in {{cl|Daredevil #272}}-{{cl|Daredevil #283|283}}.</ref>\n\nEventually, the Genetics Council, including the chief justice's inner circle now composed of only four members and going as the '''Council of Four''', learned the location of Ahura and sent the [[Uys (Earth-616)|Seeker]], [[Leonus (Earth-616)|Leonus]], [[Timberius (Earth-616)|Timberius]], [[Falcona (Earth-616)|Falcona]], [[Pinius (Earth-616)|Pinius]], [[Felor (Earth-616)|Felor]] and the [[Burrowers (Earth-616)|Burrowers]] to collect the boy. They were stopped by the royal family and the [[Fantastic Four (Earth-616)|Fantastic Four]], but [[Triton (Earth-616)|Triton]] (sent by Black Bolt) collected the boy himself.{{r|Fantastic Four Unlimited #2}}\n\nThe Genetic Council dismissed the concern of a possible violation of law (one of their members having broken the law in secretly sending Ahura off-world) by granting unconditional amnesty to anyone involved, but put Medusa, Karnak, Gorgon and the dog Lockjaw under custody of Black Bolt, responsible for their good behavior under penalty of his own deposal, and had Ahura return to the Council while suspending visiting rights from his parents.{{r|Fantastic Four Unlimited #2}}\n\nAhura was put inside Skip Ash's [[Morphotron]], the chief justice intending to mold him into his monarch pawn, to use when he would have deposed Black Bolt. At that point, the Fantastic Four (who had infiltrated Attilan), allied with Medusa and Gorgon, opposed the Council's forces, with the councilmen urging Black Bolt to execute both his wife and cousin, to which he answered by entering the Council Tower where he witnessed the chief justice siphoning the Evil Eye of Ahura.{{r|Fantastic Four Unlimited #2}}\n\nThe corrupt chief justice then slew his fellow members and absorbed their energies becoming greatly powerful and sought to do the same to Ahura. However the boy psionically drew the power back to him, killing the chief justice in the process.{{r|Fantastic Four Unlimited #2}}\n\nThe surviving members of the Council admitted in shame that their institution had let the chief justice and his inner circle gather too much power. They declared the death of the [[Genetics Policy]] and offered the royal crown to Black Bolt in order to form a re-strengthened monarch, but he refused, wishing for the abolition of the monarchy and council in favor of a more democratic model. Consequently the council members offered Ahura the crown, but he shattered it instead. The Royal Family then went into a self-imposed exile.{{r|Fantastic Four Unlimited #2}}\n\n====Elected Council====\nA newly elected council was formed which had full control over Inhuman society. This new council included members such as [[Thernon (Earth-616)|Ministress Thernon]] and [[Kitang (Earth-616)|Minister Kitang]]. When members of the Kree attempted to seek refuge outside of Attilan following the fall of their empire to the [[Shi'ar Empire|Shi'ar]], the council initially accepted. However tensions began to rise and it was exposed that a rogue group of Kree sought to wipe out the Inhumans and reclaim the Blue Area of the Moon for themselves. This attempt was thwarted by the Inhuman royal family who returned to Attilan after a failed assassination attempt by the Kree.{{r|Inhumans: The Great Refuge #1}}\n\n<!-- ===[[Atlantis Rising|War for Atlantis]]=== -->\nLater a new Genetics Council was selected which included [[Arkadine Arcadius (Earth-616)|Chancellor Arcadius]], [[Targon (Earth-616)|Targon]], [[Sapphiras (Earth-616)|Sapphiras]], [[Furgar (Earth-616)|Furgar]], [[Porcal (Earth-616)|Porcal]], [[Cynas (Earth-616)|Cynas]]. This group formed a new Inhuman militia called the [[Crimson Cadre (Earth-616)|Crimson Cadre]], led by [[Ator (Inhuman) (Earth-616)|General Ator]].<!-- they formed it ? Devlor speaks of us as legends -->{{r|Fantastic Force #8}} During their rule, they discovered that [[Atlantis]] was being risen from the ocean floor by the sorceress known as [[Morgan Le Fay (Earth-616)|Morgan Le Fay]]. This greatly interested the Council as they considered Atlantis their ancestral home, and sent the Crimson Cadre to Earth to wage war on humanity in order to reclaim it. Not long after this Attilan was threatened when scientist [[Nathaniel Richards (Earth-616)|Nathaniel Richards]] accidentally triggered a trap within the [[Watcher's Citadel|citadel]] belonging to the Earth's [[Uatu (Earth-616)|Watcher]]. Looking after only themselves, the Council fled to Earth with the Terrigen Mist to seek an alliance with Morgan le Fay. After they fled, the Fantastic Four arrived on the Moon and saved Attilan by shrinking it down to size and taking it aboard their ship.{{r|Fantastic Four: Atlantis Rising #1}}\n\nThe Council then manipulated the royal family of the Inhumans to do their bidding.{{r|Fantastic Four #401}}{{r|Fantastic Four #402}} They also managed to recover Attilan and bring it back to Atlantis.{{r|Fantastic Force #9}} During the final battle, Attilan was restored to it's normal size on the island of Atlantis. The Terrigen Mists were also unleashed, but Arcadius and his fellow Councilors managed to seal Attilan within another Negative Zone Barrier to prevent the Mists from escaping out into Earth's atmosphere.{{r|Fantastic Four: Atlantis Rising #2}} The council attempted to get revenge against the Inhuman royal family as they fled Attilan, but this attempt failed.{{R|Fantastic Four Unlimited #11}}\n\n====Subordinate Council====\nSince then, the Inhuman royal family reclaimed the Inhuman throne, and while the council remains, the last roster has not been seen since the [[Atlantis Rising]] debacle. Since then the Genetics Council has taken on a more subordinate role, with the Inhuman monarchy taking full control over society, the council is now answerable to Black Bolt and not the other way around.{{r|Inhumans Vol 2 1}} The Council still dealt with civil matters, such as granting [[Timberius (Earth-616)|Timberius]] the right to kill a soldier responsible for killing his [[Naanis (Earth-616)|twin-brother]].{{r|Inhumans Vol 2 7}}\n\n==Functionment==\n{{MessageBox\n| Message = Please find [[Inhuman Law#Genetic Council|'''here''' the functionment of the Genetic Council]].\n}}<!-- that's for now, it might be more logical to have the functionment on the Genetic Council page and the link on the Inhuman Law page -->\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Inhuman Councils]]"
                }
            }
        }
    ],
    "page_id": "685132"
}