{
    "pageid": 862775,
    "ns": 0,
    "title": "Ghosts of Cyclops (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Ghosts of Cyclops (Earth-616) from All-New X-Men Vol 2 1 001.jpg\n| ImageSize               = 250px\n| Name                    = Ghosts of Cyclops\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Chicago (Illinois)|Chicago]], [[Illinois (State)|Illinois]]\n\n| Leaders                 = [[Austin Deprez (Earth-616)|Thirst]]\n| CurrentMembers          = [[Juice (Hannah) (Earth-616)|Juice]], [[Pillar (Jeremy) (Earth-616)|Pillar]], [[Sebastian (Earth-616)|Sebastian]], [[Tarpit (Earth-616)|Tarpit]], Unnamed other\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[X-Men (Time-Displaced) (Earth-616)|X-Men (Past)]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Dennis Hallum; Mark Bagley\n| First                   = All-New X-Men Vol 2 1\n\n| Quotation               = [[Scott Summers (Earth-616)|Cyclops]] might be dead and gone. But his '''ghosts''' linger on--\n| Speaker                 = [[Austin Deprez (Earth-616)|Thirst]]\n| QuoteSource             = All-New X-Men Vol 2 1\n\n| HistoryText             = The Ghosts of Cyclops are a group of misguided young [[Homo superior|Mutant]] extremists that wrecked havoc throughout [[Chicago (Illinois)|Chicago]] under the claims of being activists, following the legacy of the deceased Mutant leader [[Scott Summers (Earth-616)|Cyclops]].\n\nCyclops' [[Scott Summers (Earth-616)|time-displaced younger counterpart]] started tracking the Ghosts of Cyclops, and discovered a pattern to their attacks, so he was able to be present during their following appearance. The Ghost appeared and started scaring people, and the young Cyclops confronted them until the police arrived and they fled.\n\nThe leader of the Ghosts of Cyclops, [[Austin Deprez (Earth-616)|Thirst]], had dropped his wallet during the fight and the young Cyclops was able to track him down to Algar University. When he entered the facility, two of the members of the Ghost recognized him and alerted their boss. They put on their masks, confronted him in the library and started beating him up. Angered by the Ghosts' distortion of Cyclops' image, the young Scott Summers blasted them away with an optic blast, whoever, using his power caused him to faint. Before the Ghosts could leave, the rest of the time-displaced [[X-Men (Time-Displaced) (Earth-616)|X-Men]] appeared on the scene.{{r|All-New X-Men Vol 2 1}}\n\nWith the presence of the X-Men, the Ghost of Cyclops fled, accidentally leaving Thirst behind, who had been beaten up by the young Cyclops. The police arrived to the scene, and apprehended Cyclops and Thirst. The rest of the Ghost hid in a garage to plan their next course of action, and when they were leaving to rescue Thirst, [[Laura Kinney (Earth-616)|Wolverine]] and Angel confronted them. The fight was cut short because, even though Laura had it under control, she was set on fire and Angel decided to leave with her and extinguish the flames just in case.{{r|All-New X-Men Vol 2 2}}\n\nOnce the Ghosts broke into the police station, they subdued the officers on the scene and prepared to leave, only to find themselves surrounded by dozens of cops. When they were getting ready to storm through the police, the X-Men entered into the building and fought them. After getting through a layer of ice created by Iceman to contain the fight, the police surrounded the mutant younglings. The X-Men quickly raised their hands in the air to prevent anything, but Thirst encouraged his teammates to attack. When an officer signaled to attack the Ghosts, the young Cyclops shot an energy blast between them, and gave a speech that prompted the police to not take lethal measures.{{r|All-New X-Men Vol 2 3}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "862775"
}