{
    "pageid": 506923,
    "ns": 0,
    "title": "Grand Jhar (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Grand Jhar (Earth-616) from Excalibur Vol 1 69 001.png\n| Name                    = Grand Jhar\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile \n\n| Leaders                 = formerly [[C'efn (Earth-616)|C'efn]]\n| CurrentMembers          = \n| FormerMembers           = [[Cerise (Earth-616)|Cerise]]\n| Allies                  = [[Shi'ar]]\n| Enemies                 = [[Excalibur (Earth-616)|Excalibur]]\n\n| Origin                  = To bring new cultures into the Shi'ar imperium \n| PlaceOfFormation        = Formed witin the Shi'ar Imperium \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Excalibur Vol 1 69\n\n| HistoryText             = The Grand Jahr is a military fleet of ships, with the sole purpose of bringing new planets into the [[Shi'ar]] empire. One vessel within the Grand Jhar was commanded by [[C'efn (Earth-616)|C'efn]], who was the most bloodthirsty leader in Shi'ar history. One of his new recruits was the young Shi'ar [[Cerise (Earth-616)|Cerise]]. The Grand Jahr bombed the alien Knsashii committing genocide on the peaceful race, in hopes that the remain survivors would then gladly join the Shi'ar.\n\nWhen Cerise witnessed this atrocity, she was disgusted that her people would do this. But Commander C'efn defended these actions as working for the best of the Shi'ar and executes a young survivor to prove a pointed warning Cerise - \"she better be prepared for the next battle\". From that moment Cerise vowed to bringing down the Grand Jahr, and bring them to justice for their actions.\n\nCerise plan was to override the ship and re-program to to fly into a nearby sun. Cerise recorded a message for the Empire explaining her actions and the crimes of the Grand Jhar, then abandoned ship. Commander C'efn and his crew were all killed. \n\nThe planet Ariston was one of the few planets to resist the Grand Jhar. They were constantly harassed by them, due to their close proximity to the Shi'ar border. The planets force field kept the Shia'r at bay for many years.\n\n| Equipment               = Advanced Shi'ar technology.\n| Transportation          = Shi'ar Starships.\n| Weapons                 = Shi'ar energy weapons.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Shi'ar Organizations]]"
                }
            }
        }
    ],
    "page_id": "506923"
}