{
    "pageid": 14820,
    "ns": 0,
    "title": "Grapplers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Grapplers (Earth-616) from Marvel Two-in-One Vol 1 56 001.png\n| ImageSize               = 250px\n| Name                    = Grapplers\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Marian Pouncy (Earth-616)|Poundcakes]], formerly [[Ann Fraley (Earth-616)|Auntie Freeze]], [[Davida DeVito (Earth-616)|Titania]]\n| CurrentMembers          = [[Hellen Feliciano (Earth-616)|Letha]], [[Marian Pouncy (Earth-616)|Poundcakes]]\n| FormerMembers           = [[Ann Fraley (Earth-616)|Auntie Freeze]], [[Anita Ehren (Earth-616)|Battleaxe]], [[Deborah Lowry (Earth-616)|Cowgirl]], [[Robin Braxton (Earth-616)|Gladiatrix]], [[Melissa Gold (Earth-616)|Screaming Mimi (Melissa Gold)]], [[Lanie (Earth-616)|Screaming Mimi (Lanie)]], [[Susan Hayakawa (Earth-616)|Sushi]], [[Davida DeVito (Earth-616)|Titania]]\n| Allies                  = [[Genius In action Research Labs (Earth-616)|G.I.R.L.]], [[Yon-Rogg (Earth-616)|Magnitron]], [[Roxxon Energy Corporation (Earth-616)|Roxxon Oil Company]], [[Thundra (Earth-715)|Thundra]]\n| Enemies                 = [[Avengers (Earth-616)|Avengers]], [[Carol Danvers (Earth-616)|Captain Marvel]], [[Alison Blaire (Earth-616)|Dazzler]], [[William Foster (Earth-616)|Giant-Man]], [[Wendell Vaughn (Earth-616)|Quasar]], [[Scourge]], [[Sharon Ventura (Earth-616)|Sharon Ventura]], [[Benjamin Grimm (Earth-616)|The Thing]]\n\n| Origin                  = The Grapplers are an all-female band of criminals and mercenaries who pose as professional wrestlers.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mark Gruenwald; Ralph Macchio; John Byrne\n| First                   = Marvel Two-In-One #54\n\n| HistoryText             = [[Ann Fraley (Earth-616)|Ann Fraley]], as Auntie Freeze, was one of the leading female wrestlers of thirty years ago. After two decades in the ring, Fraley retired from professional wrestling to become a trainer of other female wrestlers. She managed her proteges, [[Hellen Feliciano (Earth-616)|Helen Feliciano]], alias Letha; [[Davida DeVito (Earth-616)|Davida DeVito]], alias Titania; [[Marian Pouncy (Earth-616)|Marian Pouncy]], alias Poundcakes; and Melissa \"Mimi\" Schwartz, alias [[Melissa Gold (Earth-616)|Screaming Mimi]]; to become the wrestling team known as the original Grapplers.{{r|Official Handbook of the Marvel Universe Vol 1 5}}\n\nThe original Grapplers became renowned for their colorful personalities and ringside antics, but despite Auntie Freeze's tireless promotion of her four proteges, the wrestling federation denied them the opportunity to make the amount of money their male counterparts made.{{r|Official Handbook of the Marvel Universe Vol 2 5}}\n\nTitania, the leader of the team, was contacted by a representative of the [[Roxxon]] Oil Company in charge of covert operations whose identity has not yet been revealed but who happened to be a wrestling fan. This representative offered the four the opportunity to earn supplementary income by performing a covert operation for the corporation. The four agreed and were given special paraphernalia to assist them in their mission. The four were sent to accompany the woman warrior [[Thundra (Earth-715)|Thundra]] in invading Project: Pegasus, a federal government energy research project. Roxxon warned a monopoly on major research into tapping new energy sources. Therefore, following orders from. Roxxon, once the four Grapplers were inside the Project, they began sabotaging and destroying equipment there. However, the mission failed due to the Project's then-security chief [[Wendell Vaughn (Earth-616)|Quasar]], and the four Grapplers were tried and jailed for their misdeeds.{{r|Marvel Two-In-One Vol 1 54|57}}\n\nThe four Grapplers were sent to the prison at [[Ryker's Island]]. Eventually, they became the leaders of the other women prisoners there and virtually ran the women prisoner's area at night. However, they were overpowered in battle by the mutant hero [[Alison Blaire (Earth-616)|Dazzler]] when she was imprisoned there for a night.{{r|Dazzler Vol 1 13}}\n\nWhen the Grapplers were finally paroled, they discovered that the women's wrestling movement had lost its momentum without them. The Grapplers undertook certain petty crimes to support themselves, and at one point made an unsuccessful attempt to take revenge on the hero the [[Benjamin Grimm (Earth-616)|Thing]], who had helped thwart their mission at Project Pegasus. The Grapplers were never caught and imprisoned during this time.{{r|Marvel Two-In-One Vol 1 96}}\n\nAuntie Freeze, in the meantime, was scouting out new candidates for female wrestling stardom and succeed in finding several promising ones. When wrestling promoter Edward Garner organized the Unlimited Class Wrestling Federation for the increasing number of wrestlers who were barred from other wrestling associations because of their superhuman strength, Auntie Freeze contacted him to arranged for the formation of a women's division. Auntie Freeze, like many of the managers and trainers of male wrestlers, was contacted by Power Broker, Inc., an agency which promised to augment an individual's strength to very high levels for a very high price. Auntie Freeze sent all of her new clients as well as the original Grapplers to the Power Broker to undergo treatment. Thus, the Grapplers were given superhuman powers. The original Grapplers had by now returned to being managed by Auntie Freeze. The four original members and Fraley's new female wrestlers were now collectively called the Grapplers and were legitimate professional wrestlers in the UCWF. The original Grapplers resented the newcomers to a certain extent, but were mostly pleased by now being able to earn money without having to resort to crime.{{r|Thing Vol 1 33|34}}\n\nOver time, membership of the Grapplers were shaken slightly. Titania lost a bout for leadership of the Grapplers to the newcomer [[Anita Ehren (Earth-616)|Battleaxe]], and was soon after was slain by the enigmatic villain [[Kendra Louise Price (Earth-616)|Scourge]], disguised as a woman wrestler named Golddigger.{{r|Thing Vol 1 33}} Scourge also killed Letha, who was searching for a way to avenge Titania's death.{{r|Captain America Vol 1 319}} Screaming Mimi was contacted by [[Helmut Zemo (Earth-616)|Baron Zemo]] to join his version of the criminal team [[Masters of Evil (Earth-616)|Masters of Evil]]{{r|Avengers Vol 1 271}}, a path which would lead her to eventually become a founding member of the [[Thunderbolts (Earth-616)|Thunderbolts]] as Songbird.{{r|Incredible Hulk Vol 1 449}} Poundcakes remained a freelance mercenary.{{r|USAgent Vol 1 2}}\n\nLetha and Titania, adopting the new codename Lascivious, were resurrected by the [[Parker Robbins (Earth-616)|Hood]] as part of the [[Deadly Dozen (Earth-616)|Deadly Dozen]].{{r|Punisher Vol 8 5}} They gained new psionic powers and attempted to kill the [[Frank Castle (Earth-616)|Punisher]].{{r|Punisher Annual Vol 3 1}} They later reunited with Poundcakes and a brand new [[Lanie (Earth-616)|Screaming Mimi]] and attempted to get revenge on the original, now known as Songbird. The Grapplers were eventually defeated, with Songbird convincing the new Screaming Mimi not to pursue a life of crime.{{r|Women of Marvel Vol 1 2}}\n\nLetha and Lascivious later relocated to [[Bagalia]] and joined the [[Masters of Evil (Earth-616)|Masters of Evil]].{{r|Secret Avengers Vol 1 29|32}} Letha, Poundcakes, and the second [[Mary MacPherran (Earth-616)|Titania]] were then seen at a bar, flirting with [[Henry McCoy (Earth-616)|Beast]] and [[Simon Williams (Earth-616)|Wonder Man]].{{r|A + X Vol 1 12}}\n\nPoundcakes and Letha attempted to seek out redemption and worked briefly with [[Genius In action Research Labs (Earth-616)|G.I.R.L.]],{{r|Unstoppable Wasp Vol 2 2|4}} though Poundcakes would return to a life of crime.{{r|M.O.D.O.K.: Head Games Vol 1 2}}\n\n| Equipment               =   On the mission to invade [[Project P.E.G.A.S.U.S.]], [[Hellen Feliciano (Earth-616)|Letha]] wore special sonic plugs in her ears so [[Melissa Gold (Earth-616)|Screaming Mimi]]'s wave frequecy was filtered out. Presumably other members of the Grapplers aslo wore these ear plugs. {{r|Marvel Two-In-One #56}}\n| Transportation          = \n| Weapons                 =             \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * The Unofficial Handbook to the Marvel Universe\n}}"
                }
            }
        }
    ],
    "page_id": "14820"
}