{
    "pageid": 1066305,
    "ns": 0,
    "title": "Gray Blade (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Gray Blade (Earth-616) from Peter Parker The Spectacular Spider-Man Vol 1 300 001.jpg\n| Name                    = Gray Blade\n| Aliases                 = \n\n| Leaders                 = [[Corben Mintz (Earth-616)|Agent Corben Mintz]]\n| CurrentMembers          = [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)/Members#Charles|Agent Charles]]\n| FormerMembers           = [[Teresa Parker (Earth-616)|Teresa Parker]], [[David Albright (Earth-616)|David Albright]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Phineas Mason (Earth-616)|Tinkerer]]\n| Enemies                 = [[Phineas Mason (Earth-616)|Tinkerer]], [[Peter Parker (Earth-616)|Spider-Man]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Chip Zdarsky; Paulo Siqueira\n| First                   = Free Comic Book Day Vol 2017 Secret Empire\n| History                 = Gray Blade originated as an independent [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] division that specialized in performing international hostage rescues and intel gathering. [[Teresa Parker (Earth-616)|Teresa Parker]] joined this organization briefly after leaving the [[Central Intelligence Agency (Earth-616)|CIA]].{{r|Peter Parker: The Spectacular Spider-Man Vol 1 2}}\n\nOne of Gray Blade's operations, named \"Project Twlight,\" consisted of an exhaustive plan to take down both superheroes and supervillains.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 3}} S.H.I.E.L.D. apprehended the [[Phineas Mason (Earth-616)|Tinkerer]] not long afterwards, and he offered to feed the organizaton technical information on super-humans. The Gray Blade stepped in due to Project Twilight, and had the Tinkerer give them the data.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 300}}\n\nAfter discovering of Project Twlight's existence, agent [[Teresa Parker (Earth-616)|Teresa Durand]] deleted all of its archives and went on the run with the only back-up  injected into her bloodstream through a series of nanobots.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 2}} In order to discredit Teresa, Mintz had his agents take a photograph of her with [[Peter Parker (Earth-616)|Spider-Man]], and contacted different news outlets to label her as a traitor of country.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 3}} Due to Spider-Man's connection with Peter Parker, Mintz decided to arrest him to get to Durand.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 5}}\n\nA unit of Grey Blade agents raided Peter Parker's apartment, but he managed to evade capture and changed into Spider-Man. However, Agent Mintz managed to get the drop on him. He was saved by [[John Jonah Jameson (Earth-616)|J. Jonah Jameson]], who ran Agent Mintz over with his car. Since Gray Blade decided to arrest Peter's [[Maybelle Parker (Earth-616)|Aunt May]] after he had evaded capture, Peter turned himself in to let her go.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 297}} Corben interrogated Peter to no avail, and while waiting for him to cooperate, Parker was rescued by the [[Jonathan Storm (Earth-616)|Human Torch]] and Agent Durand.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 298}}\n\nAgent Mintz led the way when the Gray Blade attacked the Tinkerer's hideout, where he had captured Agent Durand and was exctracting the data from her body. Spider-Man came to the rescue, and stopped the Tinkerer from crushing Agent Mintz. Shortly afterwards, Spider-Man's ally [[Elizabeth Brant (Earth-616)|Betty Brant]] destroyed the comptuer storing Project Twlight's data. After the Tinkerer escaped, the heroes prepared to arrest Agent Mintz, since Brant had recorded Mintz adimittion to his alliance with Tinkerer. However, when a fleet of the alien [[Vedomi]] arrived to Earth, Spider-Man joined forces with Mintz to interrogate the Tinkerer about them, since he had known about their arrival.{{r|Peter Parker: The Spectacular Spider-Man Vol 1 300}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:S.H.I.E.L.D. Projects]]"
                }
            }
        }
    ],
    "page_id": "1066305"
}