{
    "pageid": 2951,
    "ns": 0,
    "title": "Great Beasts (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = [[Great Beasts]]\n| Image                   = Great Beasts (Earth-616) from Amazing X-Men Vol 2 11 001.jpg\n| ImageSize               = 250px\n| Name                    = Great Beasts{{r|Official Handbook of the Marvel Universe Vol 3 3}}\n| Aliases                 = Gods of the Elder Night,{{citation}}<!-- Razazel --> [[Old Beasts of the North]]{{r|Immortal Hulk #4}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Realm of the Beasts]]\n\n| Leaders                 = \n| CurrentMembers          = [[Kariooq (Earth-616)|Kariooq]], [[Kolomaq (Earth-616)|Kolomaq]], [[Ranaq (Earth-616)|Ranaq]], [[Somon (Earth-616)|Somon]], [[Tolomaq (Earth-616)|Tolomaq]], [[Tundra (Earth-616)|Tundra]]\n| FormerMembers           = [[Tanaraq (Earth-616)|Tanaraq]]\n| Allies                  = [[Wendigo (Race)|Wendigo]]\n| Enemies                 = [[Alpha Flight (Earth-616)|Alpha Flight]], [[Narya (Earth-616)|Snowbird]], [[Inua|Arctic Gods]]\n\n| Origin                  = Extradimensional mystical creatures\n| PlaceOfFormation        = [[Realm of the Beasts]]\n| PlaceOfDissolution      = \n| Creators                = John Byrne\n| First                   = Alpha Flight Vol 1 24\n| Last                    = \n\n| HistoryText             = The Great Beasts are a group of powerful creatures from another dimension who have tried several times to take over Earth. They were trapped a thousand years ago in their own dimension by the gods of northern Canada but the magicks holding them began to weaken recently. Nelvanna, one of the gods mated with a human and gave birth to Narya who would become the Alphan Snowbird.{{r|Alpha Flight #7}}\n\nThe first Beast to break through the Great Barrier was Ranaq, just over a hundred years ago, by temporarily possessing a man who was trying to use Ranaq for his own needs. A time travelling contingent of Alpha Flight was able to beat him though, forcing him back to his own dimension.{{r|Alpha Flight #18|19}}\n\nThe next Beast to break free was Tanaraq, who broke free when Walter Langkowski attempted to turn himself into a second Hulk. The two formed a symbiotic relationship wherein Walter would temporarily change places with Tanaraq in the Beasts' own dimension, the Realm of the Beasts. Snowbird had no choice but to eventually slay Tanaraq after he took control of Langkowski.{{r|Alpha Flight #23}}\n\nTundra broke free before this ever happened as it took some time before Tanaraq controlled Walter. He was called upon by the man who was Narya's father who had gone insane. Shortly after that Kolomaq broke free but Narya was able to defeat him once again.{{r|Alpha Flight #1}}{{r|Alpha Flight #6}}\n\nAlpha Flight had to venture into the Realm of the Beasts to find Walter's soul. It was there that they encountered the other Beasts: Kariooq, Somon, and Tolomaq. Four of the Beasts were able to return to Earth when Somon (who was mistakenly believed to be destroyed) affected Langkowski's subconscious into creating a formation which allowed them to break the dimensional barrier. A powerful explosion, created when [[Madison Jeffries (Earth-616)|Box]] destroyed Tundra, sent the Beasts back to their dimension.{{r|Alpha Flight #24}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Great Beasts]]\n[[Category:Deities]]\n[[Category:Mystical Organizations]]\n[[Category:Races of Demons]]"
                }
            }
        }
    ],
    "page_id": "2951"
}