{
    "pageid": 269085,
    "ns": 0,
    "title": "Great Wall (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Great Wall (Earth-616) Agents of Atlas Vol 2 8.jpg\n| Name                    = Great Wall\n| Aliases                 = Society of the Great Wall{{r|Agents of Atlas Vol 2 11}}\n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = unspecified headquarters in [[Asia]]\n\n| Leaders                 = [[Temugin (Earth-616)|Temugin]]; formerly [[Suwan (Earth-616)|Jade Claw]]\n| CurrentMembers          = [[Yao (Dragon) (Earth-616)|Yao]], [[Chin Ti (Earth-616)|Chin Ti]], [[Suwan (Earth-616)|Jade Claw]], others unnamed\n| FormerMembers           = [[M-21 (Earth-616)|M-21]]\n| Allies                  = \n| Enemies                 = [[Agents of Atlas (Earth-616)|Atlas Foundation]]\n\n| Origin                  = Split from the Atlas Foundation when Suwan was not allowed to ascend to the leadership of Atlas because she was female.\n| PlaceOfFormation        = [[Asia]]\n| PlaceOfDissolution      = \n| Creators                = Jeff Parker; Carlo Pagulayan\n| First                   = Agents of Atlas Vol 2 #8\n| Last                    = \n\n| Overview             = The Great Wall are a rival empire to the Atlas Foundation led by Jimmy Woo's ex-girlfriend [[Suwan (Earth-616)|Jade Claw]]. It used to be part of the Atlas Foundation, before it splintered from the Eternal Empire. After losing its battle with the Agents of Atlas, the Great Wall are now being led by Atlas' own [[Temugin (Earth-616)|Temugin]] who has been tasked with guiding the Great Wall towards greater good.\n\n| HistoryText          = The Jade Claw became the commander of the Atlas forces in the East, letting the [[Plan Chu (Earth-616)|Golden Claw]] focus on the West. The Horde in [[China]] became loyal to her and when he ordered her to step down, they rebelled.{{r|Agents of Atlas Vol 2 8}} She formed the Society of the Great Wall using a fraction of the loyal Horde. With it she took back most of the Asian territories which had been lost in the previous centuries. Business and government leaders now had to consider and answer to the Jade Claw.{{r|Agents of Atlas Vol 2 9}} \n\nIn addition to her legions of followers in the Great Wall, she controlled parts of the Chinese military, resulting in a force which outgunned and outmanned the forces of the [[Atlas Foundation (Earth-616)|Atlas Empire]] by ten times.{{r|Agents of Atlas Vol 2 10}} The organization had at least 312 bases spread across the world and a network of satellites which it controlled.{{r|Agents of Atlas Vol 2 10|11}} The Jade Claw had her forces execute a global campaign against the Atlas Empire and took out all of its bases as well as its tactical air and naval footholds.{{r|Agents of Atlas Vol 2 11}}  \n\nLed by [[James Woo (Earth-616)|Jimmy Woo]], Atlas used the [[Dragon's Corridor]] to launch a counter-strike to the Great Wall's mountain base in China. A battle ensued between the forces of the Great Wall and a tank division of the [[People's Liberation Army (Earth-616)|Chinese Army]] on one side and the forces of Atlas and the [[Atlantean Army (Earth-616)|Atlantean Army]] on the other side. Which ended in victory for Atlas and the surrender of the Jade Claw. Rather than have her execute per custom, Jimmy Woo allowed her to live and continue to help the Great Wall in its endeavors but with [[Temujin (Earth-616)|Temujin]] as head of the organization.{{r|Agents of Atlas Vol 2 11}} \n| Equipment               = \n| Transportation          = \n| Weapons                 = Robots, directed energy weapons, arsenal of the Chinese military\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Chinese Organizations]]\n[[Category:Criminal Organizations]]\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "269085"
}