{
    "pageid": 31564,
    "ns": 0,
    "title": "Green Liberation Front (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Green Liberation Front (Earth-616) from Soviet Super Soldiers Vol 1 1 0001.jpg\n| Name                    = Green Liberation Front\n| Aliases                 = GLF\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Boris Bullski (Earth-616)|Titanium Man (Boris Bullski)]], [[Character Index/B#Black|Captain Black]]\n| Allies                  = [[Character Index/S#Sergei|Sergei]]\n| Enemies                 = [[Beta Ray Bill (Earth-616)|Beta Ray Bill]], [[Sif (Earth-616)|Lady Sif]]\n\n| Origin                  = Disaffected Vietnam War veterans used as pawns by [[Boris Bullski (Earth-616)|Titanium Man (Boris Bullski)]]\n| PlaceOfFormation        = [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Walter Simonson\n| First                   = Thor Vol 1 354\n| Last                    = \n\n| HistoryText             = [[Boris Bullski (Earth-616)|Titanium Man (Boris Bullski)]] formed the Green Liberation Front as part of a plot by the KGB. He employed a Soviet defector (Sergei) to build suits of armor that could be miniturized into electronic cards.{{r|Thor #358}}\n\nBullski posed as the Commander and gave the technology to an organization of disaffected Vietnam War veterans. Using the suits of amor the GLF robbed a New York bank and Federal Reserve. The GLF believed they were performing acts of political rebellion but Bullski was also using the opportunity to implant a computer virus that would destroy the American economy.{{r|Thor #354|355}}\n\nSergei exposed Bullski's true identity and the GLF turned on him. Bullski attempted to teleport away but was captured in electronic card format. At some point, the GLF were also transformed back into electronic card form. {{r|Thor #357|358}}\n\n[[Airstrike|Crimson Dynamo]] ventured to New York to retrieve Bullski. He accidentally activated the GLF armor who attacked for being Soviet. Crimson Dynamo was forced to re-activate Bullski but it was an incomplete process.  Enraged, Bullski attacked and killed the GLF before Crimson Dynamo lured him away.{{r|Soviet Super Soldiers #1}}\n\n\n| Equipment               = The Green Liberation Front used advanced armor that could be stored in electronic cards.  The armor was capable of flight.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Soviet Organizations]]"
                }
            }
        }
    ],
    "page_id": "31564"
}