{
    "pageid": 628629,
    "ns": 0,
    "title": "Guardians of Space (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Guardians of Space (Earth-616) from Young Men Vol 1 28 0001.jpg\n| Name                    = Guardians of Space\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n| Enemies                 = [[Isidoro Scarlotti (Earth-616)|Vulture]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Joe Gill; Dick Ayers\n| First                   = Young Men Vol 1 28\n| Last                    = Young Men Vol 1 28\n\n| History                 = The origin of the so-called '''Guardians of Space''' is unknown. They are a group representing the interests of galactic peace and determine if a sentient race is ready for the stars. The Guardians became interested in the planet [[Earth]] in 1954 when the governments of the world were in the early stages of the space race. Due to the ongoing Cold War between the [[United States of America]], [[Union of Soviet Socialist Republics|Russia]] and [[China]], they had deemed that humanity was not ready for the stars until they renounced war. When the first American rocket test was launched, the Guardians blocked it from leaving Earth's atmosphere, wiped out the crews memories of their encounter with the Guardians and sent them back to Earth with only a notion that mankind cannot live in space.\n\nHowever, the rocket was later stolen by the international terrorist known as the [[Isidoro Scarlotti (Earth-616)|Vulture]] who sought to take over the [[Luna (Moon)|Moon]]. He was pursued by the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]] who boarded the ship before it left Earth's atmosphere. They made short work of the Vulture and his men but the ship was once again barred from leaving Earth's atmosphere. The Guardians revealed themselves to the Torch and decided to allow him to retain his memories of the encounter. The Torch kept the Guardian's existence a secret, only telling military officials that man's bridge to the stars was closed to them.{{r|Young Men Vol 1 28}}\n\nThe Guardians of Space have not been seen since, for reasons that have yet to be revealed. They either accepted or were no longer capable of stopping the human race from reaching to the stars.\n\n| Equipment               = \n| Transportation          = The Guardians traveled space in a spaceship of unspecified capabilities.{{r|Young Men Vol 1 28}}\n| Weapons                 = \n\n| Notes                   = The Guardians had the ability to disable rockets and return them to Earth, project messages through space and wipe memories. It is unknown if these are natural abilities or technological in nature.{{r|Young Men Vol 1 28}}\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "628629"
}