{
    "pageid": 242520,
    "ns": 0,
    "title": "Gunhawks (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Gunhawks Vol 1 1.jpg\n| ImageSize               = 300px\n| Name                    = Gunhawks\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Old West, circa 1870s\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Reno Jones (Earth-616)|Reno Jones]], [[Richard Cassidy (Earth-616)|Kid Cassidy]]\n| Allies                  = [[Confederate States Army (Earth-616)|Confederates States Army]]\n| Enemies                 = [[United States Army (Earth-616)|Union Army]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gary Friedrich; Syd Shores\n| First                   = Gunhawks Vol 1 1\n| Last                    = \n\n| HistoryText             = ===Original Series===\n\nThe Gunhawks were [[Richard Cassidy (Earth-616)|Kid Cassidy]] and [[Reno Jones (Earth-616)|Reno Jones]]. Cassidy was the son of a plantation-owning family in the antebellum American South, and Jones was an African-American slave of the family. Cassidy Snr. was kind, treating his slaves like employees, and allowing Reno and the Kid to be tutored together. The boys grew up close friends, and when the [[American Civil War (Event)|American Civil War]] broke out, Reno chose not to fight on either side, until rampaging Union troops slaughtered his master and carried off his love, Rachel Brown. Reno then joined with Cassidy and they fought together for the Confederate States of America during the American Civil War, with Jones claiming he wanted to kill every Yankee he could. After the war, they became wandering gunfighters, the Gunhawks, and continued searching for Rachel.\n\nKid Cassidy was later shot and killed by Grey Fox, a Cheyenne chief who now had Rachel, and Jones was blamed for the crime, becoming a fugitive. \n\n===Modern Version===\n\nIt was later revealed that the published adventures of the classic Marvel gunfighters, including the Gunhawks, had actually been dime novels based on the actual gunfighters' actions. In this revised version of events, while Cassidy Snr. was a better master than most, his slaves were still treated as slaves; Reno did play with Kid, but the two men had only been friends as children; the plantation was attacked, but Reno didn't join the Confederate Army. After the war, his old friendship with Kid was revived, they did ride together for a while, and Kid genuinely had become sick of racism.\n\nAt this point their friendship was unquestionable; Kid underwent grueling Cheyenne trails to become a brave for his friend, and Reno, armed only with a knife, fought an angry Grizzly to save Kid. They fought buffalo rustlers, led a revolt against a slave-owning plantation owner, and tried to stop the Medicine Creek massacre whee the insane Reverend Graves ran guns to Grey Fox's Cheyennes but then set the cavalry on them, hoping to wipe out both sides. Afterwards Reno spotted Grey Fox fleeing his Rachel, but Kid knocked him out, having learned Rachel didn't want Reno pursuing her, afraid of Fox's violent jealousy.\n\nReno drew on Kid for this, only to deliberately shoot wide. Kid and Reno kept tracking Rachel, but their friendship had been damaged, and Kid grew increasingly bitter, and finally drew on Reno, who shot him down, then fled. Reno picked up Rachel's trail in Cayuse, New Mexico, got framed for anather murder by San Francisco Slade, and met the [[Rawhide Kid]]. \n\nTen years later Reno Jones had taken up residence in the town of Wonderment, Montana, a town populated largely by freed slaves; there, he married a woman named Mary, and they had a son named Cass (Cassidy). Kid meanwhile, had survived, holding onto a seething hatred of Reno. By 1885 he was an enforcer, working for a corrupt busnessman named [[Clay Riley (Earth-616)|Clay Riley]]- who had previously fought the original [[Carter Slade (Earth-616)|Ghost Rider]] as a costumed bandit called the Tarantula - sought to take the town's land by force. To this end, he hired a group of the Ku Klux Klan's [[Nightriders (Earth-616)|Nightriders]] to kill the townfolk. Kid discovered Reno was living there, finally giving him a chance for revenge. To defend the town Jones brought in a number of Western gunfighters including the Rawhide Kid, [[Matthew Liebowicz (Earth-616)|Two-Gun Kid]], [[Caleb Hammer (Earth-616)|Caleb Hammer]], [[Gunhawk (Earth-616)|Gunhawk]], [[Kid Colt]], [[Outlaw Kid]] and [[Red Wolf]]. Red Wolf, who had been a contemporary and ally of the deceased Ghost Rider, provided Jones with the Rider's costume, knowing that this would give him a psychological advantage over Riley. Believed killed in an early skirmish, Reno secretly became the Phantom Rider. \n\nAfter many fatalities on both sides, Jones killed Riley and then unmasked the Nightriders' leader as Kid Cassidy. Before either could fully react, the Outlaw Kid stunned Cassidy, and Jones took the opportunity to strangle Cassidy to death. After the carnage was over, Jones returned the Ghost Rider costume and retired to take care of his family.\n\n| Equipment               = \n| Transportation          = Horses\n| Weapons                 = Pistols, rifles\n\n| Notes                   = * These Gunhawks should not be confused with either [[Preston Hardwick (Earth-616)|Red Larabee]] or the bounty hunter known as [[Gunhawk (Earth-616)|Gunhawk]].\n| Trivia                  = \n| Links                   = http://en.wikipedia.org/wiki/Gunhawks\n}}\n[[Category:Western Teams]]\n[[Category:Western Characters]]"
                }
            }
        }
    ],
    "page_id": "242520"
}