{
    "pageid": 1219721,
    "ns": 0,
    "title": "Gwen Stacy Clones (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = [[Gwen Stacy Clone]]s\n| Image                   = Gwen Stacy Clones (Earth-616) and Miles Warren (Jackal Clone 2) (Earth-616) from Spider-Man Vol 1 61 001.jpg\n| ImageSize               = 250px\n| Name                    = \n| EditorialNames          = [[Gwen Stacy Clone]]s{{r|Spider-Man: Back in Black Handbook Vol 1 1}}\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = \n\n| Origin                  = Imperfect [[Homo sapiens|human]] [[Glossary:Clone|clones]] created by the Jackal\n| PlaceOfFormation        = The Jackal's Lab in the [[Catskill Mountains]]{{r|Spider-Man: Back in Black Handbook Vol 1 1}}\n| PlaceOfDissolution      = \n| Creators                = J.M. DeMatteis; Mark Bagley\n| First                   = Amazing Spider-Man Vol 1 399\n| Last                    = Spider-Man Vol 1 61\n\n| HistoryText             = [[File:Gwen Stacy Clone (Earth-616) from Amazing Spider-Man Vol 1 399 001.jpg|thumb|left|The first imperfect clone of Gwen Stacy.{{r|Amazing Spider-Man Vol 1 399}}]]\nOne of the many imperfect clones of [[Gwendolyne Stacy (Earth-616)|Gwen Stacy]] created by the [[Miles Warren (Earth-616)|Jackal]] was used for the express purpose of sewing confusion between [[Peter Parker (Earth-616)|Spider-Man]] and the [[Benjamin Reilly (Earth-616)|Scarlet Spider]]. This plot was intended to make the pair question which was the real Peter Parker and which was the clone.{{r|This scheme is detailed in the Smoke and Mirror story arc of the [[Clone Saga]].{{Smoke and Mirrors}}}}\n\nTo this end, the Jackal tried to convince the two Spiders that the real Gwen Stacy had not died many years prior, and presented a clone as proof.{{r|The real Gwen Stacy was murdered by the Green Goblin back in {{cl|Amazing Spider-Man Vol 1 121}}. The Jackal made this false revelation in {{cl|Amazing Spider-Man Vol 1 399}}.}} This deception initially worked and was quite painful for Spider-Man as he had long since moved on with his life following the death of the real Gwen Stacy and had a common-law relationship with [[Mary Jane Watson (Earth-616)|Mary Jane Watson]].{{r|During this story, detailed in {{cl|Spider-Man Vol 1 56}}, Peter and Mary Jane are referred to as husband and wife. However, years later, their marriage is erased from existence by Mephisto in {{cl|Amazing Spider-Man Vol 1 545}}. As such they are referred to as a common-law couple here.}} Despite the fact that he was offered the chance of being with \"Gwen Stacy\" again, Spider-Man refused to give up on his life, even though the Jackal had also spent this time trying to convince him that he was a clone.{{r|At this time, the Jackal was attempting to convince Peter he was a clone. Ultimately, he would be convinced of this in {{cl|Spectacular Spider-Man Vol 1 220}} thanks to the machinations of the Green Goblin (as revealed in {{cl|Osborne Journals Vol 1 1}}) Peter will ultimately learn the truth in {{cl|Peter Parker: Spider-Man Vol 1 75}}.}}\n\nAs Spider-Man told Gwen that he was unwilling to give up his life, she suddenly began feeling ill. She then suddenly began degenerating, the eventual fate of all of the Jackal's imperfect clones. Spider-Man and the Scarlet Spider then watched in utter horror as the Gwen clone melted into a pile of genetic goo on the floor. They were then forced to flee the Jackal's facility before it exploded, presumably destroying all trace of the Gwen Stacy clone.{{r|Spider-Man Vol 1 56}}\n\nWith his plan to replace all humanity with clones created by him going smoothly, the Jackal sent Spider-Man, who at that time believed himself to be a clone, after the most perfect Gwen Stacy clone he had ever created: [[Joyce Delaney (Earth-616)|Joyce Delaney]]. In anticipation of her return, the Jackal released all the other Gwen Stacy clones at his secret hideout and activated their degeneration factor, killing all of them.{{r|Spider-Man Vol 1 61}}\n\n==Powers and Abilities==\n===Powers===\nNone.\n===Abilities===\nAs an exact copy of Gwen Stacy, she has the same skills and abilities as the template she is based on.\n===Strength level===\nHuman standard.\n===Weaknesses===\n[[File:Peter Parker (Earth-616), Gwen Stacy Clone (Earth-616), and Ben Reilly (Earth-616) from Spider-Man Vol 1 56 001.png|thumb|right|The Gwen Stacy clone degenerates.{{r|Spider-Man Vol 1 56}}]]\nLike all of the Jackal's imperfect clones, these Gwen Stacy clones were prone to degeneration. If this is a natural weakness, or intentionally implanted by the Jackal is subject to debate. This is because the Jackal has claimed to have a cure for clone degeneration, has created perfect clones in the past, and has even triggered instant degeneration in other clones through a \"kill switch\" he implanted in them as a failsafe.{{r|Examples of the Jackal's perfect clones would be Ben Reilly as well as [[Joyce Delaney (Earth-616)|the original Gwen Stacy clone]] circa {{cl|Amazing Spider-Man Vol 1 141}}-[[Amazing Spider-Man Vol 1 149|149]]. The Jackal's dubious explanations for and possible cure for clone degeneration are detailed in the Smoke and Mirrors story arc of the Clone Saga. Lastly, the Jackal attempted to initiate a kill switch on Spidercide in {{cl|Spectacular Spider-Man Vol 1 227}}. In the case of the first of these Gwen Stacy clones, the Spiders are led to believe that this was a natural defect, and the Jackal did nothing to confirm or deny this.}}\n{{Clear}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Clones]]\n[[Category:Clones of Gwen Stacy]]\n[[Category:Clones Created by Miles Warren]]"
                }
            }
        }
    ],
    "page_id": "1219721"
}