{
    "pageid": 468058,
    "ns": 0,
    "title": "Hades Incorporated (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Hades Incorporated (Earth-616) from Marvel Mystery Comics Vol 1 27 0001.jpg\n| Name                    = Hades Incorporated\n| Aliases                 = Hades Inc.\n\n| Leaders                 = \"Lucifer Satan\" (L.S.)\n| CurrentMembers          = \n| FormerMembers           = Satan's Sales Manager, \"Victor Risling\"\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Aarkus (Earth-616)|Vision]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = \n| BaseOfOperations        = An unknown [[Hell|Hell Realm]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Paul Gustavson\n| First                   = Marvel Mystery Comics Vol 1 27\n\n| History                 = By 1941, an unidentified [[Hell|Hell Realm]] decided to operate much like a business, calling themselves \"Hades Incorporated\". By their own accounts, they were responsible for all the world's evils and had a hand in [[Adolf Hitler (Earth-616)|Adolf Hitler]]'s rise to power in Nazi Germany. Operating under a hellish business model, they had various departments and business operations. Noted departments included the \"Terror Department\" and an archive that contained \"New Methods of Slaughter for Dictators\". The operation was run by a being calling himself Lucifer Satan (or \"L.S.\" for short), and he would delegate at least one of \"Satan's Sales Managers\" to create evil on Earth.\n\nIn 1941, L.S. would become furious that the town of Arbor City in the United States was completely devoid of evil and violently placed one of his Sales Managers on the job. Without any human prospects to spread evil in this town, the Sales Manager instead had one of his demons pose as a handsome and charismatic man named Victor Risling. Starting off as a daring adventurer, \"Victor Risling\" then earned the love and adoration of the people of Arbor City. Once establishing a great deal of popularity, \"Risling\" then got into politics. Here, he spread his message of hate, inciting prejudice against those who worshiped other religions and encouraging the people of Arbor City's majority religious faith to attack those minorities who followed other faiths.\n\nWhen actual acts of violence broke out, they attracted the attention of the [[Aarkus (Earth-616)|Vision]] who then came to the aid of a Jewish man being attacked by an angry mob. Learning of \"Risling's\" racist and prejudice triads, the Vision sought him out and attacked the politician at a public rally. There, the Vision forced the demon to reveal his true form and flee back to his hell realm, exposing the demon's plot to the people of the town. Thanks to the Vision's intervention, the people of Arbor City learned the errors of their ways and returned to their more peaceful and accepting ways.\n\nWhile back down in Hell, a furious L.S. kicked his Sales Manager and the demon who posed as Risling down a chasm for their failure.{{r|Marvel Mystery Comics Vol 1 27}}\n\nIf Hades Inc. is still operational remains to be revealed.\n| Equipment               = It would appear that Hades Incorporated uses standard office supplies that were commonly used in the workplace circa 1941.\n| Transportation          = \n| Weapons                 = \n| Notes                   = It is unknown if \"Lucifer Satan\" was any of the known [[Hell-Lords]] using a false identity, or if he was another Hell-Lord or lesser [[Demons|Demon]]. \n\nHades Inc's claim to be responsible for the rise of Adolf Hitler to power remains unsubstantiated. As other demonic forces have claimed credit of the Holocaust during [[World War II]], and demons being notorious liars, these claims are highly suspect.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "468058"
}