{
    "pageid": 631241,
    "ns": 0,
    "title": "Half-Fulls (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Plateau des Bolovens from New Warriors Vol 1 23 001.png\n| Name                    = Half-Fulls\n| Aliases                 = \n| Distinguish1            = \n\n| Status                  = Defunct\n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = Cambodia, Vietnam \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Daryl Taylor (Earth-616)|Daryl Taylor]], [[Andrew Chord (Earth-616)|Andrew Chord]] , [[Diego Casseas (Earth-616)|Diego Casseas]], [[Mark Conroy (Earth-616)|Mark Conroy]], [[Collier Mack (Earth-616)|Collier Mack]], and [[Go Vin Ng (Earth-616)|Go Vin Ng]].\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = New Warriors Vol 1 23\n| Last                    = New Warriors Vol 1 24\n\n| HistoryText             = The Half-Fulls were a unit of the [[United States Army (Earth-616)]] during the [[Siancong War]]. During a mission in Cambodia they stumbled upon the Temple of the Dragon's Breath cult. There they met [[Tai (Well of All Things) (Earth-616)]] and the brides of the cult. Tai made an offer to the six men: marry the brides and the children from those unions would one day rule the world. The temple was built around an interdimensional vortex that crossed into several other dimensions and the members of the Cult had planned through centuries of selective breeding to tap into the power of the well, with the end goal of their descendants one day ruling the world. Tai had murdered her people in order to ensure she alone would reap the reward from the well.\n\n[[Daryl Taylor (Earth-616)|Daryl Taylor]] declined Tai's offer while [[Andrew Chord (Earth-616)|Andrew Chord]], [[Collier Mack (Earth-616)|Collier Mack]], [[Diego Casseas (Earth-616)|Diego Casseas]], [[Mark Conroy (Earth-616)|Mark Conroy]], and [[Go Vin Ng (Earth-616)|Go Vin Ng]] accepted the offer. Daryl Taylor and his [[Melody Taylor (Earth-616)|wife]] were murdered for Daryl's rejection of the terms of the pact. The other members of the Half-Fulls besides Daryl and Diego went on to father children who would one day become members of the [[Folding Circle]]. Diego and his wife had a daughter who was left comatose in an elevator crash. Diego used dark arts to steal his daughter's powers for himself and he became the Left Hand.\n\nTai's only daughter Miyami was given to Andrew Chord. Miyami later faked the deaths of herself and her children to keep them out of Tai's hands. Andrew Chord and Miyami's children became Silhouette and Midnight's Fire.\n\nMark Conroy and his wife had a son named Eric Conroy (Bloodstrike). Collier Mack and his wife had a son named Conrad Mack (Smiling Tiger). Go Vin Ng and his wife had a daughter named Min Li Ng (Silk Fever).\n\nDaryl Taylor refused the pact on the grounds that he was faithful to his wife Melody who he married when they were 18 years old. Together they had a son named Dwayne Taylor (Night Thrasher). Ironically Daryl cheated on Melody with a woman he met on a business trip to Chicago and has an illegitimate son named Donyell Taylor (Bandit).\n\nTai had her son-in-law Andrew Chord murder Daryl and Melody Taylor. From that point on Dwayne was raised by Chord and Tai who played on his desire for revenge and steered him towards creating his own team of superheroes. Tai's people's plan for the Children of the Pact (The Folding Circle) was to sacrifice them to the well so that Tai's generation (the grandparents of the Folding Circle) would be granted the full power of the well. Tai had modified the plan and wanted to sacrifice the New Warriors instead and keep the Children of the Pact alive to serve as her avatars on earth. [[File:Half-Fulls (Earth-616) from New Warriors Vol 1 23 0001.jpg|thumb]]\n \nTai and the Left Hand were killed when Night Thrasher shot Tai and she and Diego fell into the Well. Mark Conroy died 3 years before his son became Bloodstrike. Go Vin Ng's daughter is an orphan, and may have been killed in the napalm explosion that triggered Min Li Ng's powers. Andrew Chord is still alive. Collier Mack's fate is unknown.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each teammates' arsenal\n\n| Notes                   = *  \n| Trivia                  = \n| Links                   = \n* \n\n}}"
                }
            }
        }
    ],
    "page_id": "631241"
}