{
    "pageid": 15808,
    "ns": 0,
    "title": "Heralds of Galactus (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Annihilation Heralds of Galactus Vol 1 1-2 Textless.jpg\n| ImageSize               = 250px\n| Name                    = Heralds of Galactus\n| Aliases                 = Galactus's Heralds, Galaction Heralds{{r|Silver Surfer Vol 3 33}}\n\n| Status                  = Active \n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Generally mobile under their own power, or Galactus' Worldship ([[Worldship (Taa II)|Taa II]])\n\n| Leaders                 = [[Galan (Earth-616)|Galactus]]\n| CurrentMembers          = [[Norrin Radd (Earth-616)|Silver Surfer]], [[Thor Odinson (Earth-616)|Thor]]\n| FormerMembers           = [[Air-Walker (Automaton) (Earth-616)|Air-Walker (Automaton)]], [[Gabriel Lan (Earth-616)|Air-Walker (Gabriel Lan)]], [[Alpha Ray (Earth-616)|Alpha Ray]], [[Conner Sims (Earth-616)|Anti-Man]], [[Suzi Endo (Earth-616)|Cybermancer]], [[Alison Blaire (Earth-616)|Dazzler]], [[Wade Wilson (Earth-616)|Deadpool]], [[Destroyer (Enchanted Armor)]], [[Fallen One (Herald) (Earth-616)|Fallen One]], [[Firelord (Pyreus Kril)|Firelord]], [[Gah Lak Tus (Earth-1610)|Gah Lak Tus]], [[Galactus' Cat (Earth-616)|\"Galactus' Cat\"]], [[Jonathan Storm (Earth-616)|Invisible Boy (Johnny Storm)]], [[Morg (Earth-616)|Morg]], [[Frankie Raye (Earth-616)|Nova (Frankie Raye)]], [[Praeter (Mike) (Earth-616)|Praeter]], [[Rigellian Recorders|Recorder]], [[Red Shift (Earth-616)|Red Shift]], [[Lambda-Zero (Earth-616)|Stardust]], [[w:c:dc:Kal-El (New Earth)|Superman]],{{r|Superman / Fantastic Four Vol 1 1}} [[Tyros (Earth-616)|Terrax the Tamer]], [[Zoloz (Earth-616)|Zoloz]]{{r|Doctor Strange Vol 5 17}}\n| Allies                  = [[Alpha Ray]], [[Fantastic Four (Earth-616)|Fantastic Four]], [[Skrulls]]; (additional allies vary, based on the morality and personal goals of the individual herald) \n| Enemies                 = [[Annihilus (Earth-616)|Annihilus]], [[Elders of the Universe]], [[Morg]], [[Seekers]], [[Tyrant]] (additional enemies vary, based on the morality and personal goals of the individual herald)\n\n| Origin                  = The Heralds of Galactus are individuals imbued with a fraction of Galactus’ immense [[Power Cosmic]] in order to scour the universe in search of planets for Galactus to consume. Over the years, Galactus has had several heralds, though few as famous as the Silver Surfer.\n| PlaceOfFormation        = The exact events that led to the creation of Galactus's first herlad, Fallen One, are a complete mystery unknown to anyone but Galactus and Fallen One. Galactus created his second herald, the Silver Surfer near [[Zenn-La]], Deneb system, the Milky Way Galaxy\n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four #48 \n| Last                    = \n\n| Quotation               = No longer must I scour the cosmos '''alone.''' Let it be known throughout all existence that Galactus is allied with another. \n| Speaker                 = [[Galan (Earth-616)|Galactus]]\n| QuoteSource             = Superman / Fantastic Four Vol 1 1\n\n| HistoryText             = [[Galactus]], originally named Galan, is the oldest and one of the most powerful beings in the universe, having survived the death (big crunch) of his \"first\" universe and the birth (big bang) of this universe, but he is crippled by an insatiable hunger that drives him to consume the very life-energies of entire planets, destroying these worlds in the process. Eons ago, Galactus realized it was far more efficient to use advance scouts or “heralds” to seek out planets for him to consume. In the years that followed, Galactus created a succession of Heralds, each with very different backgrounds, motives, and personalities. \n===The Fallen One===\nAlthough the ancient history of Galactus’ heralds remains rather vague, it is believed that his first herald was the being now known simply as the [[Fallen One (Herald) (Earth-616)|Fallen One]]. Like the heralds that would follow him, the Fallen One was given the [[Power Cosmic]]. However, the Fallen One was too hostile and unpredictable for Galactus to control, so the world-devourer eventually imprisoned him. Over the millennia that followed, the Fallen One repeatedly escaped and tried to confront Galactus, only to be defeated and imprisoned again.\n\n===The Silver Surfer===\nPerhaps humbled by his experiences with the Fallen One, Galactus seemingly did not create another herald for eons. However, when Galactus threatened to destroy [[Zenn-La]], [[Norrin Radd]] offered to become the world-devourer’s servant if Galactus would spare his homeworld. Galactus agreed and imbued Radd with a small fraction of his power cosmic, transforming him into the herald known as the Silver Surfer. As Galactus’ new herald, the Surfer was dedicated to finding uninhabited but energy-rich worlds for Galactus to consume. \n\nThe Silver Surfer served Galactus for many years, during which Galactus gradually altered Norrin Radd’s mind. With his emotions and memories repressed, the Surfer began leading Galactus to inhabited worlds. When the Silver Surfer arrived on Earth, however, he encountered [[Alicia Masters (Earth-616)|Alicia Masters]], who sensed Radd’s nobility and courage. Moved by Alicia, the Silver Surfer rebelled and joined forces with the [[Fantastic Four (Earth-616)|Fantastic Four]] and [[Uatu (Earth-616)|Uatu]] to drive Galactus away from Earth. Galactus punished the Silver Surfer for his betrayal by trapping Norrin Radd on Earth. Galactus would later reconsider this decision, but the Silver Surfer resisted all of Galactus’ efforts to regain his services and the world-devourer began searching for a new herald…\n\n===The Air-Walker===\nGalactus began scanning the minds of sentient beings across the universe for a suitable replacement of the Silver Surfer. Eventually, he chose [[Gabriel Lan (Earth-616)|Gabriel Lan]], captain of an [[Xandarians|Xandarian]] exploration vessel, to become his next herald. A member of the [[Nova Corps]], Lan was brave and prone to wanderlust. He did not refuse Galactus’ offer of immense power and unlimited freedom to travel the universe under his own power. Galactus gave Lan a tiny portion of his power cosmic, transforming Gabriel into the Air-Walker.\n\nThe Air-Walker served Galactus faithfully for years, and even befriended the world-devourer. The Air-Walker eventually sacrificed himself to protect Galactus from a fleet of [[Ovoids|Ovoid]] warships. Galactus was weak from hunger and could not protect or resuscitate Lan, but eventually managed to transfer Gabriel’s consciousness into a robot replica of the Air-Walker. Unfortunately, Lan’s personality and passion for exploration did not survive the process, and the Air-Walker automaton was a hollow image of Galactus’ former friend and ally. Frustrated, Galactus sent the Air-Walker to Earth to convince the Silver Surfer to return to his role as Galactus’ herald. The Silver Surfer declined, and the automaton was badly damaged in a subsequent battle with the Surfer and the Fantastic Four. Galactus abandoned the automaton on Earth, where the Air-Walker robot was secretly captured by the [[Machinesmith]].\n\n===Firelord===\n[[Pyreus Kril (Earth-616)|Pyreus Kril]] was first officer aboard Gabriel Lan’s Xandarian exploration vessel, and was present when his friend was seemingly kidnapped by the alien starship belonging to Galactus. Determined to rescue his captain, Kril took command of the exploration vessel and pursued Galactus’ ship across the universe. \n\nYears passed, but Kril did not give up his quest. Eventually, Kril located Galactus’ ship and, unaware that Lan had already been slain battling the Ovoids, teleported aboard the massive vessel. Kril confronted Galactus and demanded that Lan be released. Impressed by the man’s courage, Galactus offered to reveal Lan’s fate if Kril agreed to become his new herald. Kril accepted the offer, receiving the power cosmic and becoming Firelord.\n\nGalactus told Kril of Air-Walker’s death, and the apparent destruction of the Air-Walker automaton. However, he immediately altered Firelord’s mind, suppressing the information he had just imparted to his herald.\n\nFirelord’s servitude to Galactus was extremely short-lived. While on a mission to Earth, Firelord encountered [[Thor Odinson (Earth-616)|Thor]], who negotiated with Galactus for Firelord’s freedom. In exchange for releasing Firelord, Thor provided Galactus with an Asgardian construct known as the Destroyer. Although he retained the power cosmic and was free to roam the universe, Firelord’s subconscious compelled him to remain on Earth, the last known location of the Air-Walker automaton.\n\nMonths later, the Machinesmith accidentally reactivated the Air-Walker automaton, and the android gradually regained consciousness. The Air-Walker robot set out to kill the Silver Surfer, but was instead engaged by Thor, who destroyed the automaton’s self-repair circuitry. Upon learning of the Air-Walker’s existence, Firelord’s suppressed memories flooded back and he took possession of the android. He buried the automaton – the only remains of his friend Gabriel Lan – on an asteroid in the Tranta System, near their homeworld of Xandar.\n\n===The Destroyer===\nAt Thor's urging, Galactus agreed to trade Firelord’s freedom in exchange for the [[Asgard|Asgardian]] [[Destroyer (Enchanted Armor)|Destroyer]]. The Destroyer is actually a suit of mystic armor created by [[Odin Borson (Earth-616)|Odin]] to battle the incredibly powerful [[Celestials]]. The armor is constructed of a metal superior to [[Uru]] (the metal that comprises Thor’s hammer) and has been enchanted by Odin. These enchantments allow the armor to contain the powers of various Asgardians, including those of Odin, Thor and others.\n\nThough powerful, the Destroyer armor was far different from the sentient heralds that Galactus had previously employed. When the Destroyer was later stolen by [[Loki Laufeyson (Earth-616)|Loki]] as part of one of his numerous schemes, Galactus did not try to regain the enchanted armor. Instead, he began seeking a new herald.\n\n===Terrax the Tamer===\nAccording to Galactus, the Silver Surfer had been noble, brave, and even heroic, which were qualities that ultimately led him to betray his master in order to protect Earth. Hoping to find a new herald that would have no qualms about identifying inhabited worlds for Galactus to consume, the world-devourer searched for a ruthless, power-hungry being to accept his offer. Eventually, Galactus identified [[Tyros (Earth-616)|Tyros]], the tyrannical dictator of the city Lanlak on the planet [[Birj]], as a worthy successor to the Silver Surfer. But Tyros was already very powerful, as he had been born with a unique mutation that allowed him to animate stone. Galactus knew that he would need to first overpower Tyros before he could transform the despot into his new herald. Ironically, Galactus turned to the Fantastic Four for aid: he offered to help them defeat the [[Sphinx]] if they would in turn promise to subdue Tyros. Reluctantly, the Fantastic Four accepted this offer, and the quartet did defeat Tyros as promised. Galactus immediately brought Tyros under his cosmic control and imbued him with a tiny fraction of his power cosmic. This transformed Tyros into Terrax the Tamer, an immensely powerful being whose complete control over stone allowed him to move 100-mile-wide planets.\n\nAs Galactus had hoped, Terrax was immoral and had no concerns about pointing his master towards inhabited worlds. However, Terrax was also ambitious and had no sense of loyalty to Galactus. He eventually began conquering planets for his own selfish ends, and only served Galactus out of fear. Seeking to escape Galactus’ service forever, Terrax eventually fled to Earth, where he took Manhattan hostage and threatened to demolish the city unless the Fantastic Four destroyed Galactus’ ship. Galactus was enraged by this treachery and stripped Terrax of his powers – something he had not done to any of his previous heralds – transforming him back into Tyros. Galactus then hurled Tyros from the top of the World Trade Center and left him for dead.\n\n===Nova===\n[[Frankie Raye (Earth-616)|Frankie Raye]] was the adopted daughter of William Raye, secretly [[Phineas Horton (Earth-616)|Phineas T. Horton]] in disguise. Horton, the inventor of the original [[Jim Hammond (Earth-616)|Human Torch]], became enraged when [[Jonathan Storm (Earth-616)|Johnny Storm]] began using the same moniker. When Horton tried to reactivate the android Human Torch, his daughter was exposed to the same chemicals used to construct it and gained the android’s powers as a result.\n\nPerhaps due to the similarity of their powers, Frankie Raye was drawn to Johnny Storm. She began a relationship with him and even began fighting alongside the Fantastic Four. However, over time, Frankie became restless. She dreamed of experiencing “cosmic grandeur” and space-faring adventures. When Galactus yet again threatened Earth, Frankie volunteered to become his newest herald to spare the planet. Galactus agreed and transformed Frankie into Nova – a being with the power of a miniature sun.\n\nIn the tradition of the Silver Surfer, Nova used her powers to seek out uninhabited worlds for Galactus to consume. She also teamed up with the Silver Surfer to battle the Elders of the Universe, who attempted to destroy Galactus and thereby come the oldest living being in the universe. After this adventure, Nova and the Silver Surfer began a (somewhat rocky) romantic relationship.\n\nLike the Air-Walker before her, Nova formed a strong bond with Galactus, who let down his guard and shared his private thoughts and feelings with his new herald. But Galactus remained driven by his insatiable hunger and encouraged Nova to lead him to inhabited worlds. Nova continued to ignore Galactus’ demands until the world-devourer dismissed her from his service.\n\n===Morg and the Herald Ordeal===\nAfter dismissing Nova, Galactus was yet again left without a herald. He considered his past mistakes and recognized that he needed a herald who was both amoral enough to lead Galactus to inhabited worlds, but pliable enough to remain loyal to his master. While consuming an unnamed planet, Galactus located [[Morg (Earth-616)|Morg]], a bloodthirsty court executioner. Evidently unconcerned with his planet’s fate, Morg agreed to become Galactus’ new herald even after Galactus destroyed his homeworld. As with all past heralds, Morg received a fraction of Galactus’ power cosmic. He later increased his powers even further by immersing himself in the Well of Life, thereby becoming Galactus’ most powerful herald yet.\n\nMorg quickly proved that he was also far more vicious than any of Galactus’ previous heralds. The Silver Surfer, Firelord, and Nova realized that Morg would cause the death of untold billions and agreed to join forces against their successor. To this end, they combined their cosmic powers to resurrect the Air-Walker android. The four former heralds battled Morg and seemingly killed him, but not before Nova was slain when Morg stabbed her in the back. The Silver Surfer flew Nova’s body into a nearby sun.\n\nAfter Morg’s apparent demise, Galactus reluctantly accepted both Firelord and the Air-Walker automaton back into his service. The first known paired heralds, Firelord and Air-Walker could more easily find uninhabited worlds for Galactus to consume than a single herald alone. During this time, Firelord tried to revive Gabriel Lan’s personality, which was still buried deep in the Air-Walker android.\n\nWhile Air-Walker and Firelord served Galactus faithfully, Galactus secretly resurrected Morg, altering his personality in the hopes of making him more tractable. But Morg was kidnapped by Galactus’ old foe, [[Tyrant]]. Galactus agreed to let Tyrant keep Morg in exchange for a truce between the two ancient enemies. When Morg eventually escaped, he returned to Galactus and attempted to kill his “replacements.” The Silver Surfer arrived in time to save Firelord and Air-Walker. Tyrant confronted Galactus soon after, and Morg proved his undying loyalty to Galactus by attacking Tyrant with the [[Ultimate Nullifier]]. The resulting blast seemingly destroyed both Morg and Galactus.\n\n===Red Shift===\nGalactus survived the Ultimate Nullifier by escaping into another dimension, and later returned after consuming the power of [[Hyperstorm]], a villain from an alternate timeline. After this ordeal, however, Galactus’ hunger only grew, nearly driving him insane. He became obsessed with consuming sentient life, but was yet again without a herald. He quickly recruited [[Red Shift (Earth-616)|Red Shift]], a mysterious herald about which very little is known, and planned to at last devour Earth. <br>\nSensing Red Shift’s use of the power cosmic, the Silver Surfer tried to convince the herald that Earth should not be destroyed. Red Shift refused to listen to reason, and the two heralds clashed. Red Shift used his powers to open a portal to a black hole, into which he hoped to send the Silver Surfer, but his plan went awry and both heralds were swept into the trap. Their battle continued within the black hole until the Silver Surfer unleashed a massive explosion of cosmic energy. Red Shift lost his two swords -- the weapons which enabled him to open his portals – and remained trapped in the black hole even after the Surfer barely escaped.\n\n===The Invisible Boy===\nSometime after Red Shift’s battle with the Silver Surfer, a federation of aliens from various worlds consumed by Galactus arrived on Earth. These aliens had created a technology that could cloak and conceal other planets from the world-devourer. However, they feared that Sue Storm, the [[Susan Storm (Earth-616)|Invisible Woman]]. would become a pawn of Galactus, who would use her powers to make their devices useless. In an attempt to prevent this, the aliens planned to kill Sue, and they threatened to destroy Manhattan unless she surrendered to them. To save his wife, [[Reed Richards (Earth-616)|Reed Richards]] used one of his own inventions to seemingly strip Sue of her powers. Convinced that Sue was no longer a threat, the aliens departed. However, it was soon revealed that Reed had really used his device to swap powers between Sue and her brother, Johnny Storm. Thus, Sue became the Human Torch and Johnny became the Invisible Boy. \n\nGalactus, already intent on using Sue Storm’s powers to thwart the alien federation, arrived on Earth soon after Johnny’s transformation. Discovering the switch, Galactus kidnapped Johnny and immediately infused him with the power cosmic. Although Johnny was initially overwhelmed by his new powers, he began seeking an uninhabited world for Galactus consume while secretly rallying other worlds against Galactus. His delaying tactics allowed the Fantastic Four and [[Wendell Vaughn (Earth-616)|Quasar]] to eventually catch up to Johnny. Using his new powers, Johnny analyzed Galactus and instructed Reed and Quasar in the construction of a device that removed Galactus’ cosmic energy. Galactus temporarily reverted to his original form – that of the powerless Galen – and was brought to Earth. There, the Fantastic Four convinced Galen to exile himself into an energy-rich dimension.\n\n===Stardust===\nGalen eventually reverted back to Galactus and – for reasons of his own – left his self-imposed exile and returned to his home dimension. Again he sought a herald, this time choosing a mysterious entity named [[Lambda-Zero (Earth-616)|Stardust]] as the recipient of the power cosmic. Although very little is known about Stardust’s history prior to becoming Galactus’ herald, he claims that he was already quite powerful even before meeting his new master. What is known is that Stardust quickly became the most fanatical of Galactus’ heralds, worshipping his master like a god. His fanaticism led him to not only seek out new planets for Galactus, but also hunt down any survivors of worlds destroyed by Galactus so that no trace of these civilizations would be left alive.\n\nWhile hunting down the last of the [[Korbinites|Korbinite]] race, Stardust clashed with their protector, [[Beta Ray Bill]]. During this battle, Stardust used his powers to open a dimensional gateway that he hoped would consume Beta Ray and the last of the Korbinites. Instead, Stardust unwittingly released a demonic entity from a “cosmic hell” known as [[Asteroth]]. Realizing that Asteroth threatened the entire universe, Beta Ray and Stardust reluctantly joined forces to stop her. Meanwhile, Galactus revived Beta Ray’s predecessor – [[Alpha Ray (Earth-616)|Alpha Ray]] – and ordered him to find Stardust and Beta Ray.\n\nTo banish Asteroth, Stardust created a massive black hole. Alpha Ray arrived as the black hole was opening, and he drove Asteroth back into the rift. Both Alpha Ray and Stardust were also sucked into the void, but Stardust soon escaped and returned to Galactus’ side.\n\n===Annihilation=== \nShortly after Stardust escaped his black hole, the universe faced a major threat in the form of an insectoid armada led by [[Annihilus (Earth-616)|Annihilus]]. Dubbed the [[Annihilation Wave]], the armada began destroying every planet in its path as it made its way towards Earth. Across the universe, cosmic heroes and alien fleets began joining forces to combat the Annihilation Wave, but all seemed doomed to failure.\n\nThe Annihilation Wave had a profound impact on all of Galactus’ former heralds. The first to encounter the Wave was Air-Walker, who had regained much of his identity as Gabriel Lan identity. Sadly, Air-Walker fell during an attack on his homeworld of [[Xandar]] by a villain named [[Ravenous]] and his fellow [[Seekers]]. Without his stalwart partner, Firelord teamed up with Red Shift, who had recently escaped his own black hole. When Galactus realized the danger posed by the Annihilation Wave, he ordered Stardust to combine forces with his two former heralds. Meanwhile, Annihilus – intent on studying the power cosmic – captured both Morg and Terrax. Finally, in the chaos of Annihilation Wave events, the Fallen One escaped once again and joined forces with [[Tenebrous]] and [[Aegis (Cosmic Entity)]], both also ancient enemies of Galactus.\n\nDuring the war with Annihilus and his armada, events referred to as [[Annihilation (Event)|Annihilation]], Galactus took the Silver Surfer as his herald once more. The Surfer led Firelord, Red Shift, and Stardust in battle against the Annihilation Wave. Stardust and Red Shift later sacrificed themselves to allow [[Richard Rider (Earth-616)|Nova (Richard Rider)]] and his forces time to evacuate Daedalus 5.\n\n===Hunger===\nFollowing [[Galan (Earth-616)|Galactus]]' arrival to [[Earth-1610]],{{r|Age of Ultron #10}} the cosmic entity was merged with [[Gah Lak Tus (Earth-1610)|Gah Lak Tus]], and used portions of the collective of machines to fulfill the purpose of his heralds.{{r|Hunger #1}}\n\n| Equipment               = Varies based on the herald, but most are self-sufficient and rely on very little equipment. Gabriel Lan possesses the “[[Horn of Galactus]]”, a golden trumpet-like device that can summon Galactus across any distance.\n| Transportation          = Each herald traveled under their own power, using the power cosmic. Silver Surfer flies through the universe on a silver construct much like a [[Silver Surfer's Surfboard|surfboard]], while most of the other heralds simply fly under their own power.\n| Weapons                 = A few of Galactus’ heralds have utilized weapons. Terrax and Morg each wield a [[Morg's Axe|heavy]] [[Terrax's Axe|axe]], while Red Shift carried a [[Red Shift's Swords|pair of swords]] that allowed him to create portals in space, Stardust uses some kind a [[Stardust's Halberd|spear]], Pyraeus Kril uses a [[Firelord's Staff|staff]] to channeling his cosmic flame.\n\n| Notes                   = * [[Galan (Earth-616)|Galactus]] and his Heralds were stated to be cosmic level threats.{{r|{{cl|Marvel Fact Files #10}}, [[Norrin Radd (Earth-616)|Silver Surfer]]'s entry}}\n* In various alternate futures, Nova is Galactus' herald, suggesting that she survived her encounter with Morg or was somehow resurrected.\n* Some sources make reference to a “gladiator” that Galactus coveted as a herald for many years, but who was rescued from this fate by the Fantastic Four. The identity of this herald is unknown, but may be the Imperial Guardsman [[Gladiator (Kallark)]].\n* [[Rom]], Greatest of the [[Spaceknights]] of [[Galador]] bargained to lead Galactus to another world to feed upon in place of his homeworld Galador in {{cl|Rom #27}}. However, he was not given the status of being a Herald. Rom led Galactus to [[Wraithworld]] in [[The Dark Nebula]]. Galactus was unable to consume the planet or its Black Sun.\n* In [[Earth-9047]], [[Harrold (Earth-9047)|Harrold]], aka the Cookie Crook, is the herald of [[The Big Ol'Boy! (Earth-9047)|Galactapus]].<ref name=\"WT2\">''Bower Brats Meet Clunk and Dagnabbit'' in [[What The--?! Vol 1 2|''What The--?!'' #2]]</ref> [[Galacticus (Earth-9047)|Galacticus]], who is a different character, makes use of other heralds.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Power Cosmic]]\n[[Category:Cosmic Level Threats]]"
                }
            }
        }
    ],
    "page_id": "15808"
}