{
    "pageid": 519933,
    "ns": 0,
    "title": "Hollow Men (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Hollow Men (Earth-616) from Avengers 1959 Vol 1 5 0001.jpg\n| Name                    = Hollow Men\n| Aliases                 = \n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n| Leaders                 = [[Geoffrey Sydenham (Earth-616)|Geoffrey Sydenham]], Formerly [[Lord of Death (Earth-616)|Lord of Death]]\n| CurrentMembers          = \n| FormerMembers           = unnamed zombies\n| Allies                  = [[ICON (1950s) (Earth-616)|ICON]]\n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Joe Simon; Jack Kirby\n| First                   = All Winners Comics #1\n| Last                    = Avengers 1959 #5\n\n| HistoryText             = Not much is known about the Lord of Death, a [[National Socialist German Workers Party (Earth-616)|Nazi]] sympathizer, he would be the inventor of \"Di-Namo Fluid\". Replacing human blood with this fluid would turn people into mindless zombies that would be unstoppable short of destroying their bodies. His work would attract the attention of [[Adolf Hitler (Earth-616)|Hitler]] himself who would personally oversee his mission of disrupting the American military effort before they could enter the war.\n\nStationing himself in the Bowery section of New York, he would lure members of the large homeless population into his lair, promising food and work. Instead, he would drain the homeless people of their blood and turn them into zombies with the Di-Namo Fluid. He would unleash these zombies to attack a nearby navy ship being guarded by [[Steven Rogers (Earth-616)|Steve Rogers]] and [[James Buchanan Barnes (Earth-616)|Bucky]]. Changing into Captain America and Bucky, the two would fight off the zombies. Posing as homeless men, they would be lured into the Lord of Death's lair where they would learn of his plot.\n\nChanging into their costumed identities, they would easily defeat the overweight Lord of Death, knocking him into his own machinery, killing him.{{r|All Winners Comics Vol 1 1}}\n\nIn the late 1950s, Geoffrey Sydenham recreated the Lord of Death's dynamo fluid and produced a large group of Hollow Men to be used as part of [[ICON (1950s) (Earth-616)|ICON's]] forces. One group of these Hollow Men were created in a secret hideout in [[Latveria]] which [[Nicholas Fury (Earth-616)|Nick Fury]] and the [[Louise Grant (Earth-616)|Blonde Phantom]] invaded while seeking information on a supposed new Nazi movement. Finding only the zombified [[Hollow Men (Earth-616)|Hollow Men]], Fury blew up the base before the two adventurers fled the scene.{{r|Avengers 1959 #2}} Sydenham had a second group of Hollow Men stationed in Washington D.C., though these were later defeated by [[Victor Creed (Earth-616)|Sabretooth]] and [[Aquaria Neptunia (Earth-616)|Namora]] when they defeated ICON's forces and captured Sydenham.{{r|Avengers 1959 Vol 1 5}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "519933"
}