{
    "pageid": 481779,
    "ns": 0,
    "title": "Holy Ring (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Holy Ring (Earth-616) from Captain America Comics Vol 1 18 0001.jpg\n| Name                    = Holy Ring\n| Aliases                 = \n\n| Leaders                 = Formerly [[Peter Higorovitch (Earth-616)|Gigo]]\n| CurrentMembers          = \n| FormerMembers           = [[Peter Higorovitch (Earth-616)|Gigo]], unnamed members\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Global\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Syd Shores\n| First                   = Captain America Comics Vol 1 18\n\n| History                 = The Holy Ring organization has its beginnings in [[Russia]]. They were a secret order of Russian czars, grand dukes, princes, and generals originally formed to undermine the [[Union of Soviet Socialist Republics|Soviet Union]]. Their secret order then broadened their scope to taking down democratic nations as well, setting up Fifth Columnists all across the world. The groups emblem was the Greek letter [[Wikipedia:Rho|Rho]] (which resembles the letter P in the English alphabet). \n\nBy the fall of 1942, a sect of the Holy Ring had set up operations in the Russian district near [[Camp Lehigh]]. Their leader [[Peter Higorovitch (Earth-616)|Gigo]] ran a bowling alley that he had loaded with traps based on the bowling equipment and sought to eliminate or incapacitate American soldiers who came to the alley to play some games while off duty. Taking note that the \"accidents\" were actually carefully crafted traps, Private [[Steven Rogers (Earth-616)|Steve Rogers]] and his ward [[James Buchanan Barnes (Earth-616)|Bucky Barnes]] investigated the bowling alley as Captain America and Bucky.\n\nThrough detective work and a clash against Gigo, the two heroes learned of the Holy Ring and their origins. Tracking them to their secret hideout, the two heroes smashed the operation and turned them over to the military organization. While this branch of the Holy Ring was dismantled,{{r|Captain America Comics Vol 1 18}} if there are any other sects that survived after [[World War II]] remain to be revealed.\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Holy Ring all had access to various firearms. The bowling alley they operated in had bowling pins rigged with bullets so that when struck with a bowling ball they would fire a lethal shot. It also had bowling balls with special springs inside the finger holes that damaged the fingers of those who used them.\n| Notes                   = Gigo referred to serving a \"Fuhrer\" which implies that at least this sect of the Holy Ring organization was associated with the [[National Socialist German Workers Party (Earth-616)|Nazis]]; however, such facts are unsubstantiated. It is entirely possible that Gigo himself might have been a Nazi sympathizer and his loyalty to [[Adolf Hitler (Earth-616)|Hitler]] may not have been shared by the organization he led.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]\n[[Category:1942 Team Debuts]]\n[[Category:Russian Organizations]]"
                }
            }
        }
    ],
    "page_id": "481779"
}