{
    "pageid": 482108,
    "ns": 0,
    "title": "Hooded Gang (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Hooded Gang (Earth-616) from Human Torch Vol 1 9 0001.jpg\n| Name                    = Hooded Gang\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Somerville, USA\n\n| Leaders                 = Formerly [[Mr. Dodd (Earth-616)|Mr. Dodd]]\n| CurrentMembers          = \n| FormerMembers           = [[Mr. Dodd (Earth-616)|Mr. Dodd]], unnamed members\n| Allies                  = \n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Harry Sahle\n| First                   = Human Torch Vol 1 9\n| Last                    = Human Torch Vol 1 9\n\n| HistoryText             = [[File:Mr. Dodd (Earth-616) from Human Torch Vol 1 9 0001.jpg|thumb|left|Dodd, the leader of the Hooded Gang]]\nThe Hooded Gang was a lynch mob formed in the fall of 1942 by real estate owner [[Mr. Dodd (Earth-616)|Mr. Dodd]]. Dodd lived in the town of Somerville and owned the property where the local slum -- called Sunnyvale -- was located. Dodd was hoping to sell the land to allow a local railroad company to put tracks through the area, but the plan was threatened by the city council's plans to demolish the slum and build new homes for the people. Dodd vehemently opposed this and kept his reasons for doing so a secret. Instead, he used his charismatic personality to win people over (or to likely buy them off) to support his side of the argument. He almost caused a city council meeting to end in a riot if not for the timely intervention of the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]] who happened to be stranded in Somerville due to a storm.\n\nThe following day, when City Councilor Ross showed the Torch and Toro the slum, Dodd framed Ross for the murder of one of his own supporters. When the Torch and Toro searched Dodd's home for clues proving he was responsible, Dodd and his men got the drop on the two heroes and bound them in asbestos tape. While the two heroes struggled to get free, Dodd rallied up his followers and decked in robes they stormed the police station demanding that Ross be released to them. When the authorities refused, Dodd and his men stormed the prison and forced Ross out, taking him to the local forest where they prepared to hang him and light him on fire to make it painful.\n\nThe Torch and Toro by this point had broken free and learned of Dodd's plans for Sunnyvale and caught up with the mob. Fighting them off, they saved the life of Ross and forced Dodd to confess his crimes. Dodd was turned over to the authorities and eventually convicted of the crimes he was accused of.{{r|Human Torch Vol 1 9}} The fate of the rest of the mob is unknown; however, it can be certain they were disbanded once their ring leader was taken down.\n\n| Equipment               = \n| Transportation          = The Hooded Gang got around on horseback.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "482108"
}