{
    "pageid": 1327054,
    "ns": 0,
    "title": "Horsemen of Salvation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Uncanny X-Men Vol 5 6 Textless.jpg\n| ImageSize               = 300\n| Name                    = [[Horsemen of Salvation]]\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Nathaniel Grey (Earth-295)|X-Man]]\n| CurrentMembers          = \n| FormerMembers           = [[Frederick Dukes (Earth-616)|Bounty]], [[Ororo Munroe (Earth-616)|Life (Ororo Munroe)]], [[Warren Worthington III (Earth-616)|Life (Warren Worthington III)]], [[Max Eisenhardt (Earth-616)|Peace]], [[Arkady Rossovich (Earth-616)|Wellness]]\n| Allies                  = \n| Enemies                 = [[X-Men (Earth-616)|X-Men]], [[En Sabah Nur (Earth-616)|Apocalypse]], [[Ashton Allen (Earth-616)|Senator Allen]]\n\n| Origin                  = [[Homo superior|Mutants]] brainswashed to serve as Horsemen under the control of [[Nathaniel Grey (Earth-295)|Nate Grey]].\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[British Columbia]], [[Canada]]\n| Creators                = Matthew Rosenberg; Kelly Thompson; Ed Brisson; Pere Pérez\n| First                   = Uncanny X-Men Vol 5 3\n| Last                    = Uncanny X-Men Vol 5 10\n\n| HistoryText             = The Horsemen of Salvation was a group of [[Homo superior|mutants]] that were being controlled by [[Nathaniel Grey (Earth-295)|Nate Grey]] to help him in his collective ideals about remaking the world in his image. The Horseman blew up the [[Xavier's School for Gifted Youngsters|Xavier Institute for Mutant Education and Outreach]] in [[Central Park]] believing that they had killed the [[X-Men (Earth-616)|X-Men]] as they were a thorn in their master's plan.{{r|Uncanny X-Men Vol 5 3}}\n\nThey arrived back at X-Man's hideout in [[British Columbia]], [[Canada]] were they kept [[Katherine Pryde (Earth-616)|Kitty Pryde]], [[En Sabah Nur (Earth-616)|Apocalypse]], and [[Ashton Allen (Earth-616)|Senator Allen]] captive as they began Phase 3 of X-Man's plan. X-Man sent [[Arkady Rossovich (Earth-616)|Omega Red]] and [[Frederick Dukes (Earth-616)|Blob]] to an oil rig off the coast of [[Louisiana (State)|Louisiana]] in order to destroy it as it caused massive pollution to the natural environment of the planet but a team of X-Men led by [[Jean Grey (Earth-616)|Jean]] thwarted their plans by saving the men and the rig from exploding.{{r|Uncanny X-Men Vol 5 4}}\n\n[[Ororo Munroe (Earth-616)|Storm]] led another team against [[Max Eisenhardt (Earth-616)|Magneto]] and [[Warren Worthington III (Earth-616)|Angel]] who were invading [[Ukistoval]], [[Chernaya]] to cause an uprise of the citizens who lived there but these surgical strikes by the Horseman were only a diversion to distract the X-Men from Grey's master plan. Storm and the other's kept Magneto busy as [[Samuel Guthrie (Earth-616)|Cannonball]] grabbed Angel and flew him up to the outer most part of the atmosphere causing him to pass out from the thin air. He landed adjacent to [[Elizabeth Braddock (Earth-616)|Psylocke]] who used her psionic katana to pierce Warren psyche transforming him into his Archangel persona thus releasing him from X-Man's control.{{r|Uncanny X-Men Vol 5 5}}\n\nArchangel stooped into a beserker rage due to the force changed and unleashed his full wraith against Magneto leading to the former to retreat as he was outnumbered. Back in Canada, the Horsemen protected the newly assembled temple created by Grey from the combined forces of the two groups of X-Men. The Horseman stood by as Nate ventured out of the temple where he confronted his mother Jean in an ethical debate about the state of the planet. But it was a brief conversation as the X-Men made the first move causing a battle between them and Nate. After capturing most of them, the Xavier's students approached Grey but after a talk he transferred their consciousness into physic  constructs from Grey's home [[Earth-295|timeline]].{{r|Uncanny X-Men Vol 5 6}}\n\n[[File:Horsemen of Salvation (Earth-616) from Uncanny X-Men Vol 5 10 001.png|left|thumb|Storm becomes the Horseman of Life]]\nWhile X-Man dealt with the [[Age of Apocalypse]] world within his mind, the remaining Horsemen battled against the X-Men trying to keep their master safe within the mindscape, but the students where able to break free from the influence while X-Man had inhabited the mind and body of [[David Haller (Earth-616)|Legion]].{{r|Uncanny X-Men Vol 5 8}}\n\nAfter a failed attempt to create dupes from [[James Madrox (Bartender) (Earth-616)|Multiple Man]] who sent a dupe in his place due to his cowardice, X-Man amplified the abilities of his Horseman while also brainwashing Storm into becoming his new Horseman of Life. With Legion's powers at his disposal X-Man and his Horsemen gave the X-Men a major defeat. But as a last ditch attempt, Jean telepathically contacted every single person who has been among the ranks of the X-Men to participate in the battle against X-Man. During this time [[Hisako Ichiki (Earth-616)|Armor]] and some of the students were able to trap the Horsemen in a makeshift bubble preventing them from participating in the battle as all the X-Men arrived on the scene.{{r|Uncanny X-Men Vol 5 9}}\n\nJean joined her powers along with the other telepaths as they split Legion from X-Man leaving the former open for an all out physical attack. Magneto and the other Horseman were able to break free from Nate Grey's hold on them and joined in the final battle to stop him once and for all. But Nate gathered his remaining strength and used it to create an energy bomb that disintegrated everyone in the vicinity. But as the world believed them dead, they were actually transported to another [[Age of X-Man (Plane)|plane of existence]] created by Nate Grey.{{r|Uncanny X-Men Vol 5 10}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1327054"
}