{
    "pageid": 497642,
    "ns": 0,
    "title": "Hours (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Hours (Earth-616) from Marvel Mystery Comics Vol 1 55 0001.jpg\n| Name                    = The Hours\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = [[Peter Herrick (Earth-616)|Der Tag]]\n| CurrentMembers          = \n| FormerMembers           = I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = Nazi terrorist group\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jimmy Thompson\n| First                   = Marvel Mystery Comics Vol 1 55\n| Last                    = Marvel Mystery Comics Vol 1 55\n\n| HistoryText             = The Hours was a group of thirteen [[National Socialist German Workers Party (Earth-616)|Nazi]] agents who were active during [[World War II]]. They believed in \"Der Tag\" (German for \"The Day\"), the moment when the Nazis would rule the entire world and themed their group after the clock. Each member was code named for each hour on the clock. The thirteenth member, Peter Herrick, was the groups leader and was referred to as \"Der Tag\" himself.\n\nBy May 1944, Peter Herrick had infiltrated the municipality of New York City working as curator for the cities man large clocks. Using these clocks as their targets, they began wiring the various clocks in the city with bombs triggered by a remote device. Their plan was to detonate one clock every hour to spread terror for the purposes of demoralizing the American public. They began testing out their bombs on smaller clocks in the city. Their fourth and final test was to blow up the clock located at Grand Central Station. When the bomb went off, it happened to be at a time that the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]] had returned to the city. Investigating the blast with the police, the Torch found a rubber tube fused to the remains of the clock face. When the police suggested he seek out Peter Herrick, Herrick lied to the Torch, telling him that the hose was of no significance and must have been attached to the clock in the explosion.\n\nReturning to his cohorts, Herrick then prepared them for their next series of attacks. Taking over radio airwaves they broadcast their plans and warned the listening audience that their next target would be the Trysler Building. Hearing this, the Human Torch and Toro rushed to the scene to stop the bomb before the midnight deadline set by the Hours. Arriving at the scene, the Torch found another hose and removed it. Correctly deducing that only Herrick could have access to all the clocks, the Torch and Toro race to Herrick's secret hideout.\n\nThere they battled the Hours and preventing Der Tag from setting off the switch to blow up the Moolworth Building. During the fight, the Torch burned off Der Tag's mask revealing his true face and confirming his suspicions that he was Herrick the whole time. Herrick and his accomplices were turned over to the authorities.{{r|Marvel Mystery Comics Vol 1 55}}\n\nThe fate of the members of the Hours remains unrevealed.\n\n| Equipment               = All of the members of the Hours wore ghoulish masks to conceal their identities. They each wore a robe with their numeral indicated on the front. Der Tag had a bare clock face on the chest of his robe and wore gloves in the shape of clock hands. \n| Transportation          = \n| Weapons                 = At least one member of the Hours was armed with a pistol. They had access to explosives which they could rig with a remote timer to detonate them from afar.\n\n| Notes                   = \n| Trivia                  = Das Stunden is The Hours in German. Die Horen is the German name for The Hours in Greek Mythology.\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "497642"
}