{
    "pageid": 811565,
    "ns": 0,
    "title": "House of Agon (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Inhumans Vol 2 1 Textless.jpg\n| ImageSize               = 250px\n| Title                   = [[House of Agon]]\n| Name                    = House of Agon{{r|Official Handbook of the Marvel Universe #5}}\n| EditorialNames          = Inhuman Royal Family{{citation}}\n| Aliases                 = [[Inhumans]], Inhuman Royal Family,{{citation}} Inhumans' Royal Family,{{citation}} Royal Family of Attilan,{{r|Official Handbook of the Marvel Universe #5}} \nRoyal Family of the Inhuman Race,{{citation}} Royal Family of the Inhumans,{{r|Official Handbook of the Marvel Universe Vol 2 15|; [[Stenth (Race)|Stenth]]'s entry}} Royal House,{{r|Uncanny X-Men: First Class #1}} Royal Inhumans,{{r|All-New Inhumans #1}} Royal Inhuman Family,{{r|All-New Inhumans #9}} Royal Family,{{r|Inhumans Vol 3 1}} Family Royal,{{r|Inhumans Special #1}} Royal Court of Attilan,{{r|Uncanny X-Men: First Class #2}} Royal Court Unified Inhuman,{{r|FF #21}} First Family of the Inhumans,{{r|Avengers #376}} House Boltagon,{{r|FF Vol 2 14}} Bolt Family,{{r|Inhumans Special #1}} Ruling Family{{r|Marvel Two-In-One #72}} \n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New Attilan]]; formerly [[Attilan]]\n\n| Leaders                 = [[Blackagar Boltagon (Earth-616)|King Black Bolt]]; formerly [[Unspoken (Earth-616)|The Unspoken]] (King), [[Medusalith Amaquelin (Earth-616)|Queen Medusa]], [[Agon (Earth-616)|Agon]] (King)\n| CurrentMembers          = [[Medusalith Amaquelin (Earth-616)|Medusa]] (Queen);<br> [[Crystalia Amaquelin (Earth-616)|Crystal]], [[Gorgon Petragon (Earth-616)|Gorgon]], [[Ahura Boltagon (Earth-616)|Ahura]], [[Lockjaw (Earth-616)|Lockjaw]], [[Luna Maximoff (Earth-616)|Luna Maximoff]], [[Alecto Petragon (Earth-616)|Alecto]], [[Petras Petragon (Earth-616)|Petras]]\n| FormerMembers           = [[Agon (Earth-616)|Agon]], [[Aladi Ko Eke (Earth-616)|Aladi Ko Eke]], [[Ambur (Earth-616)|Ambur]], [[Avoe (Earth-616)|Avoe]], [[Azur (Earth-616)|Azur]], [[Karnak Mander-Azur (Earth-616)|Karnak]], [[Kobar (Earth-616)|Kobar]], [[Korath (Inhuman) (Earth-616)|Korath]], [[La (Earth-616)|La]], [[Leer (Earth-616)|Leer]], [[Magnar (Earth-616)|Magnar]], [[Mander (Earth-616)|Mander]], [[Maximus Boltagon (Earth-616)|Maximus]], [[Milena (Earth-616)|Milena]], [[Onomi Whitemane (Earth-616)|Onomi Whitemane]], [[Oola Udonta (Earth-616)|Oola Udonta]], [[Psynapse (Earth-616)|Psynapse]], [[Rynda (Earth-616)|Rynda]], [[Symak (Earth-616)|Symak]], [[Tanith (Earth-616)|Tanith]], [[Triton (Earth-616)|Triton]], [[Zeta (Earth-616)|Zeta]], [[Pietro Maximoff (Earth-616)|Quicksilver]]\n| Allies                  = [[Inhumans (Race)|Inhumans]], [[Fantastic Four (Earth-616)|Fantastic Four]], [[Avengers (Earth-616)|Avengers]], [[Mar-Vell (Earth-616)|Captain Marvel]], [[Beta Ray Bill (Earth-616)|Beta Ray Bill]]\n| Enemies                 = The [[Kadlec (Earth-616)|Seeker]], [[Draconus (Earth-616)|Dragon Man]], [[Victor von Doom (Earth-616)|Doctor Doom]], [[Kree]], [[Skrulls]], [[Blastaar (Earth-616)|Blastaar]], [[Arides (Earth-616)|Arides]], [[Timberius (Earth-616)|Timberius]], [[Vox (Super-Inhumans) (Earth-616)|Vox]]; formerly [[Maximus Boltagon (Earth-616)|Maximus]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four Vol 1 45\n| Last                    = \n\n| HistoryText             = \n===Preface===\nThe House of Agon is the name of a group of [[Inhumans (Inhomo supremis)|Inhumans]] who have a familial relation to the late [[Agon (Earth-616)|Agon]], former ruler of the Inhumans. The House of Agon is also referred to by the more generic title of Royal Family of the Inhumans, or the Inhuman Royal Family. Even though Agon is long dead,{{r|Avengers #95}} the royal family still refers to themselves as the House of Agon. \n\nThe Inhumans are an offshoot of humanity that was genetically altered by the [[Kree]] centuries ago.{{r|Thor #147}} The Inhumans kept themselves hidden from humanity in their city known as [[Attilan]] (also known as the Great Refuge) out of fear for centuries, developing a high technological society with a focus on genetics. With the discovery of the [[Terrigen Mist]], the Inhumans would expose themselves to it in order to gain fantastic abilities.{{r|Thor #146}} \n\n===Ancestry===\nTo best understand how the current House of Agon exists, it is best to trace back the family tree tracing all previous generations prior to the current generation. Most of the history of these later generation family members are mostly a mystery as mostly glints of the family history has since been revealed. It should also be kept in mind that Inhumans age much slower than normal humans, as such the lifespan of each generation is unknown. Likewise, it can be assumed that most of these prior generations are now deceased unless otherwise stated. \n\nThe current House of Agon can be traced back at least two generations, there were at least four different families that produced offspring who would comprise of the original house. These were [[Symak (Earth-616)|Symak]] and [[Tanith (Earth-616)|Tanith]] who begat Agon and his brother [[Korath (Inhuman) (Earth-616)|Korath]]; [[Magnar (Earth-616)|Magnar]] and [[Zeta (Earth-616)|Zeta]] who spawned [[Mander (Earth-616)|Mander]] and [[Rynda (Earth-616)|Rynda]]; [[Kobar (Earth-616)|Kobar]] and [[La (Earth-616)|La]] also produced [[Azur (Earth-616)|Azur]] and [[Ambur (Earth-616)|Ambur]]; and an as yet unidentified family possibly spawned two children, one of which was identified as [[Quelin (Earth-616)|Quelin]] the other is unknown, and if he exists if there is a direct connection to the Inhuman royal family is unknown.<ref>The family tree of the House of Agon was mostly constructed in {{cl|Official Handbook of the Marvel Universe #2}}, {{cl|Official Handbook of the Marvel Universe #3|3}}, {{cl|Official Handbook of the Marvel Universe #4|4}}. The family tree was mostly mapped out in {{cl|Official Handbook of the Marvel Universe #5}}, puzzled together by data in the entries for [[Blackagar Boltagon (Earth-616)|Black Bolt]], [[Crystalia Amaquelin (Earth-616)|Crystal]], [[Gorgon Petragon (Earth-616)|Gorgon]] and the [[Inhumans (Inhomo supremis)|Inhumans]]. The possibly of a relative to [[Quelin (Earth-616)|Quelin]] was stated by the rogue Inhuman known as [[Psynapse (Earth-616)|Psynapse]] in {{cl|X-Factor #67}}, although these claims have not been confirmed.</ref>\n\nAgon later took Rynda as his wife,<ref>As identified during their first appearance in {{cl|Thor #148}}</ref> Korath married a woman named [[Milena (Earth-616)|Milena]],<ref>Specified in {{cl|Official Handbook of the Marvel Universe #4}}, they were depicted together in {{cl|Inhumans Special #1}}</ref> Mander formed a union with Azur,<ref>Specified in {{cl|Official Handbook of the Marvel Universe #5}}, the couple have not appeared in any stories to date.</ref> and lastly Quelin married Ambur.<ref>Stated in {{cl|Official Handbook of the Marvel Universe #3}}, the couple have since been seen together in {{cl|Women of Marvel #1}}</ref>\n\n==First Generation==\n===Parentage===\nAs stated before, why the group took the name House of Agon and when they took this name is a mystery as not much is known about past generations. Likely it was due to the fact that Agon was an expert in genetics, the preoccupation of Inhuman society. Agon and Rynda were apparently the first who began producing offspring, about 100 years ago.<ref>As specified in {{cl|Official Handbook of the Marvel Universe A to Z Vol 1 5}}, the number of years is left vague per the [[Glossary:Sliding Timescale|Sliding Timesscale]] of [[Earth-616]] as parts of the history of the Inhumans are locked into specific dates and others are not.</ref> Their first child was named [[Blackagar Boltagon (Earth-616)|Blackagar Boltagon]], or simply Black Bolt. Agon decided that he would expose their son to the [[Terrigen Mist]] while he was still in the womb.<ref>This was first identified in {{cl|Official Handbook of the Marvel Universe #2}} but not depicted until {{cl|Secret Invasion: Inhumans #3}}</ref> Shortly after Black Bolt was born, they discovered he had incredible powers, that included complete control over the electrons around him as well as a destructive voice that he could not control.{{r|Thor #148}} Both Agon, as well as the Inhumans [[Genetics Council (Earth-616)|Genetics Council]] came to agree that Bolt needed to be confined until he had control over his powers.{{r|Thor #148}}{{r|Marvel Graphic Novel #39}}\n\nDeciding that the problem was that Black Bolt was exposed to the mists at too young an age, Agon began convincing his family members to have children and expose them to the mists while they were infants. Agon and Rynda had a second child, [[Maximus Boltagon (Earth-616)|Maximus]] who did not appear to develop mental powers after being exposed to the Terrigen Mist.{{r|Avengers #95}} Korath and Milena had a son named [[Gorgon Petragon (Earth-616)|Gorgon]] who was exposed to the mists as an infant. Gorgon developed cloven hooves that could cause massive tremors when stomped.{{r|Official Handbook of the Marvel Universe #4}} Mander and Azur has their first son [[Triton (Earth-616)|Triton]] and exposed him to the mists when he was an infant as well. However the mists turned Triton into a water breather who needed to remain in an isolated alcove off the coast of Attilan in order to survive.{{r|Official Handbook of the Marvel Universe #11}} It was because of this, when they had their second son [[Karnak Mander-Azur (Earth-616)|Karnak]] they did not expose him to the mists. Instead Karnak was sent to Tower of Wisdom where he was trained in various mental and physical disciplines that allowed him to see the flaws in any object.<ref>{{cl|Official Handbook of the Marvel Universe #6}}: There are various conflicting stories prior to this publication that state that [[Karnak Mander-Azur (Earth-616)|Karnak's]] ability to see flaws was derived from the [[Terrigen Mist]]. However, every [[Official Handbook of the Marvel Universe|Official Marvel Handbook]] that features an entry on Karnak reiterates that he was not exposed to the mists.</ref> Quelin and Ambur had two children themselves, [[Medusalith Amaquelin (Earth-616)|Medusa]] and a few years later [[Crystalia Amaquelin (Earth-616)|Crystal]], both were exposed to the Terrigen Mists at infancy and developed malleable hair {{r|Official Handbook of the Marvel Universe #7}} and elemental powers respectively {{r|Official Handbook of the Marvel Universe #3}}. At some point the House of Agon exposed the dog known as [[Lockjaw (Earth-616)|Lockjaw]] to the Terrigen Mists, the canine developing the power to teleport. Lockjaw was the loyal pet to Crystal, but also obeyed most of the royal family as well.<ref>{{cl|Official Handbook of the Marvel Universe #6}}: {{cl|Thing #3}} states that [[Lockjaw (Earth-616)|Lockjaw]] was a [[Inhumans (Inhomo supremis)|Inhuman]] exposed to the [[Terrigen Mist]] and mutated into a dog-like creature, but it was later revealed in {{cl|X-Factor #71}} that this \"revelation\" was part of an elaborate hoax.</ref>\n\nDuring this period the parents of the House of Agon saw that their children were educated in the ways of the Inhumans and tried to keep them out of trouble. Particularly Maximus, who was a trouble maker.{{r|Women of Marvel #1}} Meanwhile, Medusa was betrothed to marry Black Bolt, when she reached adolescence she made time with his brother Maximus.{{r|Marvel Graphic Novel #39}} During this period the primary rivals to the House of Agon was the [[House of Phaeder (Earth-616)|House of Phaeder]]. When it was discovered that [[Phaeder (Earth-616)|Phaeder]] was conducting scientific experiments that were against Inhuman law, Agon mercilessly persecuted him. Phaeder was eventually found guilty of his crimes, but faked his death in order to leave Attilan and continue his experiments in secret.{{r|Marvel Two-In-One #72}}\n\n===Taking Power===\nBlack Bolt remained in isolation until he reached the age of 19 and mastered the ability to remain silent. It was then he was physically introduced to his extended family. Jealous of his brother from the start, Maximus used a device to try and force Black Bolt to speak, hoping that the destructive power of his voice would eliminate any chance of Blackagar succeeding as ruler of the Inhumans. However Bolt's cousins came to his aid, stopping Maximus before he could succeed.{{r|Thor #149}} Young and headstrong, when the young Inhuman royals learned that their cousin and [[Unspoken (Earth-616)|ruler]] had hidden the Slave Engine, the Inhumans most powerful weapon, in order to usher in an age of peace, they boldly confronted him. This led to a battle between the king and Black Bolt. Because he was weakened from hiding the engine the king was easily defeated in combat by Black Bolt. Medusa then witnessed as Black Bolt to the Himalayan Mountains. Black Bolt disposed the king by uttering his name, devastating him in a powerful sonic blast and leaving him for dead. This shameful chapter in Inhuman history was then covered up, with Black Bolt's father apparently taking up leadership of the Inhumans. The former ruler referred to only as the \"Unspoken\". However this event would have far reaching consequences many years in the future. Apparently it was at this point that Agon took over as ruler of the Inhumans.<ref>{{cl|Mighty Avengers #27}}: Prior to this story it has always been implied that [[Agon (Earth-616)|Agon]] was leader of the [[Inhumans (Inhomo supremis)|Inhumans]] prior to [[Blackagar Boltagon (Earth-616)|Black Bolt]] took over as ruler of the Inhumans. All references that take place prior to the disappearance of the [[Unspoken (Earth-616)|Unspoken]] that identify Agon as leader of the Inhumans should be considered part of the cover-up. It can then be assumed that while Agon was not leader during those times, his position as a Geneticist, and his close familial relation to the ruler gave him a position of authority.</ref>\n\nAs they grew older, Black Bolt and his brother Maximus shared a brotherly bond that slowly got soured with age, particularly with the awakening of Maximus' mental powers, giving him rudimentary mind control abilities. Later, Bolt discovered his brother attempting to ally himself with the Kree in order to take control of the Inhuman throne. Confronting his brother, Black Bolt was forced to unleash his destructive voice to stop the Kree ship from escaping. This was a two fold tragedy, as the sound of Black Bolt's voice drove Maximus mad, and the crashing Kree ship slew their parents. Suddenly, Black Bolt found himself in line for the Inhuman throne, and ruled over the Inhumans for years.{{r|Avengers #95}} The fates of most of the remaining elders of the Inhuman Royal Family is unknown, as only Korath and Milena have been seen since.{{r|Inhumans Special #1}}\n\n==Second Generation==\n===Exile===\nAttilan remained isolated in the North Atlantic well into the 20th Century until the 1950s when Triton had a run in with a film crew and after experiencing New York discovered the prejudices of the outside world.{{r|Thor #150|152}} With Inhuman society being somewhat xenophobic, Black Bolt feared what discovery might bring and began seeking out a new home for his people. Along the way he encountered the [[Eternals (Homo immortalis)|Eternals]], another secret offshoot of humanity. Their leader [[Zuras (Earth-616)|Zuras]] assisted Black Bolt in locating a new home for Attilan in a remote part of the Himalayan Mountains.{{r|What If? #29}} Black Bolt, with the aid of his best scientists moved Attilan from the North Atlantic to this mountain range. Their travels were hidden with some assistance from the Eternals. Upon safely relocating their home, Black Bolt was celebrated by his people.{{r|What If? #30}} But this period of happiness would quickly come to an end a few years prior to the beginning of what is referred to as the Modern Age of Heroes.\n\nDue to his crimes against society, Maximus was locked away for years but he eventually used his mental powers to coerce three of the [[Alpha Primitives]] slave class. He compelled them to expose themselves to the Terrigen Mists transforming them into an entity known as the [[Trikon (Earth-616)|Trikon]]. The Trikon then compelled the Alpha Primitives to revolt against their suppressors. During the ensuing uprising, Medusa attempted to confront the Trikon on a sky sled, but it blasted her ship causing her to crash somewhere outside of the Great Refuge. The crash had stricken Medusa with amnesia and she wandered away from the ensuing battle which was eventually ended, but with Maximus taking control of the Inhuman throne and exiling his cousins. Black Bolt and his family were forced out of Attilan and spent the ensuing years searching for sign that Medusa might be alive. Gorgon later returned to Maximus to plea for the freedom of those he held hostage. He learned that his father was slain by the [[Kadlec (Earth-616)|Seeker]], an Inhuman loyal to Maximus, when he attempted to break free. In order to ensure the safety of his mother, Gorgon agreed to reign in the House of Agon, particularly Medusa whom Maximus secretly intended to marry.{{r|Inhumans Special #1}}\n\n===Reunion===\nTheir search eventually brought the Inhumans to New York City, where they established a temporary home below a Brooklyn tenement slated for demolition. While out exploring one night Crystal happened to cross paths with the [[Jonathan Storm (Earth-616)|Human Torch]], member of the heroic [[Fantastic Four (Earth-616)|Fantastic Four]]. The pair were smitten by each other from the first, and after a quick chase, Crystal mistook Johnny Storm for an Inhuman due to his flame powers. When Gorgon successfully returned with Medusa, she recognized him as her former foe and a battle broke out. During the conflict, Johnny was able to summon his comrades in the Fantastic Four, while the Inhumans summoned their leader Black Bolt.<ref>{{cl|Fantastic Four #45}}: For a time [[Medusalith Amaquelin (Earth-616)|Medusa]] was stricken with amnesia and coerced into joining the [[Frightful Four (Earth-616)|Frightful Four]], clashing with the [[Fantastic Four (Earth-616)|Fantastic Four]] many times, starting in {{cl|Fantastic Four #36}}</ref> During the battle the Inhumans deduced that the Seeker was after them when Triton went missing during the ensuing battle. Using Lockjaw they fled the scene by teleporting back to the Great Refuge.{{r|Fantastic Four #46}} \n\nWhen faced with his insane brother once again, Black Bolt fought through an army of Alpha Primitives and reclaimed the Inhuman crown from Maximus. The Fantastic Four soon discovered and arrived at the Great Refuge and confronted Medusa and the others, [[Reed Richards (Earth-616)|Mister Fantastic]] pleading them to reveal themselves to humanity outside. However Maximus was not totally defeated as he intended to use his Atmo-Gun to wipe out the human race so the Inhumans could take over the entire world.{{r|Fantastic Four #47}} Before Maximus could activate the Atmo-Gun, Black Bolt destroyed the device, saving the lives of every human on Earth. In one last ditch effort, Maximus scored a Pyrrhic victory by activating a device that surrounded Attilan with a \"Negative Zone\" barrier, forcing the Fantastic Four out while trapping the Inhumans within.<ref>{{cl|Fantastic Four #48}} : The Negative Zone barrier should not be confused with the similarly named antimater universe of the [[Negative Zone|same name]].</ref> Black Bolt and Gorgon then went after Maximus and the Seeker. During the ensuing clash, Maximus briefly took control of Black Bolt's mind with his mental powers. However, when the Seeker tried to shoot Gorgon, he grabbed his cousin and used Black Bolt's tuning fork to deflect the blast. The energies of the Seeker's weapon were redirected into the mind of Maximus driving him even more insane than ever before, and stripping him of his mental powers. Gorgon then slew the Seeker. With the battle over, Black Bolt began focusing on how to free his people from captivity.{{r|Inhumans Special #1}}\n\n===Freedom===\nFinding themselves trapped behind the Negative Zone barrier, Black Bolt began to puzzle out a means to break through the barrier.{{r|Fantastic Four #50}} He got the royal family hard at work to find a solution, but when Karnak tried to find a weakness in the barrier, but failed to produce results.{{r|Fantastic Four #52}} The royal family then try to coax Maximus into revealing a means for them to escape, but they found that he was more insane than ever and was only interested in making toys than helping solve their dilemma. With no other options available, Black Bolt attempted to use his control of electrons trigger an Absorba-Bomb to destroy the barrier.{{r|Fantastic Four #54}} This attempt also failed, and realizing that the Absorba-Bomb could destroy them all Black Bolt injured himself attempting to stop it.{{r|Fantastic Four #56}} As soon as Black Bolt began to recover, Maximus revealed the only means in which the barrier could be destroyed, also revealing to the others the secret of why Black Bolt never spoke. Medusa tried to stop Maximus from speaking, but it was too late and the secret was out: the only way to destroy the Negative Zone barrier was in the destructive power of Black Bolt's voice. Something that could possible destroy them all in the process.{{r|Fantastic Four #57}} With no other choice left to them, royal family and the rest of the Inhumans sought shelter below the city while Black Bolt unleashed the awesome power of his voice. Although Black Bolt succeeded in destroying the barrier, Attilan was decimated in the process. In the aftermath of the battle the Ruling Council of the Inhumans decreed that Black Bolt and the rest of the Royal Family leave the Great Refuge until the city could be rebuilt to its former splendor.{{r|Fantastic Four #59}}\n\nThey made a brief stop in Europe before a group of prejudiced villagers mistook them for witches and attacked, forcing them to defend themselves and leave.{{r|Fantastic Four #60}} They soon found a new refuge before Black Bolt allowed Crystal to venture on her own to find the Human Torch, whom she had fallen in love with.{{r|Fantastic Four #61}} Their island hide away was soon invaded by soldiers of an unspecified country who sought to secretly deploy an \"Atomic Curtain\" on the island in direct contravention of [[North Atlantic Treaty Organization (Earth-616)|NATO]] agreements. The royal family attacked the invaders, destroyed their weapon and sent them fleeing into the ocean.{{r|Fantastic Four #62}} Bolt and the others soon had to deal with two invaders, the first being the costumed hero known as the [[T'Challa (Earth-616)|Black Panther]] who legally purchased the Inhumans temporary island home. He battled it out with the Inhumans until they realized they had mutual allies in the Fantastic Four. When Black Bolt alerted them that the island was also being invaded by the [[Microverse]] tyrant known as the [[Psycho-Man (Earth-616)|Psycho-Man]], Medusa and the others worked together to invade the invader's secret hideout. They were soon joined by the Human Torch and the Thing. The gathered heroes soon fended off against the Psycho-Man's minions [[Rance Preston (Earth-616)|Live Wire]], [[Ivan (Earth-616)|Ivan]] and [[Gary Buser (Earth-616)|Shell-Shock]]. While they were also held back by the Psycho-Man's [[Control-Box|Emoto-Casting Control-Box]], Gorgon arrived and destroyed the device. However before the Inhumans and their allies could apprehend the Psycho-Man he fled back to his native Microverse.{{r|Fantastic Four Annual #5}}\n\nWhen the villain known as [[Samuel Smithers (Earth-616)|Plantman]] encroached their island in his sub, Black Bolt sent Triton to investigate. Later when Triton was captured along with the [[Namor McKenzie (Earth-616)|Sub-Mariner]], the others attempted to rescue them. Despite their efforts, the Plantman managed to escape in the ocean.{{r|Sub-Mariner #2}} However, Triton and the Sub-Mariner managed to free themselves and stop the Plantman's schemes.{{r|Sub-Mariner #3}}\n\n===Return to Attilan===\nWith Attilan completely rebuilt, Black Bolt, Gorgon and Lockjaw were the first of the royal family to return to their fabled city. Upon his arrival he was asked to try six Inhumans, [[Falcona (Earth-616)|Falcona]], [[Leonus (Earth-616)|Leonus]], [[Aireo (Earth-616)|Aireo]], [[Timberius (Earth-616)|Timberius]], [[Stallior (Earth-616)|Stallior]] and [[Nebulo (Earth-616)|Nebulo]], who committed acts of treason in his absence. Black Bolt found them guilty and had Lockjaw exile them to the [[Un-Place]], a dimensional prison. However the rogue Inhumans were soon freed thanks to the machinations of Maximus who manipulated events that the gamma spawned monster known as the [[Bruce Banner (Earth-616)|Hulk]] got trapped in Un-Place as well and assisted in breaking the rogue Inhumans free. Maximus and his minions then manipulated the Hulk into breaking through a barrier that protected a powerful weapon created by the Inhuman known as [[Ramnor (Earth-616)|Ramnor]]. With this weapon, Maximus threatened Attilan, demanding that he be reinstalled as king of the Inhumans. While the Hulk went on a rampage, defeating the minions of Maximus, Black Bolt dealt with his mad brother, disarming him of Ramnor's weapon. With the Hulk still causing damage to the city, Black Bolt then battled the neigh invincible brute. Not only was Black Bolt able to spar with the Hulk one-on-one, he was able to drive the creature from his domain, restoring peace to the kingdom once again.{{r|Incredible Hulk Special #1}}\n\nDespite this defeat, Maximus managed to retake the throne of Attilan, using hypnosis to defeat the rest of the royal family and take them prisoner. By this point, Medusa's sister Crystal was asked to join the Fantastic Four to take the place of the [[Susan Storm (Earth-616)|Invisible Girl]] who had just discovered that she was pregnant. The group learned of the fate of Black Bolt and his family before being captured themselves. With no opposition, Maximus began preparing to unleash his massive Hypno-Gun to enslave the entire world.<ref>{{cl|Fantastic Four #82}} : the [[Susan Storm (Earth-616)|Invisible Girl]] discovered that she was pregnant in {{cl|Fantastic Four Annual #5}}, the [[Fantastic Four (Earth-616)|Fantastic Four]] asked [[Crystalia Amaquelin (Earth-616)|Crystal]] to join their ranks in {{cl|Fantastic Four #81}}.</ref> Ultimately, the royal family freed themselves and the Fantastic Four broke out of their prison. The two groups then stormed the Hypno-Gun, destroying the device before Maximus could employ it. In the ensuing battle Maximus, and his loyal renegades managed to escape in a ship.{{r|Fantastic Four #83}}  Not long after being restored to the throne, the royal family defended their kingdom from the [[Norrin Radd (Earth-616)|Silver Surfer]] who was tricked into attacking the Great Refuge by Maximus. The Surfer was ultimately driven from the region.{{r|Silver Surfer #18}} Apparently by this point the Inhumans had developed a working relationship with the spy agency known as [[Supreme Headquarters International Espionage Law-Enforcement Division (Earth-616)|SHIELD]]. Following their battle with the Silver Surfer, Medusa, Gorgon and Black Bolt paid a visit to the SHIELD hellicarrier to report their battle with the Silver Surfer to SHIELD director [[Nicholas Fury (Earth-616)|Nick Fury]].{{r|Webspinners: Tales of Spider-Man #4}} Black Bolt was later injured during a radiation experiment. Only the combined powers of both Crystal and Gorgon could heal him of his injuries.{{r|Fantastic Four #99}} He sent Medusa to collect Crystal, who was forced to return home over protests from her boyfriend the Fantastic Four's [[Jonathan Storm (Earth-616)|Human Torch]].{{r|Fantastic Four #95}} Eventually Crystal's unexplained absence caused the Human Torch to come seek her out in Attilan. After an ensuing battle that was broken up by both the Inhuman royal family and the Fantastic Four the truth was revealed. With Black Bolt now cured, Crystal was allowed to leave and was reunited with the Torch.{{r|Fantastic Four #99}} \n\nNot long after this, the Fantastic Four's long time foe [[Victor von Doom (Earth-616)|Doctor Doom]] was amassing a cache of powerful weapons.{{r|Fantastic Four: World's Greatest Comics Magazine #1}} To this end he also stole the [[Helix of Randac]] from the [[Citadel of Science]] in Attilan.{{r|Fantastic Four: World's Greatest Comics Magazine #5}} When this was discovered the royal family sent Lockjaw to collect Crystal from the Fantastic Four.{{r|Fantastic Four: World's Greatest Comics Magazine #3}} Upon Crystal's arrival, Black Bolt had Medusa and the others informed her of the theft.{{r|Fantastic Four: World's Greatest Comics Magazine #5}} The House later rescued the Fantastic Four and the Black Panther from space following a failed attempt to stop Doctor Doom from stealing the [[Ultimate Machine]] on the [[Luna (Moon)|moon]]. They later reconnoitered on the SHIELD helicarrier to plan their next move along with Nick Fury and the Silver Surfer. It was not long until Doom used the [[Horn of Proteus]] to summon the sea creatures, including [[Giganto (Atlantean Beast)|Giganto]], upon New York City.{{r|Fantastic Four: World's Greatest Comics Magazine #7}} Medusa and Black Bolt then returned to Attilan where they provided the Human Torch and Crystal with an [[Agon-Sequencer]] to assist them in trying to locate the Helix of Randac.{{r|Fantastic Four: World's Greatest Comics Magazine #8}} When Doom returned to Earth after stealing the power of the world devourer known as [[Galan (Earth-616)|Galactus]], the Inhumans stood by while the Fantastic Four dealt with the crisis.{{r|Fantastic Four: World's Greatest Comics Magazine #11}} However they soon joined in the final battle against Doom in New York City. Black Bolt and his family joined in a frontal assault on Doom and were subsequently slain. However, Doom was ultimately defeated when Mister Fantastic obtained the [[Cosmic Cube]] and restored everything to normal, undoing all the carnage Doom had caused and restored Black Bolt and the others to life.{{r|Fantastic Four: World's Greatest Comics Magazine #12}} Back home, Black Bolt and the royal family joined the Eternal known as [[Pixie (Eternal) (Earth-616)|Pixie]] to reign in the rogue Inhuman known as the [[Yeti (Inhuman) (Earth-616)|Yeti]] who was in a battle with the mutant heroes known as the [[X-Men (Earth-616)|X-Men]]. In the aftermath, they revealed to the X-Men the fate of the Cold War era heroes known as the [[First Line (Earth-616)|First Line]].<ref>{{cl|X-Men: The Hidden Years #16}} : The majority of the [[First Line (Earth-616)|First Line]] sacrificed their lives stopping a [[Skrulls|Skrull]] invasion of Earth prior to the Modern Age as depicted in {{cl|Marvel: The Lost Generation #12}}</ref>\n\nAfter preventing Chinese soldiers from discovering the location of Attilan, Black Bolt and the others were shocked when their home was bombarded by various missiles. They were surprised when they found evidence that the missile attacks were apparently being launched by the Fantastic Four, unaware that it was really the work of Maximus.{{r|Amazing Adventures Vol 2 1}} Black Bolt then brought Medusa, Karnak and Gorgon to the [[Baxter Building]] to battle the Fantastic Four, while Triton went to investigate the possible involvement with Maximus. Although the Inhumans battled it out with the Fantastic Four, they stopped when Triton found proof that Maximus was responsible for the attacks and captured him.{{r|Amazing Adventures Vol 2 2}} Later, the international terrorist known as the [[Mandarin (Earth-616)|Mandarin]] launched an attack on the Inhumans in order to uncover the powerful [[Eye of Yin]] which was buried somewhere near Attilan. Black Bolt and the others battled what they thought was the Mandarin to the death, unaware that it was a robot meant to trick them into finding the Eye for the real Mandarin.{{r|Amazing Adventures Vol 2 3}} When they uncovered the Eye, the Mandarin used his [[Mandarin's Rings|rings]] to draw it to him. Medusa, Triton, and Karnak followed after it and were summarily captured. They were rescued by Black Bolt and Gorgon who knocked the Mandarin out. They then took him away, burying his rings within his hideout.{{r|Amazing Adventures Vol 2 4}}\n\n===Search for Black Bolt===\nLater Black Bolt showed Medusa and the others that he had Maximus kept in stasis in a near death state before leaving to try and find the ideal place to reveal the Inhumans to the world. Gorgon and Karnak had issue with Black Bolt's treatment of his brother as they believed that it could violate his oath that Black Bolt would never kill another Inhuman. When they pressed these concerns to Medusa, she advised them to trust their leader. However the pair freed Maximus, learning too late that Black Bolt's insane brother had gained new mental powers. Upon his freedom, he then used his powers to strike Black Bolt with amnesia while he explored the streets of San Francisco.{{r|Amazing Adventures Vol 2 5}} Maximus then used his powers to force Gorgon and Karnak to fight each other, but his powers were limited against those of the royal family. As such when Medusa came to her cousin's aid, he had to divert his power to her. Ultimately, Maximus gained the upper hand when he enthralled the entire Inhuman population and forced Medusa, Karnak, Gorgon, and Triton into exile once more, sending them fleeing to an island off the coast of China.{{r|Amazing Adventures Vol 2 6}}\n\nAfter fighting off more Chinese soldiers, the exiled Inhumans recovered a hidden craft and tracked Black Bolt to San Francisco. There they were shocked to find that Bolt had apparently been manipulated into working with activist [[Lionel Dibbs (Earth-616)|Lionel Dibbs]] who was threatening to destroy a local ghetto after the municipal government refused to help clean the area up.{{r|Amazing Adventures Vol 2 7}} Meanwhile, they sent Triton to gather the Fantastic Four to assist them.{{r|Avengers #95}} Medusa and the others attempted to get involved by they were held back by the Asgardian thunder god [[Thor Odinson (Earth-616)|Thor]] who had prior dealings with Dibbs in his civilian identity of Doctor [[Donald Blake (Earth-616)|Donald Blake]]. However during the altercation, \"Black Bolt\" was fatally killed by a bolt of lightning, and the Inhumans discovered that he was an [[Roscoe (Criminal) (Earth-616)|impostor]].<ref>{{cl|Amazing Adventures Vol 2 8}} : the man posing as [[Blackagar Boltagon (Earth-616)|Black Bolt]] here was a San Francisco native named [[Roscoe (Criminal) (Earth-616)|Roscoe]] who Black Bolt encountered trying to break into a warehouse back in {{cl|Amazing Adventures Vol 2 5}} when [[Maximus Boltagon (Earth-616)|Maximus]] struck him with amnesia. At that time, Black Bolt knocked out Roscoe and his goons and switched clothing with one of the burglars before befriending Roscoe's nephew [[Joey (Orphan) (Earth-616)|Joey]]. Roscoe recovered Black Bolt's costume before he was picked up by [[Lionel Dibbs (Earth-616)|Lionel Dibbs]] who wished to use it for his own ends in {{cl|Amazing Adventures Vol 2 7}}</ref> \n\nMedusa and their others continued their search for Black Bolt, and upon their quest witnessed the return of the Trikon. Soon they were attacked by an army of mutants and learned that Black Bolt was subsequently captured and imprisoned by their leader, the mutant terrorist known as [[Max Eisenhardt (Earth-616)|Magneto]]. Magneto mistook Black Bolt for a mutant and sought to manipulate his powers. Medusa and the others were able to track Magneto back to his hideout where the were quickly incapacitated. However their reunion with Black Bolt caused their leader's memories to return.<ref>{{cl|Amazing Adventures Vol 2 9}} : It should be noted here that the [[Trikon (Earth-616)|Trikon]] plot line was abandoned in the following issue {{cl|Amazing Adventures Vol 2 10}}</ref> With Black Bolt appearing to be in his thrall, Magneto forced the Inhuman leader to steal a power source for his new invention, the Universal Machine. While they were gone on this mission, Medusa and the others broke free and battled Magneto's minions. When Magneto and Black Bolt returned, Bolt revealed that he was pretending to be under Magneto's control. In the ensuing battle the energy source became unstable and Magneto was seemingly slain when it exploded.{{r|Amazing Adventures Vol 2 10}}\n\n===Kree-Skrull War===\nAt this point the Earth was caught in the middle of the millennia long [[Kree-Skrull War]].{{r|Avengers #95}} Apparently after his encounter with Magneto, Black Bolt managed to track down the Trikon and free Joey from its possession, although the details of this are unrevealed.<ref>As specified above, the plot line involving [[Joey (San Francsico) (Earth-616)|Joey]] and the [[Trikon (Earth-616)|Trikon]] were dropped in {{cl|Amazing Adventures Vol 2 10}}.</ref> While they were searching for Black Bolt in San Francisco, the Inhumans had sent Triton to New York to try and obtain the assistance of the Fantastic Four. By fate, Triton instead encountered the Avengers, who were dealing with the backlash caused by a [[Skrulls|Skrull]] posing as politician [[H. Warren Craddock (Skrull) (Earth-616)|H. Warren Craddock]]. Regardless of the fact that the Avengers were dealing with the escalating Kree-Skrull War, they agreed to split their forces to assist Triton in finding his leader. [[Steven Rogers (Earth-616)|Captain America]], [[Clinton Barton (Earth-616)|Goliath]] and [[Richard Jones (Earth-616)|Rick Jones]] then accompanied Triton back to San Francisco, where they assisted Black Bolt in rescuing Joey from a thug. Flying to Attilan, they found that Maximus had erected a massive barrier around the city again. They were also joined by Thor, the [[Vision (Earth-616)|Vision]] and [[Anthony Stark (Earth-616)|Iron Man]]. \n\nBlack Bolt took down the barrier with his voice and when his people took arms against him was, for the first time, able to address them with his voice. Somehow not destroying all in his path, Black Bolt ordered his people to take up arms against Maximus. With an army of his people, Black Bolt and the Avengers stormed Attilan. They then discovered that Maximus was once again working with the Kree. Bolt and the Avengers sent the Kree fleeing from Earth once again, causing Maximus to lose his mind once again. With his brothers defeat, Black Bolt regained the Inhuman throne, but was less than happy about the fate of his brother.{{r|Avengers #95}} The Avengers soon parted company and eventually played a part of halting the Kree-Skrull War for the time being.{{r|Avengers #97}} Unknown to the Inhuman royal family, in the aftermath of the Kree-Skrull War, Iron Man gathered Fantastic Four leader Mister Fantastic, Sorcerer Supreme [[Stephen Strange (Earth-616)|Doctor Strange]], Atlantean ruler the Sub-Mariner, X-Men founder [[Charles Xavier (Earth-616)|Professor X]], and Black Bolt together to discuss the outcome of the war. In order to deal with threats of this magnitude in the future they formed [[Illuminati (Earth-616)|Illuminati]], but kept their existence kept secret for years.{{r|New Avengers: Illuminati #1}} The Illuminati's first order of business was pay a visit to the Skrull homeworld where they issued a warning to [[Dorrek VII (Earth-616)|Emperor Dorrek]] to stay away from Earth. When Dorrek refused, Black Bolt destroyed his ship, but when the Illuminati attempted to flee Skrullian space, they were shot down and taken prisoner. Black Bolt and the others were then experimented on for days, but ultimately Iron Man managed to break them free. They then recovered a ship and succeeded in escaping the Skrulls and return to Earth. Black Bolt and the others were unaware that the Skrulls succeeded in learning the secrets to their super-human abilities, knowledge that would have far reaching consequences many years later.{{r|New Avengers: Illuminati Vol 2 1}}\n\n==The House Expands==\n===Project Revival===\nIt was about this time that Crystal's long association with the Fantastic Four was quickly coming to an end as the pollutants from the outside world threatened to have a fatal effect on her, forcing her to eventually return home.{{r|Fantastic Four #105}} With an unexpected detour through Australia, Crystal saved the life of the \"mutant\" known as [[Pietro Maximoff (Earth-616)|Quicksilver]] who was seriously injured battling the [[Sentinels]]. Taking Quicksilver back to Attilan, the two fell in love while Crystal was nursing him back to health.<ref>{{cl|Fantastic Four #131}}: [[Pietro Maximoff (Earth-616)|Quicksilver]] was injured by the [[Sentinels]] in {{cl|Avengers #104}}. He is referred to as a [[Homo sapiens superior|mutant]] in quotation marks here because at the time everyone -- including Quicksilver himself -- was led to believe that he was a mutant. However as revealed in {{cl|Uncanny Avengers Vol 2 4}}, Quicksilver is not actually a mutant. He was given his powers due to genetic experimentation done on him by the [[Herbert Wyndham (Earth-616)|High Evolutionary]]. The Evolutionary altered Quicksilver in such a way that he registered as a mutant in order to cover up his genetic manipulations.</ref> When the Human Torch eventually came to Attilan to be reunited with Crystal, the Inhuman royal family tried to stop him in order to explain to Johnny Storm what was going on with Crystal during he absence. This led to an altercation between the Torch and the Inhumans.{{r|Fantastic Four #130}} As expected, this led to the Torch and Quicksilver trading blows. However the fighting quickly ended when Maximus launched his latest scheme, resulting in Crystal being kidnapped by the Alpha Primitives and taken deep below Attilan. When Pietro and Johnny went after her they found her in the clutches of [[Omega (Android) (Earth-616)|Omega]], an android created by Maximus.{{r|Fantastic Four #131}} Black Bolt led his people against the Alpha Primitive uprising, but Omega proved almost unstoppable. The rest of the Fantastic Four soon arrived to lend a hand and Crystal was eventually freed from the creature. Soon Crystal realized what was powering Omega and making him neigh indestructible: The Inhumans collective guilt over the willful enslavement of the Alpha Primitives. Once Crystal got the Inhumans to all collectively recognize their guilt, Omega fell inert and the Alpha Primitives ended their uprising. In the aftermath of the battle, Crystal and Johnny realized that what they had between each other was over and parted as friends. Black Bolt then decreed that Medusa, having developed an immunity to the outside pollutants, was to venture out and act as an emissary of the Inhumans in the outside world. Medusa to this end, joined the Fantastic Four, taking the place of the Invisible Girl who had recently left the team.{{r|Fantastic Four #132}}\n\nNot long after this, the Avengers were captured during a conflict between the villainous time travelers known as [[Artur Zarrko (Earth-6297)|Zarrko the Tomorrow Man]] and [[Nathaniel Richards (Kang) (Earth-6311)|Kang the Conqueror]]. Iron Man enlisted the aid of [[Peter Parker (Earth-616)|Spider-Man]] to assist in stopping them in Zarrko's future of the [[Earth-6297|23rd Century]], but both were incapacitated.{{r|Marvel Team-Up #9}} Spider-Man managed to escape back to his own time, and prevent the unleashing of various \"Time Bombs\" that regressed time backwards to make the modern age more easily conquered. With the aid of the Human Torch, Spider-Man stopped all the bombs. Needing to get back to the future to save the Avengers and stop his foes, the Torch suggested to Spider-Man that he enlist the aid of the Inhumans to help him.{{r|Marvel Team-Up #10}} Travelling to the Hidden Land, Spider-Man pleaded his case to Black Bolt who agreed to help. They used Maximus to reconfigure on of the Time Bombs to send Spider-Man, Black Bolt, Karnak, Gorgon and Triton to the 23rd Century. They arrived just moments before Spider-Man originally fled back to his own time to stop the time bombs. They then got the drop on Zarrko and Kang. While they managed to stop Zarrko, Kang escaped them when their plan began to fail. Spider-Man and the Inhumans then freed the Avengers and returned to their own time.{{r|Marvel Team-Up #11}}{{r|Fantastic Four Annual #25}} Later, when the [[Dark Dimension]] ruler [[Dormammu (Earth-616)|Dormammu]] attempted to invade the Earth, the royal family defended Attilan from Dormammu's demons until his threat was ended by the Avengers and the [[Defenders (Earth-616)|Defenders]].{{r|Avengers #118}} Black Bolt later called Medusa back home for an update on Project Revival, a plan to reunite Mister Fantastic with his estranged wife the Invisible Girl.{{r|Fantastic Four #145}}With the assistance of the Sub-Mariner, the Inhumans managed to make Mister Fantastic and the Invisible Girl realize that they belonged together and reconcile their relationship.{{r|Fantastic Four #149}}\n\n===Medusa's Return===\nThe Inhumans soon discovered the existence of [[Counter-Earth (High Evolutionary)|Counter-Earth]], a perfect duplicate of Earth that was on an opposite rotation of the sun. Seeking to explore this world as a potential new home for the Inhumans, the royal family had to deal with the sudden arrival of the Hulk in their kingdom. However after Black Bolt swatted the Hulk away from a crash landing in the center of Attilan, the brute reverted back to his human form of Bruce Banner. Bolt and the others then tried to make Banner at home, but he eventually transformed into the Hulk again when being harassed by some locals. In the ensuing battle, the Hulk was forced aboard the ship meant to explore Counter-Earth and it was launched into space, ending the Hulks threat for a time.{{r|Incredible Hulk #175}}\n\n[[File:Crystalia_Amaquelin_(Earth-616)_married_to_Quicksilver_from_Fantastic_Four_Vol_1_150.jpg|thumb|Crystal's wedding to Quicksilver]]\nCrystal's wedding day quickly approached, Black Bolt invited members of the Avengers and the Fantastic Four to witness the wedding. Unknown to them at the time Maximus had revived the robot known as [[Ultron (Earth-616)|Ultron]] to strike back at his enemies. Instead, Ultron betrayed Maximus to get revenge on his own. Taking control of the Omega android, Ultron then attacked the gathered heroes.{{r|Avengers #127}} Ultron attempted to defeat his foes by utilizing the mental beam to incapacitate them. This proved to be Ultron's ultimate failing, as it awoke the comatose Franklin Richards who used his powers to seemingly destroy Ultron. With the threat over, Crystal and Pietro were married by Black Bolt before all their friends without further incident.{{r|Fantastic Four #150}}\n\nAttilan was later taken over by the Human Torch's old foe [[Zemu (Earth-6212)|Xemu]] ruler of the [[Earth-6212|Fifth Dimension]]. Xemu had constructed a massive weapon called the Thunder Horn which he intended to use to conquer the Earth by magnifying Black Bolt's destructive vocal chords. When Black Bolt refused to comply, Xemu forced Quicksilver to recover Medusa by threatening to kill Crystal if he did not comply. With no other choice, Quicksilver went to New York and obtained the Fantastic Four, who agreed to go with him.{{r|Fantastic Four #158}} The Fantastic Four were later captured, but with the aid of Triton, and the Fifth Dimension's [[Valeria (Earth-6212)|Valeria]] and [[Phineas (Earth-6212)|Phineas]] the Fantastic Four freed themselves. Meanwhile, Medusa was willing to sacrifice his life in order to allow Black Bolt to remain defiant toward Xemu. In order to try and force Black Bolt's hand, Xemu attacked a Chinese military base causing the super-power to launch fighter jets towards Attilan to investigate. However, the Invisible Girl had stowed aboard the FF's plane and used the Thunder Horn to boost her powers of invisibility to hide Attilan from view. When Xemu realized Black Bolt still refused to act, he fled back to the Fifth Dimension where he was defeated by both the Human Torch and Quicksilver. After the Fantastic Four and the Inhumans defeated the last of Xemu's troops, the FF welcomed Sue back to the group full time. But before they could rename themselves the Fantastic Five, Medusa informed them that she had decide to return to her people and be by Black Bolt's side. Her decision was met with the FF's blessings before they returned home.{{r|Fantastic Four #159}}\n\n===War of the Three Galaxies===\nMedusa's return to Attilan was hardly a quiet one as the Inhumans were soon attacked by the Negative Zone creature known as [[Blastaar (Earth-616)|Blastaar]] who was revived by the Kree.<ref>{{cl|Inhumans #1}}: [[Blastaar (Earth-616)|Blastaar]] was trapped in [[Adamantium]] following a battle with the [[Bruce Banner (Earth-616)|Hulk]] and [[Jonathan Storm (Earth-616)|Human Torch]] in {{cl|Marvel Team-Up #18}}. The involvement of the [[Kree]] was revealed in {{cl|Inhumans #3}}</ref> The royal family failed to stop Blastaar from activating the [[Kaptroids]], robots constructed and hidden deep below Attilan by the Kree for the purposes of rounding up the population and imprisoning them. With his mission complete, Blastaar fled the scene leaving the Inhumans to fend for themselves. While Black Bolt battled the Kaptroids, Medusa and the others attempted to deactivate the device that summoned them. Upon destroying the device, the Kaptroids fell inert.{{r|Inhumans #2}} Attilan was then struck by a series of tremors prompting Black Bolt and the rest of the House of Agon to travel to New York and seek out the help of the Fantastic Four. Their arrival coincided with the arrival of the Kree warrior known as [[Arides (Earth-616)|Shatterstar]] who was dispatched to Earth to collect the Inhumans to use as cannon fodder in the so-called War of the Three Galaxies. Attacked in the street of New York, the Inhumans were assisted by [[Falzon (Earth-616)|Falzon]], Shatterstar's father, who was sympathetic to the Inhumans plight. Despite this assistance, Black Bolt and the others were defeated in Shatterstar's opening salvo.{{r|Inhumans #3}} Regrouping, Black Bolt and his family resumed their battle with Shatterstar, ending it when Black Bolt used Shatterstar's own ship to incapacitate their foe. Taking Shatterstar prisoner, the Inhumans and Falzon returned to Attilan only to discover that Maximus had conquered the Hidden Land in their absence.{{r|Inhumans #4}}\n\nWith Crystal and Quicksilver as his prisoners, Maximus forced the rest of the royal family to surrender. They soon learned that Maximus was working along side the Kree, and had agreed to give them half of the Inhuman population to use in their war in exchange for being able to rule the other half. Black Bolt and the others were imprisoned for nine full days as Maximus forced his people to build a massive ark to send half their people to the Kree war machine. With the help of the few remaining rebels, Medusa and the others managed to break free and seemingly slay Shatterstar. Unaware of this revolt, an increasingly desperate Black Bolt gave in to his disrepair as his people were being loaded onto the ark, and cried out.<ref>{{cl|Inhumans #5}}: [[Arides (Earth-616)|Shatterstar]] survived as a photonic being as revealed in {{cl|Avengers #383}}.</ref> Black Bolt's voice completely decimated Attilan, and the population was unhappy with the end result of Black Bolt's show of weakness. Ever faithful, Medusa rallied to make her fellow Inhumans realize that Black Bolt acted out of their best interests. When Black Bolt later wrote a proclamation to his people, Medusa read it to them. In light of the attacks from the Kree, Black Bolt had decided to go searching the stars for a new home for the Inhumans to be safe. Medusa, the Inhuman Royal Family and Falzon agreed to join him on this mission and the Kree space ark was rebuild and re-purposed for this very task.{{r|Inhumans #6}}\n\nWhile passing through the [[Duggil]] star system, the Inhumans ship was shot down over the planet [[Stent]]. A planet of purple dust, they were pulled into a massive mechanical insect city run by City-Dwellers of the [[Stenth (Race)|Stenth]]. Initially thought to be coming to the aid of the dissidents in the city, [[Flarn (Earth-616)|Flarn]] welcomed them when he learned the truth. Later Black Bolt and the others were horrified when Flarn's minions were willing to cripple their own city by blasting away its ghetto in order to deal with the rebel known as [[Shreel (Earth-616)|Shreel]].<ref>{{cl|Inhumans #7}}: The [[Stenth (Race)|Stenth]] and facts pertaining to their homeworld and galaxy were revealed in {{cl|Official Handbook of the Marvel Universe #10}}.</ref> When Flarn went back on his promise to help the Inhumans repair their ship, Medusa and Black Bolt went out to try and recover it. While outside they encountered [[Warkon (Earth-616)|Warkon]] and his army of anarchists who were trying to overthrow Shreel. Learning that Shreel was loyal to the Kree, Bolt and the others joined the fight to overthrow Flarn, however in the aftermath of the battle both Flarn's beetle city, and Warkon's spider city were incapacitated in the process.{{r|Inhumans #8}} After crushing the last of Flarn's resistance, the Inhumans and Warkon's anarchists secured a ship to get off planet, unaware that Flarn had betrayed them and programmed it to head to the Kree Space Station Web, the central hub for the upcoming War of Three Galaxies. There they were forced to battle the Kree and their commanding officer [[Mon-Tog (Earth-616)|Mon-Tog]]. During the ensing battle, the Inhumans learned that the Kree were enthralling humans on Earth to commit acts to destabilize the Earth in order to make it ripe for invasion. Seeing that they had to return home, Black Bolt and his family fled the space station while Warkon and the last of his warriors sacrificed their lives to destroy it.{{r|Inhumans #10}}\n\nTheir ship later crash landed in New York Harbor, and after a brief altercation with the authorities, Blackagar and the others tried to make their way to the United Nations Building to warn the leaders of the world of the impending Kree invasion. The Kree in response used their technology to evolve a cockroach into the [[The Pursuer (Earth-616)|Pursuer]] to attack the Inhumans. The creature proved to be powerful and had Black Bolt and the others on the ropes until Falzon was able to incapacitate the Pursuer with insecticide. With their foe temporarily felled, the Inhumans fled the scene to get away from the authorities.{{r|Inhumans #11}} Getting outside of the United Nations Building, the Inhumans tried to get the attention of the world leaders, leading to another clash with the authorities. The tension grew higher when Bruce Banner tried to intervene on behalf of the Inhumans but was agitated enough that he transformed into the Hulk. Recalling Black Bolt from a previous battle the Hulk attacked the Inhumans. Using Lockjaw to teleport to a safe location, their battle with the Hulk abruptly ended when a combination of Black Bolt's electron channeling powers and a bolt of lightning altered the Hulk's personality so that he considered the Inhumans his friends and left without further incident.{{r|Inhumans #12}} Needing to find a resolution to the War of the Three Galaxies, Medusa and the Inhumans sought out the Kree renegade [[Mar-Vell (Earth-616)|Captain Marvel]]. The Royal Family remained on Earth while Mar-Vell and Black Bolt went to confront the Kree directly. There they confronted the Kree Supreme Science Council and exposed member [[Por-Bat (Earth-616)|Por-Bat]] as a [[Skrulls|Skrull]] spy trying to instigate the war in order to lead the Kree into a trap. Realizing they almost entered a conflict they could not win, [[Phae-Dor (Earth-616)|Phae-Dor]] called off the War of the Three Galaxies, and Black Bolt was returned to Earth.{{r|Captain Marvel #53}}\n\n===To the Moon===\nStill in New York City, Black Bolt, his family and Falzon discovered a Kree bomb that had crashed on Earth. While attempting to disarm the weapon, Falzon was exposed to a nerve gas and required an antidote to save his life. Medusa was sent out to get it and stole it from an ambulance in Brooklyn that was rushing it to a Manhattan hospital to be used on a boy in critical condition after being exposed to a nerve gas himself trying to stop an out of control chemical truck. This led to a battle between Medusa and Spider-Man, whose life was saved by the young man in his civilian identity of Peter Parker when he stopped the truck. Spider-Man followed Medusa to Coney Island where a battle between the wall-crawler and the Inhumans broke out. Ultimately Black Bolt stopped the fighting, and truth was revealed. With Falzon cured, Black Bolt then rushed the rest of the antidote to the boy, saving his life.{{r|Peter Parker, The Spectacular Spider-Man #11}} Black Bolt and the others returned to Attilan to find that the Inhuman known as [[Thraxon (Earth-616)|Thraxon]] had taken over and rebuilt their home into a massive fortress with the help of the [[Anath-Na Mut (Earth-616)|Sphinx]]. Medusa and the others were incapacitated and turned over to the Sphinx who plotted to use Black Bolt's powers in his satellite to probe the minds of every living being on Earth and learn the secrets of the [[Ka Stone]] that gave the Sphinx his powers. Escaping captivity, Crystal enlisted the aid of the Fantastic Four. They defeated Thraxon and followed the Sphinx aboard his space satellite. There they freed Black Bolt and the others and the Sphinx was jettisoned into the void of space. With Thraxon removed, the Inhumans then began to restore Attilan to its former glory.{{r|Fantastic Four Annual #12}}\n\nThis moment did not last long as the Inhumans soon began falling ill due to the increasing amounts of pollutants in the air.{{r|Fantastic Four #240}} Medusa and Black Bolt used Lockjaw to teleport to the Baxter Building to seek help from the Fantastic Four, but they were not home at the time. Black Bolt then sent Medusa back home while he went looking for them. Black Bolt was only able to find the Thing, and the pair got sucked into a battle against the villain known as [[Franklin Hall (Earth-616)|Graviton]]. During the course of their battle, Graviton's powers raged out of control, transforming him into a massive living pocket universe. The villain attempted to petition Black Bolt for sanctuary in Attilan, but Bolt refused. The battle ended when Graviton quickly became disgusted by what he had become and seemingly committed suicide.{{r|Marvel Two-In-One Annual #4}} Back in Attilan, Medusa was suddenly kidnapped by the rogue scientists known as the [[Enclave (Earth-616)|Enclave]], who were working in league with Maximus.{{r|Fantastic Four #240}} With Medusa as their prisoner, the Enclave scientist began experiments on her.{{r|Fantastic Four #207}} Maximus turned on the Enclave and fought for his people. In the ensuing battle Medusa was rescued and Maximus seemingly sacrificed his life to stop them.{{r|Fantastic Four #240}}{{r|Avengers Annual #12}} With the pollution taking its tole on the Inhumans, the Fantastic Four were sought out to help move Attilan to a new location where its people would not be at risk. The [[Blue Area of the Moon]] was selected for its self contained atmosphere. With the help of the Fantastic Four, Medusa and the Inhuman Royal Family moved Attilan to the moon.{{r|Fantastic Four #240}}{{r|Avengers Annual #12}}\n\nBlack Bolt then organized a celebration of the Inhumans new home on the moon, where Crystal's daughter was named Luna to commemorate their new home. The celebrations were briefly interrupted when Triton accidentally triggered a hidden crystal that plagued everyone on Attilan with a mass hallucination.{{r|Fantastic Four #248}} Unknown to all at the time, Maximus was awaking from his death like coma and used this moment to use his mental powers to swap bodies with Black Bolt.{{r|Avengers Annual #12}} Maximus successfully posed as Black Bolt for a period of time without arousing suspicions.<ref>Appearances in {{cl|Marvel Super Hero Contest of Champions #1}}, {{cl|Incredible Hulk #279}}, and {{cl|Vision and the Scarlet Witch #4}} are actually [[Maximus Boltagon (Earth-616)|Maximus]] posing as Black Bolt.</ref> When the United Nations learned that the Inhumans had relocated to the Moon, they sent the Avengers to meet with them and ensure that their society would not pose a threat to any nation on Earth. Medusa and the rest of the royal family greeted the Avengers to their home, still unaware that Maximus had swapped bodies with his brother. Maximus then started launching meteor attacks on the Earth which were stopped by Thor. When the Avengers began suspecting the truth, he ordered the Inhumans to attack the Avengers. However Maximus blew his cover when he spoke while battling the [[Jennifer Walters (Earth-616)|She-Hulk]]. Medusa then forced Maximus to reverse the mind swap, freeing Black Bolt from his prison.{{r|Avengers Annual #12}}\n\nLater, when Quicksilver insisted that Luna be exposed to the Terrigen Mists, Crystal fought against it out of fear that her daughter would be mutated into a non-human form. She sought out the aid of the Thing to help stop this from happening. Black Bolt and the rest of the royal family clashed with the Thing and Lockjaw in order to preserve an Inhuman law that stated that the father of a child could choose when and if their offspring could be exposed to Terrigenesis. However the conflict was put to an end when Quicksilver was tricked into thinking that Lockjaw was a humanoid mutated into dog form, making him see Crystal's point of view.<ref>{{cl|Thing #3}}: This was later revealed as a elaborate prank put on by [[Gorgon Petragon (Earth-616)|Gorgon]] and [[Karnak Mander-Azur (Earth-616)|Karnak]] and played on [[Pietro Maximoff (Earth-616)|Quicksilver]] and the [[Benjamin Grimm (Earth-616)|Thing]] as revealed in {{cl|X-Factor #71}}.</ref> Black Bolt later called in a favor from Dazzler to help defend Attilan from the villains [[Karla Sofen (Earth-616)|Moonstone]] and [[Marcus Daniels (Earth-616)|Blackout]], who were fleeing the authorities on Earth.<ref>{{cl|Dazzler #32}}: [[Karla Sofen (Earth-616)|Moonstone]] and [[Marcus Daniels (Earth-616)|Blackout]] were on the moon following their escape from [[Project P.E.G.A.S.U.S. (Earth-616)|Project PEGASUS]] in {{cl|Avengers #237}} & {{cl|Avengers #238|238}}.</ref> \n\n===Marriage of Black Bolt and Medusa===\n[[File:Blackagar_Boltagon_(Earth-616)_marries_Medusa_in_Fantastic_Four_Annual_Vol_1_18.jpg|thumb|The marriage of Black Bolt and Medusa.{{r|Fantastic Four Annual #18}}]]\nFinally came the time where Black Bolt and Medusa were to be married after so many long years as a couple. A massive ceremony was held in their honor and a public wedding was conducted. Among those invited to the festivities were the Fantastic Four. However the festivities were marred by an on going battle between the Kree soldier [[Bel-Dann (Earth-616)|Bel-Dann]] and [[Raksor (Earth-616)|Raksor]], his Skrull counterpart. Medusa, the royal family, and the Fantastic Four investigated the conflict and were informed by the Watcher that their battle was to determine the victor in the on-going Kree-Skrull War. In order to stop their months long battle, the two groups forced the Kree and Skrull warriors to work together and appear to defeat their mutual enemies. The battle ended with Bel-Dann and Raksor realizing that it was unity was the only way to end the conflict. A solution, sadly, that proved only short lived.<ref>{{cl|Fantastic Four Annual #18}}: [[Bel-Dann (Earth-616)|Bel-Dann]] and [[Raksor (Earth-616)|Raksor]] were ambassadors to the [[Kree]] and [[Skrulls]] to the [[Shi'ar]] empire. They had been battling on the [[Blue Area of the Moon]] since the trial of the [[Phoenix (Earth-616)|Dark Phoenix]] in {{cl|X-Men #137}}</ref>\n\nCrystal and Quicksilver's marriage began experiencing trouble not long after this, as Quicksilver began focusing on forming a militia in Attilan.{{R|Vision and the Scarlet Witch Vol 2 6}} Feeling neglected, Crystal began having an affair with [[Norman Webster (Earth-616)|Norman Webster]], the neighbor of her sister-in-law the Scarlet Witch and her husband the Vision.<ref>{{cl|Vision and the Scarlet Witch Vol 2 7}}: The [[Vision (Earth-616)|Vision]] and the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] got married in {{cl|Giant-Size Avengers #4}}</ref> The truth came out when Crystal overdose on the drug needed to breath safely on Earth while she was visiting with Norm,{{r|Vision and the Scarlet Witch Vol 2 9}} prompting Norma to get her back to Attilan on the moon. There the truth came out, and while Crystal's infidelity rocked the royal family, Black Bolt and the others refused to allow Quicksilver to kill Norm for his involvement. This battle led to the Inhumans battling Quicksilver to a stand-still and he sped off vowing to get revenge.{{r|Vision and the Scarlet Witch Vol 2 10}} Unknown to all at the time, Maximus was using his mental powers to transfer his madness to Quicksilver.{{r|X-Factor Annual #2}} Quicksilver then returned to Earth to menace his old allies in the Avengers,{{r|Avengers Annual #15}}{{r|West Coast Avengers Annual #1}} and the Fantastic Four, before being captured.{{r|Fantastic Four #304}} In light of this, Crystal demanded that she get divorced from Quicksilver, but the royal family would not allow it due to Inhuman laws set to preserve the \"sanctity\" of marriage. In response, Crystal returned to Earth and rejoined the Fantastic Four for a time, while the Inhumans took Quicksilver into custody.{{r|Fantastic Four #305}}\n\nMaximus then began focusing his powers on Black Bolt, plaguing him with headaches. Seeking to destroy his enemies, he enthralled Lockjaw and had him send Quicksilver to Earth to capture the Fantastic Four's son Franklin Richards. This kidnapping was interrupted by Franklin's friends the [[Power Pack (Earth-616)|Power Pack]] as well as the mutant heroes known as [[X-Factor (Earth-616)|X-Factor]]. Capturing Franklin, Quicksilver and Lockjaw fled back to the moon, taking X-Factor with them. After Pietro escaped both X-Factor and the royal family, the two groups worked together to track him down. Medusa and the others battled Maximus, making his hold on Black Bolt and Quicksilver weaken and he was eventually defeated. Without Maximus' insane influence. Quicksilver quickly returned back to normal.{{r|X-Factor Annual #2}} With Quicksilver back to normal, Medusa and Black Bolt ordered Crystal to return home, and when she refused forced her and the Fantastic Four to return to the moon with them. Their returned coincided with the arrival of the [[Herbert Wyndham (Earth-616)|High Evolutionary]] and his army of [[Gatherers (Earth-616)|Gatherers]] and [[Eliminators (Earth-616)|Eliminators]]. As part of his so-called [[Evolutionary War]], the High Evolutionary required a sample of the Terrigen Mists. Black Bolt, the royal family and the Fantastic Four fought off the Evolutionary and his minions. In the aftermath of the battle, Black Bolt convinced Crystal to return home.{{r|Fantastic Four Annual #21}}\n\n===Ahura===\nBy this point the aging Genetics Council had caused much turmoil among modern Inhumanity with their selective marriage and breeding policies. This came to a head when Medusa discovered that she was pregnant with Black Bolt's child. When they announced to the kingdom this news the Genetic Council objected, for fear that their child could have a destructive voice like Black Bolt, be as mad as his brother Maximus, or both. When they ordered the pregnancy to be aborted, Medusa refused to comply. When Black Bolt refused to support her, Medusa fled to Earth with Gorgon, Karnak, Triton, Crystal and Medusa's midwife [[Minxi (Earth-616)|Minxi]]. There they made a makeshift home among derelicts that lived in a dump outside of Las Vegas, Nevada. Bound by Inhuman law, Black Bolt suffered the abandonment by his wife. Meanwhile, Medusa was in the process of giving birth to her son [[Ahura Boltagon (Earth-616)|Ahura]] when she was attacked by an elemental creature. The powerful infant used his powers to slay the creature. Realizing that they could not run from their responsibilities, Medusa and the royal family returned home when Black Bolt managed to track them down. Despite her reservations, Medusa later turned her son over to the Genetics Council for examination.<ref>{{cl|Marvel Graphic Novel #39}}: [[Ahura Boltagon (Earth-616)|Ahura's]] named was not revealed until {{cl|Fantastic Four Unlimited #2}}</ref> Medusa was present when Black Bolt went to check on his brother and found that he was back in his cell.{{r|Inhumans Special #1}}\n\nUnknown to Black Bolt and the royal family a crooked member of the Genetics Council had sent Ahura to Earth to be used in part of a United States government sponsored genetics experiment. However the ship carrying the boy crashed and the boy was adopted by a couple who found his downed ship outside of the town of Pottersville, raising him as their own they named the boy Pope.{{r|Fantastic Four Unlimited #2}} Medusa became increasingly depressed and demanded that Black Bolt tell her what happened to her child, but he refused to tell her anything.{{r|Daredevil #272}} Taking Medusa's side, both Gorgon and Karnak began searching for clues as to what happened to Ahura. Learning that the child had been shipped to Earth, Medusa agreed to accompany them to search for him.{{R|Daredevil #273}} However when Black Bolt learned about this plan, he used his authority to force Medusa to stay behind. Despite Gorgon and Karnak's protest, she refused to disobey her husbands orders and so the pair went to Earth without her.{{R|Daredevil #274}} Although the pair eventually found Ahura,{{r|Daredevil #279}} and intended to bring the boy home,{{r|Daredevil #283}} they realized that he was still at the mercy of the Genetics Council. Instead, they left the boy with his adopted family, informing them of the situation of their child and swore them to keep him safe and out of the public eye in the event the Genetics Council came looking for him.{{r|Fantastic Four Unlimited #2}}\n\n===Lunar Threats===\nThe royal family soon became busy with other threats that distracted them from the fate of her son. Such as when Stane International attempted to dump toxic waste on the moon in an attempt to wipe out the Inhumans to steal their resources.{{r|New Warriors #6}} They saved the powerful [[Ditmil Pirvat (Earth-616)|Star Thief]], as well as [[Vance Astrovik (Earth-616)|Marvel Boy]], [[Angelica Jones (Earth-616)|Firestar]] and [[Namorita Prentiss (Earth-616)|Namorita]] of the [[New Warriors (Earth-616)|New Warriors]] from the ship as it sped to the moon. After stopping Star Thief's rampage, he, Black Bolt and Firestar destroyed the ship, ending it's threat to Attilan. Black Bolt later welcomed Star Thief to live among them.{{r|New Warriors #7}} Attilan then came under threat from the eternal mutant known as [[En Sabah Nur (Earth-616)|Apocalypse]], who coerced members of the Inhumans into his shock-troops known as the [[Dark Riders (Earth-616)|Riders of the Storm]].{{r|X-Factor #65}} The group later kidnapped [[Nathan Summers (Earth-616)|Nathan Christopher Summers]], the son of X-Factor's Cyclops in order for Apocalypse to absorb his essence.{{r|X-Factor #66}} Apocalypse and his minions then returned to Attilan where they quickly took over and captured many of the Inhumans, including Medusa and Crystal. X-Factor arrived shortly after and teamed up with the rest of the royal family to face off against Apocalypse.{{r|X-Factor #67}} Black Bolt and his royal family freed Apocalypse's slaves and assisted X-Factor who triumphed with the aid of the time traveler known as the [[Jen Askani (Earth-4935)|Askani]]. But the seeming destruction of Apocalypse was not without a cost as Nathan was infected with a [[Techno-Organic Virus]] and had to be taken to the [[Earth-4935|future]] to save his life.{{r|X-Factor #68}}\n\nNot long thereafter the [[Brethren]], single celled organisms hyper evolved by the enigmatic [[Celestials]], crash landed on the moon. When their leader [[Ector (Brethren) (Earth-616)|Thane Ector]] captured Karnak, Quicksilver, and Timberus; Black Bolt and the others contacted the Avengers for assistance. After a brief clash on the moon, the Brethren turned their attentions toward Earth.{{r|Avengers #334}} Eventually Ector and his minions were defeated by the Avengers, who welcomed Crystal into their ranks.{{r|Avengers #339}} \n\nDuring the [[Infinity Gauntlet (Event)|Infinity Gauntlet]] crisis, the death worshiping Titan known as [[Thanos (Earth-616)|Thanos]] obtained the six [[Infinity Stones|Infinity Gems]] and used them to kill half of the population of the universe for his lover, Death.{{r|Infinity Gauntlet #1}} Blackagar and the other surviving Inhumans volunteered their skills to help protect the Earth from the galactic upheaval caused by Thanos' rise to power.{{r|Infinity Gauntlet #2}} Eventually, [[Adam Warlock (Earth-616)|Adam Warlock]] defeated Thanos and restored all the damage he had done.{{r|Infinity Gauntlet #6}} Immediately thereafter, Black Bolt, Gorgon and Karnak broke up a fight between the Silver Surfer and the ninja warrior known as [[M'Nai (Earth-616)|Midnight Son]] that literally landed in the Inhumans' backyard. After the fight was over, Black Bolt extended an invitation for Midnight Son to live with his people.{{r|Silver Surfer Vol 3#60}} Later during the so-called [[Infinity War]], the royal family watched helplessly as the Fantastic Four's headquarters the [[Four Freedoms Plaza]] was blown up by an attack. Before they could go and help, they were visited by the [[Guardians of the Galaxy (Earth-691)|Guardians of the Galaxy]] from the [[Earth-691|31st Century]] who had come seeking a cure for their Inhuman teammate [[Talon (Earth-691)|Talon]] who had contracted the Grail's Disease. There was a brief battle before the truth was revealed. The royal family and the Guardians then had to defend themselves from doppelgangers of the royal family and the Guardians created by the [[Magus (Earth-7528)|Magus]]. After these foes were defeated and Talon was cured, the Guardians parted company.{{r|Guardians of the Galaxy #27|: The [[Four Freedoms Plaza]] was planted with a bomb by a [[Mister Fantastic (Doppelganger) (Earth-616)|Mister Fantastic doppelganger]] created by the [[Magus (Earth-7528)|Magus]] as seen in {{cl|Infinity War #2}}, the heroes it was set to kill all survived in that same story.}}\n\nBlack Bolt and the others Inhumans then spotted Doctor Doom as he made a trip to the [[Uatu (Earth-616)|Watcher's]] citadel and followed after to investigate.{{r|Fantastic Four #374}} There they found that the Fantastic Four and their allies [[Sharon Ventura (Earth-616)|Ms. Marvel]] and [[Lyja (Earth-616)|Lyja]] were charged by the Watcher to stop Doctor Doom who had stolen the powers of [[Aron (Earth-616)|Aron the Rogue Watcher]]. The battle was quickly ended when Black Bolt used his powers and Mister Fantastic's Optimizer weapon to overload Doom's power battery, seemingly vanquishing their foe, although Doom did survive and escaped once again.<ref>{{cl|Fantastic Four #375}}: [[Victor von Doom (Earth-616)|Doctor Doom]] stole the powers of [[Aron (Earth-616)|Aron the Rogue Watcher]] in {{cl|Fantastic Four #372}}.</ref> By this time, \"Pope\" and his adopted family had relocated to New York. He was in attendance of a South Bronx where the Mayor of New York City was giving a political speech with the Fantastic Four present. Ahura's resurfacing was also detected by the Genetics Council who sent their minions, including a new [[Uys (Earth-616)|Seeker]] to collect the boy. Black Bolt, Medusa and their family came to the boy's rescue and helped protect him along side the Fantastic Four. Ultimately, the betrayer among the council slew his comrades and stole their powers in a bid to also steal Ahura's abilities as well. But this rogue councilman was slain by Ahura himself. When the boy was crowned the new king of the Inhumans, Ahura instead destroyed the royal crown, prompting the Inhuman people to decide to form a democracy.{{r|Fantastic Four Unlimited #2}}\n\n===Self Imposed Exile===\nBlack Bolt and the rest of the royal family went into self exile shortly thereafter. They soon took up residence as part of a New Jersey freakshow so they could hide in plain sight among humanity. Triton briefly left the group to reconnect with sea.{{r|Namor the Sub-Mariner #45}} While Black Bolt left Earth with [[Wendell Vaughn (Earth-616)|Quasar]] to battle the intergalactic pirates known as the  [[Starblasters (Earth-616)|Starblasters]].{{r|Starblast #1}} When the Starblasters were finally defeated, Black Bolt returned to his family.{{r|Quasar #57}} Back at his temporary home at the New Jersey freakshow, Black Bolt and his family were visited by the Black Panther who was seeking the whereabouts of the Fantastic Four so that they might help his young super-human charge named [[N'Kano (Earth-616)|Vibraxas]]. The Inhumans also recommended they take a young Inhuman named [[Devlor (Earth-616)|Devlor]] with them.{{r|Fantastic Four #391}} This later led to the formation of the group of youthful heroes known as [[Fantastic Force (Earth-616)|Fantastic Force]].{{r|Fantastic Force #1}} \n\nThe Inhumans later learned that archaeologists were about to discover the remains of the Hidden Land in the Himalayas, Black Bolt ventured there and used his powerful voice to cause a massive avalanche that buried all traces of his civilization under tons of rock and ice.{{r|Marvel Comics Presents #168}} Although they were estranged from their people on the moon, the House of Agon were answered a call for help from Star Thief when the hero known as [[Richard Ryder (Earth-616)|Nova]] and his rival [[Robert Rider (Earth-9442)|Nova 0:0]] were clashing on the moon.{{r|Nova Vol 2 12}} When they finally recognized Nova from their previous encounter with the New Warriors, Black Bolt brought an end to the hostilities and when the royal family teleported back to Earth they brought Nova back with them.{{r|Nova Vol 2 13}} When the Fantastic Four's Reed Richards was believed to have been killed in battle, Black Bolt and his family were one of the many colleagues who paid their respects at the funeral.<ref>{{cl|Fantastic Four #400}}: [[Reed Richards (Earth-616)|Mister Fantastic]] seemingly died battling [[Victor von Doom (Earth-616)|Doctor Doom]] in {{cl|Fantastic Four #381}}, however he appeared alive and well in {{cl|Fantastic Four #407}} and his \"death\" all part of an elaborate trick on the part of [[Jonathan Richards (Earth-967)|Hyperstrom]].</ref>\n\nShortly thereafter, the Genetics Council of Attilan were approached by Kree refugees following the [[Operation: Galactic Storm|Kree/Shi'ar War]] that left the Kree empire decimated. Although their leader [[Maston-Dar (Earth-616)|General Maston-Dar]] truly sought refuge, the long history of hatred between the Inhumans and the Kree led to various conflicts that resulted in casualties. Maston-Dar's subordinate [[Tarnok-Kol (Earth-616)|Major Tarnok-Kol]] felt that the Inhumans would not accept them so long as Black Bolt and his family still lived and sent an army of assassins to Earth to eliminate the royal family. This assassination attempt failed and tipped Black Bolt off to the refugee situation in Attilan. Black Bolt and his family went there and later prevented another group of renegade Kree from stealing the Terrigen Mists to try and mutate themselves as well. Black Bolt and his family saved their people once again and the Kree were brought to trail. When Black Bolt forced a confession out of Tarnok-Kol, the Kree realized they ruined any chance they had at living peacefully on the moon next to the Inhumans and left. Following their departure, Black Bolt and his family returned to Earth.<ref>{{cl|Inhumans: The Great Refuge #1}}: The [[Kree]] battled the [[Shi'ar]] in what was late called [[Operation: Galactic Storm]] that occurred in {{cl|Captain America #398}}, {{cl|Avengers: West Coast #80}}, {{cl|Quasar #32}}, {{cl|Wonder Man Vol 2 #7}}, {{cl|Avengers #345}}, {{cl|Iron Man #278}}, {{cl|Thor #445}}, {{cl|Captain America #399}}, {{cl|Avengers: West Coast #81}}, {{cl|Quasar #33}}, {{cl|Wonder Man Vol 2 #8}}, {{cl|Avengers #346}}, {{cl|Iron Man #279}}, {{cl|Thor #446}}, {{cl|Captain America #400}}, {{cl|Avengers: West Coast #82}}, {{cl|Quasar #34}}, {{cl|Wonder Man Vol 2 #9}} and ending in {{cl|Avengers #347}} where the Kree [[Supreme Intelligence (Earth-616)|Supreme Intelligence]] tricked the Shi'Ar into detonating a Nega-Bomb that both decimated the Kree and freed them from the evolutionary dead-end their race had become trapped within.</ref>\n\n==Back on Earth==\n===Atlantis Rising===\nSoon the sorceress known as [[Morgan Le Fay (Earth-616)|Morgan Le Fay]] rose the undersea kingdom of [[Atlantis]] from the ocean floor in an effort to reclaim her ancestral home. This coincided with Reed Richard's father [[Nathaniel Richards (Earth-616)|Nathaniel]] accidentally triggering a trap at the Watcher's citadel on the moon that threatened to destroy Attilan. While the current Genetics Council fled with the Terrigen Mists in order to invade the Earth, the Fantastic Four responded by shrinking Attilan down to size and containing it within a bottle. Sensing that his homeland was in danger, Black Bolt had Lockjaw to teleport him to the moon just moments after Attilan was taken, leaving him with no clue what happened to his homeland.{{r|Fantastic Four: Atlantis Rising #1}} Seeking an alliance with Morgan le Fay to reclaim their ancestral home, the Genetic Councils [[Arcadius (Earth-616)|Arcadius]] contacted the royal family.{{r|Fantastic Four #401}} He then convinced them that the Sub-Mariner was responsible for the capture of Attilan. Learning that Namor and the Fantastic Four were in England meeting with government officials, Black Bolt and his family teleported there. Black Bolt and Namor soon came to blows before their fight was broken up by the Invisible Woman who attempted to maintain diplomacy in the current crisis. Before they could figure out what was going on, Arcadius contacted Blackagar and his house again asking them to come to him in Atlantis.{{r|Fantastic Four #402}}\n\nBlack Bolt and the others were asked to defend Attilan and Atlantis from invaders joining forces with the Genetic Council's elite guard the [[Crimson Cadre (Earth-616)|Crimson Cadre]]. This led to a clash between the Inhumans and the Fantastic Four and their allies Fantastic Force, Namor, Thor, [[Kristoff Vernard (Earth-616)|Kristoff Vernard]] and Nathaniel Richards. The heroes managed to stop Morgan le Fay, who was banished by the magic of the [[Ebony Blade]]. Nathaniel Richards also reversed the shrinking of Attilan causing it to reform on the ruins of Atlantis. While the heroes fled, Arcadius erected a new Negative Zone barrier around Attilan, trapping all the Inhumans inside as the Terrigen Mists began to rupture.{{r|Fantastic Four: Atlantis Rising #2}} The Inhuman royal family soon realized that Black Bolt's tuning fork was seriously damaged in the battle and teleported away before Attilan was completely sealed off. They sought out Crystal who was still a member of the Avengers in the hopes that they could repair Bolt's tuning fork. Their travels through New York were impeded by Arcadius, who used his powers to animate states to try and thwart their progress, but they were rescued by Crystal and Quicksilver and taken to [[Avengers Mansion]]. There Black Bolt was examined by the Avenger known as [[Henry Pym (Earth-616)|Giant-Man]], who was unfortunately unable to make the needed repairs.{{r|Fantastic Four Unlimited #11}} The Inhumans then moved Black Bolt to Colorado to keep him away from populated areas while his sanity began to deteriorate. Upon learning that Mister Fantastic was found alive and well, the Inhumans sought his aid. With the aid of the Fantastic Four and the Sub-Mariner, the Inhumans managed to subdue Black Bolt and take him back to the Four Freedoms Plaza for treatment.<ref>{{cl|Fantastic Four #411}}: [[Reed Richards (Earth-616)|Mister Fantastic]] turned up alive and well in {{cl|Fantastic Four #407}}.</ref> While Bolt's life hung in the balance, Mister Fantastic performed the life saving surgery that Blackagar needed to repair his tuning fork, restoring his sanity.{{r|Fantastic Four #412}}{{r|Fantastic Four #413}} \n\n===Atlantean Attilan===\nAfter his recovery, Black Bolt and his family came to the aid of the Fantastic Four during the [[Onslaught (Event)|Onslaught crisis]], helping the team fend off constructs of their greatest foes created by [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]] who had kidnapped Franklin Richards and was manipulating his abilities.<ref>{{cl|Fantastic Four #416}}: [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]] kidnapped [[Franklin Richards (Earth-616)|Franklin]] in {{cl|Fantastic Four #415}}.</ref> The Fantastic Four and the Avengers (including Crystal) later seemingly sacrificed their lives to destroy Onslaught.{{r|Onslaught Marvel Universe #1}} Unknown to all, Franklin Richards saved their lives by transporting these heroes to a pocket universe on a world later dubbed [[Counter-Earth (Heroes Reborn)|Counter-Earth]] where they lived parallel lives for months.{{r|Heroes Reborn: The Return #1}} During the time that Black Botl and the rest of the family believed Crystal to be dead, they apparently found a means of disabling the Negative Zone barrier and return to Attilan. It was around this time that Ahura began showing signs of insanity and the Genetics Council deemed the boy a danger to Inhuman society. With no choice, Black Bolt and Medusa were forced to give up their son and were forbidden from seeing him again. Apparently at this point the royal family were partially restored to power. Although they were viewed as monarchs of the realm and had some governing power, it was apparently at the approval or in conjunction to the ruling council.<ref>The fate of [[Ahura (Earth-616)|Ahura]] was left unexplained for along time, with a passing mention by [[Medusalith Amaquelin (Earth-616)|Medusa]] in {{cl|Quicksilver #6}} implying that something happened to him. It was eventually explained in {{cl|Silent War #4}} what happened to Black Bolt and Medusa's son. When the Inhumans resurfaced in Quicksilver #6, their barring through the Negative Zone barrier was unexplained and they acted as though [[Inhumans (Inhomo supremis)|Inhuman]] society still functioned as a monarchy. This was not properly explained and the plot threads about the [[Terrigen Mist]] running rampant in Attilan dropped. It was not until {{cl|Inhumans Vol 2 1}} that the relationship between the House of Agon and the [[Genetics Council (Earth-616)|Genetics Council]] were more clearly defined.</ref>\n\nWhen Crystal finally returned from her time on Counter-Earth,<ref>{{cl|Heroes Reborn: The Return #4}} and {{cl|Quicksilver #3}}.</ref> Black Bolt and his family were briefly attacked by Thanos who was causing vegetation to grow rampantly across the universe with technology stolen from the [[Savage Land]].{{r|Ka-Zar Vol 3 10}} Thanos was eventually defeated by the jungle adventurer known as [[Kevin Plunder (Earth-616)|Ka-Zar]].{{r|Ka-Zar Vol 3 11}} Crystal soon reunited with her husband and invited him back to Attilan. Black Bolt and the others regarded the speedsters return tepidly. Later Black Bolt presided of the most recent Terrigenesis, however the ceremony was disrupted by Quicksilver who unknown to all -- was being mentally manipulated by Maximus once again. While trying to flee with a supply of the Terrigen Mists, Quicksilver was subdued by Black Bolt and the others.{{r|Quicksilver #4}} Realizing what was going on, Black Bolt went to confront his mad brother only to discover he was having his powers boosted by the [[Fabian Cortez (Earth-616)|Fabian Cortez]] a member of the Magneto's [[Acolytes (Earth-616)|Acolytes]] who was sent to Attilan under orders from their leader [[Bennet du Paris (Earth-616)|Exodus]] who found the Inhumans an affront to the mutant race. Maximus then enthralled Black Bolt and most of the royal family, putting Luna's life at risk. Quicksilver broke out of his cell but was forced to face off against Black Bolt.{{r|Quicksilver #5}} Quicksilver was saved from Black Bolt's destructive voice by his sister Hex powers. Eventually Boltagon and his family shook off the mental control of Maximus, but had to battle both the Crimson Cadre and the Alpha Primitives while Maximus and Cortez attempted to unleash the Terrigen Mists into the Earth's atmosphere. Quicksilver prevented this from happening and Cortez fled, leaving Black Bolt to knock out his brother and imprison him once more.{{r|Quicksilver #6}}\n\nBlack Bolt later presided over [[Phadros (Earth-616)|Phadros]] as he had his pregnant wife [[Thera (Inhuman) (Earth-616)|Thera]] exposed to the Terrigen Mists. At first it seemed as though the child was born without powers, but unknown to them it formed a bond with [[Heather McNeil (Earth-616)|Vindicator]] of the Canadian super-hero team known as [[Alpha Flight (Earth-616)|Alpha Flight]]. It was also causing earthquakes in the region. Black Bolt and his people welcomed Heather to their sanctuary, and later welcomed her teammates when they came looking for her. They soon realized the child of Phadros and Thera had the power to control mater with his mind when it animated a statue of Randac and made it go on a rampage. While Black Bolt mentally calmed the child and taught it to control his powers, Alpha Flight and the royal family brought down the wayward statue. Realizing she could not abandon her team to live in Attilan, Vindicator returned with them back to Canada.<ref>{{cl|Alpha Flight Inhumans Vol 1 '98}}: This story incorrectly states that [[Randac (Earth-616)|Randac]] was Black Bolt's father.</ref> It's possibly around this time that Black Bolt faced the cosmic being known as [[Vortex (Cosmic Being) (Earth-616)|Vortex]], although this battle is largely unrecorded.{{r|Inhumans Vol 2 6}}\n\n===War with Portugal===\nEventually a new barrier was erected around Attilan to protected to isolate it from the outside world and keep the pollutants of the outside world out. Black Bolt soon became increasingly uneasy by the appearance of corporate interests that began mining the nearby ruins of Atlantis for Vibranium with backing from the Portuguese army. Black Bolt also became increasingly uneasy as he suspected his brother might be up to a new scheme, and the internal bickering among his family members.{{r|Inhumans Vol 2 1}} Black Bolt later presided over the Terrigenesis of the youthful Inhumans [[Neifi (Earth-616)|Neifi]], [[Tonaja (Earth-616)|Tonaja]], [[Dewoz (Earth-616)|Dewoz]], [[Nahrees (Earth-616)|Nahrees]], [[Kalikya (Earth-616)|Kalikya]], and [[Dinu (Earth-616)|Dinu]]. The celebration was marred when Dewoz's transformation turned him into an Alpha Primitive, much to the horror of those gathered. Dewoz was then remanded to the caverns below Attilan with the rest of the Alpha Primitives, leaving none aware that this transformation was orchestrated by Maximus in another one of his schemes to destroy his brother and take over the Inhuman throne.{{r|Inhumans Vol 2 2}}\n\nThe situation troubled Black Bolt and the others further, leaving them to wonder if the sudden creation of a new Alpha Primitive could spell the end of their civilization. Meanwhile, Dewoze -- endowed with strange teleportation powers -- used his abilities to help Maximus slowly bring about his plan in secret.{{r|Inhumans Vol 2 3}} The Inhumans presence also began to be known to the outside world which was getting increasingly more fearful of the enigmatic Inhumans. As Bolt pondered over problems, Maximus began working with former Russian spy [[Colonel Stalyenko (Earth-616)|Colonel Stalyenko]] to launch an attack on Attilan.<ref>{{cl|Inhumans Vol 2 4}}: This story states that [[Colonel Stalyenko (Earth-616)|Stalyenko]] previously worked for the [[Komitet Gosudarstvennoy Bezopasnosti (Earth-616)|KGB]]. Per the [[Glossary:Sliding Timescale|Sliding Timescale]] of [[Earth-616]] eventually this fact will drastically age the character and should be considered a topical reference.</ref> When the attacks started, the Inhumans were protected by the force field around their city. When Gorgon demanded that they deal with the humans, he was shocked to find that Black Bolt refused to act in any way but a defensive manner. Bolt later sent [[Mendicus (Earth-616)|Mendicus]] to the United Nations to seek their aid in stopping the attack. This proved to be a fruitless endeavor as the UN sided with the Inhumans but refused to get involved. Worse still, American officials passed on a statue of [[Abraham Lincoln (Earth-616)|Abraham Lincoln]] as a gift to the Inhumans that had a concealed device to further compromise their kingdom -- yet another wrinkle in Maximus' mad scheme. Soon the continued artillery attacks and a lightning storm brought the barrier down upon Attilan.{{r|Inhumans Vol 2 5}} As the Portugese soldiers began breaching the kingdom, Black Bolt still continued to tell his people to stand down and further shocked his family when he ordered the Inhumans to retreat from the conflict.{{r|Inhumans Vol 2 6}}\n\nBoltagon stood back when the Genetics Council later allowed Timberus the right to avenge the death of his brother, but ordered him not to kill anyone but the man responsible. Bolt then had the Inhuman army mobilized but only on the defensive, having their telekinetics put up a new barrier to keep their attackers at bay. During the ensuing confusion, Maximus kidnapped Medusa and held her prisoner in the Alpha Primitives domain, demanding that Black Bolt surrender to his fate, using his resources to shut down all of Attilan's technology.{{r|Inhumans Vol 2 7}} It was soon learned that the fault line that ran under Attilan was at risk of collapse. As his people continued to lose faith in him and their attackers pressed on, Black Bolt began formulating the final gambit to deal with the invaders. However in a rare moment of weakness, the stoic leader of the Inhumans sought comfort from Lockjaw before proceeding.{{r|Inhumans Vol 2 8}} As the royal family continued to pressure Black Bolt into acting, he sent Triton to the Sub-Mariner to try and gain his aid in defending Attilan. However it appeared that Namor was uninterested and only sought to reclaim his former kingdom.<ref>{{cl|Inhumans Vol 2 9}}: [[Namor McKenzie (Earth-616)|Namor's]] unwillingness to help was late revealed as a part of Black Bolt's secret plan to save [[Attilan]] as revealed in {{cl|Inhumans Vol 2 12}}.</ref> As Gorgon began losing his temper, Black Bolt still waited for his piece of his plan to fall into place.{{r|Inhumans Vol 2 10}} \n\nAs it turned out, Black Bolt was well aware of the schemes that were being played against him and was secretly plotting a means to victory by first tricking his enemies into thinking they had won. When Medusa managed to reactivate Attilan's systems, Black Bolt had Karnak rig a device to Lockjaw that would allow the entire nation of Attilan to be teleported along with him. By this point Dewoz had broken free from Maximus' control and Black Bolt gave him shelter before confronting his brother. Maximus quickly surrendered to his brother, and Medusa was freed. It was finally then that Black Bolt's master plan was revealed: he was going to destroy Attilan.{{r|Inhumans Vol 2 11}} After breaking the fault lines along Attilan, Bolt had Crystal use her elemental powers to cause massive volcanic upheaval causing Atlantis to sink once more. In the ensuing chaos, Black Bolt had Lockjaw teleport Attilan back to its previous location hidden in the Himalayan Mountains. Although this was a victory, the loss of lives and secrecy surrounding Black Bolt's plan to save his people caused much tension between the other members of the House of Agon.{{r|Inhumans Vol 2 12}}\n\n===Kree Assassins===\nFollowing their return to the Himalayan Mountains, Black Bolt security within Attilan increased. This extra vigilance proved to be useless against the Kree soldier known as [[Ronan (Earth-616)|Ronan the Accuser]] who managed to enslave the Inhumans overnight with his army of warriors. Ronan intended to reign in the Inhumans as cannon fodder for the Kree and use them to destabilize the Shi'ar empire that ruled over his people. To this end, Black Bolt and his people were enslaved and Attilan was converted into a massive warship that was then taken out into space.{{r|Inhumans Vol 3 1}} Finding a Shi'ar vessel, Ronan set the Inhumans to attack it for the purposes of having Karnak and Triton infiltrate the ship when the battle ended. He later fitted Black Bolt with a new antenna that allowed Ronan to monitor things and take control of Black Bolt if he so needed. He then sent Bolt, Medusa and Gorgon to a world where the Shi'ar and the [[Spartoi]] were going to conduct a symbolic wedding between their two empires for the purposes of assassinating Shi'ar empress [[Lilandra Neramani (Earth-616)|Lilandra Neramani]]. Their arrival on world was met with a trader named [[Shakati (Earth-616)|Shakati]] who helped the three Inhumans blend in as Kree refugees.{{r|Inhumans Vol 3 2}}\n\nWhile travelling to the ceremony, Black Bolt and his companions were attacked by petty thieves who robbed them. Unable to use their powers lest their cover be compromised, the Inhumans were rescued by [[J'son (Earth-616)|Jason of Sparta]], the prince of the Spartoi. Jason took them to his lodging and espoused his displeasure with the union between the Shi'ar and the Spartoi, and his people's ruling council's use of a hologram of his father to control the direction of his people. After Jason set them up with new currency, Blackagar, Medusa and Gorgon went to the wedding ceremony to carry out their task.{{r|Inhumans Vol 3 3}} Also arriving were Triton and Karnak who managed to infiltrate the ranks of the Shi'ar Imperial Guard. However, when Black Bolt attempted to assassinate the Empress, she was aware thanks to the clairvoyant powers of the Guard's new recruit [[Delphos (Earth-616)|Delphos]]. Although imprisoned in a force field, Black Bolt still had the power to kill Lilandra, but refused to do so. Viewing this remotely, Ronan forced Black Bolt to do so anyway. But as it turned out, \"Lilandra\" turned out to be the Imperial Guards resident shapechanger [[Hobgoblin (Imperial Guard) (Earth-616)|Hobgoblin]] who sacrificed his life to save his queen. Black Bolt and his family then teleported away using the [[Nega-Bands]] given to Triton to facilitate a hasty retreat. Back aboard Attilan, Black Bolt challenged Ronan to an honor duel for the freedom of his people. Although Black Bolt won the battle, he was shocked to learn that his people did not want to return to Earth, instead choosing the lives of warriors. While Black Bolt and the House of Agon returned to Earth, the rest of the Inhumans ventured off into space with Ronan to face their destiny among the stars.{{r|Inhumans Vol 3 4}}\n\n==Return to the Moon==\n===The Hidden Ones===\nBlack Bolt and his family returned to New York where they appeared before the United Nations to seek asylum on Earth. There they were attacked by bounty hunters sent after them to avenge the death of Hobgoblin. The attack was thwarted by the arrival of the Fantastic Four and the aliens were seemingly slain by orbital defense weapons while they tried to flee. Upon their arrival, the Inhumans soon became subject to increase prejudice instigated by the [[Hidden Ones (Earth-616)|Hidden Ones]], Inhuman/human hybrids who hid among the world's governments who feared that the Inhumans return would lead to their own exposure.{{r|Fantastic Four Vol 3 51}} When the Inhumans later appeared at a press conference at the Baxter Building, the Hidden Ones used their powers to throw the media into a xenophobic frenzy and later formed a mob outside the Fantastic Four's headquarters. Mister Fantastic tried to petition the United Nations to grant the Inhumans sanctuary, but no country would accept them except for Doctor Doom's Latveria.{{r|Fantastic Four Vol 3 52}} Soon after, both Reed and Ben went missing and the Baxter Building was attacked by both an angry mob and an army of [[Guardsmen (Earth-616)|Guardsmen]] loyal to the Hidden Ones. To make matters worse, the Invisible Woman's pregnancy was threatening to kill her and her unborn child.<ref>{{cl|Fantastic Four Vol 3 53}}: The [[Susan Storm (Earth-616)|Invisible Woman]] originally became pregnant with her second child in but had a miscarriage in {{cl|Fantastic Four #268}}. A restructuring of reality in {{cl|Fantastic Four Vol 3 49}} restarted this second pregnancy.</ref> Black Bolt and the others looked over Sue as she struggled with her labor pains while the Human Torch sought out help for his sister. With no other choice, Johnny enlisted the aid of Doctor Doom who used a combination of sorcery and magic to save both Sue and her unborn child, whom he named [[Valeria Richards (Earth-616)|Valeria]]. While Valeria was being born Mister Fantastic and the Thing defeated the Hidden Ones and exposed them to the world. With the crisis over, Doctor Doom offered Black Bolt and his family a chance to live in Latveria. Black Bolt refused, instead deciding to return the House of Agon to the moon where they began rebuilding Attilan.{{r|Fantastic Four Vol 3 54}} Eventually the rest of the Inhumans returned to the moon as well. Although the circumstances  of their return are unrecorded.{{r|Fantastic Four Vol 3 68}}\n\nFollowing another Terrigenesis celebration,{{r|Inhumans Vol 4 1}} Black Bolt arranged for the youths Nahrees, Tonaja, [[Jolen (Earth-616)|Jolen]], [[San (Earth-616)|San]], and [[Alaris (Earth-616)|Alaris]] to travel to Earth and attend the University of Wisconsin-Madison on a cultural exchange program in order to better relations between the Inhumans and baseline humanity.{{r|Inhumans Vol 4 2}} Black Bolt and his family were later part of a farewell party for the reality television stars and mutant mercenary group known as [[X-Statix (Earth-616)|X-Statix]], who tragically died on their final mission shortly thereafter.{{r|X-Statix #26}} \n\nWhen the newly formed [[New Avengers (Earth-616)|New Avengers]] to discuss the re-emergence of the superhero known as the [[Robert Reynolds (Earth-616)|Sentry]], a superhero whose existence nobody could remember.<ref>{{cl|New Avengers #7}}: The [[Avengers (Earth-616)|Avengers]] disbanded after the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] went insane and decimated the team between {{cl|Avengers #500}} to {{cl|Avengers #503|503}} and {{cl|Avengers: Finale #1}}. The [[Robert Reynolds (Earth-616)|Sentry]] had been around since the dawn of the modern age, however his dark side known as the [[Void (Dark Sentry) (Earth-616)|Void]] threatened to destroy all reality and the only means to save the Earth was for the mind for everyone to forget who the Sentry was as seen in {{cl|Sentry #1}} through {{cl|Sentry #5}}, {{cl|Sentry/Fantastic Four #1}}, {{cl|Sentry/Hulk #1}}, {{cl|Sentry/Spider-Man #1}}, {{cl|Sentry/X-Men #1}}, and {{cl|Sentry/The Void #1}}. These memory wipes were revealed as part of a scheme by the Sentry's old foe the [[General (Earth-616)|General]] and the mutant known as [[Jason Wyngarde (Earth-616)|Mastermind]] in {{cl|New Avengers #9}} & {{cl|New Avengers #10}}.</ref> When they all looked into it, they were shocked to learn that the Sentry had ties to their lives,{{r|New Avengers #7}} They managed to track the hero down and try to help him, but Black Bolt and his family were among members of the New Avengers, and X-Men who had come to ensure that there was no danger.{{r|New Avengers #8}} As the X-Man known as [[Emma Frost (Earth-616)|Emma Frost]] began trying to repair the Sentry's mind, the heroes were attacked by the [[Void (Dark Sentry) (Earth-616)|Void]], the Sentry's dark side personified.{{r|New Avengers #9}} Eventually the Sentry's mind was restored to normal, ending the threat of the Void, whom the Sentry seemingly destroyed.{{r|New Avengers #10}} Black Bolt and his family later chased the [[Olympian]] demi-god [[Hercules Panhellenios (Earth-616)|Hercules]] from the moon when he attempted to battle Lockjaw as part of a reality television show that recreated the 12 labors of Hercules.{{r|Hercules Vol 3 3}}\n\n==Death of Inhumans==\nWhen the [[Kree Empire]] began ordering all surviving Inhumans to join it or perish, the Inhuman Royal Family traveled to a secret meeting place on a faraway planet where they supposed to meet with the rest of the [[Universal Inhumans (Earth-616)|Universal Inhumans]] to discuss the situation. However, the leaders of the Universal Inhumans and their attendants were found dead, and a bomb was left behind as a trap. Lockjaw was able to teleport the Royal Family to safety but wasn't able to save Triton who died in the bomb blast. Medusa was also serious wounded by a piece of shrapnel and needed to be medically treated.\n\nThe Royal Family realized that while they were away, the Kree were attacking the Inhuman city of [[New Arctilan]] located on the Earth's Moon. The Royal Family hurried back to New Arctilan using Black Bolt's voice to increase their ship's speed. Lockjaw went on ahead to retrieve Maximus. Lockjaw arrived in time to rescue Maximus from the leader of the Kree's assualt, [[Vox (Super-Inhumans) (Earth-616)|Vox]]. Before Lockjaw and Maximus could escape, Vox killed them both. When the Royal Family arrived, New Arctilan was in ruins, causing Black Bolt to shed a tear.{{r|Death of Inhumans Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * See also: [[Inhuman Royal Family Tree|House of Agon's Family Tree]]\n}}\n[[Category:House of Agon]]"
                }
            }
        }
    ],
    "page_id": "811565"
}