{
    "pageid": 1092209,
    "ns": 0,
    "title": "Humanitech Robotics Inc. (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Humanitech Robotics Inc. (Earth-616) from Amazing Spider-Man Vol 1 791 001.jpg\n| Name                    = Humanitech Robotics Inc.\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = Formerly [[Xander Zynn (Earth-616)|Dr. Xander Zynn]]\n| CurrentMembers          = \n| FormerMembers           = [[Barbara Morse (Earth-616)|Bobbi Morse]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Dan Slott; Stuart Immonen\n| First                   = Amazing Spider-Man Vol 1 791\n\n| History                 = Humanitech was a start-up robotics company founded by [[Xander Zynn (Earth-616)|Dr. Xander Zynn]]. It employed [[Barbara Morse (Earth-616)|Bobbi Morse]] to design its security systems.\n\nZynn intended to make affordable artificial intelligence a reality with the invention of the [[Humanitron]]. To this end, Humanitech captured the supervillain [[Quicksand (Nguyet) (Earth-616)|Quicksand]] and split her into particles of smart sand which comprised the silicon matrix of each Humanitron.\n\nThe [[Daily Bugle (Front Line) (Earth-616)|Daily Bugle]]'s science section scored a guided tour around Humanitech's facilities due to Morse's boyfriend, [[Peter Parker (Earth-616)|Peter Parker]] being the Bugle's science editor. During the visit, Peter noticed the readouts of the Humanitron's A.I. looked extremely similar to actual human brain patterns. When a reporter attempted to take a look under the case of a Humanitron, the android lunged at him. Parker tackled the robot, but heard what appeared to be a cry from help from it.\n\nLater that day, Peter returned to Humanitech as Spider-Man and broke into the building with Mockingbird's help. While looking into the Humanitrons' A.I., the heroes were attacked by a horde of them. Spider-Man began cracking open the cases of the Humanitrons, and their matrices jumped out of the robots, bonding together and reforming into Quicksand. Spider-Man convinced Quicksand to spare Zynn's life at the moment, and she agreed in gratitude for being freed. Dr. Zynn ran far away, and Humanitech's resources were absorbed by [[Alchemax (Earth-616)|Alchemax]].{{r|Amazing Spider-Man Vol 1 791}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1092209"
}