{
    "pageid": 114015,
    "ns": 0,
    "title": "Hydra (Heroes Reborn) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Hydra\n| Aliases                 = \n\n| Leaders                 = [[Victor von Doom (Earth-616)|Dr. Doom]]\n| CurrentMembers          = \n| FormerMembers           = [[Mandarin (Heroes Reborn) (Earth-616)|Mandarin]], [[Madame Hydra (Heroes Reborn) (Earth-616)|Madam Hydra]], [[David Cannon (Heroes Reborn) (Earth-616)|Whirlwind]], [[Conner O'Reilly (Heroes Reborn) (Earth-616)|Rebel O'Reilly]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Anthony Stark (Earth-616)|Iron Man]], [[Bruce Banner (Earth-616)|Hulk]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = China\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Jim Lee; Scott Lobdell; Whilce Portacio\n| First                   = Iron Man Vol 2 1\n\n| History                 = When the Fantastic Four and the Avengers sacrificed their lives to destroy [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]], [[Franklin Richards (Earth-616)|Franklin Richards]], the son of the FF's [[Reed Richards (Earth-616)|Mr. Fantastic]] and [[Susan Storm (Earth-616)|Invisible Woman]] subconsciously created a pocket universe to save their lives. There they spent an entire year reliving living new lives \"reborn\" into a reality where they recently gained their abilities that vaguely mirror how they gained their powers originally.\n\nIn this new universe, Franklin created populated universe, including recreations of many of these heroes allies and foes. Among these creations was one based on the terrorist organization known as [[Hydra (Earth-616)|Hydra]].\n\nOn this world, Hydra was secretly backed by [[Victor von Doom (Earth-616)|Dr. Doom]], who placed a life-like robot dubbed the [[Mandarin (Heroes Reborn) (Earth-616)|Mandarin]] as the supposed leader of the organization. The organization's operations were organized and run by [[Madame Hydra (Heroes Reborn) (Earth-616)|Madame Hydra]]. Seeking to target US interests, they constantly attacked Stark International. The mega company was owned by [[Anthony Stark (Earth-616)|Tony Stark]], and was targeted due to his defense contracts. Following the death of Stark's colleague [[Conner O'Reilly (Heroes Reborn) (Earth-616)|Conner \"Rebel\" O'Reilly]] during a botched test run of Stark's new [[Prometheum Armor]], Hydra dug up Rebel's corpse and reanimated it as an armored cyborg for later use.\n\nHydra's first open attack on Stark International would be when they attempted to detonate a new experimental gamma bomb that was being developed for the government created by Stark employee [[Bruce Banner (Earth-616)|Bruce Banner]]. Banner would be locked in with the bomb and the resulting explosion would mutate him into the Hulk, while at the same time mortally wounding Stark, forcing him to put on a suit of Prometheum Armor and become the super-powered Iron Man.\n\nSeeking to get at Stark further, Madam Hydra would send her agent [[David Cannon (Heroes Reborn) (Earth-616)|Whirlwind]] to blackmail Stark. He would take Stark's secretary [[Virginia Potts (Heroes Reborn) (Earth-616)|Pepper Potts]] hostage, however Stark himself would defeat Cannon who would perish in the battle.\n\nWith the Mandarin demanding results, Madam Hydra would send Rebel out to attack Stark, injuring Stark's bodyguard [[Harold Hogan (Heroes Reborn) (Earth-616)|Happy Hogan]]. Iron Man would defeat Rebel, learn his true identity and the location of Hydra's headquarters. There, the two men would work together in destroying Hydra's operation. In the battle, the Mandarin would slay Madam Hydra and Rebel (in Stark's armor) would sacrifice his life to destroy the Mandarin, revealing himself as a robot. Stark, in Rebel's armor would then be confronted by Dr. Doom who would reveal his involvement with the organization. \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Heroes Reborn (1996 Event)]]\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "114015"
}