{
    "pageid": 304897,
    "ns": 0,
    "title": "Immortal Weapons (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Immortal Weapons (Earth-616) Iron Man 2.0 Vol 1 6.png\n| Name                    = Immortal Weapons\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Heart of Heaven]]\n\n| Leaders                 = [[Daniel Rand (Earth-616)|Iron Fist]], [[John Aman (Earth-616)|Prince of Orphans]]\n| CurrentMembers          = [[Daniel Rand (Earth-616)|Iron Fist]], [[Fat Cobra (Earth-616)|Fat Cobra]]\n| FormerMembers           = [[Steel Serpent (Davos) (Earth-616)|Steel Serpent]], [[Bride_of_Nine_Spiders_(Earth-616)|Bride of Nine Spiders]], [[John Aman (Earth-616)|Prince of Orphans]], [[Li Hua (Earth-616)|Tiger's Beautiful Daughter]], [[Sihing (Earth-616)|Dog Brother ＃1]],'''1920's:''' [[Crane Champion (Earth-616)|Crane Champion]], [[Orson Randall (Earth-616)|Iron Fist (Orson Randall)]], [[Bride of Nine Spiders (1920s) (Earth-616)|Bride of Nine Spiders (1920's)]], [[Tiger Empress (Earth-616)|Tiger Empress]]\n| Allies                  = [[James Rhodes (Earth-616)|War Machine]], [[Shang-Chi (Earth-616)|Shang-Chi]]\n| Enemies                 = [[Hydra (Earth-616)|Hydra]]\n\n| Origin                  = The Seven Capitals of Heaven\n| PlaceOfFormation        = [[K'un-Lun]]\n| PlaceOfDissolution      = \n| Creators                = Ed Brubaker\n| First                   = Immortal Iron Fist Vol 1 8\n| Last                    = \n\n| HistoryText             = \n===Origins===\n[[File:Original_Immortal_Weapons.jpg|left|thumb|Original Immortal Weapons]]\nThe champions of the [[Seven Capital Cities of Heaven]], each are skilled in martial arts and able to manipulate [[Glossary:Chi|Chi]] energy in various ways.{{r|Immortal Iron Fist Vol 1 8}} In the [[Heart of Heaven]] they battle each other as representatives of their cities in the [[Tournament of the Heavenly Cities]] held every 88 years when their cities merge.{{r|Immortal Iron Fist Vol 1 10}} The original Immortal Weapons used their Chi energy to open the gateway to the [[Eighth City]] to trap the evil of the world, [[Quan Yaozu (Earth-616)|Iron Fist (Quan Yaozu)]] stayed behind to lock the gates trapping him inside.{{r|Immortal Iron Fist Vol 1 22}}\n\n===1920's===\nIn the 1920's the cities merged, but one of the Immortal Weapon; [[Orson Randall (Earth-616)|Iron Fist (Orson Randall)]] refused to fight in the tournament, having been changed by seeing too much blood and violence in his time out of the city. When confronted by his would be opponents, attempting to strip him of his station, he lashed out, killing the [[Crane Champion (Earth-616)|Crane Champion]] of [[K'un-Zi]]. The [[Crane Mother (Earth-616)|Crane Mother]] swore revenge on the Iron Fist, as she could not produce another warrior for another 300 years.{{r|Immortal Iron Fist Vol 1 8}}\n \n===Modern Day===\nThe cities merged again and the the warriors were all called by to compete.{{r|Immortal Iron Fist Vol 1 10}} [[Davos (Earth-616)|Davos]] powers were restored by the [[Crane Mother (Earth-616)|Crane Mother]] in exchange for becoming the Champion of the mystical land of [[K'un-Zi]].{{r|Immortal Iron Fist Vol 1 8}} Each would face each other in various arena's.{{r|Immortal Iron Fist Vol 1 8}} He revealed that he now was known as the Steel Phoenix.{{r|Immortal Iron Fist Vol 1 9|10}} During his match with [[Li Hua (Earth-616)|Tiger's Beautiful Daughter]], he beats the girl soundly and she is about to yield, but Davos wanted her death not her submission. His left hand was cut off by her war fan but it did not stop him from defeating her and demonstrating his new powers. Lei Kung interrupts the fight and stops his son from killing the girl.{{r|Immortal Iron Fist Vol 1 11}}{{r|Immortal Iron Fist Vol 1 13|14}} Steel Phoenix was defeated by [[John Aman (Earth-616)|John Aman the Prince of Orphans]]. After the tournament had ended, he was able to rejoice for a while and even listen to the other Immortal Weapons' stories but it was short lived when John Amon revealed to them the Yu-Ti's activities and intentions.{{r|Immortal Iron Fist Vol 1 12}}\n\n===Hydra===\nLater, after saving the Celestial Cities from a Hydra plot to destroy them, he came to New York with Iron Fist like the other Weapons, where he fought with the Iron Fist against Ch'i-Lin, a mystic beast that kills the Iron Fist on his 33rd birthday and uses his heart to gain access to the dragon's egg, which he attempts to consume. At the [[Rand Corporation (Earth-616)|Rand Corporation]], and looked into [[Xaos (Earth-616)|Xaos]] learning he was descended from the [[Lightning Lords of Nepal (Earth-616)|Lightning Lords of Nepal]].{{r|Immortal Iron Fist Vol 1 16}} They helped Iron Fist against Zhou Cheng , the host of [[Ch'i-Lin]].{{r|Immortal Iron Fist Vol 1 19}} At Cheng's penthouse apartment they find a partial map to the Eighth City. But were nearly killed by a bomb.{{r|Immortal Iron Fist Vol 1 20}} At the gates of the Eighth City Weapons focused their chi energies to open the gateway. Weakened through the process they were unable to fight off a group of monstrous creatures. They are brought before their master [[Quan Yaozu (Earth-616)|Changming]]. They were forced into gladiatorial combat and only rescued on the brink of death.{{r|Immortal Iron Fist Vol 1 22}} The only way they could communicate with each other is through Morse code.{{r|Immortal Iron Fist Vol 1 23}} The witnessed a fight between Danny and Changming claimed was the first Iron Fist, [[Quan Yaozu (Earth-616)|Quan Yaozu]] [[Li Hua (Earth-616)|Tiger's Beautiful Daughter]] escaped and freed the others. They then attempted to escape{{r|Immortal Iron Fist Vol 1 24}} Working together they open the gateway, but was Changming's plan all along. Working together they are able to escape trapping the creatures in the Eighth City.{{r|Immortal Iron Fist Vol 1 25}}\n\n===Fear Itself===\nDuring the [[Fear Itself]] event, the doors to the Eighth City were on the verge of being opened again forcing the Immortal Weapons to reunite once again in Beijing with the addition of [[James Rhodes (Earth-616)|War Machine]] who had accompanied Prince of Orphans from Washington D.C. to close the gate. However, after being defeated by Titania and Absorbing Man, when the Immortal Weapons started the ceremony, Iron Fist had come under the possession of [[Agamotto (Earth-616)|Agamotto]] which was creating a mystical interference in preventing the Immortal Weapons from closing the gate. After Iron Fist overpowered the other Immortal Weapons, a reluctant War Machine fought him and due to Doctor Strange infusing some magic to War Machine's gun, it allowed for Iron Fist to be knocked out, allowing for the ceremony to be completed.{{r|Iron Man 2.0 Vol 1 5|7}}\n\n===Spider-Island===\nThey helped battle the mutated citizens of [[Manhattan]] during the [[Spider-Island (Event)|Spider-Island]] outbreak.{{r|Amazing Spider-Man Vol 1 672}} However the Bride of Nine Spiders turned against her allies attacked and kidnapped her teammates. When [[Shang-Chi (Earth-616)|Shang-Chi]] is tried to figure out what his recurring dream means, he learned from [[Silvija Sablinova (Earth-616)|Silver Sable]] that she has found possible locations in Manhattan for Bride of Nine Spider's lair.{{r|Spider-Island: Deadly Hands of Kung Fu Vol 1 1}} Although Shang-Chi defeated Bride of Nine Spiders and freed Iron Fist, he discovered that the person who was responsible is the demon [[Ai Apaec (Earth-616)|Ai Apaec]] who wanted to feed off the Immortal Weapons. As Shang-Chi confronted Ai Apeac, Iron Fist desperately rushed to free the other Immortal Weapons. Shang-Chi mutated into a spider during the battle, but Iron Fist uses his Chi force to cure Shang-Chi, leaving Iron Fist weakened. After Iron Fist and the rest of the Immortal Weapons are evacuated, Shang-Chi collapses the hide-out on top of Ai Apaec.{{r|Spider-Island: Deadly Hands of Kung Fu Vol 1 2}}\n\n===Defenders===\nIn a timeline where Iron Fist joined the Defenders, the Prince of Orphans foresaw a disaster and tried to kill his allies. However, the Prince assumed he was working with the Immortal Weapons and killed them. The Prince of Orphan's prophecy came true, but Dr Strange used the chaos of the disaster to create a new timeline, in which the Defenders never reformed.{{r|Defenders Vol 4 12}}\n\n==Members==\n* [[Iron Fist]]: [[Daniel Rand (Earth-616)|Danny Rand]], 66th in the line of living weapons of the city of [[K'un-Lun]].\n* [[Bride of Nine Spiders]]: Her heart pumps the coldest blood imaginable, and horrors inconceivable to mortal men. She hails from the [[Kingdom of Spiders]] located at the entrance in the [[Valley of Gates]].\n* [[Tiger's Beautiful Daughter]]: Many a man has found his doom at her hand, or in her bed. [[Tiger Island]] is a tropical paradise.\n* [[Fat Cobra]]: His size and strength are only outclassed by his speed. Cobra Warrior of [[Peng Lai]] Island.\n* [[Dog Brother ＃1]]: Hero to all the strays on all the streets of the world, a prankster assassin who rules the [[Under City]].\n* [[Prince of Orphans]]: Mysterious, even to those who cultivate unending mystery. He is the oldest living Immortal Weapon having participated in a past Tournament of the Heavenly Cities. Hails from the jungle city of [[Z'Gambo]].\n* [[Davos (Earth-616)|Crane]]: Davos the Steel Serpent was known as the \"Steel Phoenix\" while serving as the honorary champion in the Tournament of the Heavenly Cities for the Mystical City of [[K'un-Zi]], which had lacked an Immortal Weapon since [[Orson Randall (Earth-616)|Orson Randall]] killed the previous Crane and [[Crane Mother (Earth-616)|Crane Mother]] only gives birth to a new one once every 300 years. Since the tournament the title of The Crane has remained unfilled.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Sword, Fans, Spiders\n\n| Notes                   = * Each of the Immortal Weapons possesses great mastery of [[Glossary:Chi|Chi]] and their own unique abilities, each handed down from their predecessors.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Fear Itself]]\n[[Category:Mystical Organizations]]\n[[Category:Tournament of the Heavenly Cities]]\n[[Category:K'un-Lun Organizations]]"
                }
            }
        }
    ],
    "page_id": "304897"
}