{
    "pageid": 1008239,
    "ns": 0,
    "title": "Imperial Guard of Seknarf Seven (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Imperial Guard of Seknarf Seven (Earth-616) from Totally Awesome Hulk Vol 1 15 001.jpg\n| Name                    = Imperial Guard\n| Title                   = [[Imperial Guard of Seknarf Seven]]\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Seknarf Seven]]\n\n| Leaders                 = [[Phalkan (Earth-616)|Phalkan]]\n| CurrentMembers          = [[Blargon (Earth-616)|Blargon]], numerous unnamed members\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Protectors (Earth-616)|Protectors]], [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight Space Program]]\n\n| Origin                  = [[Seknarfians]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Greg Pak; Mahmud Asrar\n| First                   = Totally Awesome Hulk Vol 1 15\n| Last                    = \n\n| HistoryText             = Led by their prince regent, [[Phalkan (Earth-616)|Phalkan]], the Imperial Guard of Seknarf Seven invaded the [[Earth]] with to abduct some of its inhabitants for food supply. Even though they were effortlessly deal with by the group of heroes that would become the [[Protectors (Earth-616)|Protectors]], the battle proved to be a distraction that allowed Phalkan to activate a set of spears that teleported the heroes, numerous bystanders and a portion of the ground they were standing in to [[Seknarf Seven]].\n\nWith Hulk, his allies and numerous bystanders captured, Phalkan announced that they had become a food colony for their planet, ordering them to offer three of their number after six hours had passed.{{r|Totally Awesome Hulk Vol 1 16}}\n\nPhalkan and the Imperial Guard returned earlier after discovering that the humans were up to something. When the heroes, now dubbed the [[Protectors (Earth-616)|Protectors]], fought back, Phalkan disabled the gravity generator, and threatened to do the same to the atmosphere generator unless the offering was given to him. Amadeus Cho was one of the three humans that surrendered. However, their offering turned out to be a ruse to catch Phalkan off-guard. The humans had managed to tinker with the machinery that provided life-support to disrupt the shielding that kept Cho depowered. Amadeus Hulked-out and knocked down Phalkan, unleashing a battle between the Imperial Guard and the Protectors.{{r|Totally Awesome Hulk Vol 1 17}}\n\nThe Imperial Guard focused their efforts on taking down the Hulk, but their armors were fried when he unleashed a blast of gamma radiation after reaching the necessary level of anger. With the villains hindered, the rest of the humans started to fight back. [[James Woo (Earth-616)|Jimmy Woo]] even got close to killing Phalkan. Hulk stopped the fight, arguing they shouldn't stoop to their level. [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight]] forces subsequently arrived, after having received an S.O.S. from Woo earlier, and arrested Phalkan and the Imperial Guard.{{r|Totally Awesome Hulk Vol 1 18}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Seknarfians]]"
                }
            }
        }
    ],
    "page_id": "1008239"
}