{
    "pageid": 486335,
    "ns": 0,
    "title": "Irish Republican Army (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Irish Republican Army (Earth-616) from Web of Spider-Man Vol 1 22 0001.jpg\n| Name                    = [[Irish Republican Army]]\n| Aliases                 = [[IRA]], Provisional IRA, Provos\n\n| Leaders                 = \n| CurrentMembers          = [[Character Index/B#Brian|Brian]], [[Character Index/S#Sean|Sean]]\n| FormerMembers           = [[Paddy O'Hanlon (Earth-616)|Gael (Paddy O'Hanlon)]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n| Enemies                 = [[Sean Cassidy (Earth-616)|Banshee]], [[British Army (Earth-616)|British Army]], the Loyalists ([[Ulster Volunteer Force (Earth-616)|Ulster Volunteer Force]], [[Red Hand Commando (Earth-616)|Red Hand Commando]], [[Ulster Freedom Fighters (Earth-616)|Ulster Freedom Fighters]])\n\n| Origin                  = Paramilitary/Terrorist organization\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Ireland]], [[Northern Ireland]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Carl Pfeufer\n| First                   = Sub-Mariner Comics Vol 1 9\n\n| History                 = \n===Preface<ref>Notes adapted from the [[Wikipedia:List of organisations known as the Irish Republican Army|IRA Wikipedia]] page</ref>===\n\nThe Irish Republican Army (IRA) is an Irish terrorist group fighting for the unity of [[Ireland]], by the reunification of the [[Northern Ireland]], also known as Ulster. It first incarnation was a legitimate army belonging to the Republic of Ireland. \n\nIn 1921 they became a rebellion against the Anglo-Irish Treaty between the United Kingdom and Ireland and fought a bloody civil war, and later resisted British interference in the region until the 1960s. Since then there have been many divisions in the organization over the decades. The \"original\" incarnation adopting Marxist ideals in 1969 and becoming a legitimate political party by the 1970s. The more reactionary Provisional IRA, which ran from 1969. \n\nAnother rift in the organization happened when the PIRA ceased its practice of abstentionism leading to another offshoot calling themselves the Continuity IRA in 1986. Another group calling themselves the \"Real\" IRA in 1997 also formed to oppose the peace process between Northern Ireland and the Republic of Ireland, using violence and intimidating leading to secretarial clashes between the Catholic and Protestant divide in both countries. As of 2011, members of the PIRA also formed yet another faction resuming hostilities toward the continued British rule of Northern Ireland. \n\n===[[World War II]]===\nIn the spring of 1943, [[National Socialist German Workers Party (Earth-616)|Nazi]] spies operating in Ireland sought to sour Irish-American relations by causing a number of bombings in Ireland and framing the IRA for them and then using rabble rousing to turn the Irish public against IRA. This plot almost worked had it not been for the intervention of the [[Namor McKenzie (Earth-616)|Sub-Mariner]] whom was framed as a member of the IRA. He broke out of prison and with the assistance of key members of the IRA helped prevent Nazi [[Von Klutz (Earth-616)|Von Klutz]] from blowing up a reservoir. Namor rounded up the Nazis in the area and turned them over to the authorities clearing the IRA of any wrong doing{{r|Sub-Mariner Comics #9}}.\n\n===Provisional Irish Republican Army===\nDuring the worst of the \"[[Troubles]]\" in Northern Ireland, the Provisional IRA (the successor to the IRA) and other Republican groups, used the relatively open border to evade authorities on both sides.{{r|Marvel Atlas #1|; [[Ireland]]'s entry}} In recent history, a Provisional IRA attack claimed the life of [[Maeve Rourke (Earth-616)|Maeve Rourke-Cassidy]] the wife of future [[X-Men (Earth-616)|X-Man]] [[Sean Cassidy (Earth-616)|Banshee]].{{r|Classic X-Men #16}}\n\nMuch later, [[Deborah Harris (Earth-616)|Deborah Harris']] niece [[Glorianna O'Breen (Earth-616)|Glorianna O'Breen]] fled Ireland to avoid persecution from the IRA as they believed that she had become a traitor to the cause. They had sent agents after her in New York, among them the sadistic [[Paddy O'Hanlon (Earth-616)|Paddy O'Hanlon]] also known as The Gael to eliminate her. They were stopped thanks to the intervention of [[Matthew Murdock (Earth-616)|Daredevil]].{{r|Daredevil #205}} [[Bridget Malone (Earth-616)|Bridget Malone]] was wanted under suspicion that she had participated in IRA terrorism. Fleeing from the police was what led her to the [[Kestrel Key of Krakkan]], that turned her into Conquest.{{r|Avengers Vol 3 #25}}\n\nDuring this time, the Provisional IRA had relationships with various foreign terrorist groups and terrorist-supporting states, such as Colonel Gaddafi and possibly [[Al-Qaeda (Earth-616)|Al Qaeda]]. As the fighting continued, the Provisional IRA and the other paramilitary groups realized that they needed financing to carry on the fight. The groups turned to smuggling cocaine for the Colombians and within Belfast itself the drug trade, prostitution, loan-sharking, and porngoraphy. Since the ceasefire, the political conflict mutated into a gang war over territory.{{r|Punisher Vol 6 18}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = * The original Irish Republican Army was active from 1922 till 1969 when it split into the Provisional IRA (Marxist) and the Official IRA. The former continued operating till 1972, and Provisional IRA remained active till 2005. It has observed the cease fire since then, which ended its campaign of political terrorism. Law enforcement reports it now operates as an organized crime group, in the rackets of Belfast.\n| Links                   = \n* [[Wikipedia:Provisional Irish Republican Army|Provisional IRA at Wikipedia.org]]\n}}\n[[Category:Historical Organizations]]\n[[Category:Terrorist Organizations]]\n[[Category:Irish Organizations]]\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "486335"
}