{
    "pageid": 802320,
    "ns": 0,
    "title": "Kaxton Laboratories (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Kaxton Laboratories\n| Aliases                 = Kaxton Industries\n\n| Leaders                 = [[Carl Kaxton (Earth-616)|Carl Kaxton]]\n| CurrentMembers          = \n| FormerMembers           = [[Wilbur Day (Earth-616)|Wilbur Day]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| Alignment               = \n| BaseOfOperations        = [[New York City]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Daredevil Vol 1 8\n\n| History                 = Kaxton Laboratories was a company formed by [[Carl Kaxton (Earth-616)|Carl Kaxton]]. [[Wilbur Day (Earth-616)|Wilbur Day]]  a former employee  invented [[Stilt-Man's Suit|hydraulic lifts]] which his boss Kaxton had stolen the patents. [[Matthew Murdock (Earth-616)|Matt Murdock]] was hired by Wilbur, he contacted Kaxton to tell him that his former employee intends to sue him, a threat which Kaxton encourages them to follow through on.Later in his Daredevil guise, he unsuccessfully battled Stilt Man, who manages to get away once again. Later, when meeting with Wilbur again, Kaxton arrives at the office to contest the law suit. While the two argue over who owns the rights to the [[Stilt-Man's Suit|hydraulic device]], Matt notices that one of them is lying due to an irregular heart beat, but can't figure out which one is the liar because they are too close together.\n\nFollowing Kaxton as Daredevil, he's quickly shaken off by Kaxton who realizes he's being followed. Daredevil cannot resume his tailing because of reports that Stilt Man is causing havoc again. He again fails to stop Stilt Man. Returning to Day, the two go to confront Kaxton directly. There they find the hydrolic lifts, which turn out to be Stilt Man's stilts.Attacked by Kaxton with a gun, Day manages to knock Kaxton out, and then reveals to Murdock that he's really Stilt Man, and that he came to steal a shrinking device from Kaxton before knocking Murdock out. Taking the device and making a run for it in his stilts, Day is followed by Daredevil and in the battle, the shrinking ray is turned on Day who shrinks so small that he disappears from sight.Returning to the Nelson and Murdock law office, Matt is confronted by Kaxton, but Murdock tells him that Day has dropped the law suit and they decide to let the whole thing go.{{r|Daredevil Vol 1 8}}\n\nKaxton later moved out west to San Francisco with his daughter Barbara, reopening Kaxtion Laboratories there but under the assumed named of William Klaxton.  This was hardly enough to fool Stilt-Man, who took the “Klaxtons” hostage and attempted to force his old boss to rebuild the molecular condenser, his shrinking ray, with which to blackmail the city.  Fortunately, Daredevil again came to the rescue, alongside his partner the Black Widow, defeating the Silt-Man and ending his blackmail schemes.  The molecular condenser, meanwhile, was found by a homeless man, who tossed it in the trash, thinking it was a child’s toy.{{r|Daredevil Vol 1 102}}\n\nPresumably, Kaxton and his lab still operates on the west coast. \n\n\n| Equipment               = * '''[[Stilt-Man's Suit]]'''\n| Transportation          = \n| Weapons                 = \n| Notes                   = \n\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Companies]]\n[[Category:Laboratories]]"
                }
            }
        }
    ],
    "page_id": "802320"
}