{
    "pageid": 316190,
    "ns": 0,
    "title": "Killing Squad (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Killing Squad (Earth-616) from Adventures of Captain America Vol 1 2 0001.jpg\n| Name                    = Das Vernichtungs-Kommandos  \n| Aliases                 = Killing Squad (translation of name), [[Death Squad]]\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Maryland (State)|Maryland]]; [[Paris (France)|Paris]], [[France]]\n\n| Leaders                 = [[Agent X]]\n| CurrentMembers          = \n| FormerMembers           = [[Blitzkrieg (Nazi) (Earth-616)|Blitzkrieg]]; [[Saurespritze (Earth-616)|Säurespritze]]; [[Zahnmorder (Earth-616)|Zahnmörder]]\n| Allies                  = [[Cynthia Glass (Earth-616)|Agent X]]; [[Johann Shmidt (Earth-616)|The Red Skull]]; [[Adolf Hitler (Earth-616)|Adolf Hitler]]; the Master Interrogator\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]]; [[James Buchanan Barnes (Earth-616)|Bucky Barnes]]; [[James Fletcher (Earth-616)|Colonel James Fletcher]]\n| Origin                  = \n| PlaceOfFormation        = [[Berlin]], [[Germany]]\n| PlaceOfDissolution      = [[Paris (France)|Paris]], [[France]]\n| Creators                = Fabian Nicieza; Kevin Maguire\n| First                   = Adventures of Captain America #1\n| Last                    = Adventures of Captain America #4\n\n| HistoryText             = '''Das Vernichtungs-Kommandos''', or Killing Squad, was a super-villain team that existed during the early part of [[World War II]]. The three team members consisted of [[Blitzkrieg (Nazi) (Earth-616)|Blitzkrieg]], [[Saurespritze (Earth-616)|Säurespritze]] and [[Zahnmorder (Earth-616)|Zahnmörder]]. They were assigned by the [[Johann Shmidt (Earth-616)|Red Skull]] and [[Cynthia Glass (Earth-616)|Agent X]] to find the assistants of the late [[Abraham Erskine (Earth-616)|Abraham Erskine]] and gain from them knowledge of the [[Glossary:S#Super_Soldier_Serum|Super Soldier Serum]]. <ref>''{{cl|Adventures of Captain America #1}}''</ref>\n\nIn early March of 1941, Agent X's superior, the Red Skull, learned of the secret U.S. military program known as [[Operation Rebirth|Project: Rebirth]]. Seeking to acquire the project's secrets to create his own army of super-soldiers, he sent the Killing Squad to the [[United States of America|United States]] to steal the formula that transformed scrawny Steve Rogers into the muscle-bound [[Steven Rogers (Earth-616)|Captain America]].\n\nThe creator of Project: Rebirth's Super Soldier Serum, Doctor Abraham Erskine, had already been assassinated by a [[National Socialist German Workers Party (Earth-616)|Nazi]] agent. Before his passing however, he gave each of his research assistants a part of the formula. He entrusted the complete formula, as well as the secret of his [[Glossary:Vita-Rays|Vita-Ray]] research to one man, Colonel [[James Fletcher (Earth-616)|James Fletcher]]. \n\nThe Killing Squad systematically sought out all of Erskine's associates. Säurespritze broke into the home of a scientist named Anderson and murdered him while he was taking a shower. Blitzkrieg intercepted an Army convoy transporting a scientist named Doctor Keller to a safe house. He killed Keller with his electric barbs as well as the military personnel assigned to protect him.\n\nWhen the Red Skull discovered that Colonel Fletcher possessed the complete formula, he sent the Killing Squad to the Project: Rebirth facility to abduct him. Säurespritze turned his acid upon a soldier named Billy, killing him, while his two compatriots got to work capturing Colonel Fletcher. Zahnmörder had been hoping to get his hands on Captain America himself, but satisfied himself nonetheless by slaughtering several military officers.\n\nThey brought him to a hidden safe house where they interrogated him at length. Fletcher managed to escape, but Blitzkrieg entangled Fletcher in his electro-cables as the soldier dived out the window. Both men fell to the ground, but survived. Blitzkrieg's cable was still attached to Fletcher as he entered a vehicle and began to drive off. The Nazi sent another electrical surge down the conduit that caused the car to explode. Fletcher survived, but Blitzkrieg and the others tracked him to a local eatery called Smyth Diner. Säurespritze captured Fletcher and collectively, they slaughtered everybody else in the establishment to send a message to Captain America. The Killing Squad then brought their prisoner to a Nazi compound in occupied [[Paris (France)|Paris]], France.{{r|Adventures of Captain America #2}}\n\nAlong with another Nazi agent known as the Master Interrogator, the Killing Squad continued to torture Colonel Fletcher, but he refused to yield the secrets of the Super Soldier Formula. Fletcher was able to escape once again, but his freedom was short-lived as he flung himself through a window to his death. The complete Super Soldier Formula died with him.{{r|Adventures of Captain America #3}}\n\nCaptain America, arriving too late to save Fletcher, raided the Nazi compound and fought against the Killing Squad. Säurespritze tried to get Cap in a strangle-hold, but the hero pushed himself and his assailant backward over a staircase banister. When Säurespritze landed, he shattered the backpack cylinder containing his corrosive arsenal and was killed by his own acid. Blitzkrieg fired his electro-dart at Captain America, but the hero deflected it with his shield. The assailants continued to exchange blows with one another and Säurespritze was killed during the fight. Cap ran out of the compound onto the streets of Paris, but Blitzkrieg and Zahnmörder stayed close behind. As they approached the [[Eiffel Tower]], Blitzkrieg fired his electro-dart again, but his battery pack malfunctioned, causing a power surge that electrocuted him. Zahnmörder maintained his pursuit of Captain America and followed him up the Eiffel Tower. Waiting for them at the top of the tower however was Zahnmörder's supreme commander, the Red Skull. Unimpressed with Zahnmörder's inability to defeat the American super-hero, the Skull shot him in the forehead and Zahnmörder's body plummeted to the ground. With the death of Zahnmörder, the Killing Squad was no more.{{r|Adventures of Captain America #4}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each member of the team was equipped with his own arsenal. Blitzkrieg wore a battery pack that enabled him to fire razor-tipped electrified cables. Säurespritze possessed a gauntlet that could project highly corrosive acid and Zahnmörder wore a special glove that housed several bladed weapons.\n\n| Notes                   = \nRetroactively, the three members of the [[Killing Squad (Earth-616)|Killing Squad]] are the first costumed super-villains to ever fight up against Captain America.\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "316190"
}