{
    "pageid": 967665,
    "ns": 0,
    "title": "Knights Templar (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Knights Templar (Earth-616) from Ares Vol 1 3 0001.jpg\n| Name                    = [[Knights Templar]] \n| Aliases                 = [[Templars]]{{r|Werewolf by Night Vol 2 1}}\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = [[Cadre (Earth-616)|Cadre]]\n| Enemies                 = \n\n| Origin                  = Militant order\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[London (England)|London]], [[England]], [[United Kingdom]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Alan Zelenetz; Bob Hall\n| First                   = Thor #330\n\n| Overview                = The '''Knights Templar''' were among the wealthiest and most powerful of the Christian military orders in [[Europe]] during the [[Middle Ages]]. They were officially endorsed by the [[Catholic Church (Earth-616)|Catholic Church]].{{citation}} The Knights wore distinctive white mantles with a red cross.\n| History                 = \n===[[Crusades]]===\nThey were one of the many groups to take part in the invasion of the holy lands in the middle east.{{r|Ares #3}}\n\nDuring the Crusades the Knights Templar attempted and invasion of the African nation of [[Wakanda]]. They were unable to defeat the tiny african nation as they defeated the European invaders with ease.{{r|Fantastic Four #608}}\n\nThe [[Raven's Eye]] was part of the Knights Templars' loot. They they were later slaughtered and it moved east into [[Russia]].{{r|Thor Vol 1 498}}\n\n===Modern Age===\n[[File:Blackwoods from Thor Vol 1 330.jpg|250px|thumb|right|Arthur with his sword drawn.]]\n[[Arthur Blackwood (Earth-616)|Arthur Blackwood]] visited his family crypt to meditate on his life. There he had a religious vision of all of his ancestors who devoted their lives to serving [[Yahweh (Earth-616)|God]]. In this vision he met the spirit of one of his ancestors who served in the Crusades. This spirit seemingly bequeathed to him the combined power of all his ancestors and dubbed him knight. When Blackwood awoke from this vision, he discovered a sword, shield, and knight's raiment had inexplicably materialized nearby. Blackwood decided to take up the sword and use his newfound power to destroy all pagans and infidels. As his first target, he chose the thunder god [[Thor Odinson (Earth-616)|Thor]], whose claims of godhood seemed blasphemous.{{r|Thor #330}} Calling himself the Crusader, Blackwood attacked Thor at a public assembly. Somehow the strength of his faith granted him sufficient power not only to hold his own in pitched battle with the [[Asgardian]], but also to inflict upon Thor a seemingly mortal wound. When Thor reappeared a short time later, his wound fully healed by the power of [[Odin Borson (Earth-616)|Odin]] the Crusader's belief in his own infallibility was shaken. The Crusader was unable to comprehend how a supposed agent of the devil like Thor could be superior to him, a self-styled messenger of the Lord. When Thor shattered the Crusader’s sword, the Crusader fled, filled with doubts about the righteousness of his cause.{{r|Thor #331}}\n\nAt the doorstep of an [[Upstate New York]] monastery that was associated with the Knights Templar, an unidentified woman left a trio of [[Hellbent]] infants. The three Hellbent, [[Ard (Earth-616)|Ard]], [[Dementia (Tia) (Earth-616)|Tia]], and [[Vor (Earth-616)|Vor]] played within the monastery, continuing under the supervision of Gregori and Lauria. Once they discovered their powers and became known as the [[Cadre (Earth-616)|Cadre]], they left the monastery heading to [[Manhattan]]. Meanwhile, [[Seth Phalkon (Earth-616)|Set]] led a group of Hellbent into the upstate New York monastery and slaughtered the Templar stationed there. The next day, [[Chloe Tran (Earth-616)|Chloe Tran]] accompanied the Hellbent trio back to their former home, where they found the corpses of Gregori and the rest of the monks stationed there. While Dementia, Shard, and Vortex dealt with their loss, Chloe checked the Archives and was surprised to find that even the back-up files on the trio were incomplete.{{r|Web of Spider-Man Annual #9}} \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:French Organizations]]\n[[Category:British Organizations]]\n[[Category:Historical Organizations]]\n[[Category:European Organizations]]\n[[Category:Catholicism]]\n[[Category:Crusades Characters]]\n[[Category:Orders of Knights]]"
                }
            }
        }
    ],
    "page_id": "967665"
}