{
    "pageid": 347749,
    "ns": 0,
    "title": "Knights of the Atomic Round Table (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Knights of the Atomic Round Table (Earth-616) from Fantastic Four Vol 2 5 0001.jpg\n| Name                    = [[Knights of the Atomic Round Table]]\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[State University (Hegeman)|State University]] on [[Counter-Earth (Heroes Reborn)|Counter-Earth]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Victor von Doom (Earth-616)|Victor von Doom]], [[Reed Richards (Earth-616)|Reed Richards]], [[Henry Pym (Earth-616)|Henry Pym]], [[Anthony Stark (Earth-616)|Tony Stark]], [[Bruce Banner (Earth-616)|Bruce Banner]], [[Conner O'Reilly (Heroes Reborn) (Earth-616)|Conner \"Rebel\" O'Reilly]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = Unofficial title for the assemblage of Counter-Earth's greatest scientific minds.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jim Lee; Brandon Choi\n| First                   = Fantastic Four Vol 2 5\n| Last                    = Captain America Vol 2 12\n\n| HistoryText             = When the Fantastic Four and the Avengers sacrificed their lives to destroy [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]], [[Franklin Richards (Earth-616)|Franklin Richards]], the son of the FF's [[Reed Richards (Earth-616)|Mr. Fantastic]] and [[Susan Storm (Earth-616)|Invisible Woman]] subconsciously created a pocket universe to save their lives. There they spent an entire year reliving living their new lives \"reborn\" into a reality where they recently gained their abilities that vaguely mirror how they gained their powers originally.\n\nIn this pocket-dimension history would unfold in a way that the greatest minds of those who sacrificed themselves in the Onslaught event would attend the same school and have a close relationship prior to being \"reborn\" as that worlds greatest heroes. These men would include [[Reed Richards (Earth-616)|Reed Richards]], [[Anthony Stark (Earth-616)|Tony Stark]], [[Henry Pym (Earth-616)|Henry Pym]], [[Bruce Banner (Earth-616)|Bruce Banner]] and [[Victor von Doom (Earth-616)|Victor von Doom]]. Rounding the group would be [[Conner O'Reilly (Heroes Reborn) (Earth-616)|Conner \"Rebel\" O'Reilly]], a being unique to Counter-Earth, who was friends with Tony Stark.\n\nThe group would work together on a group project to develop an exo-suit, a piece of personal armor. However, none could come to an agreement on how the armor should be used. Stark would wish to profit off the armor, while Richards wished to use it for the betterment of mankind, while Doom wanted to use the technology to take over his home country of [[Latveria]]. Ultimately the group fell apart, each member going on to their own independent areas of expertise. Stark and O'Reilly would continue to work on a suit of personalized armor, developing what would eventually become the [[Prometheum Armor]]. Doom would mock them when news would come out that the Russian government had developed their own suit of personal armor.\n\nDoom himself would continue on with his own experimental armor, and one day while attempting to activate it on his own he'd be interrupted by Reed Richards. Doom would ask Richards to assist in his glory, however Richards would refuse, and then point out an error in his calculations. Scoffing at this notion, Doom would attempt to activate the armor, causing an explosion that would horribly scar his entire body. For his reckless actions Doom was expelled from State University.\n\nThe group would drift apart and in modern times they would all become important members of the newly formed super-hero community:\n\n* Reed Richards would develop the Excelsior warp-drive ship and be involved in an accident that would find himself and his crew bombarded with nuclear radiation and the [[Power Cosmic]] changing them all into the [[Fantastic Four (Earth-616)|Fantastic Four]] whom Reed would lead as Mr. Fantastic.\n\n* Tony Stark and \"Rebel\" O'Reilly would develop complete their Prometheum Armor. O'Reilly, the memory of Russia's advancement, would take the armor out on an unauthorized trip into Russian airspace and clash with [[Boris Bullski (Heroes Reborn) (Earth-616)|Titanium Man]]. The armor would be damaged causing it to malfunction during it's first official test, and kill O'Reilly. Stark would become a ruthless CEO of Stark International, but eventually have a literal and figurative change of heart when an attack by [[Hydra (Heroes Reborn) (Earth-616)|Hydra]] would lodge shrapnel in his heart forcing him to wear the Prometheum Armor to survive. He would become the hero Iron Man and eventually join the [[Avengers (Heroes Reborn) (Earth-616)|Avengers]]. O'Reilly would be resurrected by Hydra and sent against Stark, but the two would crush the organization at the seeming death of O'Reilly once more.\n\n* Henry Pym would go off to gain an expertise in size-changing and robotics, eventually dating [[Janet Van Dyne (Earth-616)|Janet van Dyne]]. He would develop the android [[Vision (Earth-616)|Vision]] and the robot [[Ultron (Heroes Reborn) (Earth-616)|Ultron]] and be hired by [[Strategic Hazard Intervention Espionage Logistics Directorate (Heroes Reborn) (Earth-616)|SHIELD]] to join the Avengers as their support staff. He would ultimately join their ranks as Ant-Man.\n\n* Bruce Banner would become an expert in gamma radiation and begin working for Stark International. There during the same Hydra attack that would birth Iron Man, Banner would be exposed to a lethal amount of gamma radiation, causing him to become the man/monster known as the Hulk.\n\n* Victor von Doom, would end up seeking out a Tibetan monastery where it was said that they could treat the constant pain his horribly maimed body suffered. He would ultimately develop a suit of armor of his own, and now calling himself Dr. Doom, would take over his home country of Latveria.\n\nEach member would cross paths many times during their heroic careers, however they would officially (minus the then deceased O'Reilly) reunite to work together in building the Ultimate Nullifier weapon to combat the threat of [[Galactus (Heroes Reborn) (Earth-616)|Galactus]] when he had come to devour the Earth. \n\nFollowing the defeat of Galactus, all the members of the Atomic Knights would ultimately return to their native reality of [[Earth-616]] to resume their super-heroic activities there. Doom for a time would briefly control Counter-Earth before abandoning it. Rebel would be resurrected once more and has been active as a resistance fighter against [[Master Man (Heroes Reborn) (Earth-616)|Master Man]] and later an enforcer for Doom during the time that he ruled Counter-Earth.  \n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Think Tanks]]"
                }
            }
        }
    ],
    "page_id": "347749"
}