{
    "pageid": 857066,
    "ns": 0,
    "title": "Knights of the Infinite (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Knights of the Infinite (Earth-616) from New Avengers Vol 4 3 001.jpg\n| ImageSize               = 250px\n| Name                    = Knights of the Infinite\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Castle Tarnala]], Forbidden Asteroids, [[Andromeda Galaxy]]\n\n| Leaders                 = \n| CurrentMembers          = [[K'kyy (Earth-616)|K'kyy]], [[Lan-Zarr (Earth-616)|Lan-Zarr]], [[Mur-G'nn (Earth-616)|Mur-G'nn]], [[Varra (Earth-616)|Varra]]\n| FormerMembers           = [[Dorrek Supreme (Earth-616)|Dorrek Supreme]], [[M'ryn (Earth-616)|M'ryn the Magus]], two other unnamed members\n| Allies                  =  [[New Avengers (A.I.M.) (Earth-616)|New Avengers]], [[Kree/Skrull Alliance (Earth-616)|Alliance]]\n| Enemies                 = [[Moridun (Earth-616)|Moridun]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Ewing; Gerardo Sandoval\n| First                   = New Avengers Vol 4 3\n| Last                    = \n\n| HistoryText             = The Knights of the Infinite were a group of [[Deviant Skrulls|Skrull]]/[[Kree]] hybrids gathered together over time by the very first of their kind, [[Dorrek Supreme (Earth-616)|Dorrek Supreme]]. The objective of Dorrek was to shape this group of outcasts into heroes dedicated to uniting the two warring empires. As time passed, the Knights started believing in the prophecy that once the Skrull and the Kree empires fell, the Knights were destined to unify and protect the two empires, under the leadership of he who managed to take up Dorrek Supreme's sword, [[Excelsior (Star-Sword)|Excelsior]], a feat that would prove him as the reincarnation of Dorrek Supreme.{{r|New Avengers Vol 4 4}} The Knights eyed the first royal hybrid in thousands of years, [[Theodore Altman (Earth-616)|Dorrek VIII]], known to Earthers as the super hero [[Hulkling]].{{r|New Avengers Vol 4 3}}\n\nFollowing the destruction of the Kree capital planet [[Hala (Planet)|Hala]], the Knights were anxious to recruit Dorrek VIII to become their king. However, the elder [[M'ryn (Earth-616)|M'ryn the Magus]], who had created the prophecy, tried to postpone its fulfillment, because another part of the prophecy he maintained secret from the Knights involved his death. The Knights decided to part anyways, and they travelled to Earth and kidnapped Hulkling, and his boyfriend [[William Kaplan (Earth-616)|Wiccan]] by accident. The Knights returned to their base of operations, the Forbidden Asteroids, apologized for the kidnapping, and showed Hulkling the test he had to pass in order to see if he was truly the chosen one: pulling Excelsior from a stone. Hulkling passed the test, and the Knights kneeled before him.{{r|New Avengers Vol 4 3}}\n\nWhen the Knights returned to their home, [[Castle Tarnala]], they discovered the corpse of M'ryn possessed by the evil wizard [[Moridun (Earth-616)|Moridun]]. Any attempts at damaging Moridun were in vain, and the creature soon absorbed enough power to grow in size, destroying the castle from the inside out. Hulkling and Wiccan's teammates, the [[New Avengers (A.I.M.) (Earth-616)|New Avengers]], joined the brawl against Moridun, to no avail. After accidentally absorbing an energy blast from Moridun with Excelsior, he realized he could use it against Moridun. The New Avengers distracted Moridun long enough to allow Hulkling to stab him in the face, seemingly killing the creature.\n\nOnce the dust settled, the Knights buried those lost to Moridun and allowed Hulkling to leave, explaining that the young hero had a duty to his friends, and he wouldn't be their king if he was capable of abandoning that. Before biding farewell, [[Lan-Zarr (Earth-616)|Lan-Zarr]] promised that when the time was right, the Knights of the Infinite would fight at his side.{{r|New Avengers Vol 4 4}}\n\n| Equipment               = The Knights of The Infinite utilize a blend of Kree and Skrull technologies which is operated by either a blend of science magic or some form of low level reality warping.\n| Transportation          = '''Knight Ship:''' The knights possess a half-a-mile wide space vessel capable of masking its presence and entering planetary orbit without detection, has faster than light transport.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * The Knights of the Infinite appear to be named after characters from the legends of [[wikipedia:King Arthur|King Arthur]]; [[M'ryn (Earth-616)|M'ryn]] corresponds to [[wikipedia:Merlin|Merlin]], [[K'kyy (Earth-616)|K'kyy]] to [[wikipedia:Sir Kay|Sir Kay]], [[Lan-Zarr (Earth-616)|Lan-Zarr]] to [[wikipedia:Lancelot|Lancelot]], and [[Mur-G'nn (Earth-616)|Mur-G'nn]] to [[wikipedia:Morgan le Fay|Morgan (le Fay)]].\n| Links                   = \n}}\n[[Category:Kree Organizations]]\n[[Category:Mystical Organizations]]\n[[Category:Skrull Organizations]]\n[[Category:Orders of Knights]]"
                }
            }
        }
    ],
    "page_id": "857066"
}