{
    "pageid": 1439569,
    "ns": 0,
    "title": "Kree/Skrull Alliance (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Kree Skrull Alliance (Earth-616) from Empyre Vol 1 6 001.jpg\n| Name                    = Alliance\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Throneworld II]]\n\n| Leaders                 = [[Theodore Altman (Earth-616)|Emperor Dorrek VIII]]\n| CurrentMembers          = [[Lauri-Ell (Earth-616)|Accuser Lauri-Ell]], [[Av-Rom (Earth-616)|Av-Rom]], [[Glah-Ree (Earth-616)|Captain Glory]], [[Theodore Altman (Earth-616)|Emperor Dorrek VIII]], [[Kalamari (Earth-616)|General Kalamari]], [[Glaz't (Earth-616)|Glaz't]], [[J'Bahzz (Earth-616)|J'Bahzz]], [[Kal-Torr (Earth-616)|Kal-Torr]], [[Keeyah (Earth-616)|Keeyah]], [[K'kyy (Earth-616)|K'kyy]], [[Kl'rt (Earth-616)|Kl'rt]], [[Lan-Zarr (Earth-616)|Lan-Zarr]], [[Mur-G'nn (Earth-616)|Mur-G'nn]], [[Paibok (Earth-616)|Paibok]], [[Raz-El (Earth-616)|Raz-El]], [[Talos (Earth-616)|Talos]], [[Tarna (Earth-616)|Tarna]], [[Varra (Earth-616)|Varra]], [[Ethan Edwards (Earth-616)|Virtue]], billions of others\n| FormerMembers           = [[Bel-Dann (Earth-616)|Bel-Dann]], [[Carol Danvers (Earth-616)|Captain Marvel (Carol Danvers)]], [[M'lanz (Earth-616)|M'lanz]], [[Raksor (Earth-616)|Raksor]], [[R'Klll (Earth-616)|\"Tanalth\"/R'Klll]], [[Val-Lorr (Earth-616)|Captain Val-Lorr]]\n| Allies                  = [[Accuser Corps (Earth-616)|Accuser Corp]], [[Knights of the Infinite (Earth-616)|Knights of the Infinite]], [[Avengers (Earth-616)|Avengers]], [[Fantastic Four (Earth-616)|Fantastic Four]], [[North Atlantic Treaty Organization (Earth-616)|NATO]], [[United States Army (Earth-616)|United States Army]], [[New Fantastic Four (Earth-616)|New Fantastic Four]], [[Galactic Council (Earth-616)|Galactic Council]], [[Sentient World Observation and Response Department (Earth-616)|S.W.O.R.D.]]\n| Enemies                 = [[Empyre (Earth-616)|Cotati Empyre]], [[Children of Lost Tarnax (Earth-616)|The Children of Lost Tarnax]], [[Knull (Earth-616)|Knull]], [[Hive (Symbiotes) (Earth-616)|Symbiote Hive]], [[Walter Lawson (Earth-616)|Wastrel]]; formerly [[Avengers (Earth-616)|Avengers]], [[Fantastic Four (Earth-616)|Fantastic Four]]\n| Origin                  = A gestalt empire created from the union of the [[Skrull Empire]] with the [[Kree Imperium]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Ewing; Humberto Ramos\n| First                   = Incoming Vol 1 1\n\n| Quotation               = '''<big>My people!</big>''' You are '''[[Kree]]''' and you are '''[[Deviant Skrulls|Skrull]]!''' Orphans of '''[[Skrullos]]!''' Orphans of '''[[Hala (Planet)|Hala]]!''' Your '''[[Kree-Skrull War|war]]''' has run '''hot''' and '''cold''' for a '''thousand years!''' Since the '''dawn''' of civilization as we know it! Your conflict '''created''' the [[Excelsior (Star-Sword)|Star-Sword]] I hold! Your conflict created me! I am the '''living embodiment''' of your war! '''<big>And today -- I call an end to it!</big>''' By '''prophecy''' and '''destiny --''' by '''my decree''' and '''your acclaim --''' the twin empires are '''one!''' We are '''one people -- <big>our people!</big>''' I am '''Dorrek VIII,''' the once and future '''King of Space!''' I am '''your emperor --''' and I say we are '''no longer''' Kree or Skrull! We are '''[[Kree/Skrull Alliance (Earth-616)|the Alliance]] --''' and in all the [[Milky Way|galaxy]], we have only '''one''' enemy -- <big>[[Earth|'''this''' enemy]]! Make ready the fleet! Join our forces as one! We journey to the [[Sol|Sol System]]! '''[[Empyre (Event)|The final war]] begins now!'''</big>\n| Speaker                 = [[Theodore Altman (Earth-616)|Dorrek VIII]]\n| QuoteSource             = Incoming Vol 1 1\n\n| History                 = ===Origins===\nThe [[Kree]] and the [[Deviant Skrulls|Skrulls]] were two of the biggest galactic empires, engaged in an eons-long war known as the [[Kree-Skrull War|Kree/Skrull War]]. Their conflict started when Skrull emperor [[Dorrek (Earth-616)|Dorrek I]] pitted a group of primitive Kree in a contest against the plant-like species named the [[Cotati]] to see which of the two species living in [[Hala]] was worthy of the Skrulls' patronage. When the Cotati were declared the winners after foresting an otherwise lifeless moon, the Kree massacred them and then attacked the Skrulls.{{r|Avengers Vol 1 133}} As the war went on, a prophecy surfaced that the two empires would come together under the leadership of a Kree/Skrull hybrid capable of wielding [[Excelsior (Star-Sword)|Excelsior the Star-Sword]].{{r|New Avengers Vol 4 4}} The hybrid [[Dorrek VIII (Earth-616)|Dorrek VIII]], better known as the super hero Hulkling, became believed to be this unifier, as the first royal hybrid in a thousand of years, and the son of the Kree champion [[Mar-Vell (Earth-616)|Mar-Vell]] and the Skrull princess [[Anelle (Earth-616)|Anelle]].{{r|New Avengers Vol 4 3}}\n\nIn modern day, the Cotati resurfaced. Fueled by a desire to avenge the crimes of the Kree and the Skrulls against their ancestors, the Celestial Messiah [[Sequoia (Earth-616)|Quoi]] and the [[Swordsman (Cotati) (Earth-616)|Cotati Swordsman]] led their people in cutting a swathe through Skrull and Kree territory while they refined a power-boosting flower called the [[Death Blossom]] which enhanced the Cotati's plant-controlling magic.{{r|Empyre Vol 1 2}} The leader of the Kree, [[Tanalth (Earth-616)|Tanalth the Pursuer]], was secretly Hulkling's grandmother [[R'Klll (Earth-616)|R'Klll]], whose intended end goal was to see her bloodline rule over the Kree and the Skrulls through her grandson.{{r|Empyre Vol 1 3}} She saw the rise of the Cotati as an oportunity to unite the two empires,{{r|Empyre: Aftermath Avengers Vol 1 1}} leadering her and the Skrull emperor [[Kl'rt (Earth-616)|Kl'rt the Super-Skrull]] to agree to form the Alliance to ensure the survival of their people.{{r|Lords of Empyre: Emperor Hulkling Vol 1 1}} The Cotati attempted to stop the Alliance's formation by killing two of its key sponsors, [[Raksor (Earth-616)|Raksor]] and [[Bel-Dann (Earth-616)|Bel-Dann]],{{r|Empyre Vol 1 2}} but not before they had managed to enlist Hulkling as a figurehead. His first act as the emperor was to call a ceasefire between the Kree Imperium and the Utopian Kree, since the Kree had been waging their own civil war in recent times.{{r|Lords of Empyre: Emperor Hulkling Vol 1 1}}\n\n===The Cotati Invasion===\nThe Alliance's war fleet sped towards the [[Earth]],{{r|Incoming Vol 1 1}} since the Cotati had converged in the [[Blue Area of the Moon]].{{r|Empyre: Avengers Vol 1 0}} In order to delay the Alliance, the Cotati enlisted the help of the [[Avengers (Earth-616)|Avengers]], using a pacifist pretense to paint themselves as innocent targets of a genocide, which earned them the heroes' protection.{{r|Empyre: Avengers Vol 1 0}} Not long before the Alliance reached the Earth, the [[Fantastic Four (Earth-616)|Fantastic Four]] stumbled into their fleet,{{r|Empyre: Fantastic Four Vol 1 0}} and were brought into the flagship. Both teams became convinced that Hulkling was being misguided by Super-Skrull and Tanalth, prompting them to disrupt their effort to reach the Cotati, with [[Anthony Stark (Earth-616)|Iron Man]] infecting the Alliance's ships with a virus to disable them. This intervention bought the Cotati enough time for the blooming of a [[Death Blossom]] they had planted in the Blue Area, which allowed Quoi to cast deadly vines to ensnare and cripple the Alliance's fleet before launching their invasion on Earth.{{r|Empyre Vol 1 1}} Only the Alliance flagship survived the attack, and it was freed from the Cotati's clutches when [[Carol Danvers (Earth-616)|Captain Marvel]] absorbed and dispersed the energies of Hulkling's Star-Sword. Afterward, she was appointed as the new [[Accuser Corps (Earth-616)|Accuser]] of the Alliance.{{r|Empyre Vol 1 2}} During her time as Accuser, Captain Marvel investigated the destruction of the experimental city [[K'in-Al]] for Kree/Skrull coexistence,{{r|Captain Marvel Vol 10 18}} which was bombed by Kree-hating human scientist [[Walter Lawson (Earth-616)|Walter Lawson]],{{r|Captain Marvel Vol 10 20}} causing Danvers' half-sister [[Lauri-Ell (Earth-616)|Lauri-Ell]] to be blamed for the attack.{{r|Captain Marvel Vol 10 18}}\n\nThe Alliance and Earth's heroes worked together to fend off the Cotati invasion on Earth. Despite Hulkling issuing rules of engagement,{{r|Empyre Vol 1 3}} most Alliance soldiers attacked the Cotati without caring for harm that came to Earth's inhabitants, making the Avengers and [[Agents of Wakanda (Earth-616)|Agents of Wakanda]] ensure the safety of civilians. In one instance, a division of Alliance soldiers who had won a battle in [[Mexico]] turned against the super heroes [[Simon Williams (Earth-616)|Wonder Man]], [[Barbara Morse (Earth-616)|Mockingbird]] and [[Pietro Maximoff (Earth-616)|Quicksilver]] when they objected to the killing of Cotati captives.{{r|Empyre: Avengers Vol 1 1}} The heroes only managed to catch a second wind and disarm the Alliance soldiers when the Kree and the Skrulls turned against each other.{{r|Empyre: Avengers Vol 1 3}}\n\nAs the fight against the Cotati continued, Hulkling refused to risk Captain Marvel's life by making her absorb Excelsior's energies again in a bid to destroy the Cotati garden in the Blue Area of the Moon, gaining the disapproval of his [[Alliance Royal Guard (Earth-616)|Royal Guard]], who frowned upon their emperor's compassionate nature. Instead, Hulkling teleported the sword to [[T'Challa (Earth-616)|Black Panther]] for his own plan against a marching Cotati division in [[Wakanda]]. Hulkling also refused to deploy the [[Pyre (Item)|Pyre]], a star-detonating device that would eradicate the Cotati by destroying the Earth. After [[Glah-Ree (Earth-616)|Captain Glory]] deduced that Tanalth was a Skrull impostor, R'Klll revealed herself to him,{{r|Empyre Vol 1 3}} and staged a coup by secretly abducting and supplanting Hulkling to order the deployment of the Pyre. Captain Marvel and the [[Jonathan Storm (Earth-616)|Human Torch]] would later enlist the help of Hulkling's husband, [[William Kaplan (Earth-616)|Wiccan]],{{r|Empyre Vol 1 4}} to locate and liberate the true Hulkling. When Hulkling and his allies confronted his impostor, R'Klll rallied the royal guard against him.{{r|Empyre Vol 1 5}}\n\nBy this time, the [[New Fantastic Four (Earth-616)|New Fantastic Four]] had reassembled in [[New York City]], comprised of [[Valeria Richards (Earth-616)|Brainstorm]], [[Franklin Richards (Earth-616)|Powerhouse]], [[Peter Parker (Earth-616)|Spider-Man]] and [[James Howlett (Earth-616)|Wolverine]], to rescue the child Kree soldier [[Jo-Venn (Earth-616)|Jo-Venn]] and the young Skrull warrior [[N'Kalla (Earth-616)|N'Kalla]] from the Cotati-allied assassin sect known as the [[Dark Harvest (Earth-616)|Dark Harvest]].{{r|Fantastic Four Vol 6 21}} The Dark Harvest had built an [[Omni-Wave Projector]] and used it on Jo-Venn and N'Kalla, both having been imbued with the chronicles of the Kree/Skrull War at birth. This allowed the Dark Harvest to project a psychic attack that stirred discord between the ranks of the Alliance. Brainstorm and Powerhouse convinced Jo-Venn and N'Kalla to focus on their shared bond, causing the psychic blast to instead strengthen the bond between the two alien races.{{r|Fantastic Four Vol 6 23}}\n\nThe effect of the Omni-Wave Projector prompted Captain Glory to expose R'Klll as an impostor. With the Pyre having been activated, Hulkling's allies and the royal guard teleported to the Sun to contain the detonation until the Pyre was remotely disabled by Iron Man. Afterward, Hulkling managed to subdue R'Klll and neutralize her powers with an [[Inhibitor Mask|inhibitor mask]] she had previously forced unto his grandson during his imprisonment. In the meantime, the Alliance's troops joined forces with a contingent of Earth's heroes for the final battle against the Cotati in Wakanda, where Quoi attempted to plant a Death Blossom since its [[Vibranium]]-enriched soil would have allowed him to extend his reach to cosmic levels.{{r|Empyre Vol 1 6}}\n\nFollowing the defeat of the Cotati, the Alliance became at peace, with Hulkling stepping up to the role of a king and not just a figurehead. R'Klll was imprisoned at the Alliance's flagship, and Lauri-Ell was made the new chief Accuser in place of Captain Marvel. Wiccan was made the prince consort and court wizard after a royal wedding was held for him and Hulkling. Super-Skrull and Captain Glory were demoted by Hulkling, with Kl'rt accepting a diplomatic posting, whereas Glah-Ree preferred the prospect of a life sentence at a penal stockade.{{r|Empyre: Aftermath Avengers Vol 1 1}} The Cotati were handed over by the Alliance to [[Thor Odinson (Earth-616)|Thor]], who teleported the would-be conquerors to a secluded plant in uncharted space.{{r|Empyre: Fallout Fantastic Four Vol 1 1}}\n\n===After the Cotati War===\nWhen some planets of the Alliance's zone ceased communication, [[Talos (Earth-616)|Talos]] was sent along with a group to investigate. To their horror, they found that these planets and its Kree and Skrull habitants had been consumed by [[Symbiotes]] before being attacked by [[Knull (Earth-616)|Knull]] and his [[Symbiote Dragons|dragons]]. With most of the group having perished to the monsters, Talos planned to distract them while [[Tarna (Earth-616)|Tarna]] escaped and warned the empire. However, while Talos was able to escape from Knull, Tarna's fate was unknown and Talos' escape pod - broadcasting a signal warning ships to stay away - was rescued. He told [[Kalamari (Earth-616)|General Kalamari]], who had been sent to rescue his group, about what he had seen and stated it was too late, showing him the symbiotes under Knull's command arriving at their location.{{r|Web of Venom: Empyre's End Vol 1 1}}\n\nKl'rt was sent alongside [[Val-Lorr (Earth-616)|Captain Val-Lorr]] to [[Proscenium]], in order to negotiate the universe's new status quo with the [[Galactic Council (Earth-616)|Galactic Council]]. Upon being questioned by the Utopian Kree representative [[Noh-Varr (Earth-200080)|Marvel Boy]] on the deployment of the Pyre in Earth's solar system, Kl'rt stated that it was not what the emperor ordered and the Alliance would remain humanity's ally until Teddy was on the throne, hoping he never loses it. Val-Lorr threatened the Utopian Kree with destruction if that happened. Upon hearing this, the council voted to keep the existing treaties in force and having the Alliance dismantle all banned weaponry, while allowing independent inspections. In the restroom, Marvel Boy found [[Stote (Earth-616)|Emperor Stote]] dying and was confronted by Val-Lorr, who suspected him of being the murderer. As he tried to shoot him, his gun backfired and killed him instead. Kl'rt suspected Marvel Boy too and told the council of his crime, before trying to kill him. [[Richard Rider (Earth-616)|Nova Prime Richard Rider]] reminded that he had jurisdiction in such cases, but Kl'rt demanded an impartial law official. Rider then called [[Rocket Raccoon (Earth-616)|Ranger Rocket]] to investigate.{{r|Guardians of the Galaxy Vol 6 7}}\n\nRocket  proved that Val-Lorr's gun was rigged. He then had the psychics there scan everyone's mind. [[Peacebringer (Earth-616)|Peacebringer]] was soon revealed to be sent there to blow up everyone by the [[Chitauri Empire]], but they found he didn't murder Stote. As the [[Guardians of the Galaxy (Earth-616)|Guardians of the Galaxy]] tried stopping him, Rocket revealed that \"Lani Ko Ako\" claiming to represent the [[Sisterhood of Badoon (Earth-616)|Badoon Sisterhood]], who would never send someone on their behalf, was Profiteer in disguise trying to start the [[Snarkwar]] between Stote's sons and also had Val-Lorr killed to cover her tracks. The [[Galactic Rim Collective (Earth-616)|Galactic Rim Collective]]'s representative [[Zoralis Gupa (Earth-616)|Zoralis Gupa]] soon informed them about worlds across empires being purged of life and the \"credit\" currency becoming worthless. Profiteer decided to save the representatives, so their empires can rebuild themselves and buy from her, teleporting away with Peacebringer before his Bio-Bomb could detonate. Gupa then told them he wasn't lying and they knew who was responsible: Knull.{{r|Guardians of the Galaxy Vol 6 8}}\n| Equipment               = <!-- {{Navigation\n| title = \n| body  = --><br>\n* '''[[Kree Militia Uniforms]]'''{{r|Empyre: Avengers Vol 1 0}}\n*'''Mutations:''' The alliance has manufactured mutated creatures that can take over the mechanical sentries. It also has access to technology that allows it to increase the powers and abilities of its warriors.{{r|Empyre: Avengers Vol 1 0}}\n* '''[[Inhibitor Mask]]s:''' Masks of Skrull technology that can block a Skrull's power to shapeshift.{{r|Empyre Vol 1 6}}\n<!-- \n}} -->\n| Transportation          = <!-- {{Navigation\n| title = \n| body  = --><br>\n* '''Gliders'''{{r|Empyre: Captain America Vol 1 3}}\n* '''Hovering tanks:''' Mounted with cannons capable of firing energy blasts.{{r|Empyre: Captain America Vol 1 2}}\n*'''Intergalactic Warp-Capable [[Accuser Warship|Starships]]'''\n<!-- \n}} -->\n| Weapons                 = <!-- {{Navigation\n| title = \n| body  = --><br>\n* '''Energy blasters'''{{r|Fantastic Four Vol 6 23}}\n* '''[[Kree Sentries]]:''' giant robotic sentries created to protect Kree interests on far off planets.{{r|Empyre: Avengers Vol 1 0}}\n* '''[[Pyre (Item)|Pyre]]:''' A thermonuclear weapon capable of wiping out an entire solar system.{{r|Empyre Vol 1 3}}\n*'''[[Universal Weapon]]''': The hammer of [[Ronan (Earth-616)|Ronan the Accuser]], wielded by the Supreme Accuser.{{r|Captain Marvel Vol 10 19}}\n*'''Warp-capable [[Skrull Battleship|warships]]'''{{r|Empyre: Avengers Vol 1 0}}<!-- \n}} -->\n| Notes                   = * Since the Kree Imperium merged with the Skrull Empire, it is left unknown what happened to the [[Vox (Super-Inhumans) (Earth-616)|Vox]].\n| Trivia                  = * The Kree and the Skrulls have united their forces in other universes such as [[Earth-4290001]], [[Earth-90110]], [[Earth-90111]], [[Earth-14118]], and [[Earth-98120]].\n* The Alliance was equal in power with the [[Shi'ar Empire]].{{r|S.W.O.R.D. Vol 2 1}}\n| Links                   = \n}}\n[[Category:Kree Organizations]]\n[[Category:Skrull Organizations]]\n[[Category:Empires and Civilizations]]\n[[Category:Interplanetary Organizations]]\n[[Category:Monarchies]]"
                }
            }
        }
    ],
    "page_id": "1439569"
}