{
    "pageid": 547993,
    "ns": 0,
    "title": "Last of the Vikings (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Last of the Vikings (Earth-616) from Namora Vol 1 3 0001.jpg\n| Name                    = Last of the Vikings\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Moble; formally an undisclosed island in the Atlantic, [[Norway]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Hunsen the Hated (Deceased), Hunsen\n| Allies                  = \n| Enemies                 = [[Namor McKenzie (Earth-616)|Sub-Mariner]], [[Aquaria Neptunia (Earth-616)|Namora]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Bill Everett\n| First                   = Namora #3\n| Last                    = Namora #3\n\n| HistoryText             = The Last of the [[Vikings]]' origins begin in the 11th century. A band of Norwegian Vikings led by Hunsen the Hated tried to stage a political revolution. Their attempt failed in the year 1248 and they were exiled from Norway. They sailed west and found an uninhabited island that they colonized and lived on in seclusion for many centuries. \n\nBy the Mid-20th Century the Last of the Vikings were ruled by Hunsen the Hated's descendant Hunsen. In 1948 a plague spread across the island killing everyone except for the strongest men. With no other choice, Hunsen and his men left the island and continued to sail west until they reached the United States. Their passage was spotted by a modern day ship and the information was relayed to Dr. Svorland, a expert on Viking history. He called upon the [[Namor McKenzie (Earth-616)|Sub-Mariner]] and [[Aquaria Neptunia (Earth-616)|Namora]] to help him investigate. \n\nMeanwhile, the Vikings arrived on shore and attacked a small farm house killing its owner. Finding the bounty within the dead man's home, Hunsen decided they must go to war against the United States, unaware of how impossible such a task was. With Namor and Namora out searching for them, the Vikings soon captured the latter. When they told her their plans she tried to convince them to reconsider. The Sub-Mariner soon let himself be captured and tried to explain to Hunsen that they were greatly overpowered by the United States Navy. Hunson only would accept these \"wild tales\" if Namor could best him in a battle over the Truth-Stick, a pole that two warriors grappled over when they disputed truth. Although Hunsen was strong, the Sub-Mariner eventually began to gain the upper hand. When the other Vikings tried to prevent Namor from winning, Namora joined the fight, but the two [[Atlanteans]] were forced to flee. \n\nHunsen and his men returned to their ship and prepared to invade American shores, but were once more opposed by the Sub-Mariner and Namora. This time the heroes destroyed their ship, the entire crew drowned except for Hunsen. Namor and Namora dragged him to shore and learned of the Vikings history before Hunsen himself died as well. With the last Viking dead, Namor, Namora and Dr. Svorland all agreed to keep this discovery a secret.{{r|Namora #3}}\n\n| Equipment               = \n| Transportation          = The Last Vikings travelled the seas in a 11th Century Viking warship.\n| Weapons                 = The Last Vikings wielded weapons such as swords, spears, and axes that were commonly used by the original Vikings of Norway in the 11th Century.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Norse Religion]]\n[[Category:Vikings]]"
                }
            }
        }
    ],
    "page_id": "547993"
}