{
    "pageid": 485743,
    "ns": 0,
    "title": "Laughing Death Patrol (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Laughing Death Patrol (Earth-616) from U.S.A. Comics Vol 1 7 0001.jpg\n| Name                    = Laughing Death Patrol\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Pacific Ocean]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Unnamed members\n| Allies                  = [[Imperial Japan (Earth-616)|Imperial Japan]]\n| Enemies                 = Allied Forces, [[Doug Johnson (Earth-616)|Jap Buster Johnson]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mickey Spillane; Dennis Neville\n| First                   = U.S.A. Comics Vol 1 7\n| Last                    = U.S.A. Comics Vol 1 7\n\n| HistoryText             = The Laughing Death Patrol was a squad of [[Imperial Japan (Earth-616)|Imperial Japanese]] fighter pilots that were active during [[World War II]]. Piloting specially made Zero fighters, they used a lethal gas that caused those exposed to it to literally laugh themselves to death -- a side effect of the gas would cause their skin to turn green as well.\n\nIn February of 1943, members of the Laughing Death Patrol clashed with American fighters out on the Pacific. The American fighters were exposed to the lethal gas, but returned to their battleship before the final effects of the gas took their lives. This horrific display was witnessed by [[Doug Johnson (Earth-616)|Doug \"Jap Buster\" Johnson]] who also witnessed as the members of the Laughing Death Squad attacked the ship but were forced to retreat by its defenses.\n\nSoon, Johnson was allowed to partake in a solo mission to wipe out the Laughing Death Patrol. Clashing with them in the air, Johnson realized that the Patrol was attempting to trick him into flying into clouds of the green gas. He refrained from doing so shooting the fighters down instead.\n\nFinding the battleship they came from, Johnson landed and allowed himself to be captured. Breaking free, Johnson stole an Admiral's uniform and then rushed to the lower decks of the ship and unleashed the gas aboard the crew. Eventually, Johnson abandoned ship after tipping his Navy to the location of the vessel. Any members of the Laughing Death Patrol who was not killed by their own gas were killed when an American destroyer sank their ship.{{r|U.S.A. Comics Vol 1 7}}\n\n| Equipment               = \n| Transportation          = The Laughing Death Patrol flew specially modified Japanese Zero fighters that could release chemical gasses. They were deployed from a battleship.\n| Weapons                 = The Laughing Death Patrol used a powerful and lethal gas that caused the skin of those exposed to it to turn green. Those exposed to the gas would literally laugh themselves to death. The gas was fast acting and could kill in a matter of minutes. One could protect themselves from the gas by wearing a standard issue gas mask.\n\n| Notes                   = The Laughing Death Patrol's laughing gas works in a similar fashion to the [[w:c:dc:Joker Venom|Joker Gas]] used by the [[DC Universe|DC Comics]]' villain, the [[w:c:dc:Joker|Joker]]. It's unknown if the laughing gas was inspired by the Joker Gas.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Japanese Organizations]]"
                }
            }
        }
    ],
    "page_id": "485743"
}