{
    "pageid": 470218,
    "ns": 0,
    "title": "League of Unicorns (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = League of Unicorns (Earth-616) from Captain America Comics Vol 1 13 0001.jpg\n| Name                    = League of Unicorns\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly King Unicorn Zang (Burton J. Hargrave)\n| CurrentMembers          = \n| FormerMembers           = King Unicorn Zang, Yen Soy, unnamed others \n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Avison\n| First                   = Captain America Comics Vol 1 13\n| Last                    = Captain America Comics Vol 1 13\n\n| HistoryText             = [[File:Burton J. Hargrave (Earth-616) from Captain America Comics Vol 1 13 0001.jpg|thumb|left|154px|King Unicorn Zang]]\nThe League of Unicorns were a group of Asian terrorists who were active sometime prior to America's entry into [[World War II]]. They were defeated and disbanded by a king of an undisclosed Chinese territory. After the 1941 attack on [[Pearl Harbor]] and [[United States of America|America]]'s entry into the war, railroad owner [[Burton J. Hargrave (Earth-616)|Burton J. Hargrave]] saw an opportunity to gain power. Noting that those who held power in the east would get control of the lucrative market, he posed as an Asian man named Zang and reformed the League of Unicorns. Under the false pretense of wishing to ruin relations between the United States and [[China]] so that the \"old rulers\" could take over, Hargrave ordered the his minions to assassinate visiting Prince Tsaihoon and his wife Princess Yana. The targets were chosen due to the fact that it was Tsaihoon's father who took down the League of Unicorns in the past.\n\nWhen an Chinese-American whose family had connections to Prince Tsaihoon learned of this plot while the two royals were on a good-will tour of America, he was targeted by the League. Their attack on the man happened in front of [[Steven Rogers (Earth-616)|Private Steve Rogers]] and military mascot [[James Buchanan Barnes (Earth-616)|Bucky Barnes]] who stopped the attempt as Captain America and Bucky. Although they failed to stop the League from mortally wounding the man, their victim told Cap and Bucky about the plot.\n\nWhen the League of Unicorns attempted to derail the royals' train at the Black River rail bridge while they were on their way to Lee City, Captain America and Bucky foiled this plot. King Unicorn Zang sent a message warning the royals and Captain America that their deaths were now insured. When the royals arrived in Lee City with Captain America and Bucky as their bodyguards, they were greeted by the mayor and Burton Hargrave. The League of Unicorns attacked again, this time taking Princess Yana and Bucky hostage. Zang sent Prince Tsaihoon a message demanding that he met them in an abandoned mansion alone. Captain America went instead, disguised as Tsaihoon and attacked the League. Cap broke their lantern, engulfing the room with darkness and allowing him to hide in the rafter. Thinking that Cap had fled, the League returned to where the prisoners were kept -- in an old abandoned subway tunnel, unaware that they were leading Captain America to their hideout.\n\n[[File:Burton J. Hargrave (Earth-616) from Captain America Comics Vol 1 13 0002.jpg|thumb|112px|Burton J. Hargrave]]\nThere, Captain America battled the League again, freeing Bucky, but Zang escaped with Princess Yana. Hiding the princess off in another room, \"Zang\" would remove his disguise and as Hargrove pretended like he was trying to stop the Unicorns as well through his own private investigation. Captain America sent Bucky to get the authorities, leaving him along with Burton. As the two searched the tunnels for Yana, Burton slipped away and changed back into Zang and began taunting Captain America. Cap chased him to another secret room where Cap stopped Zang from dousing Yana with a strong acid. Defeating Zang in battle, Cap made short work of the rest of the League with the aid of Bucky and the arriving police. With the battle over, Captain America unmasked Hargrove, and he explained how he manipulated the League of Unicorns for his own ends.{{r|Captain America Comics Vol 1 13}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each member of the League wore a metal helmet with a sharp point on the end fashioned to look like the horn of the mythical unicorn. Hargrave wore a lifelike mask that gave him Asian features that also had a similar horn attached to it. They also occasionally carried hand axes.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "470218"
}