{
    "pageid": 469323,
    "ns": 0,
    "title": "League of Crime (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = League of Crime (Earth-616) from Mystic Comics Vol 1 8 0001.jpg\n| Name                    = [[League of Crime]]\n| Aliases                 = <nowiki></nowiki>\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Fomrerly [[Remu the Great (Earth-616)|Remu the Great]]\n| CurrentMembers          = \n| FormerMembers           = [[Remu the Great (Earth-616)|Remu the Great]], [[Nails Swigland (Earth-616)|Nails Swigland]], [[Crusher Collins (Earth-616)|Crusher Collins]], [[Pierre La Verne (Earth-616)|Pierre La Verne]]\n| Allies                  = \n| Enemies                 = [[William Waring (Earth-616)|Challenger]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee\n| First                   = Mystic Comics #8\n| Last                    = Mystic Comics #8\n\n| HistoryText             = The League of Crime was a quartet of criminals that were gathered by master hypnotist and professor of psychology Remu the Great in 1941. Their members included expert gunman Nails Swigland, pro-wrestler Crusher Collins, and Pierre La Verne, sword fighter extraordinaire. They committed a series of very successful crimes working together. However, this union would soon fall apart thanks to the [[William Waring (Earth-616)|Challenger]] and Remu's own greed.<!-- {{r|Mystic Comics #8}} -->\n\nAfter a number of successful hauls, Remu demanded that he get paid half of the stolen wealth while the other half was split between his three companions. When the others protested this, Remu used his hypnotic powers to make them agree with everything he told them. He then sent out Nails on his own to commit another robbery. By this time, the Challenger was on the case for the police to capture the League. Tricking Nails into attempting to rob him, the Challenger bested him in a gun fight and turned him over to the authorities.<!-- {{r|Mystic Comics #8}} -->\n\nUnaware of this, Remu sent Crusher on another mission to rob someone, and he too was defeated by the Challenger. Learning the location of the League's hideout from Crusher, the Challenger then crashed the place and dueled one-on-one with Pierre in a sword fight. Remu attempted to use his hypnotic powers to trip up the Challenger, but the hero tossed the hypnotist into his opponent knocking both men out. The Challenger turned them over to the authorities.{{r|Mystic Comics #8}}\n\nThe fate of each individual member of the League of Crime is unknown, however it is highly unlikely they formed together again.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Nails armed himself with a pistol while Pierre wielded a sword.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "469323"
}