{
    "pageid": 461622,
    "ns": 0,
    "title": "League of Blood (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = League of Blood (Earth-616) from Mystic Comics Vol 1 7 0001.jpg\n| Name                    = League of Blood\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly Natas\n| CurrentMembers          = \n| FormerMembers           = Natas, Nick the Gambler, unnamed members\n| Allies                  = \n| Enemies                 = [[Witness (Golden Age) (Earth-616)|The Witness]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Mike Suchorsky\n| First                   = Mystic Comics #7\n| Last                    = Mystic Comics #7\n\n| HistoryText             = The League of Blood was a group of criminals organized to murder for criminal game. Formed by the mobster named Natas, he first sent his group to kill football star Sid Shores to collect a big payout from Nick the Gambler. The League's actions were spotted by the [[Witness (Golden Age) (Earth-616)|Witness]] who foiled the assassination attempt. Learning that the League was hired on the behalf of Nick the Gambler, the Witness went to Nick's home and killed him. When Natas arrived to collect the money from Nick the Gambler, the Witness was waiting for him, and the two clashed; however, Natas managed to escape and warned his minions of the Witness' attempts against his organization. He told his men to prepare to eliminate the Witness after their next assignment was completed.\n\nHe next sent the League to kill a trucker named Rowlings who had previously refused to pay into the gang's protection racket. The League arrived at Rowlings truck company and loaded all his drivers into the trailer of a truck and drove to a nearby cliff to send them all to their deaths. Their attempt was stopped once more by the Witness, who in the ensuing clash sent Natas falling down the cliff to his death. The fate of the other gang members is unrevealed, but they were likely either captured or killed by the Witness.{{r|Mystic Comics #7}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Legion of Blood used conventional firearms.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "461622"
}