{
    "pageid": 593142,
    "ns": 0,
    "title": "Legion of the Dead (Outlaws) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of the Dead (Outlaws) (Earth-616) from Wild Western Vol 1 22 0001.jpg\n| Name                    = Legion of the Dead\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = \n| CurrentMembers          = Outlaws who posed as Jose Morales, Matt Sherill, Daniel \"Killer\" Kane, and Raymond Holiday (Spander and Ike Morrison are the only members named)\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Preston Hardwick (Earth-616)|Gunhawk]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Wild Western #22\n| Last                    = Wild Western #22\n\n| HistoryText             = The Legion of the Dead were a group of ordinary outlaws who were active during the days of the American Frontier. Utilizing local superstitions, they created life like masks to pose as outlaws Jose Morales, Matt Sherill, Daniel \"Killer\" Kane, and Raymond Holiday, who were all notorious criminals and were killed in one manner of the other. They then went to a nearby town and murdered the local jailer and freed all the prisoners forming a gang together. The Legion of the Dead then went from town to town, robbing them and burning the place flat. They used the superstitions of the locals to promote fear of the gang and maintain the ruse that they were the undead who had returned from the grave.\n\nOnly one man was brave enough to face them, [[Preston Hardwick (Earth-616)|Red Larabee]], also known as the Gunhawk. Red tracked down the Legion to their hideout, a tunnel dug out beneath the cemetery where the outlaws the Legion took their names from were buried. There the Gunhawk mowed down the entire gang. Later calling in the army, they searched the bodies and realized that the leaders of the Legion of the Dead were real live criminals wearing clever masks.{{r|Wild Western #22}}\n\n| Equipment               = \n| Transportation          = Each member of the Legion rode a horse\n| Weapons                 = Each member of the Legion carried one or two six-shooters.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Western Teams]]\n[[Category:Shooting]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "593142"
}