{
    "pageid": 448367,
    "ns": 0,
    "title": "Legion of the Doomed (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of the Doomed (Earth-616) from Daring Mystery Comics Vol 1 6 0001.jpg\n| Name                    = Legion of the Doomed\n| Aliases                 = Legion of Doom; Legion of the Damned\n\n| Status                  = \n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Unidentified Hell-Realm called Hades\n\n| Leaders                 = \n| CurrentMembers          = Various unnamed demons\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Jack Castle (Earth-616)|Fiery Mask]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jack Kirby; Joe Simon\n| First                   = Daring Mystery Comics Vol 1 6\n| Last                    = \n\n| HistoryText             = [[File:Legion of the Doomed (Earth-616) from Daring Mystery Comics Vol 1 6 0002.jpg|thumb|left|Legion Messenger]]\nNot much is known about the Legion of the Doomed; they are demonic creatures that come from a fiery realm. In their first and only recorded appearance, one of their members appeared before Ella Waltin, leaving her a child for her to care for. While she agreed to do so, the child's strange eyes and adult sounding voice unnerved her. This led to a call to [[Jack Castle (Earth-616)|Dr. Jack Castle]], secretly the costumed hero known as Fiery Mask. Castle found the child's strange voice suspicious as well.\n\n[[File:Legion of the Doomed (Earth-616) from Daring Mystery Comics Vol 1 6 0003.jpg|thumb|left|Legion Serial Killer in Baby Form]]\n[[File:Legion of the Doomed (Earth-616) from Daring Mystery Comics Vol 1 6 0004.jpg|thumb|137px|Legion Serial Killer in Demonic Form]]\nSoon, a series of bizarre and violent murders happened across the city, prompting Fiery Mask to investigate. What he would find was be a demonic creature. Following it as it went through the city, he tracked it back to the Waltin home. There, Fiery Mask was be horrified to watch as the small child suddenly transformed into the creature he had been tracking. Attempting to stop its next nightly murder spree, Fiery Mask failed to stop it from killing two new victims. Attacking it, the creature attempted to teleport away, taking Fiery Mask to his realm with him.\n\nAttacked by two winged demons, the hero easily defeated them. Suddenly a massive demonic creature -- presumably their leader -- rose from the flames and banished Fiery Mask from the realm. Fiery Mask woke up in his office in his civilian guise wondering if the whole experience happened. Checking the morning paper, he saw that the string of murders mysteriously stopped and that their last victim was Ella Waltin's husband Ab.{{r|Daring Mystery Comics Vol 1 6}}\n\n[[File:Legion of the Doomed (Earth-616) from Daring Mystery Comics Vol 1 6 0005.jpg|thumb|left|Legion Leader]]\nThe purpose of the Legion's murder spree and their use of Ella Walton remains unrevealed.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = While the Legion of the Doomed's origins remain unrevealed, it's entirely likely that they are minions of one of the many hell-lords such as [[Mephisto (Earth-616)|Mephisto]], [[Marduk Kurios (Earth-616)|Satan]], [[Satannish (Earth-616)|Satannish]], or [[Thog (Earth-616)|Thog]]. \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "448367"
}