{
    "pageid": 466871,
    "ns": 0,
    "title": "Legion of Despair (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of Despair (Earth-616) from Human Torch Vol 1 6 0001.jpg\n| Name                    = Legion of Despair\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = Haskell\n| CurrentMembers          = \n| FormerMembers           = Haskell, five unnamed accomplices (two deceased)\n| Allies                  = \n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Carl Burgos\n| First                   = Human Torch #6\n| Last                    = Human Torch #6\n\n| HistoryText             = The Legion of Despair was formed by a greedy millionaire named Haskell who wished to commit crimes to obtain wealth but did not wish to get caught. He put an ad in the classifieds of the Star Newspaper offering an opportunity of a lifetime, attracting many of New York's downtrodden. Haskell hired five men from these interviews to be part of his Legion of Despair. Each one was willing to do whatever it took to pull off a crime, even if it meant their own deaths. They would dole out responsibilities by rolling a pair of dice. Unknown to all, Haskell had rigged these dice so that the odds were always in his favor and others would end up doing his dirty work for him.\n\nThe first heist of the Legion of Despair was the Park Hotel. As three of their members fled from the scene, they were spotted by the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]] who gave chase. In order to escape with the loot, two of the Legion members killed themselves to slow down the Torch and Toro until one of their numbers was able to escape. Searing one of the deceased pockets, the Torch found a pair of dice. After investigating who might have bought the dice and turning up nothing, the Torch had a fake story planted in the paper. This prompted Haskell to send his men to kidnap Toro as he was leaving school for the day.\n\nThe Legion then sent a note to the Human Torch demanding a $50,000 ransom in exchange for Toro's return home. The Torch confronted the crooks without the money but was soon incapacitated in a special fire-retardant glue. As the Legion members rolled dice to determine who was going to kill the Torch, the Torch managed to revive his powers and round up the crooks. Before being taken away by the authorities, the Human Torch showed Haskell's minions how Haskell used a rigged dice to get them to do his dirty work.{{r|Human Torch #6}}\n\n| Equipment               = When having to deal with the Human Torch and Toro, the Legion obtained a special glue that not only doused the two heroes flames, but also glued them into position. Each member carried a pair of dice which each number carved out in the shape of a hole. Unknown to all except Haskell, these dice were weighted so that someone with the proper skill could roll whatever they wanted.\n\n| Transportation          = \n| Weapons                 = Most of the Legion members were armed with pistols. \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "466871"
}