{
    "pageid": 478611,
    "ns": 0,
    "title": "Legion of the Dead (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of the Undead (Earth-616) and Thomas Halloway (Earth-616) from Marvel Mystery Comcis Vol 1 33 0001.jpg\n| Name                    = Legion of the Dead\n| Aliases                 = Legion of the Undead\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Doctor Merkel (Earth-616)|Doctor Merkel]]\n| CurrentMembers          = \n| FormerMembers           = unnamed scientists\n| Allies                  = \n| Enemies                 = [[Thomas Halloway (Earth-616)|Angel]]\n\n| Origin                  = Zombies\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Fagaly\n| First                   = Marvel Mystery Comics #33\n| Last                    = Marvel Mystery Comics #33\n\n| HistoryText             = Doctor Merkel was a genius doctor who went insane and was locked away in an asylum for reasons unknown. Escaping confinement, he managed to gather loyal scientists to assist him on his revenge scheme against the city that locked him away. Through an undefined scientific method, he and his colleagues managed to resurrect the dead into a horde of loyal zombies. \n\nPart of his ultimate revenge scheme involved murdering the mayor of the city and then using his zombies bodies to contaminate the city water supply. Merkel commanded this horde of zombies wearing a costume that made him appear to be one of the undead as well. This plot was thwarted by the [[Thomas Halloway (Earth-616)|Angel]] who managed to prevent the assassination attempt against the mayor and followed the attacking zombies back to Merkel's hideout. \n\nAttacking the horde of zombies, the Angel was captured and locked in a dungeon. Breaking free, the hero used a bottle of chlorine against the zombies sent to contaminate the city water supply, dissolving their bodies. Returning to the house where the creatures were created, the Angel beat two doctors into submission and followed their recently reanimated corpse to a graveyard where he found more zombies digging up graves. Beating these zombies into submission, the Angel piled their bodies into a mass grave and set them ablaze.\n\n[[File:Dr. Merkel (Earth-616) from Marvel Mystery Comics Vol 1 33 0001.jpg|thumb|Doctor Merkel]]\nReturning to the lab, he clashed with Merkel, spilling chemicals on the mad scientist melting away his mask and revealing his identity. The spilled chemicals sparked a blaze which burned down the lab, killing Merkel and his assistants and presumably destroying any remaining zombies, Merkel's method of reanimating the dead was likely lost to  the blaze as well.{{r|Marvel Mystery Comics #33}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Legion of the Dead mostly used shovels and pick axes to dig up more corpses to be reanimated, they used them as defensive weapons when they were attacked by the Angel. Merkel armed himself with an small ax.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "478611"
}