{
    "pageid": 478362,
    "ns": 0,
    "title": "Legion of the Devil (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of the Devil (Earth-616) from Captain America Comics Vol 1 16 001.jpg\n| Name                    = Followers of the Yellow Hoods\n| Aliases                 = \"Hooded Horde\"\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Satan's Reef, Valley Port\n\n| Leaders                 = The Hooded Horror\n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]], [[Elizabeth \"Betsy\" Ross (Earth-616)|Betty Ross]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Manly Wade Wellman; Al Avison\n| First                   = Captain America Comics Vol 1 16\n| Last                    = Captain America Comics Vol 1 16\n\n| HistoryText             = [[File:Hooded Horror (Earth-616) from Captain America Comics Vol 1 16 0001.jpg|thumb|left|105px|The Hooded Horror (Impostor)]]\n[[File:Hooded Horror (Earth-616) from Captain America Comics Vol 1 16 0002.jpg|thumb|left|105px|The Hooded Horror Impostor Unmasked]]\nThe Legion of the Devil comprise mostly of amphibious creatures who call themselves \"Lower-Earth Men\". Centuries ago, they lived on the Island of Lai-Son, named after the goddess they worshiped. They were visited by \"Upper-Earth\" explorers originating from Germany. They had come seeking gold, and in order to obtain as much wealth as possible, the crew married many of the female natives of the Lower-Earth Men. The naive Lower-Earth Men were easily tricked into giving up all their gold, and the Germanic sailors abandoned their brides and sailed away.\n\nBecause customs dictated that married women must follow their husbands, the women of the Lower-Earth Men had massive ships built to follow after them. Centuries later, the descendants of this original crew landed in modern-day Germany and attacked with their horde of sea monsters. They were not prepared for the [[National Socialist German Workers Party (Earth-616)|Nazis]] whose guns proved no match for them. Surrendering, the leader of the Lower-Earth Men, descendant of their queen, was brought to the Nazi commander in charge of the counterattack. Now believing the legends of his ancestors' wealth building the town around them, the Nazi commander decided to use the Lower-Earth Men to his advantage and force them to help invade America.\n\n[[File:Legion of the Devil (Earth-616) from Captain America Comics Vol 1 16 003.jpg|thumb|left|130px|The Lower-Earth Men's true leader]]\nCapturing their leader, the Nazi commander disguised himself and led a group of Lower-Earth Men to the American town of Valley Port. There they built an underground temple to Lai-Son and frightened off most of the locals, replacing many of them with Nazi spies. By the summer of 1942, two [[Federal Bureau of Investigation (Earth-616)|FBI]] agents were sent to investigate Valley Port and were eliminated by the Nazi spies. Meanwhile, anyone who wandered into town were captured by the the Nazi (now calling himself the Hooded Horror) and his Lower-Earth minions. The disappearance of the FBI agents led to [[Elizabeth \"Betsy\" Ross (Earth-616)|Betty Ross]] being assigned to investigate the situation. With the military's support, she was assigned an escort from [[Steven Rogers (Earth-616)|Steve Rogers]] who was secretly Captain America.\n\nLearning of the supposedly haunted area, Steve feigned cowardice, allowing him to change into Captain America, but Betty went on ahead, and Steve just barely managed to save her from a fatal bus crash when her driver's roadside coffee was drugged by a Nazi spy. Checking into a hotel while Captain America investigated the city, Betty was captured by the Legion of the Devil and taken to their temple. When [[James Buchanan Barnes (Earth-616)|Bucky]] attempted to stop this kidnapping, he too was captured. Captain America was also attacked by members of the Legion, but he managed to break away, and knock out their leader. Finding the leader of the Lower-Earth Men chained to a wall, he learned of their origins and how the Nazi commander tricked him. Cap then agreed to join him in liberating his people and saving his friends.\n\n[[File:Legion of the Devil (Earth-616) from Captain America Comics Vol 1 16 002.jpg|thumb|188px|The Lower-Earth Men's sea monsters]]\nRushing to the underground temple, they stopped the execution, but the Lower-Earth Men did not believe the claims that their leader was replaced with an impostor. Freeing Betty and Bucky, the quartet then fled from the Lower-Earth Men. Using TNT, Captain America caused an explosion that buried the Lower-Earth Men alive. When their former leader attempted to claim Betty Ross as his bride and force her to return to the Island of Lai-Son with him, Captain America knocked him out with a single punch. The leader of the Lower-Earth Men and his Nazi impostor were both turned over to the authorities,{{r|Captain America Comics Vol 1 16}} their fate is unknown.\n\n| Equipment               = [[File:Temple of Lai-Son from Captain America Comics Vol 1 16 0002.jpg|thumb|left|Temple of Lai-Son]]\nThe Hooded Horror wore a mask to make himself appear to be the leader of the Lower-Earth Men. They had a secret underground headquarters that was protected from water with airlocks. It came equipped with cells for prisoners, a private quarters for their leader, a secret escape passage, and a temple to Lai-Son. The temple had a massive statue of Lai-Son and tables to sacrifice their victims.\n| Transportation          = \n| Weapons                 = Each member of the Followers of the Yellow Hoods carried maces, during sacrificial ceremonies to their goddess Lai-Son (also spelt Laison). They used a scimitar to behead their victims.\n\n| Notes                   = The \"Legion of the Devil\" are called the Followers of the Yellow Hoods (\"Hooded Horde\") in {{cl|Avengers, Thor & Captain America: Official Index to the Marvel Universe Vol 1 4}}.\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "478362"
}