{
    "pageid": 2970,
    "ns": 0,
    "title": "Legion of the Unliving (Kang) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of the Unliving (Kang) (Earth-616) from Avengers Vol 1 131 0001.jpg \n| ImageSize               = 250px\n| Name                    = Legion of the Unliving\n| Aliases                 = Battalion from Beyond \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = None. The Legion of the Unliving is only active for short periods at a time and are usually only active in an area where they're directly engaging their enemies (usually the [[Avengers (Earth-616)|Avengers]]).\n\n| Leaders                 = Formerly [[Nathaniel Richards (Kang) (Earth-6311)|Kang]], [[Nathaniel Richards (Immortus) (Earth-6311)|Immortus]] \n| CurrentMembers          = \n| FormerMembers           = [[M'Nai (Earth-616)|Midnight]], [[Heinrich Zemo (Earth-616)|Baron Zemo]], [[Jim Hammond (Earth-616)|Human Torch (Jim Hammond)]], [[Joost van Straaten|Flying Dutchman]], [[Frankenstein's Monster (Earth-616)|Frankenstein's Monster]], [[Simon Williams (Earth-616)|Wonder Man]], [[Nathan Garrett (Earth-616)|Black Knight]], [[Eric Williams (Earth-616)|Grim Reaper]], [[Arno Stark (Earth-8410)|Iron Man 2020]], [[Hector Lennox (Earth-616)|Left-Winger]] and [[Jerome Johnson (Earth-616)|Right-Winger]], [[Oort (Earth-616)|Oort]], [[Jacques Duquesne (Earth-616)|Swordsman]], [[Thomas Raymond (Earth-616)|Toro]] \n| Allies                  = \n| Enemies                 = [[Avengers (Earth-616)|Avengers]], [[Norrin Radd (Earth-616)|Silver Surfer]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Steve Englehart; Sal Buscema; Roy Thomas; Paul Ryan; \n| First                   = Avengers #131\n| Last                    = Avengers West Coast Vol 2 61\n\n| HistoryText             = The Legion of the Unliving was initially formed by [[Nathaniel Richards (Kang) (Earth-6311)|Kang the Conqueror]] and his alternate self, [[Nathaniel Richards (Immortus) (Earth-6311)|Immortus]]. They extracted beings from their home time periods or they resurrected them, intending for their presence to poise a psychological offensive either due to their emotional ties to their opponents or simply the suggested supernatural nature of their existence. The group would later be recreated by the [[En Dwi Gast (Earth-616)|Grandmaster]], and later by the [[Eric Williams (Earth-616)|Grim Reaper]]. \n\nThe first Legion was created by Kang after he and yet another of his alternate selves, [[Nathaniel Richards (Rama-Tut) (Earth-6311)|Rama-Tut]], was rescued from the void of time by Immortus.  Entrapping both of them, Kang used Immortus' devices in conjunction with the mercurial nature of the realm of [[Limbo (Temporal)|Limbo]] to pull super-powered beings out of time shortly before their destined deaths; Baron Zemo, the Frankenstein Monster, Midnight, the Flying Dutchman's Ghost, the original Human Torch, and Wonder Man.  Dubbing this group of people the Legion of the Unliving, as they were all at least supposedly dead by the time he choice to attack his enemies, Kang had them fight against the Avengers, who were also brought to Limbo.  Despite deaths on both sides of the conflict, the Legion was defeated and Kang fled back into the void of time to escape capture, leaving Immortus free to regain control of Limbo.  Restoring all participants back to their original state, Immortus had the Avengers stay behind to explore the shared natures of the Torch and the [[Vision (Earth-616)|Vision]] while the Legionnaires were returned to their origin points to face their respective destinies.{{r|Giant-Size Avengers Vol 1 3}} \n\n[[File:Legion of the Unliving (Kang) (Earth-616) from Avengers West Coast Vol 2 61 001.jpg|thumb|250px|Immortus' Legion]]\nImmortus would later create his own team, by then the third iteration of the Legion of the Unliving, in Limbo to face off against the [[Avengers West Coast (Earth-616)|West Coast Avengers]].  Wishing to use deceased enemies of the assembled Avengers, Immortus called upon the villainous modern Black Knight, the Grim Reaper, Iron Man 2020, the Left-Winger and Right-Winger, Oort the Living Comet, the Swordsman, and the original Torch's old sidekick, Toro. This group was mostly meant as a distraction to keep the Avengers busy while Immortus concentrated on his intentions to transform the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] into a living power conduit by which to increase his control over time, and were believed all to be simulacra so many of the present heroes resorted to lethal tactics to defeat them. This time, Immortus had the Legionnaires vanish once he felt they were no longer necessary, perhaps too soon as he was ultimately defeated and suffered the fate he had intended for the Witch.{{r|Avengers West Coast Vol 2 61|62}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * The lineups of the Legion have been the subject of debate, since not all of the characters listed as dead have actually been deceased at the time of their inclusion, or stayed deceased. Some, as with [[James Buchanan Barnes (Earth-616)|Bucky Barnes]] and [[Luchino Nefaria (Earth-616)|Count Nefaria]], were found later to not have been dead, while others returned to life as in the cases of [[Tyros (Earth-616)|Terrax]], [[Vlad Dracula (Earth-616)|Dracula]], and [[Arthur Douglas (Earth-616)|Drax the Destroyer]]. One character, [[Arno Stark (Earth-8410)|Iron Man 2020]], was not only not deceased at the time of inclusion, hadn't even technically been born yet.\n\n| Trivia                  = \n* When he appeared as a member of Immortus' Legion, Toro claimed he had been the actual Human Torch that had been summoned by Kang, although this conflicts with the display of knowledge on the Vision's synthezoid design that the Torch shared. \n* Oort is implied to be a villain that Quicksilver will battle in the future, an interesting explanation for a new character created as Quicksilver had no personal rogues gallery to speak of. \n* The appearance of Left-Winger and Right-Winger led [[Jonathan Walker (Earth-616)|USAgent]] to a traumatic episode as he believed both of them to be alive, and that the two Legionnaires were imposters meant to unnerve him. The Agent had been told the duo -- who had formerly been friends and partners with him -- had survived an explosion he had left them to suffer after they'd indirectly caused the deaths of his parents. The Wingers had survived due to their physical enhancements, but nevertheless had been hopelessly crippled, resulting in both committing suicide.  The USAgent did not learn the truth until after he'd returned from Limbo and sought to check on the current state of his former friends, leading to a traumatic episode for him. \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "2970"
}