{
    "pageid": 593769,
    "ns": 0,
    "title": "Legion of the Dead (Mexican Outlaws) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of the Dead (Mexican Outlaws) (Earth-616) from Kid Colt Outlaw Vol 1 22 0001.jpg\n| Name                    = Legion of the Dead\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile between [[Mexico]] and the state of [[Texas (State)|Texas]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Blaine Colt (Earth-616)|Kid Colt]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Kid Colt Outlaw #22\n| Last                    = Kid Colt Outlaw #22\n\n| HistoryText             = In the March of 1836, General [[Antonio Lopez de Santa Anna (Earth-616)|Antonio Lopez de Santa Anna]] led the Mexican army into Texas and participated in what became the legendary Battle of the [[Alamo Mission|Alamo]]. Santa Anna and his men were wiped out in the battle.\n\nMany years later, a group of Mexican outlaws decided to play into people's superstitions by dressing themselves to appear like the they were Santa Anna's army risen from the grave. This so-called Legion of the Dead then rode across the Rio Grande into the state of Texas where they pillaged towns and burned them flat. The locals, still remembering the great battle at the Alamo were so fearful of these apparent undead soldiers that they offered no resistance. \n\nEventually the governor of Texas called on the US Army to deal with the Legion. As it happened, the army had just recently captured the famous outlaw [[Blaine Colt (Earth-616)|Kid Colt]]. The colonel of the troop had been saved by Kid Colt a few years earlier and owed him a debt. When Kid Colt agreed to deal with the Legion of the Dead, the colonel then staged an escape so that Kid Colt could get away without ruining his career with a court martial. \n\nWith the help of his friend Miguel, Kid Colt learned the location of the Rio where the Legion crossed over into the United States. There he waited for the Legion's nightly raid and followed after them, picking off the stragglers in the group from behind. When the US Army clashed with the Legion of the Dead, they were forced into a bottleneck and trapped. Kid Colt then rode in from behind, adding the additional fire power needed to force the Legion to try and flee. However, all those who attempted to flee -- including the Legion's leader -- fell under the roar of Kid Colt's guns. In killing their leader, Kid Colt soon realized that these men were not the undead army of General Santa Anna, but outlaw impostors posing as the legendary soldiers.{{r|Kid Colt Outlaw #22}}\n\n| Equipment               = \n| Transportation          = Each member of the Legion rode a horse.\n| Weapons                 = Each Legion member was armed with various conventional fire arms of the time: six-shooters, rifles etc. Their leader also carried a Cutlass sword.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "593769"
}