{
    "pageid": 775859,
    "ns": 0,
    "title": "Legion Accursed (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Secret Wars II Vol 1 7.jpg\n| ImageSize               = 250px\n| Name                     = Legion Accursed\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Mephisto's Realm]]\n\n| Leaders                 = [[Mephisto (Earth-616)|Mephisto]]\n| CurrentMembers          = \n| FormerMembers           = [[Emil Blonsky (Earth-616)|Abomination]], [[Carl Creel (Earth-616)|Absorbing Man]], [[Blanche Sitznski (Earth-616)|Anaconda]], [[Karl Mordo (Earth-616)|Baron Mordo]], [[Georges Batroc (Earth-616)|Batroc the Leaper]], [[Blastaar (Earth-616)|Blastaar]], [[Dimitri Bukharin (Earth-616)|Crimson Dynamo]], [[Esteban Corazón de Ablo (Earth-616)|Diablo]], [[Victor von Doom (Earth-616)|Doctor Doom]], [[Otto Octavius (Earth-616)|Doctor Octopus]], [[Maxwell Dillon (Earth-616)|Electro]], [[Franklin Hall (Earth-616)|Graviton]], [[Roderick Kingsley (Earth-616)|Hobgoblin]], [[Cain Marko (Earth-616)|Juggernaut]], [[Nathaniel Richards (Kang) (Earth-6311)|Kang the Conqueror]], [[Sergei Kravinoff (Earth-616)|Kraven the Hunter]], [[Arthur Parks (Earth-616)|Living Laser]], [[Harvey Elder (Earth-616)|Mole Man]], [[Aleksei Sytsevich (Earth-616)|Rhino]], [[Maynard Tiboldt (Earth-616)|Ringmaster]], [[Keniuchio Harada (Earth-616)|Silver Samurai]], [[Mary MacPherran (Earth-616)|Titania]], [[Ultron (Earth-616)|Ultron-11]], [[Vanisher (Earth-616)|Vanisher]], [[Adrian Toomes (Earth-616)|Vulture]], [[Emma Frost (Earth-616)|White Queen]], [[Bentley Wittman (Earth-616)|Wizard]], [[Dirk Garthwaite (Earth-616)|Wrecker]]\n| Allies                  = [[Death (Earth-616)|Death]]\n| Enemies                 = [[Avengers (Earth-616)|Avengers]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jim Shooter; Al Milgrom\n| First                   = Secret Wars II #7\n| Last                    = Secret Wars II #7\n\n| HistoryText             = [[Mephisto (Earth-616)|Mephisto]] sent his agent [[Bitterhorn (Earth-616)|Bitterhorn]] out to Earth to recruit an army of super-villains to battle the Beyonder. Bitterhorn began by making deals with the [[Cain Marko (Earth-616)|Juggernaut]], [[Maxwell Dillon (Earth-616)|Electro]], [[Karl Mordo (Earth-616)|Baron Mordo]], [[Carl Creel (Earth-616)|Absorbing Man]] and [[Mary MacPherran (Earth-616)|Titania]]. With each deal made, a handshake was made marking each villain connecting them to the Beyonder's bane.<!-- {{r|Secret Wars II #7}} -->\n\nAs Mephisto watched from his realm, he explained to [[Death (Earth-616)|Death]] that if only one of the villains managed to make contact with the [[Beyonder (Earth-616)|Beyonder]] it would complete the circuit with the [[Beyondersbane]] machine unleashing its power. He explained that the force of the power would be enough to not only destroy the Beyonder but a great part of the universe.<!-- {{r|Secret Wars II #7}} -->\n\nAs he explained this, he showed that the universes many cosmic beings were behind him and that the Beyonderbane was being operated from within by [[Eternity (Earth-616)|Eternity]] itself. He explained that Eternity was willing to amputate part of itself to end the potential menace of the Beyonder from destroying its existence. Soon, Bitterhorn reported that the collection of 99 super-villains had been completed and that they were ready to strike at any moment.<!-- {{r|Secret Wars II #7}} -->\n\nMephisto has gathered his Legion Accursed and was about to unleash them at a crucial moment when he spied on the Beyonder considering to leave, to get away from the throng of people who had invaded his island. Seeing this as a determent to his plan, he came up with a means to keep the Beyonder in one spot so that he could attack.{{r|Secret Wars II #7}}\n\nAppearing before the [[Benjamin Grimm (Earth-616)|Thing]], who had just woken from a nightmare, Mephisto used illusions to trick the Thing into signing a contract to go after and kill the Beyonder, providing him with enhanced strength to do so. Thing signed it and dove into the ocean to swim to the Beyonder, unaware that he had played into Mephisto's plans and would forfeit his soul in the process.<!-- {{r|Secret Wars II #7}} -->\n\nJust before the Beyonder could depart, the Thing arrived ready to beat him to death. Before he could, Ed tried to stop him. When Ed told the Thing he was a hero, the Thing became confused and he began to lose his nerve.<!-- {{r|Secret Wars II #7}} -->\n\nThis provided an ample distraction for Mephisto to unleash his Legion Accursed on the island. As the creatures rushed toward the Beyonder, the powers that be waited in anticipation to see how things would play out. While the Thing struggled with his morality as a hero and his desire to kill the Beyonder, the Beyonder considered letting the attack happen or simply escaping. It's finally the Thing who decided that despite the fact that he hates the Beyonder, killing him was against his code as a hero and began fighting off the villains who came slay him.<!-- {{r|Secret Wars II #7}} -->\n\nWith the enhanced strength provided to him by Mephisto, the Thing easily trounced all the villains. Horrified by this turn of events, Mephisto destroyed the contract he forced the Thing to sign to reverse the power he gave him, willing to give up the hero's soul to succeed in destroying the Beyonder. Even reduced to his regular strength, the Thing managed to prevent the last villain, the seemingly unstoppable Juggernaut from touching the Beyonder.<!-- {{r|Secret Wars II #7}} -->\n\nWith all the villains defeated, they were teleported back to where they were before Mephisto's scheme began as the Beyondersbane reached critical mass and exploded. This was a great defeat for Mephisto, who was furious. When Death abandoned him, his grief caused the tortured souls in his realm to experience a moment of joy, and Eternity departed from Mephisto's realm as well.{{r|Secret Wars II #7}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "775859"
}