{
    "pageid": 1417614,
    "ns": 0,
    "title": "Legion of the Unliving (Grim Reaper) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Avengers Vol 3 11.jpg\n| Name                    = Legion of the Unliving\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = None. The Legion of the Unliving is only active for short periods at a time and are usually only active in an area where they're directly engaging their enemies (usually the [[Avengers (Earth-616)|Avengers]]).\n\n| Leaders                 = Formerly [[Eric Williams (Earth-616)|Grim Reaper]]\n| CurrentMembers          = \n| FormerMembers           = [[Khufor (Earth-616)|Amenhotep]], [[Heinrich Zemo (Earth-616)|Baron Zemo]], [[Nathan Garrett (Earth-616)|Black Knight]], [[Luchino Nefaria (Earth-616)|Count Nefaria]], [[Joseph Conroy (Earth-616)|Inferno]], [[Nebulon (Earth-616)|Nebulon]], [[Necrodamus (Earth-616)|Necrodamus]], [[Alexi Shostakov (Earth-616)|Red Guardian]], [[Star Stalker]], [[Mar-Vell (Earth-616)|Captain Marvel (Mar-Vell)]], [[Anthony Druid (Earth-616)|Dr. Druid]], [[Patricia Walker (Earth-616)|Hellcat]], [[H'rpra (Earth-616)|Mockingbird]], [[Jacques Duquesne (Earth-616)|Swordsman]], [[Eric Masterson (Earth-616)|Thunderstrike]], [[Simon Williams (Earth-616)|Wonder Man]] \n| Allies                  = [[Lloigoroth (Earth-616)|Lloigoroth]] (formerly)\n| Enemies                 = [[Avengers (Earth-616)|Avengers]], [[Norrin Radd (Earth-616)|Silver Surfer]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Len Kaminski; M.C. Wyman; Kurt Busiek; George Perez; \n| First                   = Avengers Vol 1 353 \n| Last                    = Avengers Vol 3 12\n\n| HistoryText             = Himself at one point one of the drafted Legionnaires, the [[Eric Williams (Earth-616)|Grim Reaper]] went on to create his own Legion of the Unliving, the fourth to exist and first to be created by him.  Comprised of zombified facsimiles of deceased (at least at the time) foes of super-heroes and other powerful beings, he used the villainous modern Black Knight, Baron Heinrich Zemo, one of the Red Guardians, Count Nefaria, Inferno, Nebulon the Celestial Man, the Star Stalker, Necrodamus, and the demonic Khufor (formerly the pharaoh Amenhotep). At that point in time an undead being with necromantic abilities, the Reaper created his Legion from the victims of a plane crash with aid from Lloigoroth, a Lovecraftian demonic entity, and lured his enemies the Avengers into a Hell-like reality in which to battle them. The heroes were facing defeat by their gruesome opponents when they were rescued by the [[Vision (Earth-616)|Vision]], who confronted the Grim Reaper and caused him to face a horrific epiphany, that he had committed suicide and the Avengers were innocent of his death.  This cost the Reaper his control over the Legionnaires, who regained some degree of their independent will and turned against him. Lloigoroth then appeared and apparently destroyed the Reaper for failing to complete their bargain, after which the accursed crash victims then peacefully returned to their rest.{{r|Avengers Vol 1 353}}\n\nSome time later, following their own apparent return from death following the Onslaught event, the Avengers were confronted by the Grim Reaper's all-new Legion of the Unliving.  Again intent on seeking vengeance against not just his enemies by the entire world, the Reaper this time eschewed dead villains for perished members of the Avengers, trusting in the inherent psychological advantage \nthey would have.  Thus, the Avengers were forced to battle against zombified teammates and friends: Captain Mar-Vell, Doctor Druid, Hellcat, Mockingbird, Swordsman, Thunderstrike, and Wonder Man. Due to his ionic energy-mutated status, Wonder Man had actually been caught in a state between life and death, and had been used as a conduit for the Reaper to not only return to Earth, but to draw in supernatural power to create and control his Legion.  The Grim Reaper's team defeated the assembled Avengers, then sought out to kill the Scarlet Witch as well, only to be freed thanks to her awakening control over chaotic magic.  Restored to a more lifelike appearance, the Legionnaires turned on the Grim Reaper and freed their former teammates while the Scarlet Witch used her magic to completely pull Wonder Man back into the living world.  With the Reaper's link to the afterlife broken, the Legionnaires all vanished, while the Reaper was also pulled back to the land of the living by Wonder Man and the Witch, fully restoring him to life but also leaving him subject to arrest by the authorities.{{r|Avengers Vol 3 10|11}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * The lineups of the Legion have been the subject of debate, since not all of the characters listed as dead have actually been deceased at the time of their inclusion, or stayed deceased. Some, as with [[James Buchanan Barnes (Earth-616)|Bucky Barnes]] and [[Luchino Nefaria (Earth-616)|Count Nefaria]], were found later to not have been dead, while others returned to life as in the cases of [[Tyros (Earth-616)|Terrax]], [[Vlad Dracula (Earth-616)|Dracula]], and [[Arthur Douglas (Earth-616)|Drax the Destroyer]]. One character, [[Arno Stark (Earth-8410)|Iron Man 2020]], was not only not deceased at the time of inclusion, hadn't even technically been born yet.\n\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1417614"
}