{
    "pageid": 645395,
    "ns": 0,
    "title": "Legion of Death (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Legion of Death (Earth-616) from Wild Western Vol 1 42 0001.jpg\n| Name                    = Legion of Death\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = unnamed members\n| Allies                  = \n| Enemies                 = [[Matthew Masters (Earth-616)|Black Rider]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Wild Western #42\n| Last                    = Wild Western #42\n\n| HistoryText             = The Legion of Death were a gang of criminals who were active during the days of the American Frontier. They were all prisoners jailed at Fort Gilboa in the state of [[Texas (State)|Texas]]. When inmates learned that the long lost King's Ransom Mine had a vein that ran under the prison, they dug a tunnel into the mine and used it to escape. They then ambushed the soldiers at the fort, murdering them all and then set the place ablaze before the masked hero known as the [[Matthew Masters (Earth-616)|Black Rider]] could search the fort for clues at how the soldiers were murdered and how the prisoners escaped.{{r|Wild Western #42}}\n\nCovering themselves in a powder that made them appear as ghost they then began attacking towns across the state, looting and pillaging wherever they went, earning the name the Legion of the Dead. Their downfall came when a gold panner found the King's Ransom Mine. The Legion tries to murder him but the old man managed to escape, although he was mortally wounded. The man made it to [[Leadville]] where he was given medical attention by Dr. Matthew Masters, the Black Rider's alter-ego before he died. Finding a map to the King's Ransom Mine and learning from the dying man that there was a connection between the mine, the prison, and the Legion of the Dead, he went to investigate as the Black Rider.{{r|Wild Western #42}} \n\nFinding an entrance into the mine in the rubble of the prison the Black Rider ambushed the Legion of the Dead, but the resulting gun battle caused the mine to cave in burying all its members alive.{{r|Wild Western #42}}\n\n| Equipment               = \n| Transportation          = Each member of the Legion of the Dead rode a horse.\n| Weapons                 = Each member of the gang used various fire arms including six-shooters and rifles.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Western Teams]]\n[[Category:Shooting]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "645395"
}