{
    "pageid": 42229,
    "ns": 0,
    "title": "Les Heroes de Paris (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Les Heroes de Paris (Earth-616) from Fantastic Four Vol 1 541 0001.jpg\n| ImageSize               = 250px\n| Title                   = Les Héros de Paris\n| Name                    = Les Héros de Paris{{r|Scarlet Witch Vol 2 6}}\n| Aliases                 = Les Heroes de Paris,{{r|Fantastic Four #541}} The Heroes of Paris{{citation}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Paris (France)|Paris]], [[France]]\n\n| Leaders                 = [[Adamantine (Earth-616)|Adamantine]] (Commander in Absentia)\n| CurrentMembers          = [[Le Vent (Earth-616)|Le Vent]], [[Anaïs (Earth-616)|Anaïs]], [[Le Cowboy (Earth-616)|Le Cowboy]], [[La Lumière Bleue (Earth-616)|La Lumière Bleue]], [[Detective Fantôme (Earth-616)|Detective Fantôme]] [[Comte de Nuit (Earth-616)|Comte de Nuit]], [[Docteur Q (Earth-616)|Docteur Q]], [[Adamantine (Earth-616)|Adamantine]]\n| FormerMembers           = \n| Allies                  = [[Benjamin Grimm (Earth-616)|The Thing]]\n| Enemies                 = [[L'Empereur du Monde Souterrain (René) (Earth-616)|L'Empereur du Monde Souterrain]], [[Hydra (Earth-616)|Hydra]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = J. Michael Straczynski; Mike McKone\n| First                   = Fantastic Four #541\n| Last                    = \n\n| HistoryText             = Eight members are known to belong to les Heroes de Paris. \n* The team leader, [[Adamantine (Earth-616)|'''Adamantine''']], has somewhat poorly-defined powers, but seems to possess powers of flight and perhaps super-strength and durability (as well as a keen but mundane ability for disguise). \n* [[Comte de Nuit (Earth-616)|'''Comte de Nuit''']]'s father was murdered by thieves, and the caped \"Night Count\" has since sworn vengeance on all who prey on the helpless. \n* [[Anaïs (Earth-616)|'''Anaïs''']], the exiled queen of a lost cat civilization in the [[Sahara Desert|Sahara]], is able to command all felines from the smallest cat to the most vicious lion. \n* [[Detective Fantôme (Earth-616)|'''Detective Fantôme''']] must wander the Earth as an avenging spirit, aiding others until he can solve the mystery of his own murder and achieve entrance into Heaven. At night he prowls the Louvre Museum, in search of secrets and mysteries.  \n* [[le Vent (Earth-616)|'''Le Vent''']], the fastest man in all of Europe, can outrace a plane flying at Mach 4, but because he derives his powers from a sorcerer's curse, can never slow down to a normal speed.  \n* [[La Lumière Bleue (Earth-616)|'''La Lumière Bleue''']] possesses the powers of flight, and a blue Light of Truth which emanates from his palm, revealing all secrets.  \n* [[Le Cowboy (Earth-616)|'''Le Cowboy''']] -- the team's Parisian homage to the American west -- is an accomplished shootist and man of few words. \n* Finally, the armored '''[[Docteur Q (Earth-616)|Docteur Q]]''', formerly one of the world's greatest scientists and weapon designers, is now dedicated to using his knowledge and advanced arsenal in pursuit of peace.\n\nNothing is recorded about the Heroes of Paris until they make contact with a visiting [[Benjamin Grimm (Earth-616)|Thing]] to ask for his help. The Thing had come to France to avoid the moral and legal implications of the superhuman [[Civil War (Event)|Civil War]], and had just sat down at ''le Rose et la Plume'' cafe when an elaborate hidden mechanism lowered him to an underground lair where he met les Heroes de Paris. The team leader, Adamantine, who had been disguised as the street vendor who recommended the cafe, apologized for the deception, stating it was necessary to save precious time. Adamantine explained over lunch that the team could use his muscle in battling [[L'Empereur du Monde Souterrain (René) (Earth-616)|L'Empereur du Monde Souterrain]]. L'Empereur had assembled an army of rock creatures, whom he was prepared to order to tunnel directly under [[Paris (France)|Paris]], destroying the city as it collapsed. The Thing, moved by memories of \"the good old days\" when you knew who the heroes were and all they had to do was go beat the tar out a bad guy, agrees to help.\n\nAfter battling past the rock creatures, le Vent uses his super-speed to hurl the Thing directly to l'Empereur's tunneler, where the ranting villain declares the city above, which gives nothing but pain, deserves to be destroyed for the hurt it has caused him.  Grimm instantly recognizes woman troubles when he see them.  He destroys the machine, creating a powerful explosion that triggers a cave in.  The heroes excape, with Grimm carrying l'Empereur.  No harm having been really done, they release l'Empereur (now just \"René\") to his estranged girlfriend Louise.  Louise is so impressed by René's devotion, in fact, that she agrees to reconcile and marry him.  As the heroes march off to dinner, the Thing feels that this might be beginning of a wonderful friendship.{{r|Fantastic Four #541}}\n\nLater, [[Anaïs (Earth-616)|Anaïs]] and the [[Benjamin Grimm (Earth-616)|Thing]] followed the trail on an [[Hydra (Earth-616)|Hydra]] base on [[Docteur Q (Earth-616)|Docteur Q]]'s intel. After a quick battle, the terrorists were taken into custody by French Police officers. Anaïs also tried to romantically bound with Ben, but he refused, and soon go back to America.{{r|Fantastic Four #542}}\n\nAt some point, Les Héros de Paris vanished, and with the [[Musketeers (Earth-616)|Musketeers]] (the elite armored government unit) out of the country, Paris was short on super heroes to protect it.{{r|Scarlet Witch Vol 2 6}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * Adamantine introduces himself to Ben Grimm as \"Commander in Absentia\" of the team, but never expands on the matter.\n* The team introduces themselves to Grimm in an underground lair near ''le Rose et la Plume'' (the Rose and Feather cafe).  They also dine there, but there is no indication one way or another that this is their main base of operations.\n\n| Trivia                  = * Although the team name is shown to be \"Les Heroes de Paris\" in their first appearance in {{cl|Fantastic Four #541}} (February, 2007), this is an editor's grammatical error as it does not properly interpret into French words. It was corrected as \"Les Héros de Paris\" in {{cl|Scarlet Witch Vol 2 6}} (May 4, 2016).\n* The team seems to share similarities with some DC's heroes.\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "42229"
}