{
    "pageid": 1101786,
    "ns": 0,
    "title": "Life-Like Doll Company (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Life-Like Doll Company (Earth-616) from Mystic Comics Vol 1 6 0001.jpg\n| Name                    = [[Life-Like Doll Company]]\n| Aliases                 = <nowiki></nowiki>\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Laslo Pevely (Earth-616)|The Terror]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Washington, D.C.]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Mystic Comics Vol 1 6\n\n| History                 = On the birthday of President Roosevelt, Americans from all over head to the White House to personally give gifts to their leader, among the celebrators is the Terror. When a man pushes his way to the front of the line to drop off his gift, the Terror transforms into his monstrous form and briefly clashes with him, however he drops off his gift and flees. Finding the package contains a strange doll, he turns it over to the President who is shocked to find that it's Senator Thompson who has somehow been killed and shrunk down to size. The Terror decides to investigate this strange murder and examines the package, learning the dolls came from a company called the Life-Like Doll Company.\n\nGoing to the company's factory, the Terror recognizes one of the men inside as the man he clashed with earlier and transforms into his super-human form again. Beating the man into submission, the Terror enters the factory proper he spots a Nazi spy using a shrinking potion to do the same to Admiral Pierce as what was done to Senator Thompson. The Terror is told that the Nazis are using a formula that shrinks human bodies much like primitive tribes shrink heads. The Terror easily overpowers the spy and uses his own shrinking potion on him, shrinking him down to size. Noticing that Admiral Pierce is still alive, the Terror finds the antidote and restores him to his normal size and then dumps out the remainder of the formula so it can never be used again.{{r|Mystic Comics Vol 1 6}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = * History Text extracted from the Synopsis for \"The Dolls of Death\" in [[Mystic Comics Vol 1 6]] edited by [[User:Nausiated|Nausiated]]\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Doll Makers]]"
                }
            }
        }
    ],
    "page_id": "1101786"
}