{
    "pageid": 533358,
    "ns": 0,
    "title": "Lightning Cult (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Lightning Cult (Earth-616) from Marvel Mystery Comics Vol 1 86 0001.jpg\n| Name                    = Lightning Cult\n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = Formerly [[Arson Anne (Earth-616)|Arson Anne]], [[Arson Andy (Earth-616)|Arson Andy]]\n| CurrentMembers          = \n| FormerMembers           = Arson Anne, Arson Andy, unnamed members\n| Allies                  = \n| Enemies                 = [[Jeffrey Mace (Earth-616)|Captain America]], [[Fred Davis Jr. (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Avison\n| First                   = Marvel Mystery Comics Vol 1 86\n| Last                    = Marvel Mystery Comics Vol 1 86\n\n| HistoryText             = [[File:Arson Andy (Earth-616) and Arson Anne (Earth-616) from Marvel Mystery Comics Vol 1 86 0001.jpg|thumb|left|136px|\"Jupter\" and \"Jove\"]]\nThe Lightning Cult was a front for notorious criminals Arson Anne and Arson Andy, two arsonists who were active during the 1940s. They cult \"worshipped\" the [[Olympians|Olympian]] gods [[Zeus (Earth-616)|Jupiter]] and [[Hera Argeia (Earth-616)|Juno]]. Arson Anne and Andy disguised themselves as the gods and their gang members posed as loyal followers.\n\nWith specially made Roman candles, \"Jupiter\" simulated the ability to shoot lightning. They then lit fire to buildings and sent their minions into the burning building in fire-proof cloaks to rob them of valuables. After a string of successful arsons, one fire attracted the attention of [[Jeffrey Mace (Earth-616)|Captain America]] and [[Fred Davis Jr. (Earth-616)|Bucky]] who attacked the cult, but the gang escaped into the burning building, which was too dangerous for the heroes to follow. However, they found evidence that the cult robbed the building's safe and infiltrated their much publicized meeting outside of town. Knowing that they had impostors in their midst, \"Jupiter\" and \"Jove\" had their minions subdue Cap and Bucky and revealed the scope of their operation. However, before Arson Andy could strike the two heroes down with a Roman candle blast, they ducked out of the way, causing the blasts to strike the minions.\n\nCaptain America and Bucky then easily subdued the two arsonists and used their own weapons to subdue the rest of the cult, who were then turned over to the authorities.{{r|Marvel Mystery Comics Vol 1 86}}\n\n[[File:Arson Andy (Earth-616) and Arson Anne (Earth-616) from Marvel Mystery Comics Vol 1 86 0002.jpg|thumb|Arson Anne and Andy unmasked.]]\nThe fate of the members of the Lightning Cult after that are unknown.\n\n| Equipment               = Members of the cult wore specially plastic robes that were fire proof. Presumably Arson Anne and Andy's Jupiter and Jove costumes were made out of the same material.\n| Transportation          = \n| Weapons                 = Arson Andy carried specially made Roman candles that could start fires quickly, they fired from out of the sleeve of his \"Jupiter\" cloak and resembled lightning bolts.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Greek Religion]]"
                }
            }
        }
    ],
    "page_id": "533358"
}