{
    "pageid": 610039,
    "ns": 0,
    "title": "Lions' Club (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Lions Club from IM134.jpg\n| Name                    = Lions' Club\n| Aliases                 = Lions Club\n\n| Leaders                 = \n| CurrentMembers          = [[Edwin Cord (Earth-616)|Edwin Cord]]; Rodney Dangerfield; [[Anthony Stark (Earth-616)|Anthony Stark]]\n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Boris Bullski (Earth-616)|Titanium Man]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = David Michelinie; Jerry Bingham\n| First                   = Iron Man Vol 1 134\n\n| History                 = The Lions' Club was an association of some kind, with members including top industrialists [[Anthony Stark (Earth-616)|Anthony Stark]] and [[Edwin Cord (Earth-616)|Edwin Cord]].<ref name=\"IM145\">[[Iron Man Vol 1 145|''Iron Man'' #145]]</ref> The Club met annually for a formal dinner and, for several years, they scheduled an appearance and demostration by Stark and his high-tech bodyguard (and secretly alter ego) Iron Man.<ref name=\"IM134\">[[Iron Man Vol 1 134|''Iron Man'' #134]]</ref> Stark first met Cord during one of these dinners,<ref name=\"IM145\" /> apparently the fourth appearance of Iron Man in a row.<ref name=\"date\">In ''Iron Man'' #134, Stark says that Iron Man had been guest star of the dinner for five years, but he would not be at that point. In ''Iron Man'' #145, Cord says he had met Stark at the Lions Club dinner \"a couple of years ago.\"</ref> Stark believed that Cord was not a friendly guy.<ref name=\"IM145\" />\n\nAt one point, the Club cancelled Iron Man's appearance at the last moment because Iron Man had been involved in a scandal, murdering the [[Carnelia|Carnelian]] ambassador; the Club replaced him with comedian Rodney Dangerfield. Although Iron Man had been absolved and his innocence had been proved, his popularity had nevertheless lowered. Stark discovered this through his secretary [[Bambina Arbogast (Earth-616)|Mrs. Arbogast]] only hours before the dinner, as he had been too busy, and disliked the idea but he accepted it. He instead went for a date with his romantic interest of the time, [[Bethany Cabe (Earth-616)|Bethany Cabe]].<ref name=\"IM134\" />\n\nIron Man's enemy [[Boris Bullski (Earth-616)|the Titanium Man]] went to [[New York City]] looking for Iron Man for a duel. His information led him to believe that Stark would attend to the Lions' Club dinner at the [[Sheraton Hotel]], so the Titanium Man flew to the hotel, broke an external wall and raided the place, asking for Iron Man. The attendees explained him that Iron Man was not there. Enraged, he insulted Dangerfield and left, summoning Iron Man by screaming through the city.<ref name=\"IM134\" /> He eventually found Iron Man and was defeated by him.<ref name=\"IM135\">[[Iron Man Vol 1 135|''Iron Man'' #135]]</ref>\n\nLater, when Cord met Iron Man in a conclave in [[Dallas]], he approached him by saying that they had met at the Lions' Club dinner.<ref name=\"IM145\" />\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "610039"
}