{
    "pageid": 93596,
    "ns": 0,
    "title": "Lunatic Legion (Kree Survivors) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Lunatic Legion (Kree Survivors) (Earth-616) from Iron Man Vol 3 7 001.png\n| ImageSize               = 250px\n| Name                    = Lunatic Legion\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Luna (Moon)|Earth's moon]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Dylon Cir|Commander Cir]], [[Galen-Kor (Earth-616)|Admiral Galen-Kor]], [[Klynn (Earth-616)|Klynn]], [[Kona Lor (Earth-616)|Kona Lor]], [[Bron Char (Earth-616)|Bron Char]], [[Talla Ron (Earth-616)|Talla Ron]], [[Tokk (Earth-616)|Tokk]], [[Ciry (Earth-616)|Ciry]]\n| Allies                  = \n| Enemies                 = [[Avengers (Earth-616)|Avengers]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Bob Harras; Steve Epting\n| First                   = Avengers Vol 1 366\n| Last                    = Quicksilver Vol 1 10\n\n| HistoryText             = [[Galen-Kor (Earth-616)|Admiral Galen-Kor's]] crew relocated to the former [[Blue Area of the Moon]], taking with them the [[Supreme Intelligence (Earth-616)|Supreme Intelligence]], whose computerized form had been found beneath the surface of [[Earth]]. Kor's crew formed an alliance with the Western US company PowerSource Inc, run by [[Victoria Snow (Earth-616)|Victoria Snow]], offering her funding (as the company was on the verge of bankruptcy) in exchange for the use of their plant. Kor re-named his crew the Lunatic Legion, after the former group formed by Fer-Porr, Sro-Himm, Zarek, etc. \n\nThey continued their plans to transform humanity into genetic duplicates of the [[Kree]], unaware that this plan was at odds with the Supreme Intelligence's plan for the Kree, which involved evolving them beyond their current stagnant form. Later, as [[Iron Man (Anthony \"Tony\" Stark)|Tony Stark]] investigated PowerSource for unrelated reasons, he was assaulted by a drunken [[Carol Danvers (Earth-616)|Warbird]], which led [[Dylon-Cir (Earth-616)|Dylon Cir]] to declare their security to be compromised and to try to contain the discovery. Stark became Iron Man, but Cir unleashed [[Sentry 571 (Earth-616)|Sentry #571]] to hold off the two [[Avengers (Earth-616)|Avengers]] while he and the other Kree agents present escaped, taking with them the experimental energy generator they had sought. After Iron Man and Warbird had destroyed the Senry, Warbird pursued the Kree ship.{{r|Iron Man Vol 3 #7}}\n\nThe [[Talla Ron (Earth-616)|Talla Ron]], Dylon Cir, and the [[Bald Twins (Earth-616)|bald twins]] assaulted [[Attilan]], stealing a sample of [[Terrigen Crystals|Terrigen Mist]] from the [[Inhumans]].{{r|Quicksilver Vol 1 #10}}. Establishing another base in an abandoned missile silo in [[Cape Canaveral]], the Kree captured a number of humans and began testing the Terrigen Mist on them, hoping to use it to transform humans into Kree genetic duplicates that they could then use as slave labor. Warbird pursued the Lunatic Legion to their Cape Canaveral base. Warbird summoned [[Steven Rogers (Earth-616)|Captain America]] for help against the Lunatic Legion, but lied to him, telling she had already called in other reinforcements as she was hoping to impress him due to her recent failings. The Legion subdued Warbird and experimented on her form, searching for the key (via her human-Kree hybrid physiology) to mutate humanity as per their goal. Captain America arrived and freed Warbird, but when she tried to capture the escaping Kree, she was instead captured by them and brought to the [[Luna (Moon)|Moon]].{{r|Captain America Vol 3 #8}}\n\nKor tormented Warbird as the Kree completed their study of her, learning how to successfully accomplish the intended mutation of humanity. Quicksilver, [[Clinton Barton (Earth-616)|Hawkeye]], and the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] (who could also summon [[Simon Williams (Earth-616)|Wonder Man's]] energy form) traveled to the moon via [[Lockjaw (Earth-616)|Lockjaw]]. Upon their arrival, the Supreme Intelligence revealed to them the Lunatic Legion's ultimate goal, explaining the use of PowerSource's generator to fuel the Omni-Wave projector, whose output would be filtered through the Terrigen Mists, transforming humanity. Quicksilver rescued Warbird, who consumed a large quantity of Kree alcohol to help steady herself (from her withdrawal symptoms). After Lockjaw took the Kree's Terrigen supply, the drunken Warbird flew in, destroying the generator, but wounding Lockjaw and nearly killing everyone via explosive decompression when she shattered the Kree building. The Avengers escaped, assuming the threat to be over, but the Kree restored the atmosphere of their building, and Galen Kor revealed that they would use their own lives as power.{{r|Quicksilver Vol 1 #10}}\n\nKor announced the imminent success of the Lunatic Legion's plans to the Supreme Intelligence, who was greatly displeased. The Intelligence thus sent a transmission to [[Avengers Mansion]], informing them of the persistence of the threat. The Avengers (Captain America, [[Angelica Jones (Earth-616)|Firestar]], Hawkeye, [[Vance Astrovik (Earth-616)|Justice]], Quicksilver, Scarlet Witch, [[Thor Odinson (Earth-616)|Thor]], Wonder Man) traveled to the moon, battling the Kree there. Kor activated the [[Omni-Wave Projector]]; he and the rest of the Lunatic Legion were transformed into energy in order to power the device. However, Thor opened a dimensional portal to re-direct the Omni-Wave's mutagentic energy and despite Lor's distracting assault on Thor, Firestar held the portal open with her own energies and Justice re-directed the Omni-Wave into the portal.{{r|Avengers Vol 3 #7}}\n\n| Equipment               = Omni-Wave Projector\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * http://www.marvunapp.com/Appendix2/lunaticlegionkor.htm\n}}\n[[Category:Kree Organizations]]\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "93596"
}