{
    "pageid": 492987,
    "ns": 0,
    "title": "Malone Family (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Malone Family (Earth-616) from Sub-Mariner Comics Vol 1 12 0001.jpg\n| Name                    = Malone Family\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = \n| CurrentMembers          = Jake Malone\n| FormerMembers           = Tom Malone, Pete Malone, Pat Malone (all deceased)\n| Allies                  = \n| Enemies                 = [[Thomas Halloway (Earth-616)|Angel]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gustav Schrotter\n| First                   = Sub-Mariner Comics Vol 1 12\n| Last                    = Sub-Mariner Comics Vol 1 12\n\n| HistoryText             = Tom Malone was a notorious bank robber who was active in the 1940s. In 1944, the [[Thomas Halloway (Earth-616)|Angel]] and the police opposed Malone's most recent robbery, ending in Malone being fatally shot by the authorities. His surviving relatives were his three children Pete, Pat and Jake. Upon learning of their father's death, the Malone children blamed the Angel and sought to gain revenge while also continuing their father's criminal career.\n\nTo this end, Pete had Pat get a job as an usher for a charity bazaar where priceless jewels were to be put on display. When the Angel showed up at the event, Pete had Jake set one of the tents on fire. While the Angel was busy apprehending Jake and tying him up, Pete and Pat made an attempt at stealing the jewels. When the Angel tried to stop them, Pete knocked the Angel out, and both older siblings fled the scene.\n\nWhen the Angel attempted to question Jake, the young boy sucker-punched the hero and fled, leading the Angel back to the Malone home. There, Jake was able to warn his elder siblings of the Angel's arrival, and they caught him in a foot snare and set a fire beneath him and left him to die. The Angel freed himself from the trap and jumped onto their speeding getaway vehicle. While struggling with Pete (who was behind the wheel) the car crashed, throwing Pat from the vehicle, killing her on impact. Just as Pete was about to bash out the Angel's brains with a rock, Jake discovered his sister's dead body. Upon learning that his sister was dead and that it was his fault, Pete lost his mind and, suicidal from grief, threw himself off a nearby cliff, falling to his death.\n\nAs Jake cried over his sister's dead body, the Angel explained to the boy that sometimes revenge has a heavy price to pay and left Jake to deal with the authorities.{{r|Sub-Mariner Comics Vol 1 12}} Jake's subsequent fate is unknown.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Crime Families]]\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "492987"
}