{
    "pageid": 637940,
    "ns": 0,
    "title": "Mandan (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Mandan (Earth-616) from Ringo Kid Vol 1 3 0001.jpg\n| Name                    = Mandan\n| Aliases                 = Mandan people\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Flying Cloud, Three Bears (Deceased)\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Blaine Colt (Earth-616)|Kid Colt]]\n| Enemies                 = [[Ringo Kid (Earth-616)|Ringo Kid]] \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[North Dakota (State)|North Dakota]], [[South Dakota (State)|South Dakota]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Kid Colt Outlaw #13\n\n| History                 = \n===Overview===\nThe Mandan people were a tribe of Native Americans who originated from North and South Dakota.<ref>[[Wikipedia:Mandan|Wikipedia]]</ref> Presumably their general history is similar to that of the real world.\n\n===American Frontier===\nThe Mandan people had a number of encounters with famous gunslingers who were active during the time, sometimes as friends sometimes as foe depending from each specific tribe and what their motivations were at the time.\n\nThe first recorded encounter was with [[Blaine Colt (Earth-616)|Kid Colt]], who had befriended Mandan chief Flying Cloud. Flying Cloud's tribe was being stirred up into going to war against white settlers by the renegade Three Bears. When Flying Cloud refused to go to war he was restrained by his people. Kid Colt came to his rescue and challenged Three Bears to a fight. He lost the initial conflict, but was only knocked out and left for dead. Flying Cloud nursed Kid Colt back to health and the two decided to use Three Bear's superstition against him: Convincing Three Bears that Kid Colt was resurrected by the Native American god [[Gitche Manitou (Earth-616)|Manitou]], Kid Colt confronted Three Bears and his followers and gunned them down. Flying Cloud then retook his tribe and restored order.{{r|Kid Colt Outlaw #13}}\n\nAnother tribe lived at peace for years with the neighboring [[Comanche Nation (Earth-616)|Comanche]] tribe until they soon began to believe a sacrificed needed to be made to Manitou, by kidnapping a Comanche girl and plotting to sacrifice her during the next lightning storm. This threatened to put the Mandan and Comanches at war, but when the [[Ringo Kid (Earth-616)|Ringo Kid]] (half-Comanche himself) learned of this, he convinced the Comanche elders to allow him to free the girl on their behalf. Ringo Kid prevented the sacrifice, slaying all those involved and apparently stopping further hostilities between the Comanches and the Mandans in that region.{{r|Ringo Kid Vol 1 3}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Historical Organizations]]\n[[Category:Native American Tribes]]"
                }
            }
        }
    ],
    "page_id": "637940"
}