{
    "pageid": 659176,
    "ns": 0,
    "title": "Marauders (Outlaws) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Marauders (Outlaws) (Earth-616) from Outlaw Kid Vol 1 6 0001.jpg\n| Name                    = Marauders\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = The Valley of No Return, [[Texas (State)|Texas]]\n\n| Leaders                 = Fargo\n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Lance Temple (Outlaw Kid) (Earth-616)|Outlaw Kid]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Outlaw Kid #6\n| Last                    = Outlaw Kid #6\n\n| HistoryText             = The Marauders were a gang of outlaws who were active in Texas during the days of the American Frontier. To conceal their identities they wore body length sheets to mask themselves. Led by an outlaw named Fargo, the gang operated out of a cave located in the mist filled Valley of No Return. Their crime spree attracted the attention of masked gunslinger the [[Lance Temple (Outlaw Kid) (Earth-616)|Outlaw Kid]]. When the Marauders were next going to attack the Outlaw Kid's home town of [[Caliber City]], this prompted stage coach operator Henry Evans to consider closing down his operations in the town. Learning of this, the Outlaw Kid convinced Evans and the sheriff to assist him in laying a trap for the Marauders. Sending out a stage coach with a lock box filled with rocks, the Outlaw Kid had the sheriff pose as the hero when attempting to stop the robbery. While the Marauders were fleeing from the phony Outlaw Kid, the real masked hero had dawned a full body sheet and infiltrated the group. The Marauders then were tricked into leading the Outlaw Kid into their base where he easily dismantled the organization and brought them to justice. The gang was turned over to the authorities and their subsequent fate is unknown.{{r|Outlaw Kid #6}}\n\n| Equipment               = \n| Transportation          = The Marauders rode horses.\n| Weapons                 = The Marauders were armed with six-shooters and rifles.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Western Teams]]\n[[Category:Shooting]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "659176"
}