{
    "pageid": 474750,
    "ns": 0,
    "title": "Martians (Nazi Impostors) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Martians (Nazi Impostors) (Earth-616) from Captain America Comics Vol 1 15 0001.jpg\n| Name                    = Martians\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]] and [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Al Avison\n| First                   = Captain America Comics Vol 1 15\n\n| History                 = Inspired by the radio play adaptation of [[Herbert George Wells (Earth-616)|H.G. Wells]]' ''War of the Worlds'' (as read by actor [[Orson Welles (Earth-616)|Orson Welles]]) and the hysteria it caused by tricking Americans into thinking there was a real invasion, members of the [[National Socialist German Workers Party (Earth-616)|Nazis]] decided to mimic it for their most recent attack on American soil during [[World War II]].\n\nIn the summer of 1942, armed with realistic looking costumes and prop weapons, these \"Martians\" attacked Gotham City. Taking over city hall and slaying the mayor, they demanded that the human race surrender and began using their \"ray gun\" to destroy nearby ships (actually rigged with time bombs). Their invasion attracted the attention of [[Steven Rogers (Earth-616)|Captain America]] and [[James Buchanan Barnes (Earth-616)|Bucky]] who fought back. Cap was captured and demanded to surrender on behalf of the human race; however he refused.\n\nThrough their battles against the Martians, Captain America and Bucky learned the truth and easily trounced the phony Martians, revealing their true identities to the world and foiling their plot to frighten America into a state of hysteria.{{r|Captain America Comics Vol 1 15}}\n| Equipment               = The \"Martians\" all wore lifelike costumes that made them appear to be gigantic creatures from outer space. They were simply rubber body suits and masks with stilts to make their arms and legs appear to be longer than normal. They also used a \"ray gun\" projector, which was really just a spotlight disguised as a weapon. \n| Transportation          = \n| Weapons                 = The Martians were all armed with German Lugers that were disguised to look like ray guns. They had time bombs which they planted in ships to give the illusion that their ray guns were real.\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "474750"
}