{
    "pageid": 8028,
    "ns": 0,
    "title": "Masters of Silence (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Masters of Silence (Earth-616) from Marvel Comics Presents Vol 1 149 0001.jpg\n| Name                    = Masters of Silence\n| Aliases                 = Warrior Souls, Three Storms\n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Tokyo\n\n| Leaders                 = the eldest member is given rank of Sensei\n| CurrentMembers          = [[Meredith McCall (Earth-616) |Kaze]], [[Arashi Wakayama (Earth-616) |Inazuma]], [[Kiyoshi Kurata (Earth-616) |Kaminari]] \n| FormerMembers           = [[Daichi Sakamoto (Earth-616)|Kaze]], Inazuma, Kaminari (multiple incarnations)\n| Allies                  = [[Iron Man (Tony Stark)|Iron Man]], [[Ghost Rider (Dan Ketch)|Ghost Rider]]\n| Enemies                 = [[Justin Hammer (Earth-616)]], [[Face Thief]], [[Tsin Hark]]\n\n| Origin                  = The Shinma demon [[Kao-Gotu Suru (Earth-616) |Kao-Goto Suru]], also known as the Face Thief, killed and replaced the warlord Tezuka. He then led Tezuka's armies in rebellion against the emperor. Only three warriors survived the disastrous campaign. After discovering the truth, they swore vengeance on the demon. They asked the gods for assistance and were empowered by the Three Storms: Kaze (Wind), Inazuma (Lightning), and Kaminari (Thunder). \n\n| PlaceOfFormation        = Feudal Japan \n| PlaceOfDissolution      = \n| Creators                = Len Kaminski; Kevin Hopgood\n| First                   = Iron Man Vol 1 281\n| Last                    = \n\n| HistoryText             = The Masters of Silence uphold a strict code of bushido. When called upon, they extract vengeance for their employer. While this usually means death, other compensation may be offered and agreed to. Each master is bound to their warrior soul until death; a new host must then be found.\n\nThe Masters are able to conceal their presence. Highly advanced sensors may be able to detect them, but normal devices may only be able to catch a glimpse of their shadow at best. However, as a matter of honor, they will reveal themselves to their bounty.\n\nThe current group fully embraces technology and the modern world. They were tricked by [[Justin Hammer (Earth-616) |Justin Hammer]] into attacking [[Anthony Stark (Earth-616) |Iron Man]], but then joined Iron Man in demolishing Hammer's facilities. {{r|Iron Man Vol 1 281|283}}{{r|Iron Man Vol 1 288}}\n\nIron Man again encountered the Masters as they searched for the Face Thief. Kaze was killed, but [[Meredith McCall (Earth-616) |Meredith McCall]] was chosen by the warrior's soul to replace him, as the Face Thief had murdered both her husband and father.{{r|Iron Man Annual Vol 1 14}}\n\nWhile investigating The Golden Triad's abduction and ritual sacrificing of children, the Masters met [[Daniel Ketch (Earth-616)|Ghost Rider]]. Initially confusing him for a monster summoned by the Triad, they joined forces due to their shared interest of vengeance. Although they were unable to stop Tsin Hark's ritual, they managed to keep his army at bay long enough for Ghost Rider to defeat him.{{r|Marvel Comics Presents Vol 1 137|142}}\n\n| Equipment               = Armor; other devices.\n| Transportation          = Motorbikes\n| Weapons                 = wakizashi, remote-controlled shuriken (all); katana (Inazuma), kusari-gama (Kaze), sasumata (Kaminari) \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * [[Iron Manual Mark 3 Vol 1 |Iron Manual Mark 3]]\n}}\n[[Category:Japanese Organizations]]"
                }
            }
        }
    ],
    "page_id": "8028"
}