{
    "pageid": 505119,
    "ns": 0,
    "title": "Megalos (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Megalos (Earth-616) from Marvel Mystery Comics Vol 1 61 0001.jpg\n| Name                    = Megalos\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = A secret island\n\n| Leaders                 = [[Master Megalo (Earth-616)|Master Megalo]]\n| CurrentMembers          = \n| FormerMembers           = [[Master Megalo (Earth-616)|Master Megalo]], unnamed members\n| Allies                  = \n| Enemies                 = [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Allen Simon\n| First                   = Marvel Mystery Comics Vol 1 61\n| Last                    = Marvel Mystery Comics Vol 1 61\n\n| HistoryText             = The Megalos were creations of a mad scientist who called himself the [[Master Megalo (Earth-616)|Master Megalo]]. All were animal-human hybrids that were loyal to him. It is unknown if they were willing test subjects or victims that were conditioned to be his obedient followers after transformation. \n\n[[File:Megalos (Earth-616) from Marvel Mystery Comics Vol 1 61 0002.jpg|thumb|190px|left|Megalo Octopus]]\nHis creations included a group of octopi that had human intelligence, a four armed man, an man with reptilian scales and an alligators head, a human/crab hybrid, and men with the bodies of gorillas.\n\nSeeking to start his own civilization of Megalos, the Master Megalo lead some of his minions attacked the island of Pagano to steal supplies and architecture for their secret island base. This led the people of Pagano to call the [[Namor McKenzie (Earth-616)|Sub-Mariner]] for help. When at the local hospital, he failed to stop an ape-man from kidnapping nurse Grace Johnson. He later clashed with her captor and killed him in battle. Namor then failed to stop a group of octopus from robbing a supply ship of its medical supplies.\n\nTracking down the Megalos to their secret hideout, fighting his way past the crab-man. Namor fought the other Megalos, killing their leader by stabbing him to death with a scalpel. With the other Megalos reeling from their leader's death, Namor caused their hidden sanctuary to collapse upon them killing the remaining Megalos.{{r|Marvel Mystery Comics Vol 1 61}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "505119"
}