{
    "pageid": 914839,
    "ns": 0,
    "title": "Mercenary Organization Dedicated Only to Killing (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Mercenary Organization Dedicated Only to Killing (Earth-616) from Unbelievable Gwenpool Vol 1 2 001.jpg\n| Name                    = Mercenary Organization Dedicated Only to Killing\n| Title                   = [[M.O.D.O.K.]]\n| EditorialNames          = \n| Aliases                 = [[M.O.D.O.K.]],{{r|Unbelievable Gwenpool Vol 1 2}} M.O.D.O.K. Team{{r|Unbelievable Gwenpool Vol 1 8}}\n\n| Leaders                 = Formerly [[Gwendolyn Poole (Earth-TRN565)|Gwenpool]], [[M.O.D.O.K. Superior (Earth-616)|M.O.D.O.K.]]\n| CurrentMembers          = \n| FormerMembers           = [[M.O.D.O.K. Superior (Earth-616)|M.O.D.O.K.]], [[Georges Batroc (Earth-616)|Batroc the Leaper]], [[Gwendolyn Poole (Earth-TRN565)|Gwenpool]], [[Mega Tony (Earth-616)|Mega Tony]], [[Terrible Eye (Sarah) (Earth-616)|Terrible Eye]], [[Cecil (Hacker) (Earth-616)|Cecil]], [[Poole Boys (Earth-616)|Poole Boys]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Teuthidans]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Mobile Fortress\n| PlaceOfFormation        = Unknown\n| PlaceOfDissolution      = [[Bay Ridge]]\n\n| Creators                = Christopher Hastings; Gurihiru\n| First                   = Unbelievable Gwenpool Vol 1 1\n\n| History                 = The Mercenary Organization Dedicated Only to Killing was created by [[M.O.D.O.K. Superior (Earth-616)|M.O.D.O.K. Superior]], sometime following his depature from [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]]. It consisted of [[Mega Tony (Earth-616)|Mega Tony]], [[Terrible Eye (Sarah) (Earth-616)|Terrible Eye]], [[Georges Batroc (Earth-616)|Batroc the Leaper]],{{r|Unbelievable Gwenpool Vol 1 2}} and an army of foot soldiers.{{r|Unbelievable Gwenpool Vol 1 9}} The organization worked for [[Vincent Doonan (Earth-616)|Vincent Doonan]], a man living in the suburbs who used M.O.D.O.K. to eliminate any possible threats to peace and quiet.{{r|Unbelievable Gwenpool Vol 1 9}}\n\nAfter independent mercenary [[Gwendolyn Poole (Earth-TRN565)|Gwen Poole]] killed M.O.D.O.K.'s top foot soldier by catching him off-guard and throwing him in a furnace in the middle of a mission she took credit for, M.O.D.O.K. drafted her into the organization, believing she had skills, considering she had disposed of his top agent. She reluctantly accepted after M.O.D.O.K. killed her mission control and friend, a young hacker named [[Cecil (Hacker) (Earth-616)|Cecil]].{{r|Unbelievable Gwenpool Vol 1 1}}\n\nM.O.D.O.K. eventually turned against Gwen after finding out that she lacked any powers or skill whatsoever. Gwen managed to defend herself against M.O.D.O.K., in part due to the slight training she received from Batroc. M.O.D.O.K. was ultimately defeated when Gwen Poole summoned Cecil's ghost, whose presence was made possible in the world of the living by [[Stephen Strange (Earth-616)|Doctor Strange]]. Cecil infiltrated and overrode the systems of M.O.D.O.K.'s chair and sent him into space. With M.O.D.O.K. defeated, Gwen was assigned the new head of the organization.{{r|Unbelievable Gwenpool Vol 1 4}}\n\nWhile Gwen met up with Vincent to ensure their continuing collaboration, [[Earth]] was invaded by an army of [[Teuthidans]], an alien race of which many of its specimens had been killed by M.O.D.O.K.'s top agent as part of the very same job Gwen took credit for.{{r|Unbelievable Gwenpool Vol 1 7}} When Doonan discovered that Gwen's plan to deal with the Teuthidans involved gravely disrupting the harmony of the [[New York City Police Department (Earth-616)|NYPD]] and luring the aliens to [[Times Square]] to slaughter them, he decided to turn over Mega Tony, Mad Eye and Batroc to the Teuthidans to force Gwen to surrender, having concluded that the Teuthidans would simply go away without causing further disorder as soon as they got what they wanted.{{r|Unbelievable Gwenpool Vol 1 8}}\n\nGwen escaped Vincent's grasp, who revealed himself to be a [[Doombot]] trying to live a normal life, and fled to M.O.D.O.K.'s mobile base. When they were trying to come up with a plan, Gwen learned of the existence of M.O.D.O.K.'s foot soldiers, whom she had never met before.{{r|Unbelievable Gwenpool Vol 1 9}} Gwen travelled to Vincent's neighborhood, [[Bay Ridge]], where the Teuthidans had her friends captured, and deployed the foot soldiers, now rebranded the [[Poole Boys (Earth-616)|Poole Boys]], to fight the Teuthidan troops while she used the arsenal of the mobile base on the alien ships. Gwen abandoned the mobile base when it was heavily damaged and began to collapse. As it was about to crush the house of tow of Vincent's neighbors, Doonan halted its fall and diverted it to the remaining Teuthidan ships right before it exploded.<!-- {{r|Unbelievable Gwenpool Vol 1 10}} -->\n\nWith their base and all equipment destroyed, any ties with their client surely cut, and the arrest of the Poole Boys by the police, Mega Tony, Terrible Eye and Batroc decided it was better to dissolve the organization, much to Gwen's dismay.{{r|Unbelievable Gwenpool Vol 1 10}}\n\nThe former M.O.D.O.K. agents later reunited in anticipation for M.O.D.O.K. Superior's return to Earth. He swore revenge upon them only for their collective might to scare him off.{{r|Unbelievable Gwenpool Vol 1 25}}\n| Transportation          = M.O.D.O.K Headquarters is itself a 'giant mobile fortress' capable traversing upside down, climbing buildings and walking through the streets of [[New York City]].\n| Weapons                 = The M.O.D.O.K Headquarters had various installed weapons including two gattling guns, missle launchers and some sort of laser weapon.{{r|Unbelievable Gwenpool Vol 1 10}}\n| Notes                   = * Even though M.O.D.O.K. frequently threatened his own employees, his organization was meant to be ultimately a force fo good, accepting only \"payment for the blood of evil.\"{{r|Unbelievable Gwenpool Vol 1 2}}\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "914839"
}