{
    "pageid": 471047,
    "ns": 0,
    "title": "Metal Mobsters (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Metal Mobsters (Earth-616) from Marvel Mystery Comics Vol 1 30 0001.jpg\n| Name                    = Metal Mobsters\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = Formerly [[Stephen Cole (Earth-616)|Stephen Cole]]\n| CurrentMembers          = \n| FormerMembers           = [[Leslie Garden (Earth-616)|Leslie Garden]] (forced into membership), [[Stephen Cole (Earth-616)|Stephen Cole]], unnamed members\n| Allies                  = \n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Carl Burgos\n| First                   = Marvel Mystery Comics Vol 1 30\n| Last                    = Marvel Mystery Comics Vol 1 30\n\n| HistoryText             = [[File:Stephen Cole (Earth-616) from Marvel Mystery Comics Vol 1 30 0001.jpg|thumb|left|105px|Stephen Cole]]\nThe Metal Mobsters were formed by museum director [[Stephen Cole (Earth-616)|Stephen Cole]], who sought to steal the Spencer Collection, a collection of diamonds worth a fortune. It just so happened that he was the legal guardian of Mary Orchid who was to marry [[Leslie Garden (Earth-616)|Leslie Garden]]. Garden had invented a new type of metal that was light as balsa wood, could stretch like rubber, and was bullet proof. This metal was dubbed \"Y-9\" by Leslie, who had hoped to give it to the government upon completion. However, Cole kidnapped Garden and forced him to make suits of armor out of Y-9 so that his gang of crooks could rob the Spencer collection and be impervious to law enforcement. In order to avoid his own implication in matters, Cole sought to imprison Mary to force Leslie to lead his men in robbing the gallery.\n\nSending men who were mute, Cole's first attempt to capture Mary happened outside the home of the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]]. The two heroes prevented Mary's capture and learned of the crooks' intention to steal the jewels on display from a newspaper clipping in one of the crooks pockets. \n\nThis proved to be Cole's undoing, as the Torch and Toro soon went to the museum to see the display for themselves. While being shown by Cole, he had his men kidnap Mary. Then pretending to contact the authorities, forced Leslie to lead his fellow crooks in stealing the jewels. The Torch and Toro found that their flames did not effect the armor, and most of the crooks escaped. Capturing the supposed leader, they unmasked him and were shocked to find the \"leader\" to be Leslie Garden. Cole arrived shortly thereafter with the authorities and demanded that Leslie be arrested.\n\n[[File:Leslie Garden (Earth-616) from Marvel Mystery Comics Vol 1 30 0001.jpg|thumb|103px|Leslie Garden]]\nSpotting fresh welts from a whipping on Garden's back, the Torch would not believe this claim and decided to search the museum grounds. The Torch and Toro were then attacked by the true leader of the gang and chased him into a room where Mary was strapped to a stretcher machine. Freeing Mary, the Torch and Toro sent the leader of the Metal Mobsters fleeing. Catching the entire gang out of their protective armor, the two fire-bugs rounded them up and returned Mary upstairs.\n\nThere, the Torch then accused Stephen Cole of being the leader of the mob. Leslie confirmed this by explaining how he was forced to work for them. With no way out, Cole then pulled a gun and held Mary hostage to get away. Cole slipped up by not keeping an eye on Toro who sneaked away during the confrontation and managed to get Cole from behind, saving Mary's life.\n\nThe Metal Mobsters were turned over to the authorities.{{r|Marvel Mystery Comics Vol 1 30}} Cole's fate remains unknown. It does not appear as though Y-9 was accepted by the government.\n\n| Equipment               = [[File:Metal Mobsters (Earth-616) from Marvel Mystery Comics Vol 1 30 0002.jpg|thumb|left|140px|Y-9 armor]]\nEach of the Metal Mobsters wore a suit of armor that was constructed out of an experimental metal called Y-9. It was as light as balsa wood, could stretch like rubber, was bullet proof, and immune to fire. \n| Transportation          = \n| Weapons                 = Stephen Cole was armed with a chemical spray gun that could snuff out the Human Torch and Toro's flames. He was also armed with a whip.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "471047"
}