{
    "pageid": 2978,
    "ns": 0,
    "title": "Micronauts (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Incredible Hulks Enigma Force Vol 1 1 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Micronauts|Enigma Force]]\n| Aliases                 = Micronauts, Microns\n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Arcturus Rann (Earth-616)|Arcturus Rann]]\n| CurrentMembers          = [[Flare (Microns) (Earth-616)|Flare]], [[Mari (Earth-616)|Marionette]], [[Quark (Earth-616)|Quark]], [[Arcturus Rann (Earth-616)|Arcturus Rann]]\n| FormerMembers           = [[Acroyear (Earth-616)|Acroyear]], [[Biotron (Earth-616)|Biotron]], [[Biotron II (Earth-616)|Biotron II]], [[Bug (Insectivorid) (Earth-616)|Bug]],  [[Death's Head (Carl) (Earth-616)|Carl]], [[Cilicia (Earth-616)|Cilicia]], [[Devil (Microverse) (Earth-616)|Devil]], [[Dexam (Earth-616)|Dexam]], [[Fireflyte (Earth-616)|Fireflyte]], [[Iann-23 (Earth-616)|Huntarr]], [[Jasmine (Earth-616)|Jasmine]], [[Jentorra (Earth-616)|Jentorra]], [[Microtron (Earth-616)|Microtron]], [[Microtron II (Earth-616)|Microtron II]], [[Nanotron (Earth-616)|Nanotron]], [[Psyklop (Earth-616)|Psyklop]], [[Scion (Earth-616)|Scion]], [[Solitaire (Microverse) (Earth-616)|Solitaire]]\n| Allies                  = [[Steven Coffin (Earth-616)|Steve Coffin]]; [[Nathan Summers (Earth-616)|Cable]]; [[Fantastic Four (Earth-616)|Fantastic Four]]; [[X-Men (Earth-616)|X-Men]]; [[Scott Lang (Earth-616)|Ant Man]]; [[Janet Van Dyne (Earth-616)|Wasp]]; [[Alpha Flight (Earth-616)|Alpha Flight]]\n| Enemies                 = [[Psyklop (Earth-616)|Psyklop]], [[Psycho-Man (Earth-616)|Psycho-Man]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Microverse]]\n| PlaceOfDissolution      = \n| Creators                = Bill Mantlo; Michael Golden\n| First                   = Micronauts #1\n\n| HistoryText             = The [[Homeworld (Microverse)|Homeworld]] region of the [[Microverse]] was located far from [[Sub-Atomica]], a region occasionally visited by the [[Fantastic Four (Earth-616)|Fantastic Four]] and the original [[Henry Pym (Earth-616)|Ant Man]]. It was discovered by the people of the planet Ithaka (a reference to Ithaca where the legendary Odysseus was born). They were forced to find a new home after the death of their world, joining with refugees from worlds who had suffered similar fates, making the Homeworlders particularly diverse as a culture encompassing multiple species.{{Citation}}\n\nLed by [[Wayfinder (Microverse) (Earth-616)|Prince Wayfinder]], the Homeworlders eventually settled on the then-prehistoric Earth. The Earth was depicted as still being inhabited by dinosaurs at the time of their arrival. Earth was also plagued by demons who fed on the dinosaurs and were hostile to the new arrivals in their territory.{{Citation}}\n\nWayfinder and his leading warriors Agni, Kali, Mara/Maya, and Yama fought valiantly to defend their newly established colony but were eventually outnumbered. The power of The Sword in the Star (as well as the three Mystic Keys) relocated them to the unoccupied Homeworld molecule of the Microverse. The various races of the colonists populated the other local planets. Thus Wayfinder and the other prominent leaders of his people became the first Micronauts, and Wayfinder the original Time Traveller.{{Citation}}\n\nThe capital atom of [[Homeworld (Microverse)|Homeworld]] is called First Zone; this is the former home of the Royal Family, and later the power base of Baron Karza and the location of his Body Banks. Other regions include Seazone (home of Micronaut allies Aquon and Coral), Aegypta (home of friends Prince Pharoid and Margrace), Polaria, and Dead Zone which contains the tomb of Wayfinder, Yama, Agni, Kali, and the rest of Homeworld's original Micronauts, although there is some question about whether Wayfinder is truly dead. Homeworld's sector contains not only the Homeworld molecule planet complex, but the planets [[Spartak]] (home of the [[Acroyears]]), [[Kaliklak]] (home of the [[Insectivorids]] and [[Bug (Insectivorid) (Earth-616)|Bug]]) and Tropica (home of Devil).{{Citation}}\n\nOn Earth, Wayfinder and his people most likely settled in what is now India. Artifacts of Wayfinder's people were found in India, most notably a monolith describing the three Mystic Keys. Due to some of the names and the similarity between Micronese (the Microversian written language) and Sanskrit, there is reason to believe artifacts left behind by Wayfinder and his people may have given rise to some of the Hindu legends. (As a note of trivia, in Micronese, there is no character that represents \"z\". Baron Karza was in fact pronounced Baron Kartha.){{Citation}}\n[[File:Micronauts Vol 1 18.jpg|Dollhouse Trouble!|thumb|left]]\n\n===The Karza War===\nDuring the interludes between Karza's defeats, the Micronauts embarked on a number of subquests, most notably, the search for the Mystic Keys of Wayfinder. This took them from Homeworld's Dead Zone, to Seazone, and even icy Polaria.{{Citation}}\n\nFor an extended period, the Micronauts were marooned on Earth (having breached the spacewall) and were involved in many situations typical of finding oneself in a land of giants. They met a handful of Marvel heroes such as the [[Avengers (Earth-616)|Avengers]], [[Stephen Strange (Earth-616)|Doctor Strange]] (who also journeyed to the Microverse), Fantastic Four (who were more familiar with a different region of the Microverse), [[Nicholas Fury (Earth-616)|Nick Fury]] of S.H.I.E.L.D., and the [[X-Men (Earth-616)|X-Men]], who aided the Micronauts and a temporarily allied Karza against The Entity who threatened to destroy the Microverse. The Entity proved to be a dark aspect of the personality of [[Charles Xavier (Earth-616)|Professor X]] who had gotten loose once before.{{Citation}}\n\nThe Micronauts also battled villains including the Man-Thing, Molecule Man, Psycho-Man, a miniaturized Doctor Doom and HYDRA. But mostly, they battled ordinary Earth objects and animals that were deadly at the Micronauts' size. On several occasions, the servants of Baron Karza followed the Micronauts to Earth and continued the battle there. It was here that an agent of Baron Karza killed Biotron.{{Citation}}\n\nFor a time, it seemed that [[Argon (Microverse) (Earth-616)|Prince Argon]] (aka Force Commander) turned against his former friends and allies to set himself up as a dictator over the Microverse following Karza's first defeat. It was finally discovered that Argon was an unwilling host of a soon to be reborn Karza. Sadly, as soon as this was discovered, Karza returned and broke free of Argon's body, killing Argon in the process.{{Citation}}\n\nOther notable Micronauts include Devil, Fireflyte, Pharoid, Slug, Margrace, Huntarr, Solitaire, and later replicas of Biotron and Microtron. Devil and Fireflyte, members of a species with a complex life-cycle, were stages of each other. Devil was killed by a Soul Survivor. Pharoid, Slug, and Margrace were killed in the Micronauts' major defeat by Baron Karza. Solitaire and the two roboid replicas served aboard Endeavor II during their new voyages after the final defeat of Baron Karza. The final defeat of Baron Karza was costly in that it took place only after Karza had already destroyed almost all life on Homeworld.<ref>The Micronauts comic lasted up until issue #59, #58 being Mantlo's final script.</ref>\n\n===The New Voyages===\nWeary of war, the Micronauts decided to make a pilgrimage of exploration and discovery away from the ruined Homeworld.<ref>This is the basis for the series that immediately followed Micronauts #59, called Micronauts: The New Voyages. It lasted twenty issues and was written by Peter B. Gillis and mostly drawn by Kelley Jones.</ref>\n\nThey discovered a starfaring race known as the Children of the Confluence of Stars and one of their representatives, Solitaire, became a member of the Micronauts. Together, they attempted to piece together a cosmic puzzle that pointed to the Makers, the godlike entities of the Microverse. They discovered that the Enigma Force was now an unstable force that threatened to destroy the fabric of the Microverse.{{Citation}}\n\nThe Micronauts, under the partial guidance of Scion, a self described child of the Makers, discovered that the berserk manifestation of Enigma Force was the injured Worldmind of Homeworld. Using Baron Karza's technology, the Micronauts healed Homeworld by using the cells of their own bodies to initiate a Genesis effect. They sacrificed their lives so that their primal matter would serve to seed Homeworld and eventually give rise to new life.{{Citation}}\n\n[[File:Micronauts Vol 1 41.jpg|thumb]]\n===The Microns===\nFollowing the [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]] crisis, [[Nathan Summers (Earth-616)|Cable]] and several others journeyed to the Microverse to find Arcturus Rann, Mari, and Bug alive and apparently fighting a war against Psycho-Man. The Micronauts now called themselves the Microns.{{r|Cable Vol 1 38}}\n\nBaron Karza and [[Thanos (Earth-616)|Thanos]] battled and the result was the elimination of all microverses except one.{{Citation}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * During the early 1980s, Marvel experimented with the then-new comic book specialty outlets by turning three of their monthly comic titles into \"direct distribution only\" titles. These comics were printed on harder paper stock than the newsprint commonly used for comics at the time, were removed from under the aegis of the Comics Code Authority, and were written and drawn with more mature, adult themes. They were only available via subscription or from a direct distribution comics specialty store. Micronauts was one of the three titles to receive this treatment. (The other two were Moon Knight and Ka-Zar.) For Micronauts, this treatment lasted from issue #38 to issue #58 (the final issue of the first series).\n\n*The Micronauts met the X-Men in an early four-issue miniseries from Marvel.\n\nIn the language of Homeworld, there is no letter corresponding to \"z\". Thus Karza was pronounced \"Kartha.\"\n\n*In a pre-launch interview with a comic industry publication, Bill Mantlo (original comic series author for the Micronauts) said that the character representing the Mego toy \"Galactic Warrior\" would be called \"Ja'an.\" Ultimately, he was renamed \"Bug.\"\n\nThe Mego figure \"Baron Karza\" was introduced at a comics convention in New York in 1976, a year before George Lucas introduced the world to Darth Vader.\n\n*In Micronauts #1, the profile of \"Acroyear\", who bears the name of his own race, states that \"his name is unpronounceable.\" We never learn his true name, but it appears that the unexpected twin birth of him and his albino brother, Shaitan (a form of the word Satan and a character based on the toy, \"Acroyear II\"), left his parents struggling for names.\n\nMicroverses were once frequently believed to exist within atoms. More recent theories postulate them as dimensions to which the entry points are only accessible by shrinking size. Thus, Wayfinder and his people (originally inhabitants of the Macroverse) were shrunk by the Sword in the Star so that they could gain access to the Microverse.\n\n*The Cable series is the only instance when the name Micronauts is used. Strangely, Huntarr did not reappear, as he was a regular Micronaut since the later run of the first series and, being created by Mantlo, was not under licensing restrictions of any kind.\n\n*In a brief Alpha Flight cameo appearance, it is clear that the unnamed Micronaut character shown was originally intended to be Acroyear as there is noticeable evidence that the character had to be redrawn at the last minute due to licensing restrictions.\n\n*In Captain Marvel (third series), reference was made to a battle with Baron Karza and Thanos, the result being the elimination of all Microverses except one. The reference came with an editor's note mentioning a comic that was never printed or released.\n\n*During the mid to late 1990s, at least one animation company expressed an interest in developing a Micronauts animated series based around the comics characters. Character design artwork was produced and formerly available on the internet. It included character designs for Rann, Mari, Bug, Acroyear, Karza, and also Ray and Steve Coffin who were supporting characters during the Micronauts' early voyages on Earth. The design for Rann borrowed from Disney's Buzz Lightyear instead of the Marvel Comic. The other characters are mostly similar to their original designs.\n\nThe only exception was that Acroyear, underneath his helmet, reportedly would have Caucasian instead of ebony skin. Other than character designs and rough profiles, very little was known as to how closely the animated series would have followed the comic. Failing to find a sponsor, this project was declared dead as of 1999.\n| Links                   = \n}}\n==References==\n{{Reflist}}"
                }
            }
        }
    ],
    "page_id": "2978"
}