{
    "pageid": 1570738,
    "ns": 0,
    "title": "Mighty Avengers (Pym) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Mighty Avengers Vol 1 26 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Mighty Avengers]]\n| Aliases                 = [[Avengers]]{{r|Mighty Avengers Vol 1 21}}\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Infinite Avengers Mansion]]\n\n| Leaders                 = Formerly [[Henry Pym (Earth-616)|Wasp]]\n| CurrentMembers          = \n| FormerMembers           = [[Bruce Banner (Earth-616)|Hulk]], [[Anthony Stark (Earth-616)|Iron Man]], [[Jocasta Pym (Earth-616)|Jocasta]], [[Pietro Maximoff (Earth-616)|Quicksilver]], [[Loki Laufeyson (Earth-616)|\"Scarlet Witch\"]], [[Cassandra Lang (Earth-616)|Stature]], [[Jonathan Walker (Earth-616)|U.S.Agent]], [[Vision (Jonas) (Earth-616)|Vision]], [[Henry Pym (Earth-616)|Wasp]]\n| Allies                  = [[New Avengers (Earth-616)|New Avengers]], {{M|Global Reaction Agency for Mysterious Paranormal Activity (Earth-616)|G.R.A.M.P.A}}, [[People's Defense Force (China) (Earth-616)|People's Defense Force]]\n| Enemies                 = [[Carl Creel (Earth-616)|Absorbing Man]], [[Cabal (Dark Illuminati) (Earth-616)|Cabal]], [[Intelligencia (Earth-616)|Intel]], [[Fritz von Meyer (Earth-616)|Swarm]], [[Terminus (Destroyer) (Earth-616)|Terminus]], [[Thunderbolts (Earth-616)|Thunderbolts]], [[Ultron (Earth-616)|Ultron]], [[Unspoken (Earth-616)|Unspoken]], [[Void (Dark Sentry) (Earth-616)|Void]], [[Zzzax (Earth-616)|Zzzax]], [[Dark Avengers (Earth-616)|Dark Avengers]], [[Chthon (Earth-616)|Chthon]], [[Titan (Atlantean Beast) (Earth-616)|Titan]], [[Modred (Earth-616)|Modred]]\n\n| Origin                  = Formed by [[Henry Pym (Earth-616)|Hank Pym]] after the [[Secret Invasion|Skrull Invasion]] as a result of [[Loki Laufeyson (Earth-616)|Loki]]'s machinations \n| PlaceOfFormation        = [[Wundagore Mountain|Mount Wundagore]], [[Transia]]\n| PlaceOfDissolution      = [[Underspace]]\n| Creators                = Dan Slott; Khoi Pham\n| First                   = Mighty Avengers Vol 1 21\n| Last                    = Mighty Avengers Vol 1 36\n\n| Quotation               = I'm glad it's '''you,''' [[Henry Pym (Earth-616)|Hank]]. Dark times are coming. And if you let me, I'll help you be the light that fights through the darkness. I've gathered an army for you. An army of heroes.\n| Speaker                 = [[Loki Laufeyson (Earth-616)|Scarlet Witch]]\n| QuoteSource             = Mighty Avengers Vol 1 21\n\n| HistoryText             =\n\n===Dark Reign===\n[[File:Mighty Avengers Vol 1 31 Textless.jpg|thumb|left|the new Mighty Avengers]][[Loki Laufeyson (Earth-616)|Loki]] took the form of Scarlet Witch, and manipulated a new group of Avengers to form in order to embarrass Norman Osborn. The [[Bruce Banner (Earth-616)|Hulk]] briefly returned to active duty as an Avenger for the first time since he left the team after having helped found it. Free from Skrull captivity, fellow founder [[Henry Pym (Earth-616)|Hank Pym]] returned to active duty as the new Wasp, struggling to come to terms not only with the post-Civil War world, but with the death of the love of his life, the original Wasp. Two [[Young Avengers (Earth-616)|Young Avengers]] joined the team, the new [[Vision (Jonas) (Earth-616)|Vision]] and [[Cassandra Lang (Earth-616)|Stature]], as well as [[Jocasta Pym (Earth-616)|Jocasta]], all of whom were results of different aspects of Pym's legacy. The muscle-bound [[Hercules Panhellenios (Earth-616)|Hercules]], [[Amadeus Cho (Earth-616)|Amadeus Cho]] and [[Jonathan Walker (Earth-616)|US Agent]] rounded out the roster.{{Citation}}\n\nThe team gathered at [[Wundagore Mountain]]. Iron Man arrived on the scene, hoping to take control of the team. The united forces of the Avengers, aided by who they believed to be Wanda, quashed the threat of [[Chthon (Earth-616)|Chthon]], when he returned by possessing the body of [[Pietro Maximoff (Earth-616)|Quicksilver]] with the help of [[Modred (Earth-616)|Modred]].{{r|Mighty Avengers Vol 1 21}}. Hank Pym led the team to victory and Quicksilver was freed from his demonic control. {{Citation}}\n\nThe Mighty Avengers become an international team by the international organization [[Global Reaction Agency for Mysterious Paranormal Activity (Earth-616)|G.R.A.M.P.A.]], and were authorized to work outside of the [[United States of America|United States]]. After aiding the team against numerous villains, Quicksilver was accepted as a member. Quicksilver hoped to use the Mighty Avengers to reunite with [[Wanda Maximoff (Earth-616)|his sister]].{{r|Mighty Avengers Vol 1 24}} In escaping [[H.A.M.M.E.R. (Earth-616)|H.A.M.M.E.R.]] agents, Jocasta inadvertently untethered the \"PymPocket\" base from reality. Henry Pym contacted Reed Richards, hoping to borrow a device that had been left in the Fantastic Four's care by the late [[William Foster (Earth-616)|Bill Foster]]. When Reed refused Pym decided to have his team break into the [[Baxter Building]] and steal the device. Pym was successful, and eventually convinced Richards to hand the device over to his Avengers. Pym managed to move the Pym Pocket to a new dimensional location. The degradation of the dimensional gateways required Jocasta to be voluntarily integrated into the system in order to hold it together. The end result was the creation of the [[Infinite Avengers Mansion]], their new base, which would enable them to respond to any crisis.{{Citation}}\n\n[[File:Mighty Avengers Vol 1 30 Textless.jpg|thumb|right|The Mighty Avengers with the [[New Avengers (Earth-616)|New Avengers]]]]\nQuicksilver and U.S. Agent were sent to [[China]] to determine a possible alliance between the communist government and the [[Inhumans (Earth-616)|Inhumans]]. But they soon found out that it is the actually an incursion caused by the exiled Inhuman king known only as the [[Unspoken (Earth-616)|Unspoken]]. The Unspoken, outcast from his people for removing the [[Slave Engine]] and Xerogen Crystals from [[Attilan]], he decided to redeem himself by using the Engine and crystals to convert all of humanity into [[Alpha Primitives (Earth-616)|Alpha Primitives]].\n\nQuicksilver attempted to contact his team for help. However, Loki severed communications, fearing that his belief that she was his sister would put a wedge in her plans and hoped that Quicksilver would die. Stature caught her in the act but was magically gagged to prevent her from saying anything bad about \"the Scarlet Witch\". Therefore, she invited her fellow Young Avengers into the Mansion and tricked them into summoning Loki/Scarlet Witch. Her tolerance for Stature lost, \"Wanda\" decided to kill them all. However, [[Clinton Barton (Earth-616)|Clint Barton]], the former Hawkeye, had sneaked into the Mansion and determined that Loki was not the Scarlet Witch by kissing her. Loki was forced to flee in order to escape exposure and cast a ward to prevent being summoned again. This canceled out the spell on Stature, who alerted everyone to what's happened in China.\n\nThe Mighty Avengers gathered the [[New Warriors (Earth-616)|Avengers Resistance]] and [[New Avengers (Earth-616)|New Avengers]] to deal with the Unspoken. They managed to defeat him by turning a chronal ray against him, aging him to the point isn't a threat.\n\nAfter dealing with civil unrest on the [[Kree]] planet [[Hala (Planet)|Hala]], ruled by the Inhumans, the Mighty Avengers returned to Earth, where they continued their global peacekeeping efforts. Their continued achievements overshadowed Osborn, who called together his [[Cabal (Dark Illuminati) (Earth-616)|Cabal]] to destroy the Mighty Avengers once and for all. Only Loki, back in his male form, responded to the call. He manipulated Osborn into craving more glory. Then, secretly, Loki made one final test for Osborn, by having both Avengers teams pitted against the [[Carl Creel (Earth-616)|Absorbing Man]]. He pulled strings in the fight and portrayed Osborn as a hero, who then uses his authority to strip U.S. Agent of his rank. However, Pym saw him in the crowd. He then set up a machine designed to trap Loki. Quicksilver wanted to divulge the location of his sister Wanda from him, to which the Trickster God answers that he doesn't know, but Quicksilver doesn't believe him. After the arrival of Thor, who was summoned by Loki and explaining that it was his half-brother who was deceiving them, Pym attempted to recruit Loki into the Mighty Avengers. This was the last straw for everyone and thus, the Mighty Avengers disbanded.\n\nPym, U.S. Agent and Quicksilver joined forces with Hercules, along with the New Avengers, to stop his step-mother [[Hera Argeia (Earth-616)|Hera]]'s plan to destroy the universe. Unfortunately, when Hercules was seemingly killed trying to save Earth, the impact was so hard on his comrades that they truly went their separate ways, thus finally disbanding the Mighty Avengers. {{r|Mighty Avengers Vol 1 36}}\n\n| Equipment               = \n| Transportation          =\n| Weapons                 = \n\n| Notes                   = \n\n| Trivia                  = \n| Links                   = * [[Mighty Avengers Vol 1]]\n*[[List of Avengers members]]\n}}"
                }
            }
        }
    ],
    "page_id": "1570738"
}