{
    "pageid": 659998,
    "ns": 0,
    "title": "Mighty Avengers (Cage) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = New Avengers Vol 3 28 page 15.jpg\n| ImageSize               = 250px\n| Name                    = [[Mighty Avengers]]\n| Aliases                 = [[Avengers]], [[Secret Avengers]],{{r|New Avengers Vol 3 28}} Superior Avengers\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Gem Theater]], [[Manhattan]], [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = Formerly [[Luke Cage (Earth-616)|Luke Cage]] and [[Monica Rambeau (Earth-616)|Spectrum]]\n| CurrentMembers          = \n| FormerMembers           = '''Field Team:'''<br>\n[[Eric Brooks (Earth-616)|Blade]], [[Adam Brashear (Earth-616)|Blue Marvel]], [[Luke Cage (Earth-616)|Luke Cage]], [[Samuel Wilson (Earth-616)|Captain America (Samuel Wilson)]], [[Kaluu (Earth-616)|Kaluu]], [[Constance Molina (Earth-616)|Constance Molina]], [[Víctor Álvarez (Earth-616)|Power Man]], [[Jennifer Walters (Earth-616)|She-Hulk]], [[Monica Rambeau (Earth-616)|Spectrum]], [[Otto Octavius (Earth-616)|Spider-Man (Otto Octavius)]], [[Spider-Man (Peter Parker)]], [[Ava Ayala (Earth-616)|White Tiger]]\n\n'''Support Team:'''<br>\n[[David Griffith (Earth-616)|Dave Griffith]], [[Jessica Jones (Earth-616)|Jessica Jones]], [[Soraya Khorasani (Earth-616)|Soraya Khorasani]], [[Ruby Neal (Earth-616)|Ruby Neal]]\n| Allies                  = [[Daniel Rand (Earth-616)|Iron Fist]], [[Avengers (Earth-616)|S.H.I.E.L.D.'s Avengers]], [[Max Brashear (Earth-616)|Doctor Positron]]\n| Enemies                 = [[Proxima Midnight (Earth-616)|Proxima Midnight]], [[Shuma-Gorath (Multiverse)|Shuma-Gorath]], [[Spiderlings (Earth-616)|Spiderlings]], [[Otto Octavius (Earth-616)|Spider-Man (Otto Octavius)]], [[Deathwalkers (Earth-616)|Deathwalkers]], [[Deathwalker Prime (Earth-616)|Deathwalker Prime]], [[Gideon Mace (Earth-616)|Gideon Mace]], [[Jason Quantrell (Earth-616)|Jason Quantrell]], [[Cortex Incorporated (Earth-616)|Cortex Inc.]], [[Beyond Corporation (Multiverse)|Beyond Corporation]], [[Tiger God (Earth-616)|Tiger God]], [[Fast Five (Earth-616)|Fast Five]], [[Jonathan Swift (Earth-616)|Blue Streak]], [[Axis (Avengers) (Earth-616)|Axis]]\n\n| Origin                  = Formed when the [[Avengers (Earth-616)|(Main) Avengers]] left the Earth in order to fight the [[Builders (Race)|Builders]].\n| PlaceOfFormation        = [[Times Square]], [[New York City]], [[New York (State)|New York]]\n| PlaceOfDissolution      = \n| Creators                = Al Ewing; Greg Land\n| First                   = Mighty Avengers Vol 2 1\n| Last                    = Captain America and the Mighty Avengers Vol 1 9\n\n| Quotation               = There's a '''word''' we use. Everyone who's ever served as an [[Avengers (Earth-616)|Avenger]], we've spoken that word. Hell, it's a '''competition''' to say it. To '''shout''' it. Because it is '''that''' sacred to what we are and what we do. And that word is '''assemble.''' When we come together, we're '''stronger''' than when we stand apart. That's what it's '''always''' been about. We come together to '''fight''' what can't be fought '''alone.''' To defeat those things in the world that would drag us '''down.''' That would make us '''lesser.''' Those things no single hero can withstand. And by '''we?''' I mean '''all of us.''' When we make the effort to help those who '''need''' us-- to help '''each other''', to be '''there''' for each other -- we are '''all''' Avengers. '''You''' are Avengers. \n| Speaker                 = [[Luke Cage (Earth-616)|Luke Cage]]\n| QuoteSource             = Mighty Avengers Vol 2 3\n\n| HistoryText             = \n===[[Infinity (Event)|Infinity]]===\nWhen the [[Avengers (Earth-616)|Avengers]] left the Earth in order to fight the alien race known as the [[Builders (Race)|Builders]], the Mad Titan [[Thanos (Earth-616)|Thanos]] took advantage of the situation and sent his [[Black Order (Earth-616)|Black Order]] to raze the world.\n\n[[File:Mighty Avengers (Cage) (Earth-616) from Mighty Avengers Vol 2 1 001.jpg|left|thumb|The Mighty Avengers assemble]]\nWhen [[Proxima Midnight (Earth-616)|Proxima Midnight]] and Thanos' goons started wrecking havoc in the streets of New York, a group of heroes assembled to fight them. These heroes were [[Luke Cage (Earth-616)|Luke Cage]], [[Otto Octavius (Earth-616)|Spider-Man]], [[Monica Rambeau (Earth-616)|Spectrum]], and the mysterious Spider Hero.{{r|Mighty Avengers Vol 2 1}} While Proxima was called upon by Thanos to return to him, his other general [[Ebony Maw (Earth-616)|Eboy Maw]] had taken control over [[Stephen Strange (Earth-616)|Doctor Strange]] and summoned [[Shuma-Gorath (Multiverse)|Shuma-Gorath]].{{r|Mighty Avengers Vol 2 2}} [[Ava Ayala (Earth-616)|White Tiger]], [[Víctor Álvarez (Earth-616)|Power Man]] and [[Adam Brashear (Earth-616)|Blue Marvel]] joined the brawl against the monster, ultimately turning the tide and emerging victorious. The dust settled, and Cage decided to officially turn the improvised team into the Mighty Avengers.{{r|Mighty Avengers Vol 2 3}}\n\n===Inhumanity===\nOnce Thanos' invasion was thwarted,{{r|Infinity Vol 1 6}} the Mighty Avengers established their headquarters in the remodeled  [[Gem Theater]], and also established a hotline, with the purpose of helping everyone and anyone who needed them.\n\nThe team's next adventure came to the Mighty Avengers when [[Kaluu (Earth-616)|Kaluu]] contacted the Spider Hero (who would subsequently assume the mantle of [[Ronin]]) to inform him the [[Deathwalkers (Earth-616)|Deathwalkers]] were going to get into the fallen [[Attilan]], the Inhuman city partially sunk in the Hudson river. While a portion of the team headed to Attilan, Luke Cage and his wife [[Jessica Jones (Earth-616)|Jessica Jones]] dealt with an attempted hostile take over from Spider-Man (who was the villain [[Otto Octavius (Earth-616)|Doctor Octopus]] controlling the hero's body at the time).{{r|Mighty Avengers Vol 2 4.INH}}\n\n[[File:Gem Theater from Mighty Avengers Vol 2 5.INH 001.jpg|left|thumb|Now hiring]]\nWhile [[Jennifer Walters (Earth-616)|She-Hulk]] helped Luke and Jessica fend off Spider-Man's forces, the Mighty Avengers encountered a [[Hellhounds (Dire Wraiths) (Earth-616)|Hellhound]] sent by [[Lichidus (Earth-616)|Lichidus]] of the Deathwalkers, who wanted to recover the Lost Talisman of Kamar-Taj from Attilan. With [[Cortex Incorporated (Earth-616)|Cortex Inc.]] operative [[Barbara McDevitt (Earth-616)|Quickfire]] was caught in the middle, the Hellhound was defeated, and Ronin escaped with the Talisman.{{r|Mighty Avengers Vol 2 5.INH}}\n\n===The Deathwalkers===\nSoon after helping the Ava Ayala control the spirit of the White Tiger in Blue Marvel's underwater base, the Mighty Avengers found themselves facing an attack from Blue Marvel's son, the [[Max Brashear (Earth-616)|Doctor Positron]], who blamed his father for his brother's disappearance into the Neutral Zone, and attempted to open a portal to said dimension and rescue him, but failed.{{r|Mighty Avengers Vol 2 #8|9}}\n\n[[File:Mighty Avengers (Cage) (Earth-616) from Mighty Avengers Vol 2 4.INH 001.jpg|thumb|right]]\nAt the time the Avengers were investigating the murder of [[Uatu (Earth-616)|Uatu the Watcher]], the minions of the Deathwalkers were able to subdue Blade after weeks of chase, kidnapping him and taking the Talisman of Kamar-Taj from him.{{r|Mighty Avengers Vol 2 10}}\n\nEven though the Mighty Avengers located Blade and arrived to help him, the Deathwalker's legion of servants provided a distraction so the heroes couldn't get to Deathwalkers before they could finish their ritual. The successfully-finished ceremony merged them together into the [[Deathwalker Prime (Earth-616)|Deathwalker Prime]], a creature with control over the four elements, thus power over the fifth: the spirit, which would be the key for it to destroy humankind.{{r|Mighty Avengers Vol 2 13}}\n\nHowever, the Mighty Avengers managed to get hold of the cup used in the ritual of merging, and using a similar procedure merged themselves into the [[Avenger Prime (Earth-616)|Avenger Prime]], which managed to destroy the Deathwalker Prime, mainly because unlike the Deathwalker, the different personas merged into it were truly spiritually bonded, while the personas composing the Deathwalker were fighting for control. Once the Deathwalkers were defeated, the Avenger Prime broke down back to being individual Avengers.{{r|Mighty Avengers Vol 2 14}}\n\n===AXIS===\nSome of the members of the Mighty Avengers heeded the call for help to defeat the [[Johann Shmidt (Clone) (Earth-616)|Red Onslaught]] in [[Genosha]]. The villain was ultimately defeated when [[Victor von Doom (Earth-616)|Doctor Doom]] and [[Wanda Maximoff (Earth-616)|Scarlet Witch]] cast an inversion spell that flipped the villain's moral axis. However, the spell accidentally affected the people in the scene as well.{{r|Avengers & X-Men: AXIS Vol 1 3}}\n\nLuke Cage became extremely materialistic, going as far as having business affairs with [[Jason Quantrell (Earth-616)|Jason Quantrell]] of Cortex Inc., and Captain America became an fascist who violently beat up criminals. When the new personalities of these heroes clashed with their teammates, they joined the [[Axis (Avengers) (Earth-616)|Axis]] of other inverted Avengers.{{r|Captain America and the Mighty Avengers Vol 1 1|2}}\n\n[[File:Captain America and the Mighty Avengers Vol 1 3 Textless.jpg|thumb|left]]\nThe Axis confronted the Mighty Avengers, with the inverted [[Anthony Stark (Earth-616)|Iron Man]] demanding them to disband due to their use of the Avengers trademark. After a furious battle, Iron Man decided to back off, pretending to the public that the confrontation had been a scheme of the [[Samuel Saxon (Earth-616)|Machinesmith]].{{r|Captain America and the Mighty Avengers Vol 1 3}}\n\n===Beyond Corporation===\nAfter the effects of the inversion had been reversed, Luke Cage pretended to still be his abnormal self in order to keep making business with Cortex Inc. to infiltrate the company and discover its secrets.{{r|Captain America and the Mighty Avengers Vol 1 4}} When Luke and Jessica Jones confronted Quantrell, he revealed himself to be a member of the evil and powerful [[Beyond Corporation (Multiverse)|Beyond Corporation]].\n\nAt the same time, Power Man and White Tiger had followed the trail of the murder of [[Gideon Mace (Earth-616)|Gideon Mace]], who had been turned by Cortex Inc. into a monstrous creature along with [[Barbara McDevitt (Earth-616)|Quickfire]].{{r|Captain America and the Mighty Avengers Vol 1 5}} Meanwhile, [[Adam Brashear (Earth-616)|Blue Marvel]] had been cryptically warned by his son [[Kevin Brashear (Earth-616)|Kevin]] from the [[Exo-Space]] (a dimension outside of reality) of a threat \"from beyond.\"\n\nCaptain America, She-Hulk and Kaluu heeded a call for help from Power Man, who had been infected and turned into a similar monstrous creature shortly after White Tiger suffered the same fate. Luke and Jessica were teleported to the vacuum of space by \"Quantrell,\" but they were rescued by Blue Marvel a few moments later. Once they were safe, they warned their teammates about Beyond Corporation, causing Blue Marvel to realize the meaning behind his son's message. Spectrum took the revelation of the threat of Beyond personally, as she had been manipulated by Beyond Corporation a few years before.{{r|Captain America and the Mighty Avengers Vol 1 6}}\n\nWhile Captain America held the line against his fellow teammates, who had been all turned into monsters, Spectrum confronted \"Jason Quantrell\" and distracted him for long enough that Blue Marvel was able to open a portal to the [[Exo-Space]] and send him back. Once \"Quantrell\" left the universe, the monstrous infection that affected the rest of the team disappeared.{{r|Captain America and the Mighty Avengers Vol 1 7}}\n\n===[[Time Runs Out]]===\nWhen [[Steven Rogers (Earth-616)|Steve Rogers]] and the [[Avengers (Earth-616)|Avengers]] set out to hunt down [[Anthony Stark (Earth-616)|Iron Man]] and the [[Illuminati (Earth-616)|Illuminati]] for hiding the the phenomenon of the [[Glossary:Incursion|incursions]] from the rest of the world, he reached out to the Mighty Avengers, who agreed to help him in capturing the Illuminati.\n\nAfter weeks of attending the mass-panic caused when the existence of the incursions was made public knowledge, the Mighty Avengers were deployed in [[Spain]], where the Illuminati had been pinned down by the Avengers. The squabble was interrupted by the [[Susan Storm (Earth-616)|Invisible Woman]], who convinced the different parties to reach a middle ground and start working together.{{r|New Avengers Vol 3 28}} [[Adam Brashear (Earth-616)|Adam Brashear]] used the opportunity brought by the truce to scold Mr. Fantastic and Black Panther for their actions with the Illuminati.{{r|Captain America and the Mighty Avengers Vol 1 8}}\n\nWhen the final incursion loomed, the Mighty Avengers were forced to close their headquarters, due to the inverted Tony Stark having used his team of lawyers to sue Cage for using the \"Avengers\" name. The former members of the team were called in to fend off the forces of the incursive Earth. Spectrum engaged in a plan to destroy the other Earth by turning into hard light and crashing into it at light speed. However, she hesitated when she was about to hit its surface after seeing a group of innocent kids playing, allowing the [[Reed Richards (Earth-1610)|Maker]] of said Earth to capture her.\n\nDuring the final hour, the members of the Mighty Avengers spent the last time in different ways. Captain America continued defending the Earth against the enemy forces, Iron Fist rescued civilians caught in the middle of the combat, She-Hulk helped strike against the other Earth, Power Man visited his family, White Tiger patrolled the city beating up criminals, Kaluu drank tea with [[Wong (Earth-616)|Wong]], Blue Marvel and his son worked in their lab trying to save the Earth, the Support Team answered the hotline comforting whoever called, and Luke Cage and Jessica Jones helped a homeless shelter.{{r|Captain America and the Mighty Avengers Vol 1 9}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * The team's name (\"Mighty Avengers\") came from the hashtag used in social networks to talk about it.{{r|Mighty Avengers Vol 2 3}}\n| Links                   = \n}}\n[[Category:Detective Agencies]]"
                }
            }
        }
    ],
    "page_id": "659998"
}