{
    "pageid": 980966,
    "ns": 0,
    "title": "Mongol Empire",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Genghis Khan (Earth-616) from Invincible Iron Man Vol 1 25 001.jpg\n| Name                    = Mongol Empire\n| Aliases                 =\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Mongolia]], [[Asia]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Origin                  = \n| PlaceOfFormation        = [[Mongolia]], [[Asia]]\n| PlaceOfDissolution      = [[Mongolia]], [[Asia]]\n| Creators                = \n| First                   = Mystic Comics Vol 2 3\n\n| History                 = \n===Overview===\nThe '''Mongol Empire''' (Mongolian:''Ikh Mongol Uls'') was one of the largest contiguous land empire in history of [[Earth]]. It existed during the 12th and 14th century. It began in central [[Asia]] in a region that will be one day known as [[Mongolia]]. At it's peak the empire stretched from [[Europe]] to the [[Sea of Japan]], extending northwards into [[Siberia]], eastwards and southwards into [[India]], [[China]], [[Persia]] and westwards into [[Arabia]]. Although the Mongols were some of the most ruthless and fearless fighters, they lacked administrative skills. As a result, the kingdom had no unity and it was defeated by Ming builders.{{citation}}\n\n===Reign of Genghis Khan===\n[[Temujin]] was born on 1167, A.D. in a small Mongol tribe. When he was 13 years old, he succeeded his father as the tribe leader. He led his tribe against two neighbor tribes and obtained the title of \"The Great Khan\", later changing his name to [[Genghis Khan (Earth-616)|Genghis Khan]]. He had vowed to rule over the entire world. In doing this, he first brought together the Mongolian tribes who were initially scattered. To begin on his mission, he set out for China, where he established the Mongol Empire.{{citation}}\n\n[[File:En_Sabah_Nur_(Earth-616)_from_X-Force_Vol_1_37_001.jpg|right|thumb]]\nIn the 12th century, [[En Sabah Nur (Earth-616)|En Sabah Nur]] fought his way through a horde of Mongols. He finally arrives at a figure who sits on the ground waiting for him. The figure reveals himself to be [[Garbha-Hsien (Earth-616)|Garbha-Hsien]]. He revealed to En Sabah Nur a giant [[Prosh (Earth-616)|Celestial Ship]] that he has never entered. En Sabah Nur is intrigued and stabs Saul so that he can get into the ship. Nur then walks into the ship and leaves Garbha-Hsien for dead.{{r|X-Force #37}}\n\n====Invasion of China====\nIn 1206, A.D. he attempted to conquer China, he sought to obtain the Crown of Confucius that would make him absolute ruler of China. This attempt was thwarted by 1940s time traveler [[Thomas Tyme (Earth-616)|Tommy Tyme]] who tossed the crown down a supposedly bottomless pit before returning to his own time.{{r|Mystic Comics Vol 2 3}}\n\n[[Lao-Chung (Earth-616)|Lao-Chung]] was one of the men who helped guild the [[Great Wall of China]] thousands of years ago and helped defend China from Mongolian invaders until his death. He was placed in a stone coffin near the Great Wall after his supposed death.{{r|All Select Comics #8}}\n\n====Lost in Time====\nGenghis Khan and at least one hundred of his soldiers were catapulted to [[Dodge City]] in 1871 due to a temporal anomaly. He quickly organized a camp with twenty tents, and began campaigning to obtain valuable resources such as land or food. He would find to other time-traveling generals, [[Alexander the Great]] and [[Napoleon Bonaparte]], and begin a war with both of them. Due to the conflict, he would loose one of his commanders. He ordered to construct an arena in his camp so that his men and allies could fight for the honor. Some time-traveling heroes went to visit the Khan. They wanted to warn him of an alien threat, the [[Krozzar]], which could only be fought with an alliance between the three Human generals. Genghis Khan was interested in this, and offered the newcomers a chance to prove their worth in the arena combat and, later, in a ceremonial hunt. During the hunt, Genghis Khan was attacked by seven of Napoleon's horsemen, but the attack was repealed by the heroes. This impressed The Khan enough to allow a meeting with Alexander and Napoleon.The three armies together and ready, led by the best military minds in history, were more than a match for Alzzan's alien forces: The Krozzar never managed to capture the needed route, not even after fifteen hours of non-stop battle. However, during this time, the super-heroes sneaked into the Krozzar base and defused their only bomb.Eventually, the heroes managed to solve the time-crisis. Genghis Khan and all of his men returned home.{{r|The Weird, Weird West}}\n\n====Death====\nIn 1227 A.D., Khan and the Mongul Horde attacked a small village close to [[K'un-Lun]]. [[Bei-Ming Tian (Earth-616)|Bei-Ming Tian]], bearer of the mystical mantle of [[Iron Fist]], confronted the horde and slew Genghis Khan.{{r|Invincible Iron Man Annual Vol 1 1}}\n\n===Reign of Ögedei Khan===\nIn 1242 A.D., [[Ögedei Khan (Earth-616)|Ögedei Khan]], son of [[Temujin (Earth-616)|Ghenghis Khan]] has sent General [[Subutai (Earth-616)|Subutai]] to invade [[Europe]] with the Mongol horde. The [[Eternals (Homo immortalis)|Eternal]]; [[Kingo Sunen (Earth-616)|Kingo Sunen]] learned that [[Druig (Earth-616)|Druig]] was marching with them and believed he was controlling their minds. He confronted him at a campfire and the warrior fired arrows at him but Kingo just plucked them out of the air. Druig revealed the truth that he was not controlling the Mongols, and he has had nothing to do with the rise of the Mongol Empire nor their brutally efficient methods he was just their to study them. Druig suggested that if he wanted to stop them he should assassinate Subutai. Kingo crept into the leader's tent but could not bring himself to do it, fearing he would become like Druig. The next day; Subutai and his Horde returned home and Druig has stayed to meet with Kingo. He explained that Ogedei Khan had died of a stroke and the Mongols must return home to select a new ruler. Druig claimed not to have known what was happened but stated that if he killed Subutai the Horde would of continued into Europe killing thousands more.{{r|Eternals Vol 5 4}}\n\n===Reign of Kublai Khan===\nIn 1279 A.D., [[Kublai Khan (Earth-616)|Kublai Khan]] conquered [[China]] establishing the Yuan Dynasty.{{r|Marvel Atlas #1|; [[China]]'s entry}} He ruled China for about sixty years.{{r|Ms. Marvel Vol 2 26}} The [[Dragon]] [[Mr. Lao (Earth-616)|Mr. Lao]] was their to witness the event.{{r|Atlas Vol 1 5}}\n\nSometime in the 13th century, a ship carrying the crew of Sir John O'Dare are en route to join King Richard in the [[Jerusalem|Holy Lands]] to fight in the [[Crusades]]. However the ill fated crew is stricken with the plague and pull ashore in a region ruled by the Mongol Empire. Their party is spotted by a group of Mongols led by a Frank warrior named [[El Alemain (Earth-616)|El Alemain]]. El Aleman's second in command Tenga Khan suggests that they attack the Frankish knights who have come to shore, but El Alemain refuses to attack them. Tenga Khan wishes to see El Alemain killed as he covets his leader's sword the Saracen, which El Alemain won during the battle of El Bakar as it is believed that it makes the wielder invincible and the amulet given to him by his mother before her death. Tenga Khan then convinces the other warriors to attack the Frankish warriors anyway. But when they learn that the warriors are suffering from the plague the Mongols are forced to pull back. El Alemain then challenges Tenga Khan for his unauthorized attack, but Tenga has planned for this, having his loyal minions ready to shoot El Alemain with an arrow during the fight. However when the assassin fires his arrow, he strikes Tenga Khan instead during the battle. Seeing this dishonor, O'Dare and his men attack the Mongol and both parties are wiped out, all except El Alemain. Holding the dying John O'Dare in his arms, El Alemain learns from the dying warrior -- who recognizes El Alemain's necklace -- tells El Alemain that they are brothers and asks him to join King Richard in the crusades, wearing his armor into battle. El Alemain agrees to do so, and after burying his long lost brother, he puts on the deceased warriors armor, and so the Crusader is born.{{r|Black Knight #1}}\n\n===Religion===\nThe [[Tenger]] (also known as the Mongolian Gods) were worshipped by the Mongol tribes.  Although it is unknown if the Tenger played any direct role in Genghis Khan's military success, Khan based the legitimacy of his power on a mandate from [[Tengri (Earth-616)|Tengri]] himself.  He crafted a talisman known as the [[Spirit Banner of Genghis Khan|\"Spirit Banner of Temujin\"]] by weaving the hair of his most loyal horse and tying below the blade of his spear.  This Spirit Banner was believed to harness Tengri's godly power and channel it into Khan.{{r|Thor & Hercules: Encyclopaedia Mythologica Vol 1 1}}\n\n===Legacy===\nThe [[Atlas Foundation (Earth-616)|Atlas Foundation]] regards itself as a perpetuation of the ancient Mongol Empire, with each leader a descendant of and rightful successor to [[Genghis Khan (Earth-616)|Genghis Khan]]. As he grows old, each Khan seeks a successor.{{r|Agents of Atlas #1}}\n\n==Alternative Realities==\n===Earth-991===\nThe [[Vikings]] built permanent settlements in [[America]] after the [[Mongol Empire]] took control of [[Europe]] and [[North Africa]].{{r|New Exiles #18}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Historical Organizations]]\n[[Category:Asia]]\n[[Category:Europe]]\n[[Category:Mongol Empire]]\n[[Category:Empires and Civilizations]]"
                }
            }
        }
    ],
    "page_id": "980966"
}