{
    "pageid": 466250,
    "ns": 0,
    "title": "Mongrels (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Wolverine_Vol_4_13_Textless.jpg\n| ImageSize               = 300px\n| Name                    = [[The Mongrels]]\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret \n| Reality                 = Earth-616\n| BaseOfOperations        = Somewhere in Mexico\n\n| Leaders                 = [[William Downing (Earth-616)|Gunhawk]] (former)\n| CurrentMembers          = \n| FormerMembers           = [[Shadow S. (Earth-616)|Shadowstalker]], [[Fire Knives (Earth-616)|Fire Knives]], [[Saw Fist (Earth-616)|Saw Fist]], [[William Downing (Earth-616)|Gunhawk]], [[Cannon Foot (Earth-616)|Cannon Foot]]\n| Allies                  = [[The Red Right Hand (Earth-616)|The Red Right Hand]]\n| Enemies                 = [[James Howlett (Earth-616)|Wolverine]], his family and friends\n\n| Origin                  = Created to hunt and torture Wolverine\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[Mexico]]\n| Creators                = Jason Aaron; Renato Guedes\n| First                   = Wolverine Vol 4 1\n| Last                    = Wolverine Vol 4 13\n\n| HistoryText             = \n===Origin===\nDuring his long life, [[James Howlett (Earth-616)|Wolverine]] met and fell in love with many women and, unknown to him, he also fathered a number of children. Those children were found through the years by another of Logan's sons, [[Akihiro (Earth-616)|Daken]].\n \nDaken then gave them to an evil organization who wanted revenge on Wolverine for what he did to them in the past: [[Red Right Hand (Earth-616)|the Red Right Hand]]. On Daken’s advice, the Red Right Hand trained them in order to use them as weapons against Logan, but knowing perfectly that they wouldn't stand a chance against him. Their training completed, the Red Right Hand named them '''The Mongrels'''.{{r|Wolverine Vol 4 14}}\n\n===Vendetta against Wolverine===\nThe Mongrels became a group of mercenaries whose main mission was to make Wolverine's life a living hell. The plan was to cause as much suffering imaginable, and that included the torture of his friends and family. The Mongrels were led by [[William Downing (Earth-616)|Gunhawk]] and the rest of the team includes [[Shadow S. (Earth-616)|Shadowstalker]], [[Fire Knives (Earth-616)|Fire Knives]], [[Saw Fist (Earth-616)|Saw Fist]], and [[Cannon Foot (Earth-616)|Cannon Foot]].\n\nOne of the team's targets was Wolverine's girlfriend at the time, [[Melita Garner (Earth-616)|Melita Garner]]. They found her working in the [[San Francisco]] Post building.{{r|Wolverine Vol 4 1}} When they found and attacked Melita, they were shocked to find her with a Skrull sonic disruptor, which she fired at the team. Melita escaped from the Mongrels with the help of the mutant shape shifter [[Raven Darkholme (Earth-616)|Mystique]]. The team returned to report their failure to the The Red Right Hand. They then decided to proceed to their next target in the nation of [[Madripoor]].{{r|Wolverine Vol 4 1}}\n\nAfter they arrived in Madripoor, The Mongrels searched the city to find the [[Princess Bar]]. They entered the bar and massacred the bouncers and staff, but [[Jessán Hoan (Earth-616)|Tyger Tiger]] intervened when Gunhawk tried to open a certain door. Gunhawk told Tyger \"Logan is in hell,\" and burned the room down, which was filled with mementos and possessions that Wolverine had accumulated over his long lifetime.{{r|Wolverine Vol 4 4}}\n\n===Final Revenge===\nAfter escaping from [[Hell]], Wolverine invaded the Red Right Hand's base, where he was confronted by the Mongrels.{{r|Wolverine Vol 4 10}} Despite what they did to his friends, he gave each one of them a chance to surrender peacefully but the Mongrels attacked him on sight and tried to kill him. As a result Logan killed most of them,{{r|Wolverine Vol 4 10}}{{r|Wolverine Vol 4 11}}{{r|Wolverine Vol 4 13}} while the others killed themselves;{{r|Wolverine Vol 4 12}} and after defeating the leader of the Mongrels, [[William Downing (Earth-616)|Gunhawk]], Logan confronted the members of the Red Right Hand.{{r|Wolverine Vol 4 13}} \n\nTo his surprise, the members of the Red Right Hand had already killed themselves, leaving Wolverine with only a message: the Mongrels were his children. This revelation and the fact that he killed his own children devastated Logan.{{r|Wolverine Vol 4 14}} Wolverine then dragged the bodies of his slain children to the grave of their mothers and buried them both together.{{r|Wolverine Vol 4 15}}\n\nIt's unknown if The Mongrels were aware that Daken was their half-brother and Logan their father, as the Red Right Hand and Daken only told them what was necessary to make them fight and die against their own father.{{r|Wolverine Vol 4 14}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Gunhawk's guns, Fire Knives' knives, Shadowstalker's spiked balls, Cannon Foot's stone balls, Saw Fist's chainsaws\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Howlett Family]]\n[[Category:Hudson Family]]\n[[Category:Logan Family]]"
                }
            }
        }
    ],
    "page_id": "466250"
}