{
    "pageid": 1497280,
    "ns": 0,
    "title": "Monster Mob (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Benjamin Grimm (Earth-616) and Monster Mob (Earth-616) from Fantastic Four Vol 6 16 001.jpg\n| ImageSize               = 250px\n| Name                    = Monster Mob\n| EditorialNames          = \n| Aliases                 = Five Hundred Horde of Freak Alley{{r|Fantastic Four Vol 6 16}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Freak Alley]], [[Lowtown (Capital City)|Lowtown]], [[Capital City]], [[Spyre]]\n\n| Leaders                 = [[Krumson (Earth-616)|Big King Scrum]]; formerly [[Benjamin Grimm (Earth-616)|The Thing]]\n| CurrentMembers          = [[Slapdash (Earth-616)|Slapdash]]\n| FormerMembers           = \n| Allies                  = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Unparalleled (Earth-616)|Unparalleled]]\n| Enemies                 = [[Unparalleled (Earth-616)|Unparalleled]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Lowtown (Capital City)|Lowtown]], [[Capital City]], [[Spyre]]\n| PlaceOfDefunction       = \n| Creators                = Dan Slott; Robert Quinn\n| First                   = Fantastic Four Vol 6 15\n\n| HistoryText             = When [[Earth]] scientist [[Reed Richards (Earth-616)|Reed Richards]] set out to travel to the planet [[Spyre]] aboard a rocketship, the [[Revos (Earth-616)|Overseer]] of Spyre became aware of the planned incursion and manipulated a [[Glossary:Cosmic Radiation|cosmic ray]] storm Richards' ship had to pass through to increase its intensity and scuttle his ship. Richards and the tripulants of the ship were bestowed superpowers by the cosmic rays and turned into the [[Fantastic Four (Earth-616)|Fantastic Four]]. Fearing that the now-empowered explorers would attempt to continue their original mission, the Overseer deviced a procedure to harness cosmic rays and grant his own people super-powers in hopes to stand up against the potential invaders.{{r|Fantastic Four Vol 6 17}}\n\nThe Monster Mob was the organized horde of [[Spyricans]] banished from civilization and into [[Capital City]]'s [[Lowtown (Capital City)|Lowtown]] after subjecting themselves to the cosmic rays and emerging disfigured. They were led by [[Krumson (Earth-616)|Big King Scrum]], the first of the rejects.{{r|Fantastic Four Vol 6 16}} Scrum regularly used to send members of the Monster Mob to terrorize [[Hightown (Capital City)|Hightown]] as part of a secret agreement with Overseer, to give the [[Unparalleled (Earth-616)|Unparalleled]], the mutates who were not turned into monsters and remained in society, something to fight to prepare them for the possible arrival of the Fantastic Four.{{r|Fantastic Four Vol 6 18}}\n\nWhen the Fantastic Four traveled to Spyre and confronted the Unparalleled on arrival, [[Benjamin Grimm (Earth-616)|The Thing]] was flung during battle into Lowtown,{{r|Fantastic Four Vol 6 15}} where he was attacked by the Monster Mob while Scrum watched, since they blamed the Fantastic Four for their predicament. After The Thing fought through hordes of monsters, Scrum confronted him personally, but was defeated as well. The Thing refused to kill Scrum or take his subjects for himself, and instead rallied the Monster Mob into crawling their way back to Hightown to reclaim their place in society.{{r|Fantastic Four Vol 6 16}} Their rebellion was opposed by the Unparalleled, but the confrontation came to a pause when Mister Fantastic exposed to the public the fact that the Overseer had manipulated the cosmic ray storm, meaning the Overseer was responsible for granting the Fantastic Four their powers.{{r|Fantastic Four Vol 6 17}}\n\nAfter this revelation, the Monster Mob became even more enraged and continued fighting the Unparalleled. When [[Benjamin Grimm (Earth-616)|The Thing]] reached the Overseer's [[Tower of Over-Site]] to confront him, their subsequent fight collapsed the building. The Monster Mob joined forces with the Fantastic Four, the Unparalleled to contain the falling debris.{{r|Fantastic Four Vol 6 18}} After the Fantastic Four made peace with the Overseer and the Unparalleled, Mister Fantastic shared with the Spyricans a temporary cure that would allow each mutate to regain their normal form once a year. As a result, a process began to accept the Monster Mob back into society.{{r|Fantastic Four Vol 6 16}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1497280"
}