{
    "pageid": 288830,
    "ns": 0,
    "title": "Muir Island X-Men (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Muir Island X-Men (Earth-616) from Uncanny X-Men Vol 1 254 cover.jpg\n| Name                    = Muir Island X-Men\n| Aliases                 = [[X-Men]], Muir Islanders\n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Muir Island]]\n\n| Leaders                 = [[Moira MacTaggert (Earth-TRN748)|Moira MacTaggart]]\n| CurrentMembers          = \n| FormerMembers           = [[Lorna Dane (Earth-616)|Polaris]], [[Sean Cassidy (Earth-616)|Banshee]],  [[Thomas Corsi (Earth-616)|Tom Corsi]], [[Sharon Friedlander (Earth-616)|Sharon Friedlander]],  [[Forge (Earth-616)|Forge]], [[David Haller (Earth-616)|Legion]], [[Jean Grey (Earth-616)|Marvel Girl]], [[James Madrox (Earth-616)|Multiple Man]], [[Jimaine Szardos (Earth-616)|Amanda Sefton]], [[Theresa Cassidy (Earth-616)|Siryn]], [[Guido Carosella (Earth-616)|Strong Guy]], [[Mark Hallett (Earth-616)|Sunder]], [[Alysande Stuart (Earth-616)|Brigadier Alysande Stuart]]\n| Allies                  = [[Healer (Earth-616)|Healer]], [[Freedom Force (Earth-616)|Freedom Force]], [[Callisto (Earth-616)|Callisto]], [[Charlotte Jones (Earth-616)|Officer Jones]], [[Warpies (Earth-616)|Warpies]]{{r|Uncanny X-Men #254}}\n| Enemies                 = [[Reavers (Earth-616)|The Reavers]], [[David Haller (Earth-616)|Legion]], [[Amahl Farouk (Earth-616)|Shadow King]], [[Morlocks (Earth-616)|Morlocks under Masque]], [[Magistrates (Earth-616)|Magistrates and Press Gang]]\n\n| Origin                  = Formed initially in order to repel the Reaver's assault on Muir Island\n\n| PlaceOfFormation        = [[Muir Island]]\n| PlaceOfDissolution      = \n| Creators                = Chris Claremont; Marc Silvestri\n| First                   = Uncanny X-Men #254\n| Last                    = X-Factor Vol 1 70\n\n| HistoryText             =The Muir Island X-Men were a team of mostly [[X-Men (Earth-616)|X-Men]] reservists and associates (including several non-mutants) who came together during an emergency situation at a time when most of the world believed the official team of X-Men had died in battle during the [[Fall of the Mutants]]. This short-lived team was never officially sanctioned by [[Charles Xavier (Earth-616)|Charles Xavier]] or any of the members of the main X-Men team. As their name suggests, they used [[Moira MacTaggert (Earth-TRN748)|Moira Kinross']] [[Muir Island]] research facility as their base of operations.\n\n===The Reavers===\nThe team formed during the [[Reavers (Earth-616)|Reavers']] siege of the island. [[Sean Cassidy (Earth-616)|Banshee]] had recently regained his powers thanks to the [[Morlocks|Morlock]] [[Healer (Morlock) (Earth-616)|Healer]]. He rescued [[Lorna Dane (Earth-616)|Polaris]] from the [[Marauders|Marauders']] control, and brought her to Muir with him. Moira then performed tests that determined Polaris' magnetic abilities had waned while at the same time she gained a new power to harness a then-unknown energy source to increase her strength, size, and invulnerability.{{r|Uncanny X-Men Vol 1 254}}\n\nBanshee then met up with [[Jimaine Szardos (Earth-616)|Amanda Sefton]] and [[Alysande Stuart (Earth-616)|Alysande Stuart]] who were in search for the Britain-based team [[Excalibur (Earth-616)|Excalibur]]. On their way to Muir Island, all three were attacked by the Reavers, who had been dispatched on a mission to murder Moira and Banshee.{{r|Uncanny X-Men Vol 1 253}} Amanda used her magical abilities to teleport them away in the nick of time. The Reavers pursued them however and during a skirmish, Sean was mortally wounded but saved once again by the Morlock Healer.{{r|Uncanny X-Men Vol 1 254}}\n\nThe Muir Island residents regrouped to fight back against their attackers. Moira had Polaris, Amanda, [[Thomas Corsi (Earth-616)|Tom Corsi]], [[Sharon Friedlander (Earth-616)|Sharon Friedlander]], and Alysande suited up in new [[X-Uniforms]] and sent them out to defend the island. But [[David Haller (Earth-616)|Legion]] (who was called Danny rather than David at the time) betrayed the Muir Island X-Men by secretly aiding the Reavers. Legion's meddling helped lead to the capture of all of the Muir Island X-Men as well as the death of [[Mark Hallett (Earth-616)|Sunder]] in an extended conflict. Eventually, Banshee joined in the fight but was taken down as well.\n\n[[Forge (Earth-616)|Forge]] had gone to Muir Island to find [[Ororo Munroe (Earth-616)|Storm]] (whom he believed was there because of a vision he had experienced in a spirit walk) and was captured as well. [[Valerie Cooper (Earth-616)|Valerie Cooper]] ordered [[Freedom Force (Earth-616)|Freedom Force]] to aid the Muir Island X-Men, despite [[Raven Darkholme (Earth-616)|Mystique's]] protests. With the aid of Freedom Force, the Muir Island X-Men were finally able to repel the Reavers.{{r|Uncanny X-Men Vol 1 255}}\n\nAfter the conflict with the Reavers, Forge chose to remain in Scotland and became a member of the Muir Island team while Freedom Force returned to [[United States of America|America]].{{r|Uncanny X-Men Vol 1 255}} He aided Banshee in constructing a new defense system for the island. Meanwhile, Polaris' new powers manifested a side effect of causing everyone on the island to exhibit a darker personality. Moira was particularly affected by this.{{r|Uncanny X-Men Vol 1 257}} At the same time, Legion’s [[Jack Wayne (Legion Personality) (Earth-616)|Jack Wayne]] personality had secretly taken control of Danny and subdued the rest of his multiple personalities. Jack/Legion locked up Polaris in a top security cell and left her there to rot while he amused himself by toying with the rest of the Muir Island residents.{{r|Uncanny X-Men Vol 1 258}}\n\n===Search for the X-Men===\nMoira hooked Danny up to the recently recovered [[Cerebro (Mutant Detector)|Cerebro]] in the hope that he could use his telepathy to find the X-Men. Once Legion began using Cerebro, however, [[Amahl Farouk (Earth-616)|Amahl Farouk a.k.a. the Shadow King]] emerged and took control of him.{{r|Uncanny X-Men Vol 1 259}}\n\nBased on Danny’s (actually the Shadow King’s) statements, Banshee and Forge believed that Storm at least could be found in [[Cairo (Egypt)|Cairo]], [[Egypt]]. They left to search for her without telling Moira where they were going since Banshee no longer trusted Moira’s darker personality. They set out for Egypt unaware that Storm was actually in Cairo, [[Illinois (State)|Illinois]].{{r|Uncanny X-Men Vol 1 260}}\n\nWhile [[Cylla Markham (Earth-616)|Cylla Markham]] was flying Banshee and Forge to Egypt, she happened to show them a magazine with [[Alison Blaire (Earth-616)|Dazzler]] on the cover. The men decided to go to [[California (State)|California]] instead of Cairo as they believed Dazzler was a more concrete lead. They parted ways with Cylla, whose plane was then blown up by the [[Fenris (Earth-616)|Fenris twins]] in an attempt to murder Banshee (whom they mistakenly believed was still on the plane).{{r|Uncanny X-Men Vol 1 260}}\n\nWhile on their way to California, Banshee and Forge made a stopover at [[Xavier's School for Gifted Youngsters|Xavier's mansion]]. Finding the school in ruins, they set up shop and rebuilt it. Everyone believed they had died in the plane explosion and Banshee wanted to keep it that way for a while since he no longer trusted Moira.{{r|Uncanny X-Men Vol 1 261}} The two men planned to infiltrate Muir Island through a backdoor in the island's defense system that only they knew about with the intention of figuring out what was really going on with Moira. Before they returned, Banshee decided they first had to warn the other X-Men of the potential threat to their lives.\n\n===Joining X-Factor===\n[[Jean Grey (Earth-616)|Jean Grey]], then a member of [[X-Factor (Earth-616)|X-Factor]], paid a visit the newly-rebuilt X-Mansion and teamed up Banshee and Forge to fight mysterious evil doppelgangers of the X-Men.{{r|Uncanny X-Men Vol 1 261|262}} All three then went on a mission to save [[Piotr Rasputin (Earth-616)|Colossus]] and [[Callisto (Earth-616)|Callisto]] from rogue Morlocks.{{r|Uncanny X-Men Vol 1 263}} \n\nFollowing that rescue mission, Banshee, Forge, Colossus, and Callisto all went with Jean to X-Factor's [[Prosh (Earth-616)|spaceship]] which they discovered was under attack by the [[Magistrates (Earth-616)|Genoshan Magistrates]] and [[Press Gang (Earth-616)|Press Gang]]. The combined mutant forces (aided by [[Charlotte Jones (Earth-616)|Officer Charlotte Jones]]) were able to defeat the attackers. Afterwards, Banshee and Forge remained with X-Factor while the amnesiac Colossus and Callisto opted to leave.{{r|Uncanny X-Men Vol 1 264}}\n\n===The Muir Island Saga===\nBack on Muir Isle, Legion (possessed by the Shadow King) mentally enslaved the remaining Muir Island residents, including Moira, Amanda, Tom Corsi, [[Guido Carosella (Earth-616)|Strong Guy]], Sharon Friedlander, [[James Madrox (Earth-616)|Multiple Man]], [[Theresa Cassidy (Earth-616)|Siryn]], and Polaris.{{r|Uncanny X-Men Vol 1 269}} The Shadow King was also able to mentally manipulate Colossus, [[Rogue (Anna Marie) (Earth-616)|Rogue]], and [[Stephanie Hunter (Earth-616)|Stevie Hunter]] from afar.{{r|Uncanny X-Men Vol 1 278|279}}\n\nBy then, Prof. X had returned from an extended sojourn in the [[Shi'ar Empire|Shi’ar Galaxy]] and led all the members of the X-Men and X-Factor at that time on an assault against the Shadow King. A long campaign took place in which the Shadow King was finally defeated and his mentally enslaved captives were freed from his control.{{r|Muir Island Saga}} In the aftermath, there was a major reshuffling of team memberships. The original X-Factor team rejoined the X-Men as did Forge and Banshee in support roles. Several of the Muir Island mutants - Polaris, Guido, and Jamie Madrox - left to fill the vacancies in the X-Factor roster. With a majority of its members now departed and the conflict that necessitated the team coming together having been resolved, that was effectively the end of the Muir Island X-Men.\n\n| Equipment               = [[X-Uniforms|Environmental Suits/Body Armor Uniforms]]\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n*For an attempt at a possible all new X-Men team, the team only initially had two mutants, while also having one sorceress and four non-powered humans.\n*The humans on the team relied on their uniform for physical protection and used guns as their primary weapons.\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "288830"
}