{
    "pageid": 1363151,
    "ns": 0,
    "title": "Multicorp (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = [[Multicorp]]\n| Aliases                 = \n\n| Leaders                 = [[Adam Frost (Earth-616)|Adam Frost]]\n| CurrentMembers          = \n| FormerMembers           = [[Randall Pierce (Earth-616)|Randall Pierce]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Heavy Metal (Animals) (Earth-616)|Heavy Metal]], [[Weapon X (Earth-616)|Weapon X]]\n| Enemies                 = [[Project Brute Force (Earth-616)|Brute Force]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Manhattan]]\n| PlaceOfFormation        = [[Manhattan]], [[New York]]\n| PlaceOfDissolution      = [[Big Sur]], [[California (State)|California]]\n\n| Creators                = Simon Furman; Jose Delbo\n| First                   = Brute Force Vol 1 1\n\n| History                 = Multicorp was a major corporation based out of [[Manhattan]] in [[New York City]] formed by [[Adam Frost (Earth-616)|Adam Frost]], specializing in a multitude of lucrative business interests and multiple shell companies, and a public relations focus on environmental safety.\n\nThe Environmental Development Division was headed up by scientist [[Randall Pierce (Earth-616)|Randall Pierce]], based out of the Multicorp Ecology Center in New Jersey, where they were working on a super soldier division by fusing animal test subjects with cyborg parts and robotic power armor. While performing medical treatment on [[Uproar (Earth-616)|an injured gorilla]], a group of mercenaries disguised as the clown mascot of the rival [[Flex Corporation (Earth-616)|Flex Corporation]], Tastee Tony, broke into the Multicorp labs and prematurely woke the animal up before stealing it. Pierce tried to convince Frost to reach out to the police, but the CEO refused, advising that the company couldn't afford to look weak. Racked with guilt for the crimes he believed the Flex Corporation would be using the Gorilla for, but unwilling to put the remaining test animals through the medical procedures to enhance them, Pierce ultimately decided to use the armor's helmets to allow the animals to speak freely and ask them to form a team to bring the Gorilla home, dubbing the team [[Project Brute Force (Earth-616)|Brute Force]].\n\nIn actuality, Frost had acquired the Flex Corporation long before their raid, and had used their men to take the Gorilla in order to push Pierce into activating the animal team, allowing his scientists to observe and copy the neuro-enhancement process needed to convert them, with the intention of forming a team without Brute Force's environmental morals, [[Heavy Metal (Animals) (Earth-616)|Heavy Metal]].\n\nOn their first mission, Brute Force failed to save the Gorilla, and in the chaos of the battle, the team dealt more damage to each other than Flex's mercenaries; allowing them to escape. During the battle, however, Dr. Pierce discovered a piece of uniform material dropped by one of the mercenary's belonging to the Mulitcorp Security Division.{{r|Brute Force Vol 1 1}}\n\nFrost deployed Heavy Metal on their first mission to sink an oil tanker to practice their enhancements on live targets, and hurt the rival Varda Corporation, during which they encountered Brute Force member [[Surfstreak (Earth-616)|Surfstreak]]. While Surfstreak was unable to defeat Heavy Metal on his own, he was able to delay them long enough for the Coast Guard to arrive, forcing the team to retreat. As Frost began to berate the team for their failure to sink the the tanker and associate Varda's name with natural disasters to run them out of business, Pierce stormed into his office, overhearing him. Thinking quickly, Frost accused Pierce of masterminding the Heavy Metal attacks and had him fired and arrested.{{r|Brute Force Vol 1 2}}\n\nSeveral weeks after the arrest, Frost hired a team of gunmen to disguise themselves as eco-terrorists working for Meltdown and sent them to threaten a nuclear power plant, discrediting the environmentalist organization and forcing them underground. The attack was prematurely stopped by Brute Force, now working with [[Fresh Air (Earth-616)|Fresh Air]], who took one of the terrorists hostage, believing that a confession to the true nature of his crimes would unravel Multicorp's schemes and pardon Pierce. Unwilling to risk this happening, Frost deployed Heavy Metal to attack Fresh Air's California base to kill the mercenary. While the two teams fought, Frost directly attacked Fresh Air in a bid to shoot the witness, but was stopped by the arrival of Dr. Pierce and the FBI, who placed Frost under arrest- putting an end to Multicorp.{{r|Brute Force Vol 1 4}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = <references group=\"note\" />\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1363151"
}