{
    "pageid": 1249879,
    "ns": 0,
    "title": "Naglfar Armada (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Naglfar Armada (Earth-616) from Asgardians of the Galaxy Vol 1 1 001.jpg\n| Name                    = Naglfar Armada\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = Formerly [[Nebula (Earth-616)|Nebula]]\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Cullen Bunn; Matteo Lolli\n| First                   = Asgardians of the Galaxy Vol 1 1\n| History                 = The Naglfar Armada was an assemblage of the soulless undead bodies of pantheons that experience a cycle of death and rebirth, which are left behind after the gods are reborn into new bodies. They were cast-off into the void, boarding [[Naglfar|Naglfar Ships]], experiencing only emptiness and pain, which fueled their desire for all mortal races to experience the same.{{r|Asgardians of the Galaxy Vol 1 1}}\n\nThe [[Asgardians|Asgardian]] god [[Loki Laufeyson (Earth-616)|Loki]] commissioned to the [[Dwarves of Nidavellir]] a magical horn called the [[Naglfar Beacon]], which allowed its user to summon and command the Naglfar Armada. He moved back and forth through time to preserve its forging in secret. When the horn was finished, he cast it into the past, hidden in a place not even he could find it until the time was right.{{r|Asgardians of the Galaxy Vol 1 2}}\n\nRumors of the device's existence seeped out, and the space pirate [[Nebula (Earth-616)|Nebula]] learned of its existence by [[Coven (Witches) (Earth-616)|The Coven]].{{r|Asgardians of the Galaxy Vol 1 3}} She set out to find the Nagflar Beacon and use it to one-up her rival [[Gamora Zen Whoberi Ben Titan (Earth-7528)|Gamora]] as the most dangerous woman in the galaxy.{{r|Asgardians of the Galaxy Vol 1 5}} In parallel, [[Loki Laufeyson (Kid Loki) (Earth-616)|Kid Loki]] joined forces with [[Aldrif Odinsdottir (Earth-616)|Angela]] to find the Naglfar Beacon, since he intended to use it during the looming [[War of the Realms]]. To this end, they assembled the [[Asgardians of the Galaxy (Earth-616)|Asgardians of the Galaxy]]{{r|Asgardians of the Galaxy Vol 1 2}}\n\nNebula kidnapped the dwarf [[Urzuul (Earth-616)|Urzuul]] and used him to find the horn before the Asgardians of the Galaxy.{{r|Asgardians of the Galaxy Vol 1 1}} Nebula first tested the Naglfar Beacon on the planet [[Netredeen]], summoning the undead bodies of the past incarnations of their gods to attack the planet. She then moved to a bigger target, and summoned the Asgardian pantheon of the Naglfar Armada on [[Chandilar]].{{r|Asgardians of the Galaxy Vol 1 2}} In both instances, the undead gods were taken down by the Asgardians of the Galaxy while trailing Nebula.{{r|Asgardians of the Galaxy Vol 1 3}} Before setting her sights on her true target, [[Earth]], Nebula abducted [[Thor Odinson (Earth-616)|Thor]] to use him as leverage in case her attack on Earth and use of their dead selves warranted retaliation from the [[Asgardians]]. Loki tried to warn Thor about Nebula's plan, but he arrived late and was abducted to Neubla's ship as well.{{r|Asgardians of the Galaxy Vol 1 4}} The Asgardians of the Galaxy tracked Nebula down, and Loki incapacitated her using an illusion long enough for [[Brunnhilde (Earth-616)|Valkyrie]] to take the Naglfar Beacon from her, and used it to send the undead army back to the void. Loki then set out to hide the Naglfar Beacon,{{r|Asgardians of the Galaxy Vol 1 5}} but it ultimately remained in Angela's hands.{{r|Asgardians of the Galaxy Vol 1 8}}\n\nDuring the War of the Realms, the Asgardians of the Galaxy helped defend Midgard from the invading forces of [[Malekith (Earth-616)|Malekith the Accursed]], among whose ranks were the [[Angels (Tenth Realm)|Angels]] of [[Heven (Tenth Realm)|Heven]]. While defending Africa from the Angels' control, Angela decided to draw them back to their realm by teleporting herself to Heven and calling the Naglfar Armada there. The undead army razed Heven and massacred most of the Angels. Angela contemplated abandoning the Naglfar Armada on Heven, but instead opted to destroy the Naglfar Beacon, sending the Armada away.{{r|Asgardians of the Galaxy Vol 1 10}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1249879"
}