{
    "pageid": 55910,
    "ns": 0,
    "title": "National Security Council (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = [[Security Council|National Security Council]]\n| Aliases                 = [[Central Intelligence Agency|C.I.A.]]{{r|Nick Fury, Agent of S.H.I.E.L.D. Vol 3 38|40}}\n\n| Leaders                 = \n| CurrentMembers          = [[John Ogilvie (Earth-616)|John Ogilvie]]\n| FormerMembers           = [[Henry Gyrich (Earth-616)|Henry Peter Gyrich]], [[Valerie Cooper (Earth-616)|Valerie Cooper]], [[James Murch (Earth-616)|James Murch]], [[Raymond Sikorski (Earth-616)|Raymond Sikorski]], [[Phillip Rosen (Earth-616)|Phillip Rosen]], Judge Petrie\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Avengers (Earth-616)|Avengers]], [[Federal Bureau of Investigation (Earth-616)|F.B.I.]], [[Presidents of the United States of America|President of the United States]], [[United States Army (Earth-616)|U.S. Army]], [[Defense Advanced Research Projects Agency (Earth-616)|D.A.R.P.A.]], [[Freedom Force (Earth-616)|Freedom Force]]\n| Enemies                 = \n\n| Origin                  = Government Organization\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Washington, D.C.]], [[United States of America|United States]]\n| PlaceOfFormation        = [[Washington, D.C.]], [[United States of America|United States]]\n| PlaceOfDissolution      = \n\n| Creators                = Jim Shooter; George Perez\n| First                   = Avengers Vol 1 165\n\n| History                 =  The '''National Security Council''' is a federal government body that directly reports to the [[Presidents of the United States of America|President of the United States]], The Council consists of high ranking government officials that principally focuses on the national security of the United States. It advises and assists the President with national security, military, and foreign policy. It coordinates with other branches of government regarding the implementation of these policies. It also works with outside parties such as the [[Avengers (Earth-616)|Avengers]] and [[Freedom Force (Earth-616)|Freedom Force]].\n\n===Avengers===\n====Avengers Security====\nSpecial agent [[Henry Gyrich (Earth-616)|Henry Peter Gyrich]] was sent by the National Security Council, to the [[Avengers Mansion]] to review and improve the Avengers overall security. He easily entered the complex through a giant twelve-foot hole in the wall, noting that he could just walk in unannounced and gain access to everything in the building. Agitated, Gyrich reminded them of their unique security status within the [[United States of America|United States]] and their unusual tight relationship with the U.S. government. They had various special privileges, that included exemption from air-traffic regulations, connections to the U.S. security network, and an A.I. security clearance. These only could be overridden or revoked by the president or him.{{r|Avengers Vol 1 168}}\n[[File:Avengers Vol 1 181.jpg|thumb|right|200px|Gyrich enforcing the new rules.]]\nGyrich would later return from [[Washington, D.C.]] to check on the superhero group. Once again, he entered the mansion easily, after [[Clinton Barton (Earth-616)|Hawkeye]] left the door open. The same Hawkeye would accidentally capture him, confusing him for an intruder. Gyrich anger at the lackluster security and be bounded to a chair by Hawkeye, revoked their special privileges, the Avengers were now unable to use any of their aircraft or monitoring equipment, among other things.{{r|Avengers Vol 1 171}} All ties with [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] were severed as well, including [[Anthony Stark (Earth-616)|Stark]]'s emergency communications.{{r|Avengers Vol 1 172}}\n\nGyrich with the cooperation of Stark implemented a new rigorous security system, the team was cut down to only seven members, which would function as the core group, so that Council could track them easier. Other members could only be called in emergencies, but they required a special emergency clearance. The Council appointed a new group based on the uniqueness of abilities, established loyalties, and applicable regulations. [[Samuel Wilson (Earth-616)|Falcon]] was made part of the team, despite never been a member before, they had to give equal opportunities for minorities. If the Avengers followed these new guidelines their special privileges would be reinstated.{{r|Avengers Vol 1 181}}\n[[File:Carol Danvers (Earth-616) and Henry Gyrich (Earth-616) from Avengers Vol 1 183 001.jpg|thumb|left|200px|New procedures.]]\nDuring these days, Gyrich would figure as the governments' liaison and would frequently visit the Avengers to hold them on a short leash. When [[Wanda Maximoff (Earth-616)|Scarlet Witch]] took a leave of absence, [[Carol Danvers (Earth-616)|Ms. Marvel]] was appointed as her substitute. As part of the new regulations, retina and fingerprints were taken.{{r|Avengers Vol 1 183}} At one point, Gyrich tried to stop the Avengers from traveling to [[Transia]], to rescue the Maximoff twins, but [[Steven Rogers (Earth-616)|Captain America]] called the President and override Gyrich’s authority.{{r|Avengers Vol 1 186}}\n\nA while later, Scarlet Witch announced that she would extend her leave of absence, Gyrich who wanted her to return to the Avengers and follow the Council’s regulations, demanded her return. When her teammates backed her up, Gyrich was fed up with their obstinate behavior and wanted the shut the entire group down.{{r|Avengers Vol 1 189}} Gyrich used his authority, to arrange a senate meeting, he deemed the Avengers dangerous and demanded their dissolution. However their meeting was derailed by the [[Paul Duval (Earth-616)|Grey Gargoyle]]. in the wake of them defeating the Grey Gargoyle, the Avengers reaffirmed their importance, value and their ability to deal with major threats, who were out of the scope for the police.{{r|Avengers Vol 1 190|191}} Subsequently, The Council control over the Avengers was loosened greatly and Gyrich departed the Avengers mansion.{{r|Avengers Vol 1 192}} Following the verdict of the investigation, Gyrich primary focus would shift from the Avengers to mutants.{{r|Avengers Vol 1 235}}\n\n====A Hands-Off Approach====\nSometime later, the number of Avengers was dwindled to only four members, after the departure of [[Greer Grant (Earth-616)|Tigra]] and the dismissal of [[Henry Pym (Earth-616)|Hank Pym]], who showed reckless behavior in battle, suffered from mental issues and was abusive towards his ex-wife and teammate [[Janet Van Dyne (Earth-616)|the Wasp]].{{r|Avengers Vol 1 216}}{{r|Avengers Vol 1 213}} Following a recruitment initiative, former member [[Clinton Barton (Earth-616)|Hawkeye]] and newcomer [[Jennifer Walters (Earth-616)|She-Hulk]] joined the team, their applications were sent to the National Security Council, Gyrich brought them to [[Ronald Reagan (Earth-616)|President]], who signed them.{{r|Avengers Vol 1 221}}\n[[File:Raymond Sikorski (Earth-616) from Avengers Vol 1 235 001.png|thumb|right|200px|Raymond Sikorski forced to contact the Avengers.]]\nMeanwhile, The [[Federal Bureau of Investigation (Earth-616)|F.B.I.]] in [[Miami]], contacted the National Security Council in regards to the disappearance of [[Karl Oheimer (Earth-616)|Dr. Karl Oheimer]], who temporarily restored the mind of [[Theodore Sallis (Earth-616)|Man-Thing]]. Gyrich forwarded their message to the [[United States Army (Earth-616)|United States Army]], considering Man-Thing was created as part of [[Project Gladiator (Earth-616)|Project Gladiator]], an attempt by S.H.I.E.L.D. to recreate the [[Super-Soldier Serum]].{{r|Man-Thing Vol 2 1}}\n\nA while later, when the [[White House]] received an emergency message from [[Nicholas Fury (Earth-616)|Nick Fury]], that he and President [[Ronald Reagan (Earth-616)|Ronald Reagan]] were held hostage by [[Samuel Smithers (Earth-616)|Plantmen]] at a S.H.I.E.L.D. base near [[Chesapeake Bay]], [[Maryland (State)|Maryland]]. Gyrich sent the Avengers to rescue them and free the base, the team successfully executed their objective.{{r|Avengers Vol 1 231}} Later, [[Raymond Sikorski (Earth-616)|Raymond Sikorski]], a fellow agent of Gyrich, who at first was incredulous at the existence of superheroes and especially the Avengers, was informed about a   prison break, in which a duplicate of Plantman freed the [[Bentley Wittman (Earth-616)|Wizard]]. Despite his own skepticism, Sikorski was forced to call the Avengers for aid. The superhero team captured the Wizard and brought him back to prison.{{r|Avengers Vol 1 235}}\n\n[[Peter Parker (Earth-616)|Spider-Man]], who initially rejected [[Thor Odinson (Earth-616)|Thor]]'s invitation to join the Avengers, was desperate for cash and when he learned that Avengers earned 1000 dollars per week as a standard salary, he wanted to join them, despite his own doubts, to alleviate his financial predicament. He tried to enter the Avengers as a trainee, but his application was rejected by Sikorski, due to his anonymity and the notorious reputation Spider-Man had accrued over the years, Sikorski considered him to be a major security risk.{{r|Avengers Vol 1 237}}\n\n====A New Avengers' Liaison====\nWhen the [[Vision (Earth-616)|Vision]] had recently taken control as Avengers Chairman, he gave a press conference revealing that the main Avengers team had [[Secret Wars|disappeared]] and that there was an [[Wraith War|upcoming threat]] coming to Earth, he urged the public to stay calm and informed them that he had scheduled meeting with the National Security Council to bring him up to speed.{{r|Avengers Vol 1 243}} The Vision, who was not long ago repaired with the aid of [[Integral Synaptic Anti-Anionic Computer (Earth-616)|I.S.A.A.C.]], which greatly expanded his memory banks. However, his control crystal was still damaged, which interfered with his ability to reason. Despite this, his desire for more control and less government oversight grew, in a futile mission for peace.{{r|Avengers Vol 1 254}}\n[[File:Avengers Vol 1 243.jpg|thumb|left|200px|Vision becomes chairman]]\nKnowing he had increased his abilities as a consequence of his connection with the [[Titan (Moon of Saturn)|Titan]] supercomputer. He used his newfound capacity, to subtly through mind manipulation, convince Gyrich and Sikorski that Avengers needed more independence and free up their abilities at a governmental level. Shortly after their meeting, the Avengers reappeared in [[Central Park]]; in their next assembly the Wasp officially stepped down as Chairwoman and Vision maintained his current role. Vision introduced a new type of membership called \"Detached Membership\" if members were available, they were considered active members, and reservists if they were not. He also tasked Hawkeye to create a new Avengers branch on the [[Avengers West Coast (Earth-616)|West Coast]] with full government backing. Raymond Sikorski replaced Gyrich as their security liaison as well.{{r|Avengers Vol 1 243}}\n\nA while later, Avengers chairman Vision and his wife Scarlet Witch visited the [[White House]] to meet the presidential couple. In a private lengthy conversation between Vision and President [[Ronald Reagan (Earth-616)|Ronald Reagan]], Vision using similar methods like before, convinced the president among other things to consider transforming the position of Avengers' chairmanship into an actual cabinet-level post.{{r|Avengers Vol 1 246}}\n\nIn the meantime, Sikorski had a scheduled meeting with the Avengers chairman, in regards to the subpar security of the [[Northwind Observatory]], where [[Bruce Banner (Earth-616)|Bruce Banner]] had created new technologies at breakneck speed, during a few precious months he had complete control over his Hulk persona. With both Hulk and Banner now gone, the Observatory would be a target for would-be thieves interested in Banner's inventions, in response they sent a group of the nation's top scientists accompanied by a special Avengers team led by Captain America. Vision was unable to join them, he was occupied with his duties as Chairman.{{r|Avengers Annual Vol 1 13}}\n\n====Vision's Takeover====\nFeeling like his previous decisions as chairman were either inadequate or overlooked, his desire to have a more direct influence on current world affairs grew further. Overtime, Vision became more assertive and controlling; he started making further preparations for his eventual take over of the planet's computer systems without notifying the Council or his teammates.{{r|Avengers Vol 1 251}} First he upgraded the computer systems in the entire Avengers mansion.{{r|Avengers Vol 1 250}} Together with I.S.A.A.C., he repurposed [[Howard Stark (Earth-616)|Howard Stark]]'s old underground lab under the Avengers headquarters, at the heart of the new complex, there was Vision's Encephalatron Command Chair which allowed him to start a new golden age.{{r|Avengers Vol 1 251}} To create a world without any human strife, that would allow for peace and prosperity, at the cost of Vision's own existence.{{r|Avengers Vol 1 252}}\n[[File:Avengers Vol 1 254.jpg|thumb|right|200px|Absolute Vision]]\nHe proposed Captain America a hypothetical version of his plan, only to get uncertainty in return. When Vision was about to confide his real plan with Steve, their conversation was interrupted by Scarlet Witch, who informed them, that their home in [[Leonia]] was burned down by an anti-mutant arsonist. Watching the fire, Vision's final doubts were eliminated, when Captain America invoked the American Dream in an exchange with the local population. Back at the mansion, Vision set his plan in motion, first, he sent the rest of Avengers on spurious missions that dealt with the remnants of [[Thanos (Earth-616)|Thanos]].{{r|Avengers Vol 1 252}} \n\nSecondly, he connected himself with the rest of the world through a special built circuitry, abandoning his own synthetic body in the process. Every computer system he could access became part of him, including highly sophisticated and secured structures such as the [[Pentagon]], the [[S.H.I.E.L.D. Helicarrier]] and even Soviet spy satellites in outer space; He gained control of all the world's computerized weapon systems as well. in his new form, he could cross the entire network in microseconds.{{r|Avengers Vol 1 253}}\n\nThe Avengers rushed back to the mansion when Vision confessed his schemes.{{r|Avengers Vol 1 253}} Upon on their return, they all separately confronted different holographic incarnations of Vision. In the end, the Avengers managed to shut down the entire system and convinced Vision to see the error of his ways. Unfortunately for them, their engagement didn't go unnoticed, the [[Valhalla Base|NORAD]] traced Vision's interference back to the mansion, which would negatively impact their standing with the government. In a final act, Vision removed his control crystal. {{r|Avengers Vol 1 254}}\n\n====Restructuring====\nIn Washington, General Peabody, the head of the Valhalla facility, demanded the shutdown and arrest of the superhero group. Sikorski, taking into account the ineffective actions of his predecessor, refused, he didn't want to repeat previous mistakes. Vision contacted the Council, he took full responsibility and stepped down as chairman. Eager to know what happened, Vision was invited to Pentagon for a full debriefing.{{r|Avengers Vol 1 255}}\n\nAt their meeting, Vision told them everything regarding his time as chairman, therefore the Council almost unanimously approved of the decision to find and confiscate all the circuitry Vision had used in his takeover. However, before they could expropriate anything, [[Eros (Earth-616)|Starfox]], had already dismantled the alien machinery without any prior authorization, this was considered tampering with evidence due to the ongoing government investigation. Sikorski informed the Avengers, that until a pending restructuring had taken place, that their priority clearance was suspended. These changes had to proceed - Sikorski was unable to persuade the rest of the council to change their minds - otherwise, the Avengers were forced to disband.{{r|Avengers Vol 1 258}}\n\nAs part of the restructuring of their government clearance, the [[Federal Aviation Administration (Earth-616)|Federal Aviation Administration]] had revoked the Avengers' license to store [[Quinjet|Quinjets]] on the Avengers ground. They were given a 30 days timeframe to move their Quinjets outside the city's perimeter, the supersonic aircraft were considered a safety hazard and needed to be moved from the heart of Manhattan.{{r|Avengers Vol 1 261}} Having received numerous offers to transfer their vehicles to a site, they reached an agreement with the owners of [[Hydrobase]], a floating island off the coast of New York, to lease the facilities on the island. Which would allow them to use the base as a launchpad.{{r|Avengers Vol 1 262}}\n\nWeeks later, Sikorski was still trying to find a workable solution that would restore the Avengers' security clearance with the government. Returning from a mission from the [[Andromeda Galaxy]], which involved the [[Deviant Skrulls|Skrulls]] and [[Nebula (Earth-616)|Nebula]], Starfox decided to leave the team to pursue Nebula, who claimed to be Thanos granddaughter.{{r|Avengers Vol 1 261}} [[Namor McKenzie (Earth-616)|Namor the Sub-Mariner]] was chosen as his replacement, despite the current uncertainty around their legal situation, Namor was accepted into the team. Sikorski objected at first, arguing that this would make his job harder, but changed his tune when Captain America vowed for the former prince of [[Atlantis (Modern)|Atlantis]].{{r|Avengers Vol 1 263}}\n\nMeanwhile, at an interrogation in the [[Project P.E.G.A.S.U.S. Facility]], Gyrich and Sikorski continued their investigation by questioning the synthezoid for hours. Having waited for twelve hours, Vision and especially Scarlet Witch were fed up with the treatment Vision received, this made the couple renounce their Avengers membership. They departed the facility for Leonia, where they would reestablish themselves as private citizens, near their old home. Sikorski promised to Scarlet Witch, he would take full responsibility for their departure, to the confusion of Gyrich.{{r|Vision and the Scarlet Witch Vol 2 1}}\n\n===Mutant Menace===\n====[[Project Wideawake (Earth-616)|Project: Wideawake]]====\nOn orders of the [[Presidents of the United States of America|President]], National Security Advisor Judge Petrie arranged an assembly concerning the recently initiated [[Project: Wideawake]]. Henry Peter Gyrich, [[Valerie Cooper (Earth-616)|Valerie Cooper]] and representatives of every vital military and civilian security department, were present at a confidential meeting regarding the security threat that the increasing numbers of [[Homo superior|mutants]] posed. Cooper showed that mutants were a global phenomenon now and were of the opinion that the U.S. should take steps in order to defend itself. Gyrich disagreed with her assessment and argued that it only would prove [[Max Eisenhardt (Earth-616)|Magneto]] right, that humans would either destroy or enslave the mutants.{{r|Uncanny X-Men Vol 1 176}}{{r|X-Factor #92}}\n[[File:Valerie Cooper (Earth-616) and Henry Gyrich (Earth-616) from Uncanny X-Men Vol 1 176 001.jpg|thumb|left|200px|Cooper and Gyrich discussing the mutant menace.]]\nGoing for a more cautious approach, Gyrich was assigned to oversee the highly classified project, its mission statement: to deal with the growing mutant threat, preserve the balance of power in the world and protect the United States. Not knowing how mutants came to be and how they gained their powers, he was first determined to find those answers. They established a facility to house and examine the mutants.{{r|New Mutants Vol 1 2}} Their first target was the newly formed [[New Mutants (Earth-616)|New Mutants]].{{r|New Mutants Vol 1 1}}\n\n[[John Ogilvie (Earth-616)|Agent Ogilvie]] and other agents were sent to the [[New Salem Mall|Salem Center Mall]] to apprehend the teenage mutants, this included the use of [[Sentinels]], these were provided by industrialist [[Sebastian Shaw (Earth-616)|Sebastian Shaw]] of the [[Hellfire Club (Earth-616)|Hellfire Club]]. However, with the aid of [[Michael Rossi (Earth-616)|Michael Rossi]], the mutants managed to evade capture and the NSC agents were arrested by the local police instead, ending their first mission in failure.{{r|New Mutants Vol 1 2}}\n\nAs part of the project, they started to recruit and train agents to become \"Mutant Hunters\". Gyrich employed them for the first time, when he was informed of the death of a [[Robert Smith (Slimey) (Earth-616)|homeless person]], he surmised correctly that the [[Lois London (Earth-616)|murderer]] was a mutant, he sent out two hunters without consulting the Committee on Mutants Affairs. The two hunters investigation ended at an empty hotel room.{{r|Dazzler Vol 1 26}}\n\nBack at their headquarters, the project had yet to produce a functional Sentinel, that could take on a mutant foe, Shaw presented an updated model that came from one of his companies. Both Cooper and Gyrich were present at this demonstration, Gyrich grew frustrated with Shaw, due to the constant failures and for the lack of progress the project made. During their next presentation, one of the machines went rogue, which was caused by [[Katherine Pryde (Earth-616)|Kitty Pryde]] and [[Douglas Ramsey (Earth-616)|Doug Ramsey]], who had gained access to [[Shaw Industries (Earth-616)|Shaw Industries]] computer system through a security backdoor, in an effort to find dirt on Shaw, who besides being industrialist, was also one of the [[X-Men (Earth-616)|X-Men]]'s deadliest foes. Gyrich was forced to initiate its self-destruct sequence. Gyrich vowed to find the rogue operator responsible for the disaster.{{r|New Mutants Vol 1 13}}\n\n====Further Measures====\nRequiring more weapons and technology, they began to enlist other private companies and interests, whether they were mutants or not, capable of providing new methods of countering mutant powers. Special assistant Cooper and [[Defense Advanced Research Projects Agency (Earth-616)|D.A.R.P.A]] agent [[Raven Darkholme (Earth-616)|Raven Darkholme]], visited a recent contact of Darkholme, a mutant cyborg by the name of [[Forge (Earth-616)|Forge]], who had an intuitive talent for inventing mechanical devices. The government had turned to him after Tony Stark renounced his former life as a weapon manufacturer. He provided them with two experimental devices based on [[Rom (Earth-616)|Rom]]'s technology, a pistol able to neutralize someone's superpowers, mutant or otherwise, and a scanner that was able to determine someone's species and detect the presence of superhumanly beings.{{r|Uncanny X-Men Vol 1 184}}\n\nDespite heavy protests of Forge and Darkholme, Gyrich got authorization, with approval of Cooper, for the two prototypes to use them in conflict to even the odds and to bring in [[Rogue (Anna Marie) (Earth-616)|Rogue]],{{r|Uncanny X-Men Vol 1 185}} who was a former member of the [[Brotherhood of Evil Mutants (Earth-616)|Brotherhood of Evil Mutants]] and who had recently a confrontation with [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]].{{r|Uncanny X-Men Vol 1 182}} When they tried to apprehend Rogue for her crimes, Gyrich tried to shoot her, only for [[Ororo Munroe (Earth-616)|Storm]] to shove Rogue and absorb a full blast of the neutralizer. Immediately afterward, Forge saved Storm from drowning and berated Gyrich for his dangerous behavior. Their encounter was viewed from afar by the [[Dire Wraiths]], they analyzed Forge's weapons and concluded that needed to kill Forge to secure their victory over the Terrans.{{r|Uncanny X-Men Vol 1 185}} \n\nIn the aftermath, Forge took Storm with him back to his [[Eagle Plaza|home]], he had promised Gyrich he would look after her. Storm wanted to leave, when she overheard a phone call between Forge and Gyrich, Gyrich informed that Cooper was attacked and left in a catatonic state. In [[Caldecott County (Mississippi)|Caldecott County]], Cooper returned from a search party that was looking for Rogue, Cooper was attacked by a dire wraith, that had taken the form of another NSC [[Phillip Rosen (Earth-616)|agent]]. She was saved just on time by Rogue, giving her enough time to escape. Rogue, however, caught up to her and used her absorption powers to gain the government plans for the mutants from Cooper's mind.{{r|Uncanny X-Men Vol 1 186}} The mutants, including the X-Men, survived the attack from the Dire Wraiths. Afterward, the X-Men, together with Storm, left the [[Eagle Plaza]].{{r|Uncanny X-Men Vol 1 187|188}}\n\nMeanwhile, in Washington D.C., Gyrich is approached by a guy named [[Douglas Carmody (Earth-616)|Carmody]], who claimed to know a [[Power Pack (Earth-616)|group of mutants]] that lived in [[Richmond (Virginia)|Richmond]]. Gyrich agreed to investigate, but during their investigation, Carmody became overly aggressive and started to pursue the quartet with a gun. This led them to a local lookout tower, where Gyrich was saved by the Power Pack when he fell off the edge of the cliff. As a last-ditch effort, Carmody tried to kill the superpowered kids, but in their ensuing fight, Carmody was knocked out by kids' [[James Power (Earth-616)|father]]. A grateful Gyrich thanked the kids for the rescue and arrested Carmody for attempted murder.{{r|Power Pack Vol 1 5}}\n\n====[[Freedom Force (Earth-616)|Freedom Force]]====\nMystique, the leader of the [[Brotherhood of Evil Mutants (Earth-616)|Brotherhood of Evil Mutants]], contemplated over the future of her outlaw team. She hypothesized that they had outlived their usefulness unless she found a way to escape federal punishment. She approached special assistant Cooper with a proposal, in exchange for a full pardon, they would become government operatives, who would directly respond to White House. This would bypass the need to call the Avengers or the [[Fantastic Four (Earth-616)|Fantastic Four]]. \n\nTo prove their need and value, they were sent to capture former Brotherhood leader Magneto, the master of magnetism, who was attending a [[Holocaust (Event)|Holocaust]] memorial in the capital. The arrest escalated to a full-on confrontation with the X-Men. Noticing how terrified his friends were of his powers, Magneto surrendered himself to the newly formed [[Freedom Force (Earth-616)|Freedom Force]], he was done running away and wanted to take a stand.{{r|Uncanny X-Men Vol 1 199}} Magneto's trial was held at the Palais de Justice in [[Paris (France)|Paris]] and Cooper had now her own team of superbeings to the government's bidding.{{r|Uncanny X-Men Vol 1 200}}\n\n===[[Wraith War]]===\nBefore Gyrich could continue to his work on the Wideawake project, he was sent by the President to the [[Wraith-Hunter Rangers]]'s camp to rendezvous with [[Merriwether Locklin (Earth-616)|General Locklin]] and [[Rom (Earth-616)|Rom]]. They met in response to the Dire Wraiths who were attacking Earth, they were using the [[Sun (Star)|Sun]] as a weapon, in their final assault on Earth. Rom proclaimed this would be the end of the world if they didn't defeat the extraterrestrial forces. Gyrich was brought up to speed by the General, who had been fighting the cosmic threat for months now. In return Gyrich, informed them of the special prototype Forge previously made, that was capable of combating the alien menace.{{r|Rom Vol 1 61}}\n\nUndeterred by his previous encounters with the dire wraiths, Forge refused to give his, now the fifth iteration of the weapon he made, to the authorities. As a result of Henry Gyrich taken his prototype and using it on another human being, which fueled his distrust of the government. He remained deviant even when General Locklin started threatening him. He changed his tune, however, following a series of events. First, he had a heart-felt conversation with Rom, then people were being attacked by the dire wraiths, and lastly, the sun started blackening, made him realize how apocalyptic the situation was.{{r|Rom Vol 1 62}}\n\nForge and Rom started neutralizing the dire wraiths outside of the [[Eagle Plaza]], [[Dallas]]. They drove away the creatures for now. In less than 24 hours, led by Forge, Earth’s nations started building a [[Neo-neutralizer|giant neutralizer]] capable of wiping out the dire wraiths in one fell swoop. Gyrich was also involved in the project that was being built in Earth’s Orbit. When construction was near-completion, a group of human-disguised wraiths tried to sabotage the project and kill Forge, but Forge was saved by Gyrich and Rom dispatched the rest of the group.{{r|Rom Vol 1 63}}\n\nEven though havoc reigned on Earth, as [[Wraithworld]] continued its approach to Earth, Forge and his colleagues were putting the final touches on their enormous machine.{{r|Rom Vol 1 64}} In the final moments of the huge battle, the combined forces of the [[Defenders (Earth-616)|Defenders]], the [[Soviet Super-Soldiers (Earth-616)|Soviet Super-Soldiers]], the Avengers, the X-Men and other superheroes, held off the dire wraiths long enough, just in time for Rom and Forge to activate their machine and banish the invaders from existence. But before they could activate it, Gyrich first tried to use the weapon on the superheroes as well, but his plan was thwarted.{{r|Rom Vol 1 65}} Afterwards, Gyrich lamented his own failure.{{r|Rom Vol 1 66}} \n\n===Posing as the C.I.A.===\nThe National Security Council, posing as [[Central Intelligence Agency (Earth-616)|C.I.A.]], interrogated [[Nicholas Fury (Earth-616)|Nick Fury]] about his [[Cold War (Event)|Cold War]] days.{{r|Nick Fury, Agent of S.H.I.E.L.D. Vol 3 38|40}} Their leader, Henry Gyrich, wanted informations about [[Colonel Ishii (Earth-616)|Colonel Ishii]], a powerful [[Imperial Japan (Earth-616)|Imperial Japan]] soldier who was captured and secretly killed by [[William Cross (Earth-616)|Crossfire]].{{r|Nick Fury, Agent of S.H.I.E.L.D. Vol 3 40}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:American Organizations]]\n[[Category:Government Organizations]]"
                }
            }
        }
    ],
    "page_id": "55910"
}