{
    "pageid": 940513,
    "ns": 0,
    "title": "National Crime Syndicate (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = National Crime Syndicate (Earth-616) from Amazing Spider-Man Vol 1 220 0001.jpg\n| Name                    = [[National Crime Syndicate]]\n| Title                   = [[National Crime Syndicate]]\n| Aliases                 = [[National Syndicate Directorate]]\n\n| Leaders                 = Formerly [[Eddie Envers (Earth-616)|Eddie \"Three Fingers\" Envers]]\n| CurrentMembers          = \n| FormerMembers           = [[Eddie Envers (Earth-616)|Eddie \"Three Fingers\" Envers]], [[Honeysuckle Muldoon (Earth-616)|\"Honeysuckle\" Muldoon]], [[Weasel (National Crime Syndicate) (Earth-616)|Weasel]], [[Louie Frenchetti (Earth-616)|Louie Frenchetti]], [[One-Eye Lonigan (Earth-616)|\"One-Eye\" Lonigan]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Peter Parker (Earth-616)|Spider-Man]], [[Marc Spector (Earth-616)|Moon Knight]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Manhattan]], [[New York City]], [[New York (State)|New York]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[Manhattan]], [[New York City]], [[New York (State)|New York]]\n\n| Creators                = Michael Fleisher; Bob McLeod\n| First                   = Amazing Spider-Man Vol 1 220\n\n| History                 = The National Syndicate Directorate were a national confederation of criminal organizations that dominated the American underworld. They held a contest in [[New York City]] to replace their recently deceased secretary. In which the post would be awarded to the first mob boss who amassed $10 million in loot. Crime bosses from every state and a few foreign countries arrived to attend the mob convention. Because of the contest during the mob convetion, New York City experienced more heists in 3 weeks than it had in 3 years. \n\nSpider-Man and Moon Knight worked together to have Moon Knight get the secretary's spot. As whoever became the secretary got a box of microfilm that contained the names, hideouts, and alternate identities of nearly every major gangster operating in the United States. Which would result in the arrest of hundreds of wanted criminals. Moon Knight beat his competitors for the position but due to his crime-fighting past, the directorate voted that he needed to complete one more task. Assassinate one of the syndicate's greatest enemies, Spider-Man and bring his body to the convention. Moon Knight brought to the the body of a mobster sent to follow him, dressed up as Spider-Man. After which the real Spider-Man appeared, and both Moon Knight and Spider-Man battled and defeated the gangsters. Moon-Knight then dropped off the microfilm at the FBI.{{r|Amazing Spider-Man Vol 1 220}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = The real National Crime Syndicate was founded by Italian-American and Jewish-American crime bosses in 1929 (e.g. Charles Luciano and Meyer Lansky). It's leadership remained Italian and Jewish for a while, but eventually became Italian only. Mob bosses from other ethnic mobs (e.g. Irish-American, Puerto Ricans, African-Americans, Polish-American, etc) were affiliated with it but didn't call the shots. The criminal confederation was known to be active until the 1960s.\n| Links                   = \n* [[Wikipedia:National Crime Syndicate|National Crime Syndicate at Wikipedia.org]]\n}}\n[[Category:Criminal Organizations]]\n[[Category:Historical Organizations]]\n[[Category:Drug Cartels]]"
                }
            }
        }
    ],
    "page_id": "940513"
}