{
    "pageid": 779905,
    "ns": 0,
    "title": "Nelson and Murdock (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Daredevil Vol 3 36 Textless.jpg\n| Name                    = Nelson and Murdock \n| Aliases                 = [[Nelson and Murdock Attorneys at Law]];{{citation}} [[Storefront Legal Clinic]];{{citation}} [[Nelson, Blake, and Murdock]];{{citation}} [[Nelson & Murdock]];{{r|Daredevil Father #1}} [[Nelson: Attorney at Law]];{{citation}} [[Nelson, Murdock and Sharpe]];{{citation}} [[Murdock and Nelson Attorneys at Law]]{{r|Daredevil Father #1}}\n\n| Leaders                 = [[Matthew Murdock (Earth-616)|Matt Murdock]]; formerly [[Franklin Nelson (Earth-616)|Foggy Nelson]], [[Rosalind Sharpe (Earth-616)|Rosalind Sharpe ]] and [[Rebecca Blake (Earth-616)|Becky Blake]]\n| CurrentMembers          = \n| FormerMembers           = [[Character Index/D#Doreen|Doreen]]<!-- (secretary)? -->, [[Karen Page (Earth-616)|Karen Page]] (secretary), [[Mercedes Knight (Earth-616)|Misty Knight]] (paralegal)\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Jessica Jones (Earth-616)|Jessica Jones]] (enlisted private investigator), [[Luke Cage (Earth-616)|Luke Cage]], [[Daniel Rand (Earth-616)|Iron Fist (Danny Rand)]], [[Dakota North (Earth-616)|Dakota North]]\n| Enemies                 = [[Wilson Fisk (Earth-616)|Kingpin]], [[Goodman, Lieber, Kurtzberg & Holliway (Earth-616)|Goodman, Lieber, Kurtzberg & Holliway]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Nelson and Murdock Law Office]], [[Hell's Kitchen]], [[New York City]], [[New York]]\n| PlaceOfFormation        = [[Nelson and Murdock Law Office]], [[Hell's Kitchen]], [[New York City]], [[New York]]\n| PlaceOfDissolution      = New York State Supreme Court, [[New York City]], [[New York]]\n\n| Creators                = Stan Lee; Bill Everett\n| First                   = Daredevil Vol 1 1\n\n| History                 = \n===Nelson and Murdock Attorneys at Law===\nThis law firm was established after [[Matthew Murdock (Earth-616)|Matt Murdock]] and [[Franklin Nelson (Earth-616)|Foggy Nelson]] graduated, thanks to Foggy's dad's money. [[Karen Page (Earth-616)|Karen Page]] was quickly hired by Nelson as a secretary.{{r|Daredevil Vol 1 #1}} Nelson and Murdock became high profile attorneys with numerous cases and clients. Nelson eventually used his fame to successfully run and be elected as the District Attorney of [[New York City]].\n\nAt this point the law partnership had to be dissolved. Murdock and Nelson had a brief period of estrangement when Nelson was elected. Murdock forced Nelson to leave the office and party headquarters on the eve of his election. Murdock (as the crime fighter Daredevil) knew that organized crime members had hired the [[Wilbur Day (Earth-616)|Stilt-Man]] to kill Nelson at the law office on the night of the election.{{r|Daredevil Vol 1 48}} Daredevil prevented the assassination. Nelson won in a \"landslide\" and the two eventually reconciled.\n\n=== District Attorney Nelson ===\nNelson brought his team with him to the District Attorney's Office. Karen Page was hired as a secretary. Matt Murdock was hired as a \"Special Assistant\".{{r|Daredevil Vol 1 58}} Murdock quickly rose to Assistant District Attorney.{{r|Daredevil Vol 1 70}} However, Page soon quit the office to move to [[Los Angeles]].{{r|Daredevil Vol 1 63}} Murdock also took a leave of absence to visit Page in L.A.{{r|Daredevil Vol 1 64|Daredevil #64}}\n\nLater in New York, Murdock and Nelson argued over the [[Natalia Romanova (Earth-616)|Black Widow]] being charged with murder. Unbeknownst to Murdock, Nelson was being blackmailed by ''Mr. Klein'' to prosecute the Widow. Murdock defiantly announced that he would defend her. At this point, Murdock appears to have resigned as Assistant District Attorney due to his conflict of interest.{{r|Daredevil Vol 1 83|Daredevil #83}} Murdock successfully defended the Widow. Matt Murdock became romantically involved with the heroine and the two moved to San Francisco.{{r|Daredevil Vol 1 87}} Murdock soon became a partner at ''Broderick, Sloan, and Murdock'' for most of the time he was in San Francisco.{{r|Daredevil Vol 1 94}}\n\n=== Nelson and Murdock Reunited ===\n\nFoggy Nelson was shot in New York. When his old friend Murdock heard the news, he hurried to his bedside.{{r|Daredevil Vol 1 109}} Nelson recovered. Murdock stayed in New York as well. However, Nelson was defeated for District Attorney during his next re-election bid.{{r|Daredevil Vol 1 130}}\n\nMatt Murdock had decided to permanently remain in New York and make some changes in his life. He had begun a relationship with [[Heather Glenn (Earth-616)|Heather Glenn]] who would eventually become his fiancée. He also decided to open \"a place where the poor can come for free legal advice\" and named his new practice the ''Storefront Legal Clinic\".\n\n=== Murdock and Nelson's Storefront Legal Clinic ===\n\nMurdock sensed than Foggy Nelson would lose his election. In advance of the results, he had printed business cards for the \"Storefront\" with Nelson's name on it. He stated that they would \"always\" be partners. The \"Storefront\" prospered for some time. [[Rebecca Blake (Earth-616)|Becky Blake]] was hired as the Clinic's secretary. Nelson appeared to be in charge of day to day operations. Eventually, the Storefront lost it's government funding and grants. Nelson and Murdock's relationship again became strained. Nelson lamented that there were few, if any paying clients. Of course, Murdock spent a great deal of his personal time as the crime fighter Daredevil. Murdock and Nelson were also both mutually absent for crucial court cases involving their clients. The Storefront met its final demise when the [[Hand (Earth-616)|Hand]] bombed the clinic in an attempt to assassinate Matt Murdock.{{r|Daredevil Vol 1 174}}\n\n=== Nelson and Murdock Back in Business ===\n\nFrom the rubble of the Storefront, Foggy Nelson took a phone call from [[James Jonah Jameson (Earth-616)|J. Jonah Jameson]] of the [[Daily Bugle]]. The Bugle was involved in a defamation lawsuit from [[Wilson Fisk (Earth-616)|the Kingpin]] for a series of articles they had run about the Kingpin's candidate [[Randolph Cherryh (Earth-616)|Randolph Cherryh]]. Nelson negotiated a enormous fee from Jameson. Murdock and Nelson again appeared to put aside their differences. Rebecca Blake continued with the firm as well. The fee from the Bugle was large enough for ''Nelson and Murdock'' to become established in a Manhattan high-rise.{{r|Daredevil Vol 1 178}}\n\nLater, once again, the practice became insolvent due to a number of reasons. Murdock would lose his law license for some time. Nelson went through a difficult divorce. Murdock continued to be absent or somewhat distracted due to his activities as Daredevil. However, the friendship and partnership appear to continue in the [[Marvel Universe]].\n\n===Rosalind Sharpe: Associate===\n\nFoggy Nelson's mother [[Rosalind Sharpe]] later approached Murdock and Nelson and offered to partner with them. Rosalind was a highly successful attorney in Boston and also Foggy's mother. After some initial shock and hesitation, Murdock and Nelson agreed.{{r|Daredevil Vol 1 354}}\n\n===Nelson and Murdock Once Again===\nDuring [[Quentin Beck (Earth-616)|Mysterio's]] plot against Daredevil, Foggy Nelson was accused of the murder of their client, a divorcee (actually a porn star Mysterio hired) who hired their firm to help settle her divorce case and was sent to prison. Rosalind Sharpe, fearing the bad publicity this will bring to their firm and her career, fires Foggy to sever his ties to the firm. Matt quits the firm after Rosalind makes it clear he is forbidden from helping Foggy in this case.{{r|Daredevil Vol 2 3}} After Mysterio is unmasked as the mastermind of this plot and Foggy is released, despite Karen Page having been killed in this incident, Matt is named as the sole beneficiary of her will and the money he inherited from it allows the two to re-establish Nelson and Murdock as their own business again.{{r|Daredevil Vol 2 8}}\n\n===A New Beginning and a New Partner===\n\nMatt Murdock again lost and again regained his law license and his former legal secretary now also an attorney, [[Rebecca Blake (Earth-616)|Becky Blake]], joined the firm as a partner. At this time, besides changing to a new location, the firm also went in the direction of not having an office that accepts walk-ins, but rather one that selectively chooses its clientele to avoid dealing with Daredevil stalkers.{{r|Daredevil Vol 2 93}}\n\n== Notable Events and Clients ==\nOne of their first clients was [[Benjamin Grimm (Earth-616)|The Thing]], who asked Murdock to review the lease of the [[Baxter Building]], but the lawyer couldn't do it on time and he was dismissed by the [[Fantastic Four (Earth-616)|Fantastic Four]].{{r|Daredevil Vol 1 #2}}\n\nThe next client was the [[Leland Owlsley (Earth-616)|Owl]], whom Foggy turned down, but Matt decided to take the case instead. The Owl, lurking in the next office with some of his thugs, was confronted by Daredevil, but he managed to hold Karen Page hostage and have DD surrender to him, too.{{r|Daredevil Vol 1 #3}}\n\nSome time after, as requested by the court, Matt took the [[Zebediah Killgrave (Earth-616)|Purple Man's]] case, accused of bank robbery.{{r|Daredevil Vol 1 #4}}\n\nLater on, Mr. Murdock called a press conference to publicly state that Daredevil was the [[Manuel Eloganto (Earth-616)|Matador]], hoping to get a rematch after his first defeat.{{r|Daredevil Vol 1 #5}}\n\nNot knowing Matt's real skills, Foggy got him a voice recorder, to take notes without writing. Having read the news about the opening of a wax museum with a new display, showcasing Daredevil, Matt, Foggy and Karen decided to go to check out the display.{{r|Daredevil Vol 1 #6}}\n\nSome time later, the [[Namor McKenzie (Earth-616)|Sub-Mariner]] forced his way into the law office of Nelson and Murdock in order to seek the audience of a lawyer. Namor sought to sue the surface world for its exploitation of the sea, however when Murdock explained how ridiculous the notion was, Namor went on a rampage across the city. When he turned himself over to the authorities to answer for the damage that he had done, he later called the office to be defended.{{r|Daredevil Vol 1 #7}}\n\nMatt's next client was [[Wilbur Day (Earth-616)|Wilbur Day]], a former employee of Kaxton Laboratories, where he invented hydraulic lifts which his boss [[Carl Kaxton (Earth-616)|Carl Kaxton]] had stolen the patents. Murdock then called Kaxton to tell him that his former employee intended to sue him, a threat which Kaxton encouraged them to follow through on. Later, when meeting with Wilbur again, Kaxton arrived at the office to contest the law suit. While the two argued over who owned the rights to the hydraulic device, Matt noticed that one of them was lying due to an irregular heart beat, but couldn't figure out which one was the liar because they were too close together. Returning to the Nelson and Murdock law office from Kaxton's property, Matt was confronted by him, but Murdock told him that Day had dropped the lawsuit and they decided to let the whole thing go.{{r|Daredevil Vol 1 #8}}\n\nWhile Foggy, Karen and Mike Murdock were to the court trial against [[Vincent Patilio (Earth-616)|Leap-Frog]], the office was violated by the [[Frank Farnum (Earth-616)|Masked Marauder]], who actually was the building landlord, in order to find clues to the identity of Daredevil.{{r|Daredevil Vol 1 #26}} Soon after, [[Wilbur Day (Earth-616)|Stilt-Man]] rose to the window of Nelson and Murdock and threw in one of the Masked Marauder's sleeping gas pellets, incapacitating the occupants (Matt Murdock, Foggy Nelson and Karen Page) inside and taking them hostages.{{r|Daredevil Vol 1 #27}} After they were rescued by Daredevil, Foggy took Karen away for a date, leaving Mike Murdock behind.{{r|Daredevil Vol 1 #28}} The law office was attacked once again by the Masked Marauder's gang, who beat up Foggy and kidnap Karen to get revenge on Daredevil for their master's arrest, to draw out Daredevil.{{r|Daredevil Vol 1 #29}}\n\nWhen they both learned that the [[Klaus Voorhees (Earth-616)|Cobra]] and [[Calvin Zabo (Earth-616)|Mr. Hyde]] had begun a crime spree, Foggy wasn't interested in defending them, but Matt decided to handle the case as Daredevil.{{r|Daredevil Vol 1 #30}} After his senses were disabled due to a chemical created by Mr. Hyde, \"Mike\" showed up at Nelson & Murdock and told Foggy the bad news: Foggy agreed to help \"Mike\" try to catch Mister Hyde and the Cobra by being his eyes and ears.{{r|Daredevil Vol 1 #31}}\n\nWhen he knew that the [[Emissaries of Evil (Electro) (Earth-616)|Emissaries of Evil]] were looking for Daredevil, Matt called Karen at the office to tell her he couldn't come to work, having to attend to a few personal matters. He only returned once all the criminals were captured and turned over to the [[New York City Police Department (Earth-616)|police]].{{r|Daredevil Annual Vol 1 #1}}\n\nKaren and Foggy left the studio for an unexpected vacation with 'Mike' in [[Canada]], to visit the [[Montreal]] Expo '67.{{r|Daredevil Vol 1 #33}}\n\nThe regular workday at Nelson and Murdock was once again interrupted by the unwelcome arrival of the [[Peter Petruski (Earth-616)|Trapster]], who came here seeking legal advice -- by force. The Trapster demanded to know how to get away with murder when the body isn't found, stating that after getting defeated by the [[Fantastic Four (Earth-616)|Fantastic Four]] so many times, he was going to go after 'easier' prey, and kill Daredevil. Not giving him any usable advice, Trapster claimed that he knew how to get rid of Daredevil and left.{{r|Daredevil Vol 1 #35}}\n\nWhile Matt was out of office, Foggy gladly accepted a proposal to run for district attorney, and as he celebrated with Karen, he received a call from [[Deborah Harris (Earth-616)|Debbie Harris]], who got out of prison and wanted to see him again, although he refused, worried to compromise his D.A. career with an ex-convict.{{r|Daredevil Vol 1 #36}} While he was preparing for his date with Debbie Harris, Foggy spotted her talking to Daredevil, who pushed her away: Nelson, unaware that it was really [[Victor von Doom (Earth-616)|Dr. Doom]] inside DD's body, got mad that DD would treat Debbie that way.{{r|Daredevil Vol 1 #38}} Back to work, Matt suggested that Foggy's real problem was that he was afraid of what the public will think of a candidate for the district attorney's position dating a former criminal. Matt then convinced Foggy to setup a double date between them and Karen and Debbie.{{r|Daredevil Vol 1 #39}} When Debbie disappeared, angry at all the inaction to find her, Foggy decided to take matters into his own hands and left the studio to research the [[Unholy Three (Earth-616)|Unholy Three's]] previous employer.{{r|Daredevil Vol 1 #40}}\n\nBack from the [[New York Public Library (Main Branch)|New York Public Library]], he decided to tell all the newspapers the [[Phillip Sterling (Earth-616)|Exterminator's]] identity. Debbie eventually entered the law office and returned to normal right in front of Karen Page.{{r|Daredevil Vol 1 #41}} Finally reunited, Matt, Karen, Foggy and Debbie mourned the loss of Daredevil, believing he was 'Mike Murdock', who supposedly died fighting against the Exterminator.{{r|Daredevil Vol 1 #42}}\n\nKaren Page then announced that she couldn't take working at Nelson and Murdock anymore and decided to leave since she and Matt couldn't reconcile how they felt for each other. Matt had an opportunity to make her stay, but he pushed her away not wanting to risk her life because he's really Daredevil.{{r|Daredevil Vol 1 #43}}\n\nA short time later, Nelson watched a filmed report of a protest demonstration, where Debbie was right out in front with the leaders of the march, and got angry with her for getting involved in a public controversy, worried about the repercussions for his D.A. campaign. Matt tried to reconcile the couple, but promptly left the studio as soon as he watched the [[Jonathan Powers (Earth-616)|Jester's]] televised promise to capture Daredevil.{{r|Daredevil Vol 1 #44}}\nWhile Daredevil was trying to evade the [[New York City Police Department (Earth-616)|police]], Franklin wanted to know Karen's whereabouts from Deborah, who refused to tell him.{{r|Daredevil Vol 1 #45}} Matt finally reappeared, telling Foggy and Deborah that he had been mugged.{{r|Daredevil Vol 1 #46}}\n\nNext, Matt received the visit of [[William Lincoln (Earth-616)|William Lincoln]], an injured [[Vietnam War]] veteran, former [[New York City Police Department (Earth-616)|NYPD]] cop accused of accepting a bribe, who got him as a lawyer to clear his name.{{r|Daredevil Vol 1 #47}}\n\nHaving heard of Stilt-Man's forthcoming attack to attempt Foggy's life, Matt drove everyone else out of the office, including Karen who had just come back for him. At night, as Daredevil, he then battled the villain, who eventually managed to escape, although DD prevented him from bringing harm to Foggy.{{r|Daredevil Vol 1 #48}}\n\nSome time later, Foggy held a Christmas party with Debbie and [[Heather Glenn (Earth-616)|Heather Glenn]], without Matt, who was nowhere to be found.{{r|Daredevil Vol 1 #169}}\n\nWhen the firm was being relocated in the Worldwide Plaza, Matt Murdock stepped in and was comforted by Karen Page for taking the [[Wilson Fisk (Earth-616)|Kingpin]] down, even though the Owl was already trying to take his place.{{r|Daredevil Vol 1 #302}}\nThe day after, Matt and Foggy worked on a case against a [[Long Island City]] man breeding wolf hybrids on rooftops.{{r|Daredevil Vol 1 #303}}\n\nMany years later, Nelson and [[Jeryn Hogarth (Earth-616)|Jeryn Hogarth]] assisted [[Reed Richards (Earth-616)|Reed Richards]] and [[Susan Storm (Earth-616)|Susan Storm]] to sign a contract which would sell the entire [[Pier Four]] to the Gideon Board investment group.{{r|Fantastic Four Vol 3 #35}}\n\nSome time later, [[Spider-Man (Peter Parker)|Peter Parker]] came to the office to meet Matt Murdock, whom he hired to represent [[Felicia Hardy (Earth-616)|Felicia Hardy]], charged with the murder of [[Garrison Klum (Earth-616)|Garrison Klum]]. As soon as he learned she was innocent, they both agreed to break her out of [[Ryker's Island]].{{r|Spider-Man/Black Cat: The Evil That Men Do Vol 1 #4}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = * The firm has sometimes been (mistakenly?) depicted as \"Murdock and Nelson\".{{r|Daredevil Vol 1 48}}\n\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Companies]]\n[[Category:Law Firms]]\n[[Category:Stan Lee/Creator]]\n[[Category:William Blake Everett/Creator]]"
                }
            }
        }
    ],
    "page_id": "779905"
}