{
    "pageid": 999108,
    "ns": 0,
    "title": "New World Order (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = New_World_Order_from_Incredible_Hulk_Vol_1_403.jpg\n| Name                    = New World Order\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Johann Shmidt (Earth-616)|Red Skull]], [[Cain Marko (Earth-616)|Juggernaut]], [[Marvin Flumm (Earth-616)|Mentallo]], [[Piecemeal (NWO) (Earth-616)|Piecemeal]], [[Silvio Manfredi (Earth-616)|Silvermane]], [[Philip Sterns (Earth-616)|Madman]], [[Carl Creel (Earth-616)|Absorbing Man]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Bruce Banner (Earth-616)|Hulk]], [[Avengers (Earth-616)|Avengers]], [[En Sabah Nur (Earth-616)|Apocalypse]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| Alignment               = \n| BaseOfOperations        = Formerly the [[Amazon Jungle]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Peter David; Gary Frank\n| First                   = Incredible Hulk #403\n\n| History                 = The New World Order was an organization that was founded by the [[Johann Shmidt (Earth-616)|Red Skull]] in a yet another plot to take over the entire world. The organization structure of this agency is mostly unknown, although it appears to be founded by supervillains, for the most part.{{r|Incredible Hulk #404}}\n\nInitially, the Red Skull legally purchased a parcel of land in the Amazon Jungle. This purchase upset environmental groups as well as getting the attention of the [[Pantheon (Earth-616)|Patheon]] a secret organization that sought to create world peace. The [[Bruce Banner (Earth-616)|Hulk]] went to investigate the situation on behalf of the organization. Upon his arrival, he was ambushed and taken prisoner by the [[Cain Marko (Earth-616)|Juggernaut]].{{r|Incredible Hulk #402}} While the Red Skull had his scientists create a creature called [[Piecemeal (NWO) (Earth-616)|Piecemeal]] while also getting the mutant known as [[Marvin Flumm (Earth-616)|Mentallo]] to brainwash the Hulk. When the [[Avengers (Earth-616)|Avengers]] eventually arrived, the Hulk was totally under their control.{{r|Incredible Hulk #403}} In the ensuing battle, the Hulk broke free from the Red Skull's mental control and helped the Avengers defeat the Juggernaut. About to exposed, the Red Skull made it appear that a jet carrying other members of the NWO to crash into his fortress, destroying every trace of their organization. However, all the members of the organization survived and met deep below in a secret meeting room. The identities of these members, with the exception of the mobster [[Silvio Manfredi (Earth-616)|Silvermane]], is mostly unknown. In addition to the loss of their fortress, the New World Order also lost Piecemeal.{{r|Incredible Hulk #404}} Their agent, the [[Philip Sterns (Earth-616)|Madman]] recovered Piecemeal and used the creature to terrorize Loch Ness in Scotland. This prompted retired Pantheon agent [[Scott Shannon (Earth-616)|Perseus]] to summon the Hulk to investigate.{{r|Incredible Hulk #407}} The Hulk clashed with the two creatures there, seemingly slaying Piecemeal, but Madman escaped.{{r|Incredible Hulk #408}} The Hulk later stopped Madman from murdering a member of the British Royal Family in London with the help of [[Harley Davis (Earth-616)|Motormouth]] and [[Julius Mullarkey (Earth-616)|Killpower]].<ref>{{cl|Incredible Hulk #409}}: This story states that Madman attempted to assassinate [[Charles Philip Arthur George (Earth-616)|Prince Charles]]. However this should be considered a [[Glossary:Topical Reference|topical reference]] per the [[Glossary:Sliding Timescale|Sliding Timescale]] of [[Earth-616]].</ref>\n\nThe operations of the New World Order are unknown following this. It appears that the Red Skull had long since abandoned the organization. Other members continued to operate under it's original mandate. Some time later, the NWO became concerned about the activities of the mutant known as [[En Sabah Nur (Earth-616)|Apocalypse]]. Particularly when he transformed the Hulk into his new [[Horsemen of Apocalypse (Earth-616)|Horseman]] known as Death. With their agent, the [[Carl Creel (Earth-616)|Absorbing Man]], they enlisted the aid of the Hulk's longtime ally [[Richard Jones (Earth-616)|Rick Jones]] and [[Janis Jones (Earth-9200)|Janice]], Rick's granddaughter in the possible future of [[Earth-9200]]. Unfortunately, they were too late to stop Apocalypse from transforming the Hulk into his agent, prompting the NWO to send the Juggernaut to deal with their foe.{{r|Incredible Hulk #456}} Although the Juggernaut was able to break the Hulk free of Apocalypse's control. Their only mistake was recovering the sword that Apocalypse had given the Hulk as a weapon. As the master planners of the NWO examined it, Apocalypse contacted them through the weapon, telling them that they will be incapable of stopping the cataclysm that was coming. Before they could learn more, Apocalypse made the weapon explode, killing the high ranking members of the organization.{{r|Incredible Hulk #457}}\n\nThe organization has not been seen since, and is presumed to have disbanded.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "999108"
}