{
    "pageid": 827736,
    "ns": 0,
    "title": "New Frightful Four (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Quotation               = I have made an error. One the '''New Frightful Four''' will fix! The perfect monstrous warriors to remind the world that Dracula is not to be trifled with!\n| Speaker                 = [[Vlad Dracula (Earth-616)|Dracula]]\n| Image                   = New Frightful Four (Earth-616) from Deadpool The Gauntlet Infinite Comic Vol 1 8 001.png\n| Name                    = New Frightful Four\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Monster Metropolis]]\n| Leaders                 = formerly [[N'Kantu (Earth-616)|The Living Mummy]]\n| CurrentMembers          = \n| FormerMembers           = [[Frankenstein's Monster (Earth-616)|Frankenstein's Monster]], [[N'Kantu (Earth-616)|The Living Mummy]], [[Xzax (Earth-616)|Xzax]], [[Marcus (Centaur) (Earth-616)|Marcus]]\n| Allies                  = [[Vlad Dracula (Earth-616)|Dracula]], [[Vampires]]\n| Enemies                 = [[Wade Wilson (Earth-616)|Deadpool (Wade Wilson)]]\n\n| Origin                  = [[Vlad Dracula (Earth-616)|Dracula]] hired the four to hunt down [[Wade Wilson (Earth-616)|Deadpool]] and bring him [[Shiklah (Earth-616)|Shiklah]].\n| PlaceOfFormation        = [[Monster Metropolis]]\n| PlaceOfDissolution      = \n| Creators                = Gerry Duggan; Brian Posehn; Reilly Brown\n| First                   = Deadpool: The Gauntlet Infinite Comic Vol 1 8\n| Last                    = \n\n| HistoryText             = After growing impatient while waiting for the delivery of his bride-to-be, [[Vlad Dracula (Earth-616)|Dracula]] hired four mercenaries -- [[Frankenstein's Monster (Earth-616)|Frankenstein's Monster]], [[N'Kantu (Earth-616)|The Living Mummy]], [[Xzax (Earth-616)|Xzax]], and [[Marcus (Centaur) (Earth-616)|Marcus]] -- to form the New Frightful Four and tasked them with hunting down [[Wade Wilson (Earth-616)|Deadpool]] and escorting [[Shiklah (Earth-616)|Shiklah]] to the [[Monster Metropolis]] beneath [[Manhattan]].{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 8}}\n\nWhen Deadpool and Shiklah arrived in [[New York City]], Frankenstein's Monster informed the [[Vampires]], who chased the pair into [[Saint Patrick's Cathedral]]. The New Frightful Four then prepared to enter the church, when suddenly Deadpool burst through the stain-glass window above, as the door the monsters had planned to use exploded due to a C-4 booby trap.{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 9}}\n\nA running battle then ensued and during the fight N'Kantu changed Deadpool's gun into a snake, which he used to strangle Marcus. Marcus then threw Deadpool at Frankenstein's Monster who used a motorcycle to bat him through a nearby storefront, but no matter what they threw at him, Deadpool kept getting back up.{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 10}}\n\nXzax realized that the fight was a diversion allowing Shiklah to escape and so The Living Mummy decided to end the conflict with a spell of instant death that blasted Deadpool into a hot dog stand; however, this only aggravated Wade who promptly set N'Kantu's wrappings ablaze.{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 10}}\n\nJust then the clock struck midnight and Marcus asked Deadpool for a timeout to balance his blood sugar. Not wanting to kill a woozy opponent, Deadpool gave Marcus the time he needed, and as they returned to the fight, Deadpool questioned Marcus about long term effects of his diabetes. The [[Centaurs (Olympus)|centaur]] revealed he does worry about losing his hooves to the disease, before Deadpool then chopped off his legs, knocked him into some nearby wet cement, and finally flattened him with a steamroller.{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 10}}\n\nMarcus' death sent Xzax into a rage, but Deadpool grabbed him by the legs and flung him in front of an oncoming [[New York City Fire Department (Earth-616)|FDNY]] fire truck, splattering him across the grill. Wade then used the truck's fire hose to douse and unravel N'Kantu. While bragging about his victory over the New Frightful Four, Frankenstein's Monster pounced on Deadpool, repeatedly smashing his face into a manhole cover near the [[Empire State Building]], until suddenly a swarm of vampires, monsters, dragons, and [[demons]] burst forth from underground, with half declaring their allegiance to Dracula and the other half backing Shiklah.{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 10}}\n\n[[Eric Brooks (Earth-616)|Blade]] arrived to assist Deadpool against the monstrous horde, while they awaited the intervention of the [[Thunderbolts (Red Hulk) (Earth-616)|Thunderbolts]]. The fight between Deadpool and Frankenstein's Monster took to the skies over the [[Bronx]] as they each mounted dragons. Eventually Deadpool had had enough, and he used the bucket of hot dogs from a [[Bronx Zoo]] vendor over the head, to stun Frankenstein's Monster, knocking him from his dragon and into a habitat full of tigers.{{r|Deadpool: The Gauntlet Infinite Comic Vol 1 11}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Individual members' weapons.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "827736"
}