{
    "pageid": 23530,
    "ns": 0,
    "title": "New X-Men (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = New X-Men (Earth-616) from X-Men Messiah Complex Vol 1 1 0001.jpg\n| Name                    = [[New X-Men]]\n| Aliases                 = Academy X,{{Citation}} X-Men Trainees,{{Citation}} [[Xavier Institute student body]],{{Citation}} [[X-Men Training Squads|X-Men Training Squad]],{{Citation}} \"[[X-Babies]]\",{{r|New X-Men Vol 2 35}} \"X-Progeny\"{{r|New X-Men Vol 2 43}} \n| Distinguish1            = X-Men\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Xavier's School for Gifted Youngsters|Xavier Institute]], [[Salem Center]], [[Westchester County]], [[New York (State)|New York]]\n\n| Leaders                 = [[Noriko Ashida (Earth-616)|Surge]]\n| CurrentMembers          = \n| FormerMembers           = [[Victor Borkowski (Earth-616)|Anole]], [[Sooraya Qadir (Earth-616)|Dust]], [[Joshua Foley (Earth-616)|Elixir]], [[Nezhno Abidemi (Earth-616)|Gentle]], [[Julian Keller (Earth-616)|Hellion]], [[Cessily Kincaid (Earth-616)|Mercury]], [[Megan Gwynn (Earth-616)|Pixie]], [[David Alleyne (Earth-616)|Prodigy]], [[Santo Vaccarro (Earth-616)|Rockslide]], [[Noriko Ashida (Earth-616)|Surge]], [[Laura Kinney (Earth-616)|X-23]]\n| Allies                  =  [[Hisako Ichiki (Earth-616)|Armor]], [[Forge (Earth-616)|Forge]], [[X-Factor Investigations (Earth-616)|X-Factor Investigations]], [[X-Men (Earth-616)|X-Men]]\n| Enemies                 = [[Belasco (Earth-616)|Belasco]], [[Demons]], [[William Stryker (Earth-616)|Rev. William Stryker]], [[Nimrod (Earth-811)|Nimrod]], [[Purifiers (Earth-616)|Purifiers]], [[Matthew Risman (Earth-616)|Matthew Risman]]\n| Origin                  = [[Emma Frost (Earth-616)|Emma Frost]] disbanded all the former [[X-Men Training Squads]], and after a battle royale, she chose a select team of New X-Men (in training)\n| PlaceOfFormation        = [[Xavier's School for Gifted Youngsters|Xavier Institute]], [[Salem Center]], [[Westchester County]], [[New York (State)|New York]]\n| PlaceOfDissolution      = [[Muir Island]], [[Scotland]]\n| Creators                = Craig Kyle; Christopher Yost; Mark Brooks\n| First                   = New X-Men Vol 2 #23\n| Last                    = X-Men Vol 2 #207\n\n| HistoryText             = \n\n===Childhood's End===\nAs a result of [[Decimation|M-Day]], when most of the [[Homo Superior|mutant]] population became depowered, only 27 of the 182 students at the [[Xavier's School for Gifted Youngsters|Xavier Institute for Higher Learning]] still retained their powers. The student reactions to this event varied from horror to glee.{{r|New X-Men Vol 2 #20}}\n\n[[Emma Frost (Earth-616)|Emma Frost]] disbanded all the former training squads and formed a new team of elite '''New X-Men''' trainees. To select the students that would be included in the team, she organized a battle royale in the [[Danger Room]] between the remaining students. However, [[Nezhno Abidemi (Earth-616)|Gentle]], [[Ruth Aldine (Earth-616)|Blindfold]], [[Cassandra Nova Xavier (Earth-616)|Ernst]], and [[Laurie Collins (Earth-616)|Wallflower]] were excluded from the battle, but [[Laura Kinney (Earth-616)|X-23]] (who had just taken up residency at the X-Mansion) was included. [[Stepford Cuckoos (Earth-616)|The Three-In-One]] opted out, and [[Kevin Ford (Earth-616)|Wither]] and [[Joshua Guthrie (Earth-616)|Icarus]] were missing at the time of the rumble.{{r|New X-Men Vol 2 #23}}\n\nWhen the dust settle after the battle, Emma Frost decide the New X-Men team would consist of [[Sooraya Qadir (Earth-616)|Dust]], [[Joshua Foley (Earth-616)|Elixir]], [[Julian Keller (Earth-616)|Hellion]], [[Cessily Kincaid (Earth-616)|Mercury]], [[David Alleyne (Earth-616)|Prodigy]], [[Santo Vaccarro (Earth-616)|Rockslide]], and X-23, and be led by [[Noriko Ashida (Earth-616)|Surge]].{{r|New X-Men Vol 2 #23}}\n\nDuring this time, [[William Stryker (Earth-616)|Rev. William Stryker]] approached a conflicted Icarus. Claiming the M-Day was a miracle from God, Stryker was able to convince Jay to have his wings amputated. Stryker was trying to find trances off [[En Sabah Nur (Earth-616)|Apocalypse]]'s Technorganic strain, and knowing it was in a winged mutant he targeted Icarus. After the surgery Icarus was left bleeding on the steps of the X-Mansion.{{r|New X-Men Vol 2 #20|23}} (However, the mutant whom Stryker was actually looking for was [[Warren Worthington III (Earth-616)|Angel]]).{{r|X-Force Vol 3 #4|6}}\n\nDays passed by until it was decided that all the human students and staff would be expelled. Before this official expulsion, 111 students voluntarily left the school (including [[Sofia Mantega (Earth-616)|Wind Dancer]], Wither, and [[Melody Guthrie (Earth-616)|Aero]]). For their safety, the former mutant students was secreted out of the X-Mansion under the cover of darkness and through the abandoned [[Alley|Morlock Tunnels]] to an awaiting bus on the grounds of the Institute. Unfortunately, Stryker discovered the [[X-Men (Earth-616)|X-Men]]'s plan and launched a missile to blow up the bus, killing 42 students on board (including [[Brian Cruz (Earth-616)|Tag]], [[Mark Sheppard (Earth-616)|DJ]], [[Andrea Margulies (Earth-616)|Rubbermaid]], [[Callie Betto (Earth-616)|Dryad]], [[Dallas Gibson (Earth-616)|Spector]], and [[Sarah Vale (Earth-616)|Network]]).{{r|New X-Men Vol 2 #23|24}}\n\n===Crusades===\nSoon after the attack, the X-Men held a memorial service and funerals (specially for fifteen students whose families refused to accept them even in death). [[David Alleyne (Earth-616)|Prodigy]], who also lost his powers, wasn't killed in the attack and Cyclops fearing another attack, he was asked and allowed to stay at the Mansion.{{r|New X-Men Vol 2 #26}} After a poorly executed training session with [[Piotr Rasputin (Earth-616)|Colossus]], Wallflower confronted Elixir about his anger issues and was shot in the back off the head by [[Matthew Risman (Earth-616)|Matthew Risman]], the [[Purifiers (Earth-616)|Purifier]] sniper. Meanwhile, Jay bide Sooraya farewell and left to confront Stryker, only to be confronted by Stryker's true plan and [[Nimrod (Earth-811)|Nimrod]].{{r|New X-Men Vol 2 #25}} Dust attempted to follow Icarus, but X-23, who suspected a trapped. X-23 dressed is Dust's in abaya and, after being shot and healing, ambushed the Purifiers. Believing that Dust, his final obstacle, to be dead, Stryker launched his assault on the Xavier's Institute.{{r|New X-Men Vol 2 #26}} The Purifiers were able to subdue [[198 (Earth-616)|The 198]], cripple the [[Sentinel Squad O*N*E (Earth-616)|Sentinel Squad O*N*E]], enter the X-Mansion, injure Emma Frost, Beast, [[Lucas Bishop (Earth-1191)|Bishop]], [[Samuel Guthrie (Earth-616)|Cannonball]], most of the New X-Men, and murder [[Maxwell Jordan (Earth-616)|Quill]]. The battle ended with Dust recovering in time to attack, X-23 returning from Stryker's church and Elixir killing Stryker. Elixir was left with metallic black skin and in a catatonic state due to the strain of his powers.{{r|New X-Men Vol 2 #27}}\n\n===Nimrod===\nSoon after the attack, the X-Men were visited by [[Carol Danvers (Earth-616)|Ms. Marvel]] who told them that Icarus was found dead with the letters \"NIMRC\" written in his own blood next to him.{{r|New X-Men Vol 2 #28}} David figured out that it was Nimrod. They then received a distress call from [[Forge (Earth-616)|Forge]]. Because Forge was unsatisfied with the protection offered by the Sentinel Squad O*N*E, Forge had worked on a new \"[[Sentinel X (Earth-616)|Sentinel X]]\" to protect mutantkind.{{r|New X-Men Vol 2 #26}} Nimrod, being badly damaged, blackmailed Forge for repairs with threats of killing [[Ororo Munroe (Earth-616)|Storm]]. With the X-Men away on a mission, the New X-Men were the only ones available to hear and respond to Forge's distress signal.{{r|New X-Men Vol 2 #29}} Narrowly sneaking passed the Sentinel Squad, they \"borrowed\" a [[X-Men Blackbird|Blackbird]] and headed off to [[Eagle Plaza]] in [[Dallas]], [[Texas (State)|Texas]]. After being shot down by Nimrod, the New X-Men engaged him in battle.{{r|New X-Men Vol 2 #30}} They were unable to defeat Nimrod until David and Forge figured out away to stop him by overflowing his power core. Surge, Mercury and X-23 (briefly designated ''\"Talon\"'') accomplished this and managed to send Nimrod back in time. However, in the ensuing fight The lower level of Eagle Plaza was blown up, Rockslide's body was destroyed and X-23 was almost killed. Hellion was able to reform Rockslide's body, but because his original body was destroyed his new body was reformed out of larger more rugged appearance. Because X-23 was severely injured, Hellion used his telekinesis to fly them back to Elixir in the X-Mansion. To get her there in time to save her, Hellion telepathically asked Emma Frost to push his powers to their fullest. This caused him to increase his flight speed to above Mach-5 and even allowed him to destroy a Sentinel by flying through it. Hellion then forced Elixir to snap out of his catatonia to heal X-23 and then collapsed to the floor.{{r|New X-Men Vol 2 #31}}\n\nIn the following days, Hellion slept copiously recovering from his exertion. Mercury received a call from Wither, who had been living in [[Mutant Town]], and she disclosed the truth about Laurie's death. Wither then fell into a depressive state which was exploited by [[Selene Gallio (Earth-616)|Selene]], who had been posing as an old woman and living with Wither. Selene seduced him and convinced him to use his power for its true purpose: killing.{{r|New X-Men Vol 2 #32}}{{r|X-Necrosha: The Gathering #1}} Back at the X-Mansion, David decided to stay at the mansion after Cyclops praised him and Surge on the defeat of Nimrod. Later a memorial was held to honor all the X-Men and students who perished specifically those killed in the bombed bus, Wallflower, Icarus and Quill.{{r|New X-Men Vol 2 #32}}\n\n===Mercury Falling===\nHellion was no longer in control of his powers after they were \"unlocked\" and even the smallest use caused a major effect. Elixir told [[Henry McCoy (Earth-616)|Beast]] about his desire to learn about the human body in order to gain greater control over his abilities. Mercury became angry when she discovered that Emma had been tormenting X-23 and took Laura off the grounds where X-23 revealed that she knew that Mercury no longer needed food for sustenance. Mercury found out that Laura was interested in Hellion. They were interrupted when an assassin named [[Kimura (Earth-616)|Kimura]] attacked them and blew up the coffee house that they were meeting in. Mercury was taken hostage and tortured by scientists who wanted to find a way to use her living mercury body as skin for [[Predator X]]. [[Maximus Jensen (Earth-616)|Mammomax]] was killed by the creature. Hellion helped X-23 track down Mercury. They investigated several places and Hellion told X-23 that he disapproved of her use of lethal force and ordered her not to kill again. Finally they visited the [[Leland Owlsley (Earth-616)|Owl]] who, after some persuasion, gave them Mercury's location. Just as X-23 and Hellion arrived it was revealed that the experiments were successful and a new skin for Predator X had been created. The duo was attacked by beasts wearing Mercury's skin and seemed to be overwhelmed. Then, the New X-Men and Emma Frost arrived and rescued them. Mercury was restored to her prior form but said that she could sense that one more beast was still in existence.{{r|New X-Men Vol 2 #33|36}}\n\nBling turned down Surge and Prodigy's attempts to recruit her because she thought it was too dangerous. She and [[Sidney Green (Earth-616)|Onyxx]] left the mansion because they felt unsafe. The New X-Men, alongside Emma Frost, located them using [[Cerebra (Mutant Detector)|Cerebra]] but lost contact just within range of the facility.{{r|New X-Men Vol 2 #36}}\n\nKimura later attacked X-23 but Emma caught and tortured her by removing her memories of her loving grandmother. She then ordered her to take out X-23's other torturers and Kimura was forced to agree.{{r|New X-Men Vol 2 #36}}\n\n===Quest for Magik===\nShortly before the other students were teleported to [[Limbo (Demonic)|Limbo]], the [[Stepford Cuckoos (Earth-616)|Stepford Cuckoos]] helped Elixir learn advanced human anatomy, physiology and biology by telepathically copying information from Beast's mind into his own. This allowed him to use his power with exponentially greater precision, allowing him to regrow Prodigy's heart from nothing after it was torn out by [[Belasco (Earth-616)|Belasco]]. This proved a severe strain to Elixir however and he fell unconscious for a few moments. Later he regained consciousness and was able to use his \"black abilities\" to attack Belasco, however the demonic master of Limbo proved more resilient than humans and quickly recovered from the attack before being killed by [[Illyana Rasputina (Earth-616)|Magik]].\n\nWhen Mercury asked Elixir about his age, he was sitting alone in the dark and told her instead about his cells and how he felt them aging and dying freaking her out. When Surge interviewed him about what happened to David in Limbo, he told her nothing happened. Still later when [[Katherine Pryde (Earth-616)|Kitty Pryde]] tried to have a student/teacher conference, he was still sitting alone in the dark. When she asked him what he is doing, he told her he was thinking about life and death and how he could give it and take it. “With everything my powers can do...Really Miss Pryde...What can’t I do?” This scared Kitty greatly who suggested to the other teachers that, without proper guidance, they may be raising the next [[Max Eisenhardt (Earth-616)|Magneto]] in Josh.\n\nWhile Blindfold told [[Belasco (Earth-616)|Belasco]] and [[Illyana Rasputina (Earth-616)|Illyana Rasputin]]'s story, they were suddenly transported into Limbo. Hellion and Surge were not inside the room with the others and so were not taken. Mercury, Dust, David, X-23, Elixir, and other students were immediately captured and questioned by Belasco about the whereabouts of Rasputin.\n\nAnother group of students including Rockslide, [[Alani Ryan (Earth-616)|Loa]], [[Victor Borkowski (Earth-616)|Anole]], [[Ben Hammil (Earth-616)|Match]], [[Megan Gwynn (Earth-616)|Pixie]], Blindfold, [[Nezhno Abidemi (Earth-616)|Gentle]], [[Nicholas Gleason (Earth-616)|Wolf Club]], and [[Hope Abbott (Earth-616)|Trance]] tried to figure out what had happened. They were attacked by a group of monsters reporting to Belasco. Anole was seriously injured, losing an arm, and Rockslide seemingly exploded while trying to defend Blindfold.\n\nBelasco questioned David who said he didn't know where Illyana was repeatedly, but Belasco refused to believe him. David finally said that she was dead and Belasco ripped out his heart in retaliation. Belasco fell to the floor in sadness. Meanwhile, Illyana revealed herself to the other group of students. After David's death, X-23 broke out and attacked Belasco. Elixir also broke free and ran to David's lifeless body to try to heal him. David's heart was able to grow back and he came back to life but the effort required exhausted Elixir and he collapsed. X-23 continued to fight Belasco but he seemingly to killed her. This made Mercury and Dust to break free and also attack Belasco. Meanwhile, Illyana explained that she was able to defeat Belasco but she would need a [[Soulsword]] because she had lost hers.\n\nBack on Earth, Surge and Hellion were trying to figure out what was going on alongside [[Office of National Emergency (Earth-616)|O*N*E]]. They were informed that [[Jimaine Szardos (Earth-616)|Amanda Sefton]] had been admitted to a German hospital and was currently comatose. [[Valerie Cooper (Earth-616)|Valerie Cooper]] explained that as far as the X-Men knew, she was currently the ruler of Limbo. Hellion and Surge demanded that they had to be the ones get information from her. Back in Limbo, Illyana told her pet to take Pixie. The other students tried to save her but failed, and Illyana asked her for her soul. Pixie said no but Illyana told her she could feel Belasco was killing her friends. Pixie finally accepted her deal and Illyana started the process of taking her soul. Hellion and Surge revived Sefton from her coma and demanded that she take them to Limbo. Back in Limbo, Pixie was still getting her soul sucked out when Anole attacked Illyana using a new gargantuan hand to make her stop. Rockslide, fueled by lava, suddenly broke through the ground and started fighting the evil Magik. He was pulled out of his rage by Anole and it seemed that Rockslide had been able to temporarily beat the evil out of Magik. She decided to help them beat Belasco. At the foot of Belasco's throne, Mercury and Dust put up a good fight until Elixir recovered enough to use his death touch on the demon. This did not prove entirely effective as it only took a moment of Belasco to recover.\n\nMeanwhile, Surge, Hellion, and Amanda Sefton prepared to break into Limbo. Hellion asked Surge if she was okay as she had been greatly affected by David's \"death\" and she said, \"ask me again once I've turned Belasco into a smoking black pile of ash.\" Illyana told the \"New X-Men B-squad\" that Pixie, who now had a \"soul dagger\" because only part of her soul was removed, was pivotal to reaching Belasco and that she would teach her a teleportation spell to get to him. Belasco demonstrated his power by bringing X-23 back to life for a moment then immediately killed her again. He said the same fate awaited the rest unless someone told him where Magik was. Surge and the other, alongside former mutant [[Alexander Lexington (Earth-616)|Lexington]] of the [[Sentinel Squad O*N*E (Earth-616)|Sentinel Squad]], finally broke into Limbo and were immediately attacked by thousands of small demons. The team battled Belasco and learned that he wanted because he loved her, not for power or revenge. He had previously attempted to resurrect her [[Earth-58163|House of M]] version, but she had come back soulless and so he banished her. After they had defeated Belasco, Illyana attempted to steal the rest of Pixie's soul, but she ended up sending all of the X-Men and various students home after memories of her past self came to her. She took the throne of Limbo as her own and vowed to try to get her soul back. Upon returning to the Institute, Anole and Pixie were inducted into the New X-Men squad on recommendation of Rockslide.{{r|New X-Men Vol 2 #37|41}}\n\n===World War Hulk===\nSurge, Hellion, Rockslide, Mercury, Dust, Elixir and X-23 were training with Beast when [[Bruce Banner (Earth-616)|Hulk]] attacked the [[Xavier's School for Gifted Youngsters|X-Mansion]]. They battled him and were all defeated. The Stepford Cuckoos, Prodigy, Pixie and other students looked down upon the X-Mansion watching the fight progress. When the team was defeated, the Stepford Cuckoos sent a telepathic call for help to the other X-Men, [[X-Factor (Earth-616)|X-Factor]] and [[Excalibur (Earth-616)|Excalibur]]. Even after help arrived, though, the Hulk remained unbeaten. It ultimately took Mercury, who battled the Hulk into the graves of the mutants that died on M-Day and told him what happened to them. The Hulk saw the graves and remembered the people on [[Sakaar]] who died when his ship exploded and declared that Xavier had suffered enough and left in peace.{{r|World War Hulk: X-Men Vol 1 1|3}}\n\n===Children of X-Men===\nWith the Xavier Institute returned back to Earth and the students freed from Limbo, the senior X-Men attempted to consult with their young charges over the events of the past several arcs, but were rebuffed by the cynical students, who felt that the X-Men could not protect them anymore. With Rockslide's permission, Beast, Colossus and Anole ran some tests on the stony mutant and determined that he was actually a psionic entity that draws from the earth in order to create and reform his golem-like body. At the end of this experiment, Rockslide returned to a form similar to that he generated after the battle with Nimrod. Meanwhile, the rest of the team continued to battle their own personal issues. Elixir became hauntingly introspective, overwhelmed by the potential of his Omega-level powers, while Hellion still faced major issues controlling his telekinesis. Through the efforts of Mercury, Indra was determined to be the youngest student at the Institute, leading him to fear that he would be a priority target for the Purifiers. Immediately after, Surge passionately kissed Hellion, much to Prodigy's horror and X-23's envy.{{r|New X-Men Vol 2 42|43}}\n\n===[[Messiah Complex]]===\nAfter the first [[Hope Summers (Earth-616)|mutant birth]] since [[Decimation|M-Day]], some of the New X-Men decided to launched a preemptive strike against the [[Purifiers (Earth-616)|Purifiers]]. Elixir sat out the fight for fear that he may lose control and massacre the Purifiers in retaliation for Laurie's murder. He did however offer his help as a healer if the students needed him. When the [[Sentinels]] attacked the mansion, Elixir and some of the students left behind were knocked unconscious.{{r|Messiah Complex}}{{r|New X-Men Vol 2 44|46}}\n\n==M-Day \"survivors\"==\nAfter M-Day, the mutant student body in the academy dropped from 182 to 27. The following are the students that have been confirmed to have retained their powers, with notes as to those who died or left the academy after the event as well:\n\n===[[Alpha Squadron (Earth-616)|Alpha Squadron]] (3)===\n* [[Victor Borkowski (Earth-616)|Victor Borkowski (Anole)]]\n* [[Paras Gavaskar (Earth-616)|Paras Gavaskar (Indra)]]\n* [[Alani Ryan (Earth-616)|Alani Ryan (Loa)]]\n\n===[[Chevaliers (Earth-616)|Chevaliers Squad]] (2)===\n* [[Roxanne Washington (Earth-616)|Roxy Washington (Bling!)]]\n* [[Sidney Green (Earth-616)|Sidney Green (Onyxx)]] {{g|Post M-Day Death}}\n\n===[[Corsairs Squad (Earth-616)|Corsairs Squad]] (4)===\n* [[Celeste Cuckoo (Earth-616)|Celeste Cuckoo (The Three-In-One)]]\n* [[Irma Cuckoo (Earth-616)|Mindee Cuckoo (The Three-In-One)]]\n* [[Phoebe Cuckoo (Earth-616)|Phoebe Cuckoo (The Three-In-One)]]\n* [[Maxwell Jordan (Earth-616)|Maxwell Jordan (Quill)]] {{g|Post M-Day Death}}\n\n===[[Hellions Squad (Earth-616)|Hellions Squad]] (5)===\n* [[Julian Keller (Earth-616)|Julian Keller (Hellion)]]\n* [[Sooraya Qadir (Earth-616)|Sooraya Qadir (Dust)]]\n* [[Cessily Kincaid (Earth-616)|Cessily Kincaid (Mercury)]]\n* [[Santo Vaccarro (Earth-616)|Santo Vaccarro (Rockslide)]]\n* [[Kevin Ford (Earth-616)|Kevin Ford (Wither)]] {{g|Post M-Day Death}}\n\n===[[New Mutants Squad (Earth-616)|New Mutants Squad]] (4)===\n* [[Joshua Foley (Earth-616)|Josh Foley (Elixir)]]\n* [[Noriko Ashida (Earth-616)|Nori Ashida (Surge)]]\n* [[Joshua Guthrie (Earth-616)|Jay Guthrie (Icarus)]] {{g|Post M-Day Death}}\n* [[Laurie Collins (Earth-616)|Laurie Collins (Wallflower)]] {{g|Post M-Day Death}}\n\n===[[Paladins (Earth-616)|Paladins Squad]] (2)===\n* [[Hisako Ichiki (Earth-616)|Hisako Ichiki (Armor)]]\n* [[Ruth Aldine (Earth-616)|Ruth Aldine (Blindfold)]]\n\n===[[Paragons Squad (Earth-616)|Paragons Squad]] (4)===\n* [[Ben Hammil (Earth-616)|Ben Hammil (Match)]]\n* [[Nicholas Gleason (Earth-616)|Nick Gleason (Wolf Cub)]] {{g|Post M-Day Death}}\n* [[Megan Gwynn (Earth-616)|Megan Gwynn (Pixie)]]\n* [[Hope Abbott (Earth-616)|Hope Abbott (Trance)]]\n\n===[[Storm's Squad (Earth-616)|Storm's Squad]] (1)===\n* [[Nezhno Abidemi (Earth-616)|Nezhno Abidemi (Gentle)]]\n\n===Other Students (3)===\n* [[Cassandra Nova Xavier (Earth-616)|Ernst]]\n* [[Martha Johansson (Earth-616)|Martha Johansson (No-Girl)]]\n* [[Laura Kinney (Earth-616)|Laura Kinney (X-23)]]\n\n| Equipment               = [[Power Gauntlets|Surge's Power Gauntlets mark]]\n| Transportation          = [[X-Men Blackbird]]\n| Weapons                 = Each teammate's arsenal\n\n| Notes                   = \n*Although [[Quintavius Quire (Earth-616)|Quentin Quire (Kid Omega)]] was no longer a student at the Xavier Institute (as he had evolved to a higher state of being), he retained his powers and was being held in a containment unit at the school.\n*Most of the students who retained their powers were confirmed in {{cl|New X-Men #21}} and in {{cl|X-Men: The 198 Files Vol 1 1}}. \n**Indra and Quill were confirmed in {{cl|Decimation: House of M - The Day After Vol 1 1}}.\n**Bling! was confirmed in {{cl|X-Men Vol 2 #177}}\n**Wallflower was killed by Reverend Stryker in {{cl|New X-Men Vol 2 #26}}. \n**Quill was killed by one of Stryker's henchmen in {{cl|New X-Men Vol 2 #27}}. \n**Icarus was shot by Stryker and died in {{cl|New X-Men Vol 2 #27}}. \n**Tito Bohusk, one of the children of former Xavier students Beak and Angel has also been stated to have retained his mutant powers. \n**The Morlock and former [[Generation X (Earth-616)|Generation X]] member Leech also resided on the mansion property for a short time, and though a child, was not considered a student, but a member of the refugee 198 (who have since departed from the grounds).\n| Trivia                  = \n| Links                   = \n}}\n[[Category:X-Men]]"
                }
            }
        }
    ],
    "page_id": "23530"
}