{
    "pageid": 242672,
    "ns": 0,
    "title": "Nightriders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = \n| Name                    = Nightriders\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = outside Wonderment, Montana\n\n| Leaders                 = [[Richard Cassidy (Earth-616)|Kid Cassidy]], [[Clay Riley (Earth-616)|Clay Riley]] (employer)\n| CurrentMembers          = \n| FormerMembers           = Unnamed members\n| Allies                  = [[Marcel Fournier (Earth-616)|Marcel Fournier]] \n| Enemies                 = [[Reno Jones (Earth-616)|Reno Jones]], [[Caleb Hammer (Earth-616)| Caleb Hammer]], [[Gunhawk (Earth-616)| Gunhawk]], [[Kid Colt]], [[Outlaw Kid]], [[Rawhide Kid]], [[Red Wolf]], [[Two-Gun Kid]] \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = Wonderment, Montana\n| Creators                = \n| First                   = Blaze of Glory #1\n| Last                    = Blaze of Glory #4\n\n| HistoryText             = The town of Wonderment was built near a valley with a river, and near mountains rich with copper ore. [[Clay Riley (Earth-616)|Clay Riley]] sought to build a smelting factory for this ore, only the rightful owners stood in his way of acquiring this land. Wonderment had been settled by a group of Exodusters (African-Americans who had left the south and headed for lands in Kansas and the territories). Riley decided to obtain the property anyway, and mimicked the motif of the original Night Riders, hoping to draw on the fear from that group to drive out the former slaves and other poor blacks in the town.{{Citation}}\n\nThe Nightriders assaulted Wonderment, using hit and run raids to terrorize the townspeople. One of the residents of Wonderment, [[Reno Jones (Earth-616)|Reno Jones]], allied himself with [[Marcel Fournier (Earth-616)|Marcel Fournier]] to seek aid from some of the legendary cowboy heroes of the era. Flaming Star recruited [[Red Wolf]] to join the effort. After recruiting a number of heroes, the group returned to Wonderment, but walked right into an ambush by the Nightriders, as Fournier turned out to actually be a traitor to the heroes and was working for Riley. The heroes were pinned down in the valley, but Red Wolf appeared and picked off their attackers.{{Citation}}\n\nWhen the Nightriders rode back into Wonderment, the heroes drove them off. Meanwhile, a pair of bounty hunters, [[Gunhawk (Earth-616)|Gunhawk]] and [[Caleb Hammer (Earth-616)|Caleb Hammer]], was trailing [[Kid Colt]], who was one of the heroes defending Wonderment, hoping to bring him in for his crimes. The Nightriders captured the two bounty hunters and prepared to make them face off against each other, but a new [[Reno Jones (Earth-616)|Phantom Rider]] showed up to stop this, driving off the Nightriders in the process. The two bounty hunters traveled to Wonderment and joined the fight against the Nightriders.\nAfter learning that the Phantom Rider was involved Riley devoted all of his resources into taking the town, and finally winning against \"that spook.\" Red Wolf rallied a number of Native Americans from the local tribes, and they, too, joined the fight against the Nightriders. Riley's forces rode into battle against the Western heroes. The Nightriders (and Riley) were eventually slain, but not without heavy casualties. Among many others, the [[Outlaw Kid]] and the [[Two-Gun Kid]] fell in battle. The leader of the Nightriders turned out to be none other than [[Richard Cassidy (Earth-616)|Kid Cassidy]], the former partner of Reno Jones, when they were known as the [[The Gunhawks (Earth-616)|Gunhawks]]. Reno had gunned the Kid down years ago when he drew on him, and believed him to be dead. Both men recognized the other before Reno killed Cassidy.{{Citation}}\n\n| Equipment               = \n| Transportation          = Horses\n| Weapons                 = Pistols and rifles\n\n| Notes                   = \n| Trivia                  = \n| Links                   = http://www.marvunapp.com/Appendix/nightr.htm\n}}\n[[Category:Western Teams]]\n[[Category:Western Characters]]"
                }
            }
        }
    ],
    "page_id": "242672"
}