{
    "pageid": 978554,
    "ns": 0,
    "title": "Operation Paperclip (Earth-199999)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Operation_Paperclip_(Earth-199999)_from_Captain_America_The_Winter_Soldier_001.jpg\n| Name                    = Operation Paperclip\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Disbanded\n| Alignment               = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n| TeamLeaders             = \n| CurrentMembers          = \n| FormerMembers           = [[Arnim Zola (Earth-199999)|Dr. Arnim Zola]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Captain America: The Winter Soldier\n\n| History                 = \n===Overview===\n'''Operation Paperclip''' was the [[SSR]] program in which [[National Socialist German Workers Party (Earth-199999)|Nazi]] and [[Hydra (Earth-199999)|Hydra]] scientists, engineers and technicians, were brought to the [[United States of America]] from [[Germany]] and pardoned as long as they worked on behalf of the government. They did this to stop the [[Soviet Union]] from getting hold of the potential technology during the beginnings of the [[Cold War (Event)|Cold War]].{{r|Captain America: The Winter Soldier}}\n\n===Events===\nThe following year, still held captive after Rogers' final mission, Zola became cellmates with [[Doctor Ivchenko (Earth-199999)|Doctor Johann Fennhoff]]. He approached him expressing interest in his work on psychological manipulation and asked for insight on a possible project.{{r|Marvel's Agent Carter Season 1 8}}\n\nZola was later recruited to work for [[Strategic Homeland Intervention Enforcement Logistics Division (Earth-199999)|S.H.I.E.L.D.]] as part of Project Paperclip, only to use his position to plant seeds of Hydra within the organization. \n\nWhen he was diagnosed with a terminal illness in 1972, he transferred his consciousness into over two hundred 1970s-era computers located in a secret bunker at [[Camp Lehigh]], the same facility where Rogers had undergone military training. He also designed the 'Zola algorithm' used by Hydra in S.H.I.E.L.D.'s \"Project Insight,\" which was designed to identify and target potential threats to Hydra's interests.\n\nHe was eventually tracked down by the revived Rogers and his new associate [[Natalia Romanoff (Earth-199999)|Natasha Romanoff]], and began relating to them much of what Hydra had done in the years following World War II, as well as his own personal involvement. This was nothing more than a stalling tactic, and the deception was revealed as soon as Romanoff was alerted to an incoming missile targeted upon the base. Zola slammed the doors shut on the pair,  but his attempt to have Captain America and Black Widow entombed with him failed. The missile ravaged the equipment that sustained his mind while his visitors hid from the blast in a service duct in the floor.{{r|Captain America: The Winter Soldier}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "978554"
}