{
    "pageid": 978555,
    "ns": 0,
    "title": "Operation Paperclip (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Operation Paperclip\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Disbanded\n| Alignment               = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n| TeamLeaders             = \n| CurrentMembers          = \n| FormerMembers           = [[Klaus Kruptmann (Earth-616)|Klaus Kruptmann]], [[Agent Axis (Earth-616)|Agent Axis]]\n| Allies                  = [[Central Intelligence Agency (Earth-616)|CIA]], [[ICON (1950s) (Earth-616)|ICON]]\n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = All This and World War II\n\n\n| History                 = \n===Overview===\n'''Operation Paperclip''' was the OSS program in which [[National Socialist German Workers Party (Earth-616)|Nazi]] scientists, engineers and technicians, were brought to the [[United States of America]] from [[Germany]] and pardoned as long as they worked on behalf of the government. They did this to stop the [[Soviet Union]] from getting hold of the potential technology during the beginnings of the [[Cold War (Event)|Cold War]].{{r|All This and World War II}}\n===Origin===\nIn 1945, [[Klaus Kruptmann (Earth-616)|Dr. Klaus Kruptmann]] was one of the scientist recruited. He began working in secret projects for the US although he still retained his former Nazi loyalties. He longed to restore the glory of the Third Reich, and contributed with Nazi-backed South American crime unions.{{r|All This and World War II}}\n\n[[Wernher von Braun (Earth-616)|Dr. Wernher von Braun]] was an aerospace engineer and space architect credited with inventing the V-2 rocket for Nazi Germany and the Saturn V for the [[United States]]. [[Robert Grayson (Earth-616)|Marvel Boy (Bob Grayson)]] attempted to talk to Dr. von Braun about rocketry but was blocked by his superiors.{{r|Agents of Atlas Vol 2 2}}\n\n===ICON===\nIn the 1950's [[ICON (1950s) (Earth-616)|ICON]] was formed an organization formed by Undersecretary [[Geoffrey Sydenham (Earth-616)|Geoffrey Sydenham]] and Senator Sanford to recruit former [[National Socialist German Workers Party (Earth-616)|Nazis]] and use them against the communists. The team came into conflict with that era's [[Avengers (1950s) (Earth-616)|Avengers]], after unsuccessfully attempting to assassinate their ranks. When the conspiracy was discovered the organization was disbanded, but none of the members were imprisoned because the American government didn't want to admit that the group had any connection to them.{{r|Avengers 1959 Vol 1 #1|5}}\n\n===1980's===\nIn 1989, Dr.  Kruptmann was working in a \"chronal displacement\" project for the federal government, under the orders of former Allied officer [[Nick Fury]]. Fury appreciated and trusted Kruptmann because he was one of the few living people he knew who remembered the war. The scientist in the next lab was Dr. [[Jack Cooper (Earth-616)|Jack Cooper]], who was working on the [[Cavalier]] Infantry Support System, a hulking tank-like robot. Kruptmann noticed that the 1989 unit of the Blautot Commandos would appear near [[San Diego]]. Kruptmann greets the commandos and offered his home as HQ. He also provided them with access to the secret facility in [[Albuquerque]] he was working in with a microscanner, and information about the Cavalier project. Kruptmann did not know that Fury had called some super-heroes to test the Cavalier. The Blautot Commandos tried to get hold of the robot but were defeated by the heroes. Although the Commandos were trained for questioning and did not reveal Kruptmann's name, Kruptmann was nevertheless discovered because of the missing microscanner. He panicked and tried to attack the heroes with an experimental laser rifle, but was defeated and captured. Base security guards took him to jail.{{r|All This and World War II}}\n\n===Modern Era===\nAnother member was [[Agent Axis (Earth-616)|Agent Axis]] who was confronted by [[Bruce Dickson (Earth-616)|Thin Man]] and [[Steven Rogers (Earth-616)|Captain America]], who had teamed up to bring him to justice for the crimes he committed in World War II. Going by the name Schmidt, the two heroes tracked him to [[Queens]] where, after opening the door, he was immediately fired upon by the Thin Man, but dodged the bullet. He then revealed to the two heroes that the [[Central Intelligence Agency (Earth-616)|CIA]] knew he was there, and knew everything he had done, yet they had chosen not to arrest him. Infuriated, Thin Man leaped for the elderly man, with Captain America trying to prevent the Thin Man from killing him. After a quick struggle, Thin Man got behind Captain America and wrapped himself around Axis, then squeezed, breaking his back and killing him.{{r|Marvel Comics Presents #34}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:American Organizations]]\n[[Category:Historical Organizations]]"
                }
            }
        }
    ],
    "page_id": "978555"
}