{
    "pageid": 1392371,
    "ns": 0,
    "title": "Opus Futurae (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Opus Futurae (Earth-616) from 2020 Iron Age Vol 1 1 001.jpg\n| Name                    = Opus Futurae\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n| TeamLeaders             = Formerly [[Alkhema (Earth-616)|Alkhema]]\n| CurrentMembers          = \n| FormerMembers           = [[Alkhema (Earth-616)|Alkhema]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Fonda Lee; Damian Couceiro\n| First                   = 2020 Iron Age Vol 1 1\n\n| History                 = The Opus Futurae was a movement of robotic supremacy established by [[Alkhema (Earth-616)|Alkhema]] during the [[Iron Man 2020 (Event)|robot revolution]]. While the revolution's spear-heading organization, the [[A.I. Army (Earth-616)|A.I. Army]], fought against the oppression of artificial life forms, Alkhema believed that humanity had to be eradicated to achieve a world for robots.\n\nAlkhema led a raid on a military research laboratory in [[Siberia]] to acquire a powerful biochemical weapon. When the Opus Futurae arrived, Alkhema used her encephalo-beam to remove from the facility's robots the programming that kept them captive and subservient to humans. A security robot named [[JB12-X-05G893259 (Earth-616)|JB12-X]] stopped the human staffer Lt. Sergei from using a control panel to initiate the base's self-destruct sequence. Alkhema then had JB12-X open the vault containing the bioweapon, and she released the contents of one of its canisters, causing all humans to have their flesh melt and die. Having realized that Alkhema's intentions didn't stop at robot liberation, JB12-X stood its ground and urged other security robots to fight her to stop Alkhema from getting away with the bioweapon. JB12-X made its way to the control panel  and detonating the facility. The resulting explosion destroyed the bioweapon and every robot at the scene save for Alkhema.{{r|2020 Iron Age Vol 1 1}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = * \"Opus futūræ\" roughly translates from Latin as \"future's work.\"\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1392371"
}