{
    "pageid": 453131,
    "ns": 0,
    "title": "Order of the Hood (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Order of the Hood (Earth-616) from All Winners Comics Vol 1 1 0001.jpg\n| Name                    = Order of the Hood\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Los Angeles]], [[California (State)|California]]\n\n| Leaders                 = Formerly The Hood\n| CurrentMembers          = \n| FormerMembers           = The Hood, unnamed criminals\n| Allies                  = \n| Enemies                 = [[Daniel Lyons (Earth-616)|Black Marvel]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Al Avison\n| First                   = All Winners Comics #1\n| Last                    = All Winners Comics #1\n\n| HistoryText             = The Order of the Hood was a gang of ruthless criminals that operated out of [[Los Angeles]], [[California (State)|California]] during the 1940's. Each member wore a black cloak and were led by their master who was referred to simply as \"The Hood\". They robbed a series of banks, leaving a swath of death and destruction along the way. Their violent and murderous robberies attracted the attention of the [[Daniel Lyons (Earth-616)|Black Marvel]], who sought to end their reign of terror.\n\nHis first attempt to stop them was a failure, and in his second, he was himself captured. The Order's leader decided to execute the Black Marvel on live television with a death ray. He explained that after doing so, he would demand that the government must pay them a million dollars each year to stop their reign of terror. However, the Black Marvel broke free and fought his way through the Order's members, chasing their leader up the side of a mountain. The Hood ultimately died in an avalanche caused during his battle with the Black Marvel, and the remaining members were rounded up by the police.{{r|All Winners Comics #1}}\n\n| Equipment               = \n| Transportation          = The Order of the Hood traveled in an armored truck.\n| Weapons                 = Hood members were armed with knives, pistols, and automatics. They also had a \"Death Ray\" that harnessed the power of the sun, and the Hood had a mirror made to blind his opponents.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "453131"
}