{
    "pageid": 1459808,
    "ns": 0,
    "title": "Order of the Web (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Order of the Web (Earth-616) from Amazing Spider-Man Vol 5 48 001.jpg\n| ImageSize               = 250px\n| Name                     = Order of the Web\n| Aliases                 = Not so Friendly Neighborhood Spider-People,{{r|Amazing Spider-Man Vol 5 51.LR}} [[Order|The Order]]{{r|Amazing Spider-Man Vol 5 57}}\n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = [[Julia Carpenter (Earth-616)|Madame Web]]\n| CurrentMembers          = [[Gwendolyn Stacy (Earth-65)|Ghost-Spider]], [[Julia Carpenter (Earth-616)|Madame Web]], [[Cindy Moon (Earth-616)|Silk]], [[Anya Corazon (Earth-616)|Spider-Girl]], [[Miles Morales (Earth-1610)|Spider-Man (Morales)]], [[Jessica Drew (Earth-616)|Spider-Woman]]\n| FormerMembers           = \n| Allies                  = [[Felicia Hardy (Earth-616)|Black Cat]], [[Stephen Strange (Earth-616)|Doctor Strange]], [[Peter Parker (Earth-616)|Spider-Man (Parker)]], [[Venom (Symbiote) (Earth-65)|Venom Symbiote]]\n| Enemies                 = [[Norman Osborn (Earth-616)|Green Goblin]], [[Gabriel Stacy (Earth-616)|Kind]][[Sarah Stacy (Earth-616)|red]], [[Stanley Carter (Earth-616)|Sin-Eater]]\n\n| Origin                  = Formed to stop [[Peter Parker (Earth-616)|Peter Parker's]] prophesied death by [[Norman Osborn (Earth-616)|Norman Osborn]]\n| PlaceOfFormation        = [[Westchester County]], [[New York (State)|New York]]\n| PlaceOfDissolution      = \n| Creators                = Nick Spencer; Federico Vicentini\n| First                   = Amazing Spider-Man: The Sins of Norman Osborn Vol 1 1\n\n| Quotation               = To wear the symbol of the spider is to become a '''totem.''' Team or not, all of us are connected by the '''[[Web of Life and Destiny]].''' Out paths are tangled together. Usually that means little. Spiders are, by nature, solitary. But sometimes something happens that brings us together--\n| Speaker                 = [[Julia Carpenter (Earth-616)|Madame Web]]\n| QuoteSource             = Amazing Spider-Man: The Sins of Norman Osborn Vol 1 1\n\n| HistoryText             =\n===Formation===\n[[Julia Carpenter (Earth-616)|Madame Web]]'s clairvoyance had her witness the torture and murder of [[Peter Parker (Earth-616)|Peter Parker]] by a bandage covered [[Harold Osborn (Earth-616)|demon]]. Following this act, the demon turned and exposited, aware that Julia was observing, and presenting a connection to the other spider heroes affiliated with Peter.{{r|Amazing Spider-Man Vol 5 44}} When the [[Stanley Carter (Earth-616)|Sin-Eater]] and his army made their warpath across [[New York (State)|New York]] to target [[Norman Osborn (Earth-616)|Norman Osborn]], Julia approached [[Miles Morales (Earth-1610)|Miles Morales]] and [[Gwendolyn Stacy (Earth-65)|Ghost-Spider]] to talk with Peter about the significance of this. After he spoke with them, Julia then took a turn to tell Peter that Norman would kill again, and Sin-Eater removing that evil could save incalculable lives. However, Peter continued on as Spider-Man to [[Ravencroft Institute]] to save Norman Osborn and stop Sin-Eater.{{r|Amazing Spider-Man Vol 5 48}}\n\nWith his choice made, Julia stood in deliberation with Miles, Gwen, [[Jessica Drew (Earth-616)|Spider-Woman]], [[Anya Corazon (Earth-616)|Spider-Girl]], and [[Cindy Moon (Earth-616)|Silk]] on stopping Peter from saving Norman. While they all understand the temptation, Julia argued that the visions each had where in they were with Peter at different locations and he died by Norman's hands. Given that the [[Web of Life and Destiny]] was sensing a great danger nearing Peter, it was moving them to intercede. Despite strong arguments, they reached a consensus and officially teamed up. When Miles asked about Julia's vision, she merely stated that it was \"something worse\" as they web-swung.{{r|Amazing Spider-Man: The Sins of Norman Osborn Vol 1 1}}\n\n===Saving Peter Parker===\nPsychically observing Ravenscroft's chaos from afar, Gwen had a change of heart against interfering, wishing to respect Peter's choice. After a speech and asking for another vote, the new consensus was to allow Peter to best Sin-Eater, who was temporarily suspended in liquid concrete. The Order then intercepted Norman's attempted murder of Peter, and informed their friend of their mission upon rescue. Boarding Norman's escape pod, Norman's perverse hovering around Gwen and subsequent taunts triggered a rage in Peter, who threw Norman out for Sin-Eater to find. As the others were shocked by Peter's \"different choice,\" Julia knew that was contrary having foreseen it, and stating it was too late to change it.{{r|Amazing Spider-Man Vol 5 49}}\n\n[[File:Order of the Web (Earth-616) from Amazing Spider-Man Vol 5 51.LR 001.jpg|thumb|left|250px|Kindred sends the Order to reek havoc]]\nTraversing the river's floor, the demons taken by Sin-Eater's many cleanses were made corporeal and had found them. As the pod was breached, Julia warned Spider-Man there was no stopping the next series of events. Reaching the surface on the [[Hudson River]], the possessed six members attacked Spider-Man on Kindred's guidance as he taunted Peter through the mouths. Following a moment of physical torture on an already overworked Spider-Man, Kindred told Peter to find them later for a \"surprise\" before sending the Order to \"exorcise his own demons.\"\n\nLater that night, Kindred piloted Silk to follow Peter to the [[Sanctum Sanctorum]], where [[Stephen Strange (Earth-616)|Doctor Strange]] was treating him. However, when learning Peter was not properly forthright with Strange, he morphed Cindy's body and taunted Peter until he begged Kindred stop. Cindy's body was restored and she was commanded to depart, as Kindred wanted a face to face encounter with Peter, sending her and the other Spiders to attack New York. Among their rampages, the Order attacked Chinatown and were intercepted by the New Warriors Speedball and Night Thrasher, but their possession allowed them a victory before moving on. One of the locations they besieged was the bridge from Queens into Manhattan where Mary Jane was driving on, destroying the wire cables holding the bridge above the water. But before they could kill innocent civilians or destroy the bridge, they were freed by Kindred from a deal Peter made with the demon and cleansed of their curse.\n\n===Against Kindred===\nAs Doctor Strange repaired the bridge, Black Cat gathered the freed Order to relocate everyone to the Sanctum, where they and Strange entered Peter's dreamscape to expedite finding him. There, they battled passed a legion of demons to find the mystic portal leading to Peter, arriving at Kindred's cemetery with their final obstacle in Sin-Eater, empowered by Morlun's taken abilities. Easily overpowered and outmatched, Julia sacrifices herself to allow Stanley to take her powers, with his new clairvoyance showing him the truth of Kindred and he kills himself in shattered belief; allowing Julia to revive with her powers.\n\n[[File:Gabriel Stacy (Earth-616), Peter Parker (Earth-616) and Order of the Web (Earth-616) from Amazing Spider-Man Vol 5 55 001.jpg|thumb|right|250px|The Order as Kindred's \"guests\"]]\n\nNo longer endangered by Sin-Eater, the Spiders were too slow to react to Kindred's arrival as he captured them, making them his dinner guests with Peter and Mary Jane. Finally at Kindred's culmination, the Order was held hostage witness Harry and Peter's \"reunion\" until Mary Jane was able to negotiate her life in exchange for Peter's salvation. With Norman's sudden arrival and Mary Jane's feigning critical injury, the Order was powerless to stop Norman as Fisk soon encased Kindred's tomb in darkness to apprehend Kindred. With the tomb's structural instability, Mary Jane evacuated the heroes.{{r|Amazing Spider-Man Vol 5 50|55}}{{r|{{cl|Amazing Spider-Man Vol 5 50.LR}}-[[Amazing Spider-Man Vol 5 54.LR|54.LR]]}}\n\nFollowing Kindred's defeat with Fisk holding him in a Darkforce prison, Gwen was outraged by Peter's reluctance to share answers considering she defended his right to choose back at Ravencroft. But his choosing to sacrifice Norman for Sin-Eater proved her wrong. At Mary Jane's and Julia's advice, everyone was talked into waiting until a later time due to their collective ordeal. Despite the hell they experienced, Cindy and Anya still voted to continue helping Peter, as Jess and Julia also noted that they needed to confront the rampaging criminals no longer cleansed. As a team, they chose to continue on and combat the increased super-criminal activity after Kindred's influence.{{r|Amazing Spider-Man Vol 5 57}}\n\n\n| Equipment               = As Spider Heroes, the Order uses web-shooters either mechanical or organic in combat, defense, or traversal.\n* Web-Shooters\n* Symbiote\n<br>\n| Transportation          = Web Swinging\n| Weapons                 = \n\n| Notes                   = * While the members of this team come together at the end of {{cl|Amazing Spider-Man Vol 5 48}}, they do not officially form until {{cl|Amazing Spider-Man: The Sins of Norman Osborn Vol 1 1}}.\n| Trivia                  = \n| Links                   = \n}}\n[[ru:Орден паутины (616)]]"
                }
            }
        }
    ],
    "page_id": "1459808"
}