{
    "pageid": 512151,
    "ns": 0,
    "title": "Order of the Blue Flower (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Order of the Blue Flower (Earth-616) from Sub-Mariner Comics Vol 1 17 0001.jpg\n| Name                    = Order of the Blue Flower\n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Waterville, USA\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Larkin (Deceased), Mr. Rogers\n| Allies                  = \n| Enemies                 = [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Allen Simon\n| First                   = Sub-Mariner Comics #17\n| Last                    = Sub-Mariner Comics #17\n\n| HistoryText             = The Order of the Blue Flower were a racist group founded in 1945, formed by Waterville resident Mr. Rogers as a smoke screen to cover up his diamond smuggling operation.\n\nTo this end, he and his partner Larkin, co-owner of the George-Larkin fishing company fired the crew of their fishing ship the Sainte Anna and replaced it with a crew that were loyal to their criminal enterprise to help ship fish with the smuggled diamonds inside. When Mr. George learned of this, he argued with Larkin who then shot him dead. This happened just as fired fisherman Mr. Svoba (a Czech-American) went to find out why he and his crew were suddenly fired. Hearing the shots Svoba burst into the office just as Larkin fled out the window. In the excitement, Svoba picked up the murder weapon just as police burst in and found himself arrested for the murder.\n\nLarkin and Rogers then preyed on Waterville's prejudice to form the Order of the Blue Flower, with Rogers working in secret. When Svoba refused his guilt, they rallied the gang to attack Svoba's son, Joe, who served for the United States during [[World War II]]. Joe was rescued by the [[Namor McKenzie (Earth-616)|Sub-Mariner]], who then turned Joe over to Mr. Rogers as protection, unaware that he was one of the chief conspirators of the murder. Learning about recent history, Namor went to confront Larkin at an Order meeting and attempted to take him into custody for the murder of his partner. When Larkin refused, Namor punched him, the blow seemingly killing Larkin. Subdued, Namor was arrested but convinced the sheriff to have an autopsy performed on the body, learning that Larkin was really poisoned. \n\nSuspecting the Sainte Anna tying into events, Namor swims out to the ship and catches it's crew as they are collecting their recent shipment of stolen jewels. After Namor subdues the crew, he learns that their leader only communicates with them over shortwave radio. Rogers then attempted to warn his crew via radio of Namor's arrival, exposing his identity when Namor recognized his voice. Rushing to Roger's home, Namor prevents him from shooting Joe and takes him into police custody. When the news reaches the members of the Order of the Blue Flower, they realize how they've been tricked and agree to disband. As Namor leaves Waterville, the former members of the Order pay a visit to the Svoba's apologizing for the way they had acted.{{r|Sub-Mariner Comics Vol 1 17}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Torches, nooses.\n\n| Notes                   = The Order of the Blue Flower appear to be inspired by the [[Ku Klux Klan]], a racist organization which at the time of publication had a second resurgence that faded out in 1944.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Earth Religions]]"
                }
            }
        }
    ],
    "page_id": "512151"
}