{
    "pageid": 62800,
    "ns": 0,
    "title": "Outcasts (Subterranea) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Outcasts (Earth-616) from Iron Man Annual Vol 1 12 001.png\n| Name                    = Outcasts \n| Distinguish1            = Outcasts\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Subterranea]]\n\n| Leaders                 = [[Harvey Elder (Earth-616)|Mole Man]]\n| CurrentMembers          = [[Digger (Outcasts) (Earth-616)|Digger]], [[Boulder (Outcasts) (Earth-616)|Boulder]], [[Water Witch (Earth-616)|Water Witch]], [[Landslide (Outcasts) (Earth-616)|Landslide]]\n| FormerMembers           = [[Benjamin Grimm (Earth-616)|Thing]]\n| Allies                  = \n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Bruce Banner (Earth-616)|Hulk]], [[Anthony Stark (Earth-616)|Iron Man]], [[Peter Parker (Earth-616)|Spider-Man]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Bill Mantlo; Sal Buscema\n| First                   = Fantastic Four Annual #13\n| Last                    = Iron Man Annual #12\n\n| HistoryText             = When the Mole Man grow tired of being lonely on in his domain of [[Subeterranea]] he decided to form a utopian society for people just like him. He constructed an underground city and began kidnapping New Yorkers who were either blind, disfigured, or were generally viewed as ugly. He also began stealing various statues so that they could appreciate the beauty of the artwork. Among those kidnapped was [[Alicia Masters (Earth-616)|Alicia Masters]], the blind sculptress and long time [[Fantastic Four (Earth-616)|Fantastic Four]] associate. This led to the Fantastic Four tracking down their old enemy and uncovering his plot. Although a fight broke out, the Fantastic Four were surprised to learn that many of those the Mole Man brought into his domain wished to stay and enjoyed their new home. The Fantastic Four then agreed to depart, and leave the Mole Man alone, provided he return all the stolen statues once they had been duplicated. {{R|Fantastic Four Annual #13}}\n\nEventually, the Outcasts included a group of physically enhanced members including the large handed [[Digger (Outcasts) (Earth-616)|Digger]], the super-humanly strong [[Boulder (Outcasts) (Earth-616)|Boulder]], the vibration casting [[Landslide (Outcasts) (Earth-616)|Landslide]] and the divining rod wielding [[Water Witch (Earth-616)|Water Witch]]. These members of the Outcasts came to the aid of their master when his domain was under attack by [[Kala (Earth-616)|Kala]] mistress of the Neitherworld, and the [[Lava Men]] who sought to claim the Fountain of Youth in the Mole Man's domain. To this end she pitted a team of Olympic athletes against the Outcasts in a battle to the finish. The clash was interrupted by both [[Peter Parker (Earth-616)|Spider-Man]] and the [[Bruce Banner (Earth-616)|Hulk]]. The two heroes ended hostilities and the Mole Man and Kala agreed to live together when the Mole Man admitted to still loving her. {{r|Marvel Treasury Edition #25}} \n\nLater when Subterranea was impacted by the mutant terrorist known as [[Dominikos Petrakis (Earth-616)|Avalanche]], who was using his vibratory powers to shake San Andreas Fault, the super-powered Outcasts went to investigate. They stopped Avalanche with the help of the Hulk. {{r|Incredible Hulk #263}} When the town of [[Clairton]], [[West Virginia (State)|West Virginia]] was under attack by the [[Dire Wraiths]], the Mole Man and his outcasts crossed paths with the [[Spaceknights (Galadorian) (Earth-616)|Spaceknights]] [[Rom (Earth-616)|Rom]] and [[Brandy Clark (Earth-616)|Starshine]]. {{r|Rom #28}} The Mole Man and his followers helped the two Spaceknights defend the people of Clairton from the Wraiths. {{r|Rom #29}} When millionaire cartoonist [[Alden Maas (Earth-616)|Alden Maas]] attempted to expand the size of Earth by utilizing the powers of the [[Jonathan Storm (Earth-616)|Human Torch]] and pipe it into the Earth, it had a catastrophic effect on the Mole Man's domain, causing a massive lava flow that apparently slew all of the non-powered members of the Outcasts. The Mole Man later joined the Torch and the [[Benjamin Grimm (Earth-616)|Thing]] to stop Maas from unleashing a thermonuclear device below the Earth. {{R|Fantastic Four #264}} However, there were apparently some survivors, or the Mole Man gathered a new group of non-powered Outcasts, who began helping the Mole Man in a plan to raise a portion of Subterranea above ground so that they might have their an island to call their own on the surface. Among their numbers was the Thing during a period in which he was estranged from the Fantastic Four. When the Fantastic Four went looking for the Thing, they discovered the Mole Man's plans threatened to cause untold destruction to the surface world and put a stop to it, resulting in the apparent destruction of Subterranea and [[Monster Island]]. Most of the non-powered Outcasts either fled or presumably perished in the destruction. {{r|Fantastic Four #296}}\n\nAlthough it appears that all non-human Outcasts have fled, the super-powered members of this society remained. During the so-called [[Subterranean Wars]], the Mole Man sent these Outcasts to recover Kala when she attempted to get the aid of [[Anthony Stark (Earth-616)|Iron Man]], leading to a clash with the armored Avenger. {{r|Iron Man Annual #12}} Water Witch was later seen among the many female super-humans on [[Femizonia Isle]]. {{r|Captain America #387}} Since then none of the super-human Outcasts have been seen since, their subsequent fate is unknown.\n \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * http://www.marvunapp.com/Appendix/outcs1.htm\n}}\n[[Category:Subterraneans]]"
                }
            }
        }
    ],
    "page_id": "62800"
}