{
    "pageid": 41840,
    "ns": 0,
    "title": "Outlaws (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Plagiarism|[http://marvel.com/universe/Outlaws Outlaws on Marvel.com]}}\n{{Marvel Database:Team Template\n| Image                   = Outlaws (Earth-616) from Web of Spider-Man Vol 1 50 0001.jpg\n| ImageSize               = 250px\n| Name                    = [[Outlaws]]\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Manhattan]], [[New York City]], [[New York (State)|New York]] \n\n\n| Leaders                 = [[Silvija Sablinova (Earth-616)|Silver Sable]], [[Peter Parker (Earth-616)|Spider-Man]]\n| CurrentMembers          = \n| FormerMembers           = [[Silvija Sablinova (Earth-616)|Silver Sable]], [[Peter Parker (Earth-616)|Spider-Man]], [[Hobie Brown (Earth-616)|Prowler]], [[Thomas Fireheart (Earth-616)|Puma]], [[Robert Farrell (Earth-616)|Rocket Racer]], [[William Baker (Earth-616)|Sandman]], [[Jackson Arvad (Earth-616)|Will O' the Wisp]], [[Paladin (Earth-616)|Paladin]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = A team of superhumans inadvertently brought together by the machinations of [[Silvija Sablinova (Earth-616)|Silver Sable]] and [[Peter Parker (Earth-616)|Spider-Man]].\n\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gerry Conway; Alex Saviuk\n| First                   = Web of Spider-Man Vol 1 50\n| Last                    = Web of Spider-Man Annual Vol 1 7 \n\n| HistoryText             = This short-lived team of reformed criminals was first brought together when a member of the paparazzi, Nick Katzenberg, gave [[Daily Bugle (The DB!) (Earth-616)|Daily Bugle]] publisher, [[John Jonah Jameson (Earth-616)|J. Jonah Jameson]], what he has been telling the public for years - evidence that Spider-Man is a criminal. Katzenberg had pictures of Spider-Man robbing the penthouse of mogul Winston Walker.{{r|Web of Spider-Man #50}}\n\n[[File:Spectacular Spider-Man Vol 1 170.jpg|thumb|left|150px]]\n\nThe photos were plastered on page one of the Bugle, and Katzenberg used these photos as a negotiating tactic to become a staff photographer for the Bugle. The shock that Spider-Man may be nothing more than a common thief invited the attention of a few old sparring partners of his, namely Puma, Rocket Racer, Will-O'-The-Wisp, and Prowler to seek answers as to why he appeared to have turned to a life of crime. However, before seeing eye-to-eye, Rocket Racer accused Prowler of being the thief, and Spider-Man tries to convince Puma that he hasn’t turned to crime while trying to stay one step ahead of Puma’s assault. Leaving the scene, the wall crawler dropped a beeper that Puma decided to take back to his offices to have analyzed. {{r|Web of Spider-Man #50}}\n\nFearing that the first robbery was just a ploy to get to some hidden documents that he has stashed away at a secret location, Walker went to check on their safety as Spider-Man discreetly followed him. Ending in Staten Island, Winston Walker removed his valuables from a vault only to have them taken from him by the web slinger. That is when Will-O’-The-Wisp arrived on the scene and accused Spider-Man of being a thief, but gunshots, and a little help from high tension lines, distracted him long enough for Spidey to get away. Spider-Man then arrived at Ellis Island where he met with Silver Sable and Sandman.{{r|Web of Spider-Man #50}}\n \nRocket Racer and Prowler, after interrogating one of Sable’s men they found spying on Walker’s townhouse, arrived shortly after and attempted to apprehend Spider-Man, but were opposed by Sandman. As the fight ensued with Spidey in the middle, Sable decided to retreat, but is met by Puma who learned that the beeper came from a Symkarian electronics firm, and a trip to the Symkarian Embassy told him where to find Sable. It was soon discovered that Spider-Man was actually working with Sable, and stealing from Walker was a ruse so that he would panic, and give away his secret that he was working for the crime cartel, the Maggia.{{r|Web of Spider-Man #50}}\n\nThe documents, that Silver Sable now had in her possession, proved that Walker was laundering money for them. After completing what they set out to do, Silver Sable gave the others her business card, offering them future free lance work. Peter Parker had photographed the whole incident that would indeed clear Spider-Man, but Jameson told Parker that he would not publish any more pictures that made Spider-man look good, and to get more photos that supported Katzenberg’s story. It was soon revealed that the real J. Jonah Jameson was actually held captive, and the man replacing him was none other than the [[Dmitri Smerdyakov (Earth-616)|Chameleon]].{{r|Web of Spider-Man #50}}\n\n[[File:Web of Spider-Man Vol 1 50.jpg|thumb|left]]\nTime went by with no sign of the impromptu group until one day when an unsuspecting Spider-Man was flagged down by the [[Jennifer Walters (Earth-616)|She-Hulk]] (Who was later revealed to be [[Space Phantom (Temporal Limbo)|Space Phantom]] impersonating her). She claimed to be in need of his strength to help her reveal what was inside a crypt that was found in an old tenement building that was recently bought by [[Wilson Fisk (Earth-616)|Wilson Fisk]] (also known as the Kingpin). Once they lifted the huge slab of stone to expose the cellar, inside the web-slinger found, and opened, a locked chest. To his surprise, an ominous black cloud arose that set his spider sense off. As he tried to exit the tomb, She-Hulk let go of the huge concrete cylinder, and sent it crashing down on top of him leaving this entity to roam free. Spider-Man eventually broke free, and sought out the She-Hulk at [[Avengers (Earth-616)|Avengers]] HQ where he also found [[Steven Rogers (Earth-616)|Captain America]], [[Sersi (Earth-616)|Sersi]], [[Thor Odinson (Earth-616)|Thor]] and [[Wendell Vaughn (Earth-616)|Quasar]]. However, seeing the other heroes didn’t stop him from taking revenge on She-Hulk, and he slammed her through a wall. Trying to stop the incident from turning into a huge catastrophe, Captain America questioned Spider-Man as to why he was acting in that manner, but when Spidey told him the story, Cap informed him that She-Hulk had not left the mansion, and therefore could not be responsible for the incident. Feeling that the rest of the Avengers were against him, Spider-Man left their HQ to pursue his own investigation.\n\nSpider-Man then left messages for all of his previous allies Puma, Rocket Racer, Prowler and Sandman. When they all met at the ruins of the former [[Daily Bugle Building]], Spider-Man told of his previous adventure, and asked them to help solve the mystery. Puma and Prowler were sent to Fisk’s offices to learn more of the entity while Sandman and Rocket Racer were sent to the Hall of Records at City Hall. Unbeknownst to the group, however, the Avengers had secretly been tracking Spider-Man, and were sure that the quintet was up to no good considering all the members, except Spidey, had criminal records. Rocket Racer found what they needed, but was soon attacked by Sandman who was later revealed to be Space Phantom once again. Spider-Man eventually found the entity at the Central Park Zoo where it was eating some of the animals there alive, and it almost did the same to him if not for a timely intervention by the Avengers. Unfortunately, Spider-Man was still mistrusting of them, and swung away on a web line. After Rocket Racer attacked Sandman in the presence of the others. It was revealed that the Space Phantom had impersonated She-Hulk, and he was the one who was really responsible for these misfortunes, but he answered to an even more mysterious master. Spider-Man got a feeling that Baker wasn’t lying when he said that he never attacked the Racer in the first place, and said that it was time to go and talk to the Avengers.\n\nTraveling back to Avengers HQ, Spider-Man and the others were attempting to decide how to approach the group when, suddenly, Spider-Man swings off on his own and took a swing at Captain America. That led to a brief fight between the two groups until Puma exposed the Space Phantom as the culprit who set everything in motion in the first place. Now, as the two teams decided to get to the bottom of this mystery, Space Phantom told them that they can join forces and oppose his mysterious master, but they immediately declined his offer. Once they left the room, Space Phantom was sent back to Limbo by the very master he sought to betray. The files from City Hall told of a man, Ambrose Carpathian, who built the tenement as a private mansion. He was a millionaire that was also a mystic and ruler of an occult society known as The Arcane Order of the Night that held rituals in the tenement in the exact location of the crypt. It was also found out that Carpathian was an explorer and in 1890 he traveled to the Amazon where he returned with something that started a killing spree in the neighborhood of Carpathian’s mansion. The two groups then leave in search of the black cloud entity, and after an exhausting battle, they managed to trap it inside of the chest that it was originally released from. Thor used his mystic hammer to send the chest into outer space where the entity can no longer harm anyone. It was then revealed that the entity was really a swarm of microscopic cannibal insects. With the threat now defeated, the two groups go their separate ways, and the designer of this scheme showed himself to Spider-Man. Calculus of the Young Gods said that since he is forbidden interfere in the affairs of humanity, he needed Spider-Man to get rid of the contents of the chest before they fell into the hands of the Kingpin. {{r|Spectacular Spider-Man #168|170}}\n\nAgain, the group had not been seen together until Silver Sable had a situation to deal with that she felt she would need special operatives instead of her [[Wild Pack (Earth-616)|Wild Pack]]. Sable was hired by a high-ranking government official in Montreal named M. Eduard LeBon. His daughter had been kidnapped by a radical splinter group of LeBon’s political opponents. In order to get his daughter back, Sable recruited Prowler, Rocket Racer, and Will-O'-The-Wisp, where she then gave them the team name The Outlaws. When asked why Sandman wasn’t present, Sable tells her team that he was working for the radicals. However, Baker had his own plans and was really on a self-appointed undercover mission. Hoping to get back in good graces with the Avengers, Baker took the job with the radicals only to free their hostage and shut their operation down along with its leader, Boussard. The Outlaws, eventually arriving at the radicals’ compound, broke in and make quick work of the guards only to be confronted by their former ally. Sable, not willing to risk the life of the girl, left her team to occupy Sandman. While battling, Will-O’-The-Wisp touched Baker and sees a conflict within him, and decided not to add to it which enabled Baker to make quick work of Prowler and Rocket Racer. Baker catches up to Silver Sable as a helicopter with Boussard and his hostage was lifting off. Fearing for the life of the girl, Sandman disabled the helicopter and disarmed Boussard enabling Sable to tag him with a tranquilizer dart. After explanations are made, Sable offered Baker a place on The Outlaws. {{r|Web of Spider-Man Annual #7}}\n\nThe Outlaws have not been seen together since that mission except for a brief encounter with Excalibur.{{r|Excalibur #36}}\n\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Prowler's Gauntlet's, Rocket Racer's Mini-Rockets, Silver Sable's Guns, Paladin's Stun Gun, \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "41840"
}