{
    "pageid": 30270,
    "ns": 0,
    "title": "Pacific Overlords (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Pacific Overlords (Earth-616) from Gamer's Handbook the the Marvel Universe Vol 8 1 001.jpg\n| Name                    = Pacific Overlords\n| Aliases                 = Overlords\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Demonica]]\n\n| Leaders                 = formerly [[Douglas Birely (Earth-616)|Doctor Demonicus]]\n| CurrentMembers          = none\n| FormerMembers           = [[Miguel Santos (Earth-616)|Living Lightning]], [[Kenjiro Sasaki (Earth-616)|Big One]], [[Sunfire]], [[Toshio Sasaki (Earth-616)|Taifu]], [[Michi Sasaki (Earth-616)|Pele]], [[Marya Meshkov (Earth-616)|Morning Star]], [[Ulysses Klaw (Earth-616)|Klaw]], [[Yen Hsieh (Earth-616)|Cybertooth]], [[Tung Rapongan (Earth-616)|Jawbreaker]], [[Kayama Inoue (Earth-616)|Irezumi]], [[Morgan Kain (Earth-616)|Kain]], [[Aya Komatsu (Earth-616)|Kuroko]]\n| Allies                  = \n| Enemies                 = [[Avengers West Coast]]\n\n| Origin                  = Formed by Dr. Demonicus\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[Demonica]]\n| Creators                = Roy Thomas; David Ross\n| First                   = Avengers West Coast Vol 2 70\n| Last                    = Avengers West Coast Vol 2 95\n\n| HistoryText             = \nThe Pacific Overlords are a group of super-powered individuals who gained their powers through experiments and procedures conducted under the watchful eye of the once-brilliant geneticist turned criminal subversive, [[Doctor Demonicus]]. Principle among Demonicus's procedures was exposure to the few remaining shards of the highly radioactive meteor called the [[Lifestone (Meteor)|Lifestone]].\n\nThe existence of the Pacific Overlords was first uncovered by the heroine [[Julia Carpenter|Spider-Woman]] when she battled two of their rank, [[Jawbreaker]] and [[Kuroko]], on the dock of the Newport Beach Marina. When Spider-Woman enlisted the aid of the [[Avengers West Coast]], Doctor Demonicus led them on a merry chase from California to Hawaii to Australia to Japan before culminating on the new island nation of Demonica.\n\nAlong the way, several of the Avengers and a few private citizens were taken captive. A small band of Avengers and their allies did eventually storm the tiny nation and free the hostages, but were unable to take any action against Demonicus and his Overlords for the crimes they had committed.\n\nIt seems that raising Demonica from the ocean floor was what Doctor Demonicus's plan had been all along. The Overlords were nothing more than a means to an end, serving more to keep the Avengers occupied than anything else. Within hours of being raised from the ocean floor, Demonica was recognized as a sovereign nation by the United Nations. Under their new charter, the Avengers had no authority to interfere in the legal affairs of a United Nations member and were forced to leave Demonica. Demonicus now rules over his own country which is rich in natural resources. His Overlords give him a small but superhumanly powerful army.\n\nDemonicus eventually came under the control of a demon and used the Overlords to advance the demon's message.  [[Kuroko]] requested help from the [[Avengers West Coast]].  The nation of Demonica and the Overlords apparently sank beneath the Pacific Ocean.\n\n| Equipment               = Doctor Demonicus had access to advanced technology\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "30270"
}