{
    "pageid": 841210,
    "ns": 0,
    "title": "Paladin Corporation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Paladin Corporation (Earth-616) from Elektra Vol 3 28 0001.jpg\n| Name                    = Paladin Corporation\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Paladin Corporation (Earth-616)/Members#George (Paladin Corp.) (Earth-616)|George]], [[Paladin Corporation (Earth-616)/Members#Ken (Paladin Corp.) (Earth-616)|Ken]], [[Paladin Corporation (Earth-616)/Members#Leonard (Paladin Corp.) (Earth-616)|Leonard]], [[Paladin Corporation (Earth-616)/Members#Michael (Paladin Corp.) (Earth-616)|Michael]] \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Beben Oamat (Earth-616)|Beben Oamat]]\n| Enemies                 = [[Anton Prebble (Earth-616)|Anton Prebble]], [[Jason Spierling (Earth-616)|Jason Spierling]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Manhattan]], [[New York City]], [[New York (State)|New York]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Robert Rodi; Sean Chen\n| First                   = Elektra Vol 3 #24\n\n| History                 = The Paladin Corporation was a highly wealthy and influential company based out of Manhattan, who used tactics legal and illegal to garner wealth. They typically employed hired assassins for various jobs, then had the assassin themselves executed after four jobs to tie up loose ends.{{r|Elektra Vol 3 #28}}\n\nThe Paladin Corporation hired [[Elektra Natchios (Earth-616)|Elektra Natchios]] to be their new assassin, beginning with the assassination of their previous employee, Anger. Next, they had her kill Jason Spierling, an employee spreading news about Paladin's plan to engineer a coup in the nation of [[Djanda]] for easier access to slave labor in the populace.{{r|Elektra Vol 3 #24}}\n\nPaladin next directed Elektra to execute a rival businessman, [[Anton Prebble (Earth-616)|Anton Prebble]].{{r|Elektra Vol 3 #23|24}}\n\nFinally, the Paladin Corporation loaned out Elektra to [[Beben Oamat (Earth-616)|Beben Oamat]], a Djandan senator-in-exile after the rise of the current dictator. Oamat hired Elektra to execute the dictator [[Bridget Hapanmyas (Earth-616)|Bridget Hapanmyas]] while she was on vacation in [[London (England)|London]]. Elektra missed her chance and followed Hapanmyas back to Djanda. Elektra successfully assassinated Hapanmyas, her son, security chief, and single-handedly helped the local rebels overthrow the palace.\n\nIn the process, Elektra also learned Oamat lied to her about the political nature of the killing (Oamat misrepresented the hit as personal revenge for death of his wife and daughters). Unable to get out of Djanda without help, she accepted a job from the Djandan rebels: kill Oamat, who they felt was just as unscrupulous as the Hapanmyas.{{r|Elektra Vol 3 #25|27}}\n\nAt a private dinner among the Paladin V-Ps, Leonard, Michael and Ken got to talking about business while waiting for their fourth, George. Leonard and Michael were discussing how effective Elektra had been, if somewhat of a loose cannon in the Djanda business. Still, they laughed about how stupid it would be to ever turn on Elektra, to which Ken replied, \"Wait, what?\"\n\nAfter the hits on Anger, Spierling, Prebble, and Hapanmyas, Elektra had technically committed four jobs for Paladin, so Ken had automatically started the procedures to have her killed, according to their \"loose ends\" policy. It quickly dawned on the executives why George was late and the restaurant staff had disappeared...{{r|Elektra Vol 3 #28}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Links                   = \n\n}}\n[[Category:Companies]]"
                }
            }
        }
    ],
    "page_id": "841210"
}