{
    "pageid": 624543,
    "ns": 0,
    "title": "Pawnee People (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Pawnee_People_(Earth-616).jpg\n| Name                    = Pawnee People\n| Aliases                 = Pawnee, Paneassa, Pari, Pariki\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Little Chipmunk, Sliding Otter, [[Arrowhead (Earth-616)|Arrowhead]], Bear-That-Walks (deceased), [[Doe Eyes (Earth-616)|Doe Eyes]], [[Running Wolf (Earth-616)|Running Wolf]], [[Snake Fang (Earth-616)|Snake Fang]] (deceased), [[Black Buffalo (Earth-616)|Black Buffalo]] (deceased) \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Blaine Colt (Earth-616)|Kid Colt]]\n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Oklahoma (State)|Oklahoma]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Kid Colt Outlaw #19\n\n| History                 = \n===Overview===\nThe Pawnee people are a band of Native Americans who originated in the Great Plains of the western United States and currently reside in what is now the state of Oklahoma.<ref>[[Wikipedia:Pawnee people|Wikipedia]]</ref> Presumably their history on [[Earth-616]] is nearly identical to their real world counterparts.\n\n===American Frontier===\nDuring the days of the American Frontier, the Pawnee People had many interactions with European settlers in the area. Various tribes had run-ins with famous gun slinging heroes of the time, either as friend or enemy depending on the motivations of the specific tribe in question.\n\n====Bear-That-Walks Tribe====\nOne of the most famous tribes was the one lead by Bear-That-Walks, who sired the famous Pawnee warrior [[Arrowhead (Earth-616)|Arrowhead]]. The local medicine man [[Snake Fang (Earth-616)|Snake Fang]] and his son [[Running Wolf (Earth-616)|Running Wolf]] murdered Bear-That-Walks in order to usurp control of the tribe and begin trading for liquor and guns. Learning this, Arrowhead slew the white traders and Snake Fang as well, making him an outlaw to the white settlers in the region and a renegade among his people. While in exile Arrowhead vowed to get revenge on the white man for taking his people's lands, but eventually became a champion to anyone in trouble regardless of their race.{{r|Arrowhead #1}} Running Wolf took over leadership of the tribe, thus insuring Arrowhead's renegade status. Shortly after his exile, Arrowhead was forced to return to his tribe to be treated for injuries. There he challenged Running Wolf to a battle to the death and won, but spared Running Wolf's life for the time being in order to clear his name for unrelated murders.{{r|Arrowhead #2}} To date there is no recorded evidence that the feud between Arrowhead and Running Wolf was ever resolved.\n\nThe tribe was later attacked by a tribe of [[Sioux (Earth-616)|Sioux]] who sought to capture the maiden [[Doe Eyes (Earth-616)|Doe Eyes]]. The Pawnee failed to stop Doe Eyes' capture, but Arrowhead succeeded in rescuing her.{{r|Arrowhead #3}} Some of the tribe were sold alcohol by an outlaw named Toss, but the supply was cut off by Arrowhead who slew Toss.{{r|Black Rider #25}} One of the tribe's best warriors, [[Black Buffalo (Earth-616)|Black Buffalo]], went mad after being wounded by white men, forcing Arrowhead to slay him.{{r|Wild Western #38}}\n\n====Other Tribes====\nThe earliest recorded encounter came when a young Pawnee boy named Little Chipmunk was stealing the food caches hidden by outlaw hero [[Blaine Colt (Earth-616)|Kid Colt]] in an attempt to capture the Kid and prove himself a man to his people, and to his father who was chief of the tribe. Learning of the boy's motivations, Kid Colt allowed the boy to capture him and bring him back to his tribe. With Little Chipmunk having proved himself, his father allowed Kid Colt to go free.{{r|Kid Colt Outlaw #19}}\n\n===Modern Age===\nThe Pawnee people still exist to this day.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Native American Tribes]]"
                }
            }
        }
    ],
    "page_id": "624543"
}