{
    "pageid": 532990,
    "ns": 0,
    "title": "Phantom Raiders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Phantom Raiders (Earth-616) and Clay Harder (Earth-616) from Wild West Vol 1 1 Cover.jpg\n| Name                    = Phantom Raiders\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly Ace Biddle\n| CurrentMembers          = \n| FormerMembers           = Ace Biddle, unnamed member\n| Allies                  = \n| Enemies                 = [[Clay Harder (Earth-616)|Two-Gun Kid]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Wild West Vol 1 1\n| Last                    = Wild West Vol 1 1\n\n| HistoryText             = The Phantom Raiders were a gang of horse thieves that were active during the days of the American Frontier. They were organized by Ace Biddle an area horse trader. They specifically targeted the Circle T ranch owned by Mr. Tennyson and his family. Kidnapping Tennyson, Ace then posed as the rancher and pretended to be crippled in an accident. \"Confined\" to a wheelchair, the impostor then acted ashamed of his \"affliction\" and sequestered himself in Mr. Tennyson's room. He directed his gang of horse thieves from this room. \n\nAfter a series of successful raids, Tennyson's young boy Ted went out to try and hunt them down, instead encountering the [[Clay Harder (Earth-616)|Two-Gun Kid]] who agreed to help the family recover their stolen property. When meeting \"Mr. Tennyson\", the Two-Gun began suspecting that he was an impostor. In order to lure the Phantom Raiders into thieving the ranch again, Two-Gun had Ted ride his horse [[Cyclone (Horse) (Earth-616)|Cyclone]] into town and brag about how great the horse was. That night, the Phantom Raiders came to the property and stole Cyclone,  a move that Two-Gun allowed according to his plans. Sure enough, after being brought to the Phantom Raider's camp and left alone Cyclone returned to his master and led him there.\n\nThe Two-Gun Kid along the way found the real Mr. Tennyson who had managed to free himself and escape and arranged for a coach to bring him back home. Two-Gun then sneaked onto the Raiders camp and freed the stolen horses. In the chaos, Two-Gun rounded up the members of the gang. Their leader then confronted Two-Gun wearing a bandanna, with guns drawn. Two-Gun however was a faster draw and shot the guns out of the leaders hand and took him captive as well. Returning the to the Circle T with his prisoners, Two-Gun revealed their leader was the false Mr. Tennyson and removed his disguise revealing him as Ace Biddle. He then turned them over to the authorities just as the real Mr. Tennyson returned home to a happy reunion of his family.{{r|Wild West Vol 1 1}}\n\nThe fate of the Phantom Raiders is unknown. Whatever that fate may be all members of this gang are likely long dead.\n\n| Equipment               = The Phantom Raiders used rope as lassos.\n| Transportation          = Each member of the Phantom Raiders rode a horse.\n| Weapons                 = Each member of the Phantom Raiders carried guns, usually six shooters or rifles common to the era they operated in.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Western Teams]]\n[[Category:Equestrianism]]\n[[Category:Shooting]]"
                }
            }
        }
    ],
    "page_id": "532990"
}