{
    "pageid": 19184,
    "ns": 0,
    "title": "Poison Memories (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Poison_Memories.jpg\n| Name                    = Poison Memories\n| Aliases                 = \n\n| Leaders                 = [[Kimeiko Ashu (Earth-616)|Kimeiko Ashu]]\n| CurrentMembers          = \n| FormerMembers           = Gai No Don, Johnny Lo, Victor Hasayaba, Nguyen, Vu Thi\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[New Warriors (Earth-616)|New Warriors]]\n\n| Origin                  = Street gang\n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Chinatown (New York)|Chinatown]], [[Manhattan]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Fabian Nicieza\n| First                   = Night Thrasher: Four Control Vol 1 1\n\n| History                 = The Poison Memories were a street gang in New York City comprised of South Vietnamese descended members that Andrew Chord hired to kidnap himself from his hospital room in order to put Night Thrasher on a quest to uncover the Taylor Foundation's entrenched corruption.{{r|Night Thrasher: Four Control #1}}\n\nThe Poison Memories were originally financed by Gai No Don. Night Thrasher discovered Gai No Don was in fact Li Pan an infamous North Vietnamese war criminal who had committed many atrocities against the South Vietnamese.{{r|Night Thrasher: Four Control #4}} This revelation broke the spirit of the members.\n\nKimeiko Ashu the leader of the Poison Memories blamed Night Thrasher for the decline of the gang and sought revenge against Night Thrasher and the New Warriors. Ashu stole Namorita's address book after a drunken one night stand.{{r|New Warriors #35|36}}\n\nFrom there the Poison Memories launched attacks against the New Warriors family members. Rage's grandmother Edna Staples was murdered. Firestar's father Bart Jones was shot. Nova's brother Robert Rider and Speedball's father Justin Baldwin were kidnapped. Ashu called the New Warriors and made them listen while he chopped off Robert Rider's finger. Ashu forced them to surrender themselves to the Poison Memories.\n\nCarlton LaFroyge aka Hindsight Lad had also recently learned Speedball's identity and had been attempting to blackmail Speedball into letting him join the New Warriors. When Speedball was imprisoned by the Poison Memories Carlton used Speedball's own address book to learn Night Thrasher's identity and informed him of the New Warriors capture.{{r|New Warriors #37}}\n\nDuring the days the Warriors were prisoner Kimeiko became increasingly paranoid and began killing his fellow gang members in the fear that they would compromise the gang.{{r|Night Thrasher #1}} Night Thrasher freed the New Warriors and saved Justin Baldwin and Robert Rider from Ashu. Ashu fought the group in an armored suit until Rage arrived and ripped Ashu out of the armor, Ashu attacked Rage with a piece of shrapnel, but Rage being impervious to harm snapped his neck.{{r|New Warriors #38}}\n\nAfter the incident Rage perjured himself and claimed that he reacted on instinct and killed Ashu in self defense after he was attacked and Andrew Chord and Dwayne Taylor (Night Thrasher) became his legal guardians. Night Thrasher was at first upset at being part of the cover up of a murder but later refused to let Rage hand himself in and convinced the DA's office to drop the charges.{{r|New Warriors #39}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = * The Poison Memories were enemies of Silhouette and Midnight's Fire Vietnamese gang the Concrete Dragons. When Silhouette was a teenager the Poison Memories killed several members of the Concrete Dragons. Kimeiko Ashu also wanted Silhouette to be his sex slave.{{r|Night Thrasher Vol 1 1}}\n| Links                   = \n}}\n[[Category:Criminal Organizations]]\n[[Category:Gangs]]\n[[Category:Vietnamese Organizations]]"
                }
            }
        }
    ],
    "page_id": "19184"
}