{
    "pageid": 472528,
    "ns": 0,
    "title": "Poison Incorporated (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Poison Incorporated (Earth-616) from Mystic Comics Vol 1 9 0001.jpg\n| Name                    = Poison, Incorporated\n| Aliases                 = Poison Inc.\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly The Old One\n| CurrentMembers          = \n| FormerMembers           = The Old One, unnamed members\n| Allies                  = \n| Enemies                 = [[Laslo Pevely (Earth-616)|Terror]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Mystic Comics #9\n| Last                    = Mystic Comics #9\n\n| HistoryText             = Formed by the long time and well respected master criminal known only as \"The Old One\", Poison, Incorporated was a group of criminals who were hired out to murder people using poison exclusively. Their first customer was construction company owner John Bradley, who hired Poison Inc. in 1942 to eliminate Corkey, the editor of the Star Newspaper due to his accusations of paying politicians graft money. The Old One had his men break into the Star Newspaper office and rig Corkey's typewriter with a poison coated needle on the shift key. The next day, when Corkey went to work on his latest editorial on Bradley, he was killed instantly by the poison.\n\nPoison Inc. also succeeded in eliminating another man: Mugsy Murdock, a racketeer who was ordered to be rubbed out by a rival gangster. Murdock was tricked into a meeting with the Old One who provided him with a poisoned cigar.\n\nBy this time, the hero known as the [[Laslo Pevely (Earth-616)|Terror]], while investigating the death of Corkey, learned of the organization's existence and roughed up the men at its secret hideout while the Old One was on the Mugsy Murdock job. Arriving too late to prevent the murder of Murdock, the Terror was knocked out and tossed into the river to drown by the Old One's thugs.\n\nSurviving the attempt on his life, the Terror went back to Poison Inc.'s secret hideout and defeated the entire gang. When the authorities arrived, the Old One -- preferring death to capture -- smoked one of his own poisoned cigarettes, killing himself. The rest of the gang was taken into police custody.{{r|Mystic Comics #9}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Poison Inc.'s grunts carried conventional firearms. They also used lethal poisons, with the Old One using it in cigarettes and cigars for unsuspecting victims to smoke.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "472528"
}