{
    "pageid": 964414,
    "ns": 0,
    "title": "Praetorians (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Praetorians (Earth-616) from X-Men Phoenix Force Handbook Vol 1 1 001.PNG\n| ImageSize               = \n| Name                    = Praetorians\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Chandilar]], [[Shi'ar Empire]]\n\n| Leaders                 = [[Xenith (Earth-616)|The Strontian]]\n| CurrentMembers          = [[Xenith (Earth-616)|Strontian]], [[God-Killer (Earth-616)|God-Killer]], [[Pelagian (Praetorian) (Earth-616)|Pelagian]], [[Pn'zo (Earth-616)|Pn'zo]], [[Warwear (Earth-616)|Warwear]]\n| FormerMembers           = [[The Hodinn (Earth-616)|Hodinn]], [[Zzzxx (Symbiote) (Earth-616)|Zzzxx]]\n| Allies                  = Variable, changing with the Majestor/Majestrix in charge and the situation.\n| Enemies                 = [[Builders (Race)|Builders]]; [[Nova Corps (Earth-616)|Nova Corps]], [[House of Agon (Earth-616)|Inhumans]], Variable, changing with the Majestor/Majestrix in charge and the the situation.\n\n| Origin                  = Hit squad/back ops team of the [[Shi'ar Empire]], protectors of the Majestor/Majestrix. Formed by criminals of the Kr'kn prison\n----\nFormerly an honorable sub-cadre of the [[Imperial Guard (Earth-616)|Imperial Guard]] for worthy veterans and old guardsmen\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Christopher Yost\n| First                   = X-Men: Kingbreaker #2\n| Last                    = \n\n| HistoryText             = The '''Praetorians''' were traditionally an honorable sub-cadre within the Imperial Guardsmen for worthy veterans and old guardsmen. Emperor Majestor [[Gabriel Summers (Earth-616)|Vulcan]] used the title to legitimize his personal hit squad made of the most dangerous creatures the Shi'ar Empire has ever encountered and kept alive to serve as a Black Ops team tasked with killing the [[Starjammers]] due to not being permissible to join the Imperial Guard due to their criminal histories.{{r|X-Men: Kingbreaker Vol 1 2}}\n\nRecruited from the Kr'kn prison, the Praetorians roster included Zzxz, God-killer, Pn'zo, The Hodinn, and the Strontian as the team's leader.The Praetorians first encountered the Starjammers on one of the Clench Worlds, where the teams fought before the Hodinn decided to burn the entire planet. Pn'zo managed to teleport the remaining team members off the planet to safety while their targets escaped.The team learned the Starjammers were headed to Kr'kn and followed suit after leaving Hodinn behind, deeming him too insane. However, Hodinn was picked up after destroying the rest of the Clench Worlds at Vulcan's order to help the Praetorians by combating [[Rachel Summers (Earth-811)|Marvel Girl]] while the remaining team members teleported to the Kr'kn underwater prison to kill the remaining Starjammers. The Starjammers managed to escape before Lilandra cripple Deathbird. After this event, Vulcan replaced the Strontian with Gladiator to oversee the Shi'ar Empire's expansion.{{r|X-Men: Kingbreaker Vol 1 4}}\n\nAfter the war against the Kree Empire, Vulcan added new members to the team such as Warwear and the Pelagian and the new team was ordered to slaughter the Nova Corps after the Corps was defeated by Gladiator and the Imperial Guard. The Praetorians were next sent to Kree-Lar to support [[Blastaar (Earth-616)|Blastaar]]'s troops in their battle against [[Ravenous (Earth-616)|Raveous]] and his army. The Strontian, Pn'zo, and God-Killer were later imprisoned by the Nova Corps in stasis tubes alongside Ravenous, while the remaining team members escaped.{{r|Nova Vol 4 28}} Zzxz was later contained and used by [[Raza Longknife (Earth-616)|Raza]] against an alternate Charles Xavier from the Cancerverse\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Shi'ar Organizations]]"
                }
            }
        }
    ],
    "page_id": "964414"
}