{
    "pageid": 12450,
    "ns": 0,
    "title": "Project Wideawake (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Project: Wideawake\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Henry Gyrich (Earth-616)|Mr. Gyrich]], [[John Ogilvie (Earth-616)|John Ogilvie]], [[Dominikos Petrakis (Earth-616)|Avalanche]], Feduniwic\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Chris Claremont\n| First                   = New Mutants #1\n\n| History                 = \n===Origins===\nThe United States Government had been studying the [[Homo superior|mutant]] problem for years.{{r|X-Men #134}} \n\nIn the 1960's after the reveal the [[Adam Brashear (Earth-616)|Blue Marvel]] was African American, [[Bolivar Trask (Earth-616)|Dr. Bolivar Trask]] was called into a meeting at the [[Pentagon]] to discuss the potential threat. Trask shared his ideas about the birth of Mutants. He didn't believe Brashear was one but they should be '''\"Wideawake\"''' to the threat.{{r|Adam: Legend of the Blue Marvel #2}}\n\nLater [[Robert Chalmers (Earth-616)|Federal Judge Chalmers]] headed up the [[Federal Council on Mutant Activities (Earth-616)|Federal Council on Mutant Activities]], which concluded with a 5-year study that was interpreted to show mutants were a menace to mankind. Meanwhile, [[Robert Kelly (Earth-616)|Senator Robert Kelly]] was also conducting a study on the mutant situation. He, too, did not trust mutants, but his aspirations toward the presidency prompted him to be much more vocal about the \"mutant menace.\" Kelly was also manipulated by Sebastian Shaw of Shaw Industries into developing Sentinels for mutant-hunting purposes, after the X-Men supposedly \"attacked\" the Hellfire Club when Kelly and Shaw were present. {{r|X-Men #134|135}}\n\n[[Raven Darkholme (Earth-616)|Mystique]], and her second [[Brotherhood of Evil Mutants (Earth-616)|Brotherhood of Evil Mutants]], sought to show people that mutants could not be pushed around and attempted to assassinate Kelly. They were stopped in the nick of time by the [[X-Men (Earth-616)|X-Men]]. Instead of defusing the situation, Mystique had only made it worse. Despite the fact that he was saved by mutants, Kelly clung to his radical mutant deterrent theories and helped press the [[White House]] for more action.{{r|X-Men #141}}{{r|Uncanny X-Men #142}}\n\n===Project: Wideawake===\nIn response to all these pressures, the [[President of the United States|President]] secretly instructed the [[National Security Council (Earth-616)|National Security Council]] to create a covert, illegal commission to deal with the problems posed by the increasing numbers of mutants in America. Codenamed '''Project: Wideawake''', the commission was headed by the National Security Advisor, Judge Petrie, and included [[Frank Lowell (Earth-616)|Frank Lowell]] of the [[Central Intelligence Agency (Earth-616)|C.I.A.]], Raven Darkholme of the [[United States Department of Defense (Earth-616)|Defense Department]], [[Valerie Cooper (Earth-616)|Dr. Valerie Cooper]], Special Assistant to the National Security Advisor, plus many other currently unknown members of the U.S. intelligence community.{{r|Uncanny X-Men Vol 1 176}} [[Henry Gyrich (Earth-616)|Henry Peter Gyrich]], a top agent for the National Security Council, was chosen to be head of operations for Project: Wideawake.{{r|New Mutants #2}}\n \nRight from the start the commission had troubles, mainly because they did not completely define their course of action for handling the American mutant population explosion. Because mutants were beginning to pop up all over the world, some members of the administration decided that America should start enlisting the aid of friendly mutants into the ranks of government agencies (under careful control, of course) for America's protection. Other members of the administration felt that the mutants should be rounded up and used as a resource, but their methods denied mutants even their most basic civil rights. Still other bureaucrats believe that all mutants should be destroyed. Project: Wideawake has evolved more towards the second way of thinking (mutants as a resource) under the direction of Petrie and Gyrich.{{r|New Mutants #2}}\n\nRealizing that they would have a fight on their hands against mutant teams, such as the X-Men, the government enlisted the aid of various private firms and interests to develop methods and equipment which would strengthen their position. Strangely enough, some of the most efficient items and fighters were recruited from the mutants themselves, whether knowingly or unknowingly. The mutant named [[Forge (Earth-616)|Forge]] developed many items for the various defense departments, including a gun that would strip a mutant's powers away from them for an indeterminate period of time. This item was to be used against [[Rogue (Anna Marie) (Earth-616)|Rogue]], but when [[Ororo Munroe (Earth-616)|Storm]] intervened, stripped her powers away instead.{{r|Uncanny X-Men #186|188}} While all known models of the device have been destroyed, and Forge made sure the plans were eliminated, he still continues to blindly work for the U.S. defense agencies. Mystique and her Second Brotherhood of Evil Mutants struck a deal with the U.S. Government to become a mutant deterrent force answerable only to the Oval Office through a Special Presidential Liaison, Dr. Valerie Cooper. Thus [[Freedom Force (Earth-616)|Freedom Force]] was born, a mutant team designed to fight mutants.{{r|Uncanny X-Men #199}} But it was the involvement of [[Sebastian Shaw (Earth-616)|Sebastian Shaw]], the Black King of the [[Hellfire Club (Earth-616)|Hellfire Club]], and himself secretly mutant, that turned out to be the greatest threat to American mutants. As head of [[Shaw Industries (Earth-616)|Shaw Industries]], a major U.S. defense contractor, Shaw provided the Department of Defense with new versions of the mutant-hunting [[Sentinels]].{{r|Alpha Flight #43}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Government Organizations]]\n[[Category:American Organizations]]"
                }
            }
        }
    ],
    "page_id": "12450"
}