{
    "pageid": 1477699,
    "ns": 0,
    "title": "Project N (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Project N (Earth-616) from Avengers Vol 1 164.jpg\n| Name                    = Project N\n| Aliases                 = \n\n| Leaders                 = Formerly [[Luchino Nefaria (Earth-616)|Count Nefaria]]\n| CurrentMembers          = \n| FormerMembers           = [[Archibald Stancheck (Earth-616)|Dr. Stancheck]], [[Hellen Rachelson (Earth-616)|Hellen Rachelson]], [[Kenneth Sturdy (Earth-616)|Professor Sturdy]], [[Withers (Earth-616)|Withers]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = [[Lethal Legion (Count Nefaria) (Earth-616)|Lethal Legion]]\n| Enemies                 = [[Avengers (Earth-616)|Avengers]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Formerly Nefaria's townhouse\n| PlaceOfFormation        = Nefaria's townhouse, [[Manhattan]], [[New York City]]\n| PlaceOfDissolution      = [[Manhattan]], [[New York City]]\n\n| Creators                = Jim Shooter; John Byrne\n| First                   = Avengers Vol 1 164\n\n| History                 = '''Project N''' was a private enterprise established by [[Luchino Nefaria (Earth-616)|Count Nefaria]] in the subterranean basement of his townhouse. He wanted to increase his power levels and mitigate one of his biggest and irrational fears, mortality. He assigned [[Kenneth Sturdy (Earth-616)|Professor Sturdy]], a former assistant of [[Heinrich Zemo (Earth-616)|Baron Heinrich Zemo]], as lead designer. Professor Sturdy and his engineering team assembled a machine based on a design of Sturdy's former boss and improved upon it, the original version of the contraption gave [[Simon Williams (Earth-616)|Wonder Man]] his ionic-energy based powers.{{r|Avengers Vol 1 166}} The machinery would allow them to duplicate the powers of super-powered individuals by reading their cell structures and creating energy templates based on them. These templates than could be printed on a specialized suit the user had to wear, which acted as a conduit and gave the user comparable powers.{{r|Avengers Vol 1 165}}\n\nIn order to put his machine to use, Count Nefaria recruited three powered criminals, [[Erik Josten (Earth-616)|Power Man]], [[Arthur Parks (Earth-616)|Living Laser]] and [[David Cannon (Earth-616)|Whirlwind]], who were all enemies of the [[Avengers (Earth-616)|Avengers]]. The new group was named [[Lethal Legion (Count Nefaria) (Earth-616)|Lethal Legion]].{{r|Avengers Vol 1 164}} He first approached Power Man with the promise of power and the potential to reclaim his identity.{{r|Avengers Vol 1 164}}{{r|Avengers Vol 1 166}} Power Man was tasked with breaking out his future teammates from prison. Needing funds to back pay his scientists and to recover from his temporary financial troubles due to his latest failed scheme that was folded by the [[X-Men (Earth-616)|X-Men]]. Nefaria tasked the Lethal Legion with their first real assignment, rob the [[Union National Bank]] located in [[Manhattan]]. Upon their escape, the Avengers tried the apprehend the group but failed to do so.{{r|Avengers Vol 1 164}}\n\nAfter returning from their successful heist, the Lethal Legion escaped to the townhouse to receive their promised upgrades, not knowing they were being used as pawns by Nefaria, who only wanted to duplicate their power sets. The newly upgraded team was sent to the [[Avengers Mansion]] to fight the supergroup.{{r|Avengers Vol 1 164}} Following their departure, Count Nefaria concluded that he couldn't let the science team live, in case they would bring their expertise elsewhere and replicate the results of the project, so he wrecked the lab, killing everyone except for Professor Sturdy.{{r|Avengers Vol 1 #166}} Over the course of the fight between the Avengers and Lethal Legion, the trio picked up the fact that they were duped by their employer, as their powers seem to fade away and they were getting increasingly exhausted resulting in them being easily crushed. Moments later, the Avengers were ambushed by a super-charged Nefaria.{{r|Avengers Vol 1 164}}\n\nWith his newly gained powers, vastly improved defenses and speed, he relatively easily defeated the superheroes, while boasting that he was the strongest mortal that ever lived. He did found limitations as he was unable to crumple [[Captain America's Shield]]. Meanwhile uptown at Nefaria's laboratory, Professor Sturdy crawled out of the wreckage, the machinery they built for Project N was completely destroyed; the Lethal Legion were arrested by the [[New York City Police Department (Earth-616)|NYPD]].{{r|Avengers Vol 1 165}}\n\nNefaria eager to test his might barraged into the mansion and desired a real fight, so he wanted them to summon [[Thor Odinson (Earth-616)|Thor]]. Beating the Avengers handily again, Nefaria was attacked by the God of Thunder himself.{{r|Avengers Vol 1 165}} Their prolonged fight was interrupted by Sturdy, who crashed his car into a nearby building. When Nefaria is about to hit Sturdy, Sturdy deceived him by purporting the count was aging rapidly and would die in two days, however, this was a complete fabrication, Nefaria was virtually immortal and this point. This caused Nefaria to panic as he was terrified of death. Following another fight that staggered Nefaria, Vision nosedived into him knocking him out. In the aftermath, just before his death, Professor Sturdy revealed his ruse, the rapid aging was in reality just a temporary side-effect.{{r|Avengers Vol 1 166}}\n| Equipment               =\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1477699"
}