{
    "pageid": 1005416,
    "ns": 0,
    "title": "Protectors (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Totally Awesome Hulk Vol 1 15 Singh Variant Textless.jpg\n| ImageSize               = 250px\n| Name                    = Protectors\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = [[Jacob Oh (Earth-616)|Agent Jake Oh]], [[James Woo (Earth-616)|Jimmy Woo]], [[Kamala Khan (Earth-616)|Ms. Marvel]], [[Shang-Chi (Earth-616)|Shang-Chi]], [[Cindy Moon (Earth-616)|Silk]]\n| FormerMembers           = [[Amadeus Cho (Earth-616)|Hulk]]\n| Allies                  = [[Zaid Ahmed (Earth-616)|Zee Zee Ahmed]], [[Jeffrey Gunderblank (Earth-616)|Jeffrey Gunderblank]], [[Arnold Kovac (Earth-616)|Arnie Kovac]]\n| Enemies                 = [[Imperial Guard of Seknarf Seven (Earth-616)|Imperial Guard of Seknarf Seven]]\n\n| Origin                  = A group of Asian-American heroes who come together to protect a group of civilians from a dastardly alien abduction.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Greg Pak; Mahmud Asrar\n| First                   = Totally Awesome Hulk Vol 1 16\n| Last                    = \n\n| HistoryText             = The group of heroes that would become known as Protectors first met during a charity event to raise awareness for Asian-American bone marrow donation held in [[Manhattan]]. The group became fast friends and decided to hang out in Koreatown for the night. Their evening was interrupted by the arrival of the [[Imperial Guard of Seknarf Seven (Earth-616)|Imperial Guard]] of [[Seknarf Seven]].{{r|Totally Awesome Hulk Vol 1 15}}\n\nEven though the invaders were easily dealt with, the fight turned out to be a distraction which allowed the aliens to plant in the scene several spears that teleported the portion of ground the heroes and numerous bystanders were standing on, namely [[Herald Square]], light-years away from [[Earth]] and close to Seknarf Seven. When the prince regent of Seknarf Seven [[Phalkan (Earth-616)|Phalkan]] revealed his intention to use the individuals abducted as a food colony, the heroes decided to officially band together as a team to defend the innocent people trapped with them, becoming their Protectors.{{r|Totally Awesome Hulk Vol 1 16}}\n\nAfter Phalkan gave the humans six hours before he returned to take three of their numbers, they started to device a plan to fight back. While [[Arnold Kovac (Earth-616)|Arnie Kovac]], [[Zaid Ahmed (Earth-616)|Zee Zee Ahmed]], [[Jake Oh (Earth-616)|Jake Oh]] and [[Amadeus Cho (Earth-616)|Amadeus Cho]] tinkered with the devices that provided atmosphere and gravity to the piece of floating land, the rest worked on retrofitting a van into a bunker for the children and creating Molotov cocktails.\n\nThe aliens returned early, having figured out that the humans were up to something. The Protectors fought back, damaging Phalkan's ship with the Molotov's and striking at his Imperial Guard, which prompted Phalkan to disable the gravity generator. Phalkan then gave the humans five minutes to present the offering or he would shut down the atmosphere generator. Amadeus, Jake and [[James Woo (Earth-616)|Jimmy Woo]] offered themselves. However, their offering turned out to be a ruse to catch the aliens off-guard. The humans had managed to repurpose energy from one of Phalkan's blasts to disrupt the shielding that kept Cho from Hulking-out, and had also gained control of the life support devices. After turning back on life support, they confronted the Imperial Guard.{{r|Totally Awesome Hulk Vol 1 17}}\n\nThe Imperial Guard focused their efforts on taking down the Hulk, but their armors were fried when he unleashed a blast of gamma radiation after reaching the necessary level of anger. With the villains hindered, the rest of the humans started to fight back. [[James Woo (Earth-616)|Jimmy Woo]] even got close to killing Phalkan. Hulk stopped the fight, arguing they shouldn't stoop to their level. [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight]] forces subsequently arrived, after having received an S.O.S. from Woo earlier, and arrested Phalkan and the Imperial Guard.\n\nThe civilians were returned to Earth in Alpha Flight's ships, and Amadeus continued working on the teleported spears until he managed to teleport Herald Square back to Manhattan.{{r|Totally Awesome Hulk Vol 1 18}}\n\n===[[War of the Realms]]===\nEventually, due to their heroic actions, Jimmy Woo chooses the Protectors to join his team, [[Agents of Atlas (Earth-616)|The Agents of Atlas]]. {{r|War of the Realms: New Agents of Atlas Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1005416"
}