{
    "pageid": 1095416,
    "ns": 0,
    "title": "Puritans (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   =Puritans_(Earth-616)_from_Marvel_Team-Up_Vol_1_41_001.jpg\n| Name                    = Puritans\n| Aliases                 = \n\n| Leaders                 =\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public \n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Catholic Church (Earth-616)|Catholic Church]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[North America|Colonial America]], [[England]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                =\n| First                   = Journey into Mystery Vol 1 15\n\n| History                 = \n===Overview===\nThe '''Puritans''' were a group of [[English]] Reformed Protestants between the 16th and 18th century who sought to \"purify\" the Church of England from its \"[[Catholic Church (Earth-616)|Catholic]]\" practices.\n\n===16th Century===\nA Puritan soldier [[Solomon Kane (Earth-616)|Solomon Kane]] found a dying girl in rural [[France]], Solomon Kane swore to avenge her death by killing the murderer, the French bandit known as [[Le Loup (Earth-616)|Le Loup]]. He tracked him down to his hideout, slaying all of his gang, but Le Loup managed to escape{{r|Marvel Premiere #33}} to [[Africa]], where he became the blood brother of chieftain [[Le Loup (Earth-616)#Songa (Earth-616)|King Songa]]. Solomon eventually found Le Loup, killing him and the giantish [[Gulka (Earth-616)|Gulka the Gorilla Slayer]]{{r|Solomon Kane Vol 1 #1}}.\n\n===17th Century===\n[[File:Clan Akkaba (Earth-616) from X-Men Apocalypse vs. Dracula Vol 1 1 004.jpg|right|thumb|[[Clan Akkaba]] infiltrating the Puritanical [[Pilgrims]] voyage to the new world]]\nIn in 1620 A.D., the [[Pilgrims (Earth-616)|Pilgrims]] a separatist group of Puritans travelled aboard the [[Mayflower]], from [[Plymouth]] to the [[America|New World]].At least one member of the [[Clan Akkaba (Earth-616)|Clan Akkaba]] was on board the ship.{{r|X-Men: Apocalypse vs. Dracula #1}}\n\nAnother Pilgrim ship the [[Pandora]] was across the [[Atlantic Ocean]] to restart in the New World. One day their ship was swept in a whirlpool that was also a portal into the [[Negative Zone]]. They have spent the centuries fighting [[Annihilus (Earth-616)|Annihilus]] whom they view as the literal Biblical [[Devil]].{{r|Fantastic Four Vol 3 41}}\n\nIn 1626 A.D., the Puritans founded the town of [[Salem (Massachusetts)|Salem]], [[Massachusetts (State)|Massachusetts]]. \n\nThe immortal warrior [[Ulysses Bloodstone (Earth-616)|Ulysses Bloodstone]] travelled with the Puritans to the [[Americas]], where he found new threats including winged creature.{{r|Rampaging Hulk Vol 1 8}}{{r|Captain America Vol 1 357}} \n\n====[[English Civil War]]====\nIn 1640 A.D., The Puritanical ruler [[Oliver Cromwell (Earth-616)|Oliver Cromwell]] turned [[England]] into a Protestant republic.{{r|Marvel Atlas #1|; [[Ireland]]'s entry}} Allied with both Catholic and Royalist Irish allies, he led a re-conquest of [[Ireland]] in 1649.{{r|Marvel Atlas #1|; [[Ireland]]'s entry}}  Irish rebels rose up to oppose Cromwell's army.{{r|Amazing High Adventure Vol 1 1}} Cromwell and his forces would end up killing perhaps a third of the population of Ireland.{{r|Marvel Atlas #1|; [[Ireland]]'s entry}}\n\nIn 1686 A.D., a Puritan man in [[Salem (Massachusetts)|Salem]], [[Massachusetts (State)|Massachusetts]] asked a woman to marry him and is turned down so he plants evidence to get her condemned as a witch. They pursue her through the forest and the man hurts his leg so they leave him behind to pursue her. She returns to the man to get revenge and says \"So you called me a witch? Well, you were close!\" as she bares her [[vampire]] fangs.{{r|Journey into Mystery Vol 1 15}}\n\nIn 1691 A.D., [[Vlad Dracula (Earth-616)|Dracula]] reached out to the girl Charity Brown in Salem and asked her to call him master, offering her every desire. She agreed to let Dracula be her master and he marked her with his sign: a bat shaped mark on her breast. The Villagers discovered the mark and she was tried as a witch. When Dracula arrived he found her to have already to be executed, after that he decided to get revenge of the village. He turned another girl named Tituba and turned her into a vampire. She was then sent to orchestrate events that would lead to the '''Salem Witch Hunts'''.{{r|Dracula Vol 1 1}}\n\n===Salem Witch Trials===\n'''The trials were a series of hearings and prosecutions of people accused of [[witchcraft]] between 1692 A.D. to 1693 A.D. .These trials resulted in the executions many of the residents.'''\n\nIn 1692 A.D., [[Hiram Shaw (Earth-616)|Hiram Shaw]]  Earth's [[Sorcerers Supreme of the Marvel Universe|Sorcerer Supreme]] and Reverend of the town of Salem. He had took on the position after the last reverend was banished for witchcraft. His son was in a relationship with [[Abigail Harkness (Earth-616)|Abigail Harkness]], whom Hiram believed was a witch and thus disapproved. He forbade Obadiah from seeing her, but Obadiah disobeyed, believing that Abigail was innocent .One night, he was summoned by [[Dormammu (Earth-616)|Dormammu]]. Dormammu warned Shaw that his lust for power would damn his entire family for all time. He offered Shaw protection in exchange for Shaw's submission, but Shaw refused. When Shaw returned to Earth, he found his wife, [[Sarah Shaw (Earth-616)|Sarah Shaw]], was dead.Hiram blamed Abigail and had her arrested for witchcraft and murder. She was sentenced to death but Obadiah rescued her and the two escaped town. Hiram sent a pack of townsfolk after them. Abigail revealed that she was indeed a witch and killed the townspeople with a blast of fire. Only Hiram survived.{{r|X-Men: Hellfire Club #1}}\n\nDuring this time another woman is accused of being a witch by another who wishes to get even for being jilted by her former boyfriend. The boyfriend defends his new girlfriend against the accusations, but when he proposes, she turns him down. It turns out the accusations were true.{{r|Journey into Mystery Vol 1 58}}\n\nAnother woman is accused of being a witch. Her lover pleads her case and the jury finds her not guilty. While traveling to a minister to be wed, she is thrown from the carriage and injured. The man examines her and says she isn't seriously hurt but must be treated by a doctor within the hour to prevent it getting worse. She exclaims we can't get to a doctor in an hour. He says it is not impossible for someone who can ride a tree branch or broomstick. \"You still don't believe I'm not a witch, despite what you said in the courtroom!\" she cries, and he replies \"Nonsense! I know YOU'RE not the witch.\" as he hops on the tree branch and speeds away.{{r|Amazing Adult Fantasy Vol 1 7}} \n\nIn 1692 A.D.,  [[Cotton Mather (Earth-616)|Cotton Mather]] a witch-Hunter living in Salem was given mystical powers by the [[Dark Rider (Earth-616)|Dark Rider]].{{r|Marvel Team-Up #42}} He traveled to the future, captured the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] and returned her to the past with him. They were pursued by [[Spider-Man (Peter Parker)|Spider-Man]] and the [[Vision (Earth-616)|Vision]] who prevented her execution at the hands of Salem's villagers,{{r|Marvel Team-Up #41}} but were captured by Mather and the villagers of Salem. He then contacted the Dark Rider, but their meeting was interrupted by Spider-Man and Vision who had escaped from prison as well as [[Victor von Doom (Earth-616)|Doctor Doom]] who had traveled to the past as well.{{r|Marvel Team-Up #42}} Mather believed him to be an angel, but was knocked away by a disgusted Doom.{{r|Marvel Team-Up #43}} The Dark Rider captured Doom, and Mather assisted him in draining his energies. The Rider then demanded he stab the Scarlet Witch, but he was interrupted by [[Heather Douglas (Earth-616)|Moondragon]]. After they were defeated, Mather attempted to tell the people of Salem what had happened, but everyone believed himm to be insane.{{r|Marvel Team-Up #44|45}}\n\n===18th Century===\nThe [[Sanctum Sanctorum]] was once a lair of a Puritan witchfinder who tortured immigrants in the basement.{{r|Doctor Strange Vol 4 2}}\n\nIn pre-[[American Revolutionary War|Pre-revolutionary America]]. a young [[Jonas Graymalkin (Earth-616)|Jonas Graymalkin]] was coming to turn with his own issues when he realized he was gay. Meeting another boy in his family's barn one day, he was discovered by his father [[Charles Graymalkin (Earth-616)|Charles]] a strict puritanical religious man, who believed his son to be an abomination, a spawn of the [[devil]]. Beating Jonas nearly to death, his father then sought to bury him alive in the nearby woods. This burial triggered his mutant powers, allowing him to survive some 200 years underground before being unearthed in the modern era.{{r|X-Men: Manifest Destiny #3}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Historical Organizations]]\n[[Category:Protestant Characters]]\n[[Category:British Organizations]]\n[[Category:American Organizations]]\n[[Category:Protestantism]]"
                }
            }
        }
    ],
    "page_id": "1095416"
}