{
    "pageid": 763896,
    "ns": 0,
    "title": "Purple Children (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Purple Children (Earth-616) from Daredevil Vol 4 9.jpg\n| ImageSize               = 250px\n| Name                    = Purple Children\n| EditorialNames          = \n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[San Francisco]]\n\n| Leaders                 = Formerly [[Zebediah Killgrave (Earth-616)|Purple Man]]\n| CurrentMembers          = \n| FormerMembers           = Joe, Jamie, Connor, Shallah, an unnamed girl\n| Allies                  = \n| Enemies                 = [[Matthew Murdock (Earth-616)|Daredevil]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mark Waid; Chris Samnee\n| First                   = Daredevil Vol 4 8\n| Last                    = \n\n| HistoryText             = The Purple Children were the offspring of the villain known as the [[Zebediah Killgrave (Earth-616)|Purple Man]] with different women over the years. He would get those women pregnant, after making them fall in love with him using his powers, and would later abandon them and make them tell no one.\n\nOver the years, Purple Man (Zebediah Killgrave) kept track of them, and finally decided to gather them one by one. Zebediah hoped he could rule countries with his children and finally know unconditional love. After recovering the fifth son, Jamie, the Purple Children were powerful enough to unite their wills and stand up against their father. Using their mind-control powers inherited from their father, they forced Purple Man to walk in front of a train and kill himself. With no one to control them, the Purple Children set out to do whatever they wanted.{{r|Daredevil Vol 4 8}}\n\nThey wreaked havoc in [[San Francisco]], and caught [[Matthew Murdock (Earth-616)|Daredevil]]'s attention after stealing a police car. He managed to stop them, but they soon used the crowd nearby to oppose the vigilante. When the [[San Francisco Police Department (Earth-616)|SFPD]] arrived at the scene, they controlled the officers into shooting Daredevil, and used the confusion to escape. They were soon afterwards pinned down by him, but they used their powers to emotionally assault Daredevil, subduing him and causing the hero fall in a gutter.{{r|Daredevil Vol 4 9}}\n\nThe Purple Children targeted an arcade next, where they used their powers to take absolute control of the place. Their father, who had survived the train-hit thanks to his healing factor, followed them, and stealthily started taking them down, one by one. Daredevil managed to save the children, and help the police officers surrounding the arcade enter by turning up the volume of the music, so Purple Man's commands wouldn't be heard. The children were separated and taken to different locations; some had families where to go, and others didn't. Due to being separated and out of each other's \"sphere of influence\", they started reverting back to normal.{{r|Daredevil Vol 4 10}}\n\nHaving escaped custody, Killgrave started kidnapping the Purple Children in order to serve as batteries for a machine capable of extending his reach to a global level. The last two children managed to reach Daredevil and ask him for help. When they tracked down Killgrave, the children rushed into action, unwittingly giving away their presence, which allowed him to take control of Daredevil.{{r|Daredevil Vol 5 17}} By facing his inner demons, Daredevil broke free of the Purple Man's control and beat him up.{{r|Daredevil Vol 5 19}} In a misguided attempt to reward Daredevil, the Purple Children used their father's machine to make the entire world forget his secret identity. They escaped, and left the Purple Man tied up.{{r|Daredevil Vol 5 20}}\n\n==Powers and Abilities==\n===Powers===\nThe powers of the Purple Children are activated once they are touched by somebody with their abilities. Once touched, they change their skin color and hair to a purple tone.\n\n'''[[Mind Control via Pheromones]]:''' Similarly to their father, each Purple Children can control other individuals by releasing pheromones in the vicinity. Then, they can control the individual's actions either with words or telepathically.{{r|Daredevil Vol 4 8}}\n\n'''[[Empathy]]:''' Unlike their father, the Purple Children can blast their primal kid emotions and make people feel whatever they want. When confronting Daredevil, the use of this ability caused him to relive the tragedies of his life.{{r|Daredevil Vol 4 9}}\n\n===Weaknesses===\nIf they're kept separated from each other, the Purple Children lose their powers. Additionally, they leave a \"spoor of emotion\" which can be tracked by somebody with their abilities, like their father.{{r|Daredevil Vol 4 10}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = Joe is the biggest of the Purple Children and appears to be of African descent. Connor is the smallest. Jamie is the middle son. Shallah is the blonde. The name of the brunette Asian girl is unknown.\n===Possible Status as Mutants===\n* [[Kara Killgrave (Earth-616)|Kara Killgrave]], their older half-sibling, is a [[Homo superior|mutant]],{{r|X-Men: The 198 Files #1}} possessing the powers and skin mutation of [[Zebediah Killgrave (Earth-616)|her father]]. It is unknown if the Purple Children share this genetic make-up with her.\n* A few statements could imply that they are indeed mutants, but nothing definitive has been clearly stated:\n** [[Matthew Murdock (Earth-616)|Murdock]] said that they are the ''\"next evolutionary step\"'',{{r|Daredevil Vol 4 9}} a term often used for mutants.\n** He later said that he made calls to a school that specializes in ''\"Gifted Youngsters\"'',{{r|Daredevil Vol 4 10}} which one could reasonably assume to be the [[Jean Grey School For Higher Learning]], formerly the [[Xavier's School for Gifted Youngsters]].\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Collaboration]]\n[[Category:Killgrave Family]]\n[[Category:Wikify]]\n[[Category:Mind Control]]\n[[Category:Pheromones]]\n[[Category:Possible Mutants]]"
                }
            }
        }
    ],
    "page_id": "763896"
}