{
    "pageid": 285842,
    "ns": 0,
    "title": "Raiders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Raiders (Earth-616) from Tony Stark Iron Man Vol 1 6 001.jpg\n| ImageSize               = 250px\n| Name                    = Raiders\n| Aliases                 = \n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[David Gomez (Earth-616)|David Gomez]]\n| Allies                  = [[Kearson DeWitt (Earth-616)|Kearson DeWitt]], [[Edwin Cord (Earth-616)|Edwin Cord]] \n| Enemies                 = [[Anthony Stark (Earth-616)|Iron Man]], [[Avengers West Coast (Earth-616)|West Coast Avengers]]\n\n| Origin                  = Mercenary team outfitted by [[Edwin Cord (Earth-616)|Edwin Cord]]'s company [[Cordco (Earth-616)|Cordco]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = David Michelinie; Bob Layton; John Romita Jr.\n| First                   = Iron Man Vol 1 145\n\n| HistoryText             = The Raiders were a group of three mercenaries employed by [[Edwin Cord (Earth-616)|Edwin Cord]], head of [[Cordco (Earth-616)|Cordco]] and a corporate rival of [[Stark Industries (Earth-616)|Stark Industries]]. Each was given a battle armor with which Cord intended to recover from the disaster of his previous [[Mauler Armor]]. They were first seen during the 24th annual Conclave of Electronics Engineers and Innovators in [[Dallas]], [[Texas (State)|Texas]]. At the event organizations such as Cordco, [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D]], [[Cross Technological Enterprises (Earth-616)|C.T.E.]] and [[Roxxon Energy Corporation (Earth-616)|Roxxon Oil Corporation]] showed the latest development in technology.\n\nCord knew that [[Anthony Stark (Earth-616)|Iron Man]], as Stark's bodyguard, would follow him to the trade show, and used this opportunity to demonstrate the capabilities of the Raider suits to S.H.I.E.L.D.. Under orders of Edwin Cord, the Raiders attacked the technology trade show and cause property damage until the arrival of Iron Man and [[Scott Lang (Earth-616)|Scott Lang]]. The Raiders skirmished with Iron Man for a moment, with one of the Raiders using acid to damage the hero's armor. During a second battle at a live boxing match, Iron Man defeated all three Raiders. The Raiders were tricked when Iron Man used his image inducer to create holograms of himself to distract all three of them. Iron Man sucker punched the group and took the fight outside where there would be a less chance of harming innocent people. After an intense battle, Iron Man prevailed and all three Raiders were apprehended. Cord later showed a film of the Raiders' exploits to S.H.I.E.L.D Agent Burke to try and get a weapons contract they formerly offered to Stark, but they were aghast at Cord's illegal means and arrested him.{{r|Iron Man Vol 1 145}}\n\nThe Raiders reappeared with upgraded suits during the [[Armor Wars]]. Tony discovers his armor designs had been stolen and decided to retrieve or neutralize the technology, leading to a brief confrontation with the Raiders, in which their suits are rendered defunct. {{r|Iron Man Vol 1 225}}\n\nWhen the [[Avengers West Coast (Earth-616)|Avengers West Coast]] battled [[Kearson DeWitt (Earth-616)|Kearson DeWitt]], members [[Clinton Barton (Earth-616)|Hawkeye]], [[Simon Williams (Earth-616)|Wonder Man]] and [[Miguel Santos (Earth-616)|Living Lightning]] defended Stark Enterprises against the invading Raiders, [[Seekers (Earth-616)|Seekers]] and [[Hunters (Earth-616)|Hunters]].{{r|Iron Man Annual Vol 1 13}} The Raiders were later part of an army of armor-wearing mercenaries hired to attack [[Stark Enterprises]].{{r|Avengers: West Coast Annual Vol 1 7}}\n\nThe Raiders resurfaced years later during the worldwide release of Tony Stark's latest invention, the [[Project eScape|eScape]]. The Raiders intercepted a truck transporting eScape merchandise, but they were stopped by the combined effort of Iron Man, [[Janet Van Dyne (Earth-616)|Wasp]] and [[James Rhodes (Earth-616)|Jim Rhodes]].{{r|Tony Stark: Iron Man Vol 1 6}}\n\n| Powers                  =\n\n| Equipment               = '''Raider Armor:''' Each of the Raider suits provide the wearer with greater durability and flight, and offer varying weapons systems: \n* '''Raider 1:'''  is equipped with wristbands that can generate bullets; acid and lasers.\n* '''Raider 2:''' is equipped with a net capable of siphoning energy and a protective shield that absorbs energy attacks.\n* '''Raider 3:'''  has two wrist weapons that project and amplify sonic waves in concentrated form.\n\n}}"
                }
            }
        }
    ],
    "page_id": "285842"
}