{
    "pageid": 1088937,
    "ns": 0,
    "title": "Rampart (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Rampart (Earth-616) from Captain America Vol 1 695 001.jpg\n| Name                    = Rampart\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = Formerly [[Maximillian Babbington (Earth-616)|Maximillian Babbington]]\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Sergei Kravinoff (Earth-616)|Kraven the Hunter]] \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Mark Waid; Chris Samnee\n| First                   = Captain America Vol 1 695\n\n| History                 = The Rampart was a white supremacist militia that attempted to take over [[Bouton County]], [[Nebraska (State)|Nebraska]]. They started by seizing control of a police station in [[Captain America (Town)|Burlington]], but were stopped by [[Steven Rogers (Earth-616)|Captain America]].\n\nTen years later, the Rampart planned to resurface during the festivities for the 10th Annual Captain America Celebration. They were almost immediately stopped once again by Captain America, who had gotten intel about the Rampart's return.{{r|Captain America Vol 1 695}} However, the Rampart's plan ran deeper than Captain America knew. They had managed to arm themselves with hundreds of warheads, and planned to launch them on against their own nation.{{r|Captain America Vol 1 698}} Before executing their plan,{{r|Captain America Vol 1 700}} the Rampart hired [[Sergei Kravinoff (Earth-616)|Kraven the Hunter]] to lure Captain America to them. The villainous group then used an ice ray to freeze him, with the intention to keep him as a trophy.{{r|Captain America Vol 1 697}}\n\nThe Rampart would succeed in deploying the warheads, killing nine-tenths of America's population and using the ensuing panic to usurp the government, becoming the elitist tyrant rulers of a post-nuclear wasteland. Seven years following the Rampart's victory, Captain America would've been woken up from the ice by the resistance.{{r|Captain America Vol 1 698}} After liberating America from the Rampart,{{r|Captain America Vol 1 699}} Captain America found the impossible job of holding together what remained of the nation. Using a time machine built by Bruce Banner derived from the [[Baxter Building]]'s technology, Captain America returned right before the Rampart launched the nuclear attack.\n\nThe Captain America from the future stopped the nuclear launch at the cost of his life, destroying the Rampart's submarine base and liberating his present-self from the ice in the process. With no idea of how the Rampart's plan was foiled, the Captain America from the present salvaged enough intel from the wreckage to track down what were potentially all of the Rampart's cells.{{r|Captain America Vol 1 700}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "1088937"
}