{
    "pageid": 1045853,
    "ns": 0,
    "title": "Red Room (Secret Empire) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Secret Empire Uprising Vol 1 1 Albuquerque Variant Textless.jpg\n| ImageSize               = 250px\n| Name                    = Red Room\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly [[Natalia Romanova (Earth-616)|Black Widow]]\n| CurrentMembers          = \n| FormerMembers           = [[Natalia Romanova (Earth-616)|Black Widow]], [[Champions (Earth-616)|Champions]] ([[Amadeus Cho (Earth-616)|Hulk]], [[Miles Morales (Earth-1610)|Spider-Man]], [[Vivian (Synthezoid) (Earth-616)|Viv]]), [[Joaquín Torres (Earth-616)|Falcon]], [[Riri Williams (Earth-616)|Ironheart]], [[Nadia Van Dyne (Earth-616)|Wasp]]\n| Allies                  = [[Ophelia Sarkissian (Earth-616)|Viper]], [[Morris Sackett (Earth-616)|Mosaic]]\n| Enemies                 = [[Hydra (Earth-616)|Hydra]]\n\n| Origin                  = \n| PlaceOfFormation        = Somewhere in [[Colorado (State)|Colorado]]\n| PlaceOfDissolution      = [[Washington, D.C.]]\n| Creators                = Nick Spencer; Andrea Sorrentino\n| First                   = Secret Empire Vol 1 2\n| Last                    = Secret Empire Vol 1 10\n\n| HistoryText             = After [[Steven Rogers (Earth-61311)|a twisted fascist version]] of [[Steven Rogers (Earth-616)|Captain America]] allowed [[Hydra (Earth-616)|Hydra]] [[S.H.I.E.L.D. Helicarriers|Helicarriers]] to destroy [[Las Vegas]] due to activity from the [[Underground (Secret Empire) (Earth-616)|Underground]], [[Natalia Romanova (Earth-616)|Black Widow]] felt that the only course of action now was to kill Rogers so that acts like what happened in Las Vegas weren't repeated. Widow initially struck out on her own, but she was approached by members of the [[Champions (Earth-616)|Champions]] ([[Amadeus Cho (Earth-616)|Hulk]], [[Miles Morales (Earth-1610)|Spider-Man]], and [[Vivian (Synthezoid) (Earth-616)|Viv]]), as well as [[Joaquín Torres (Earth-616)|Falcon]], [[Riri Williams (Earth-616)|Ironheart]], and [[Nadia Van Dyne (Earth-616)|Wasp]], who wanted to help her to ensure the vision of Miles Morales killing Rogers didn't come to pass. Widow eventually agreed to their help.{{r|Secret Empire Vol 1 2}}\n\nWidow began training the young heroes in tactics and in espionage through possible scenarios conducted in virtual simulations,{{r|Secret Empire Vol 1 3}} and by infiltrating the [[Hydra Youth Choir (Earth-616)|Hydra Youth Choir]].{{r|Secret Empire: Uprising Vol 1 1}} The young heroes increasingly began to question Widow's methods especially when she tortured a Hydra agent to get information out of him. The Champions advocated mercy for the Hydra agent. Widow agreed and started untying him from the chair he was tied to, but Widow was forced to kill him when he suddenly attacked with a concealed knife.{{r|Secret Empire Vol 1 4}}\n\nWhile the teenagers conducted a rescue mission to free [[Morris Sackett (Earth-616)|Mosaic]] from Hydra, Widow allowed herself to be captured by [[Ophelia Sarkissian (Earth-616)|Viper]] so she could blackmail into helping her assassinate Steve Rogers. Viper eventually agreed to help Widow. Widow then received word from the young heroes they found their target: a frail old man barely clinging to life. The heroes expressed doubt that the man was their target, but Widow assured them that he was.{{r|Secret Empire Vol 1 5}}\n\n[[Nadia Van Dyne (Earth-616)|Wasp]] almost left the team out of indignation over the way Black Widow had been manipulating her and others and compared it to her own experiences in the [[Black Widow Ops Program (Earth-616)|Red Room]]. Wasp was ultimately convinced to remain by her teammates. When Black Widow heard over a radio of the destruction of the Mount and that there were no survivors, she mistakenly believed that everyone in the Underground had been killed. She angrily told her trainees that Hydra had killed their friends and that they were going to kill Steve Rogers.{{r|Secret Empire Vol 1 6}}\n\nLater, Widow positioned herself in the ruins of the [[Capitol Building]] as Rogers headed a ceremony ready to shoot him dead with a sniper rifle while the others were among the crowd to provide intel. Mosaic took possession of Hydra guards to neutralize them. To make sure Spider-Man didn't intervene, Widow locked him in her van, telling him that she didn't want him to become a murderer. Before Widow could kill Rogers, she was attacked by the [[Frank Castle (Earth-616)|Punisher]]. She managed to subdue him, but then she spotted Spider-Man confronting Rogers after escaping from the van. Widow tried to stop Spider-Man's and Rogers' fight and was struck in the neck by Rogers' shield, killing her almost instantly. Spider-Man exploded in rage and brutally beat Rogers. He almost killed Rogers but was talked down by Wasp from doing so. The members of the Red Room were then arrested by Hydra forces while Rogers was carried away.{{r|Secret Empire Vol 1 7}}\n\nWhen a contingent of superheroes launched a desperate attack on Hydra, Hydra allies [[Anthony Masters (Earth-616)|Taskmaster]] and [[Eric O'Grady (LMD) (Earth-616)|Black Ant]] recognized that Hydra was about fall. The pair chose to switch sides and free the Red Room from their prison cell to be in the heroes' good graces. The Red Room fled to join their fellow heroes in the fight against Hydra, but not before Spider-Man webbed Taskmaster's and Black Ant's faces to a wall.{{r|Secret Empire Vol 1 9}}\n\nHydra was eventually defeated when the true Steve Rogers appeared and defeated the Hydra Steve Rogers. With Hydra defeated, the Red Room disbanded.{{r|Secret Empire Vol 1 10}}\n\n| Equipment               = [[Bio-Synthetic Wings]], [[Black Widow's Gauntlets]], [[Ironheart Armor Model 2]], [[Spider-Man's Suit]], [[Wasp's Suit]], [[Web-Shooters]]\n| Transportation          = A van equipped with advanced technology\n| Weapons                 = Handguns\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1045853"
}