{
    "pageid": 403454,
    "ns": 0,
    "title": "Red Right Hand (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Red Right hand 004.jpg\n| Name                    = Red Right Hand\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = Unknown\n\n| Leaders                 = [[Founder (Red Right Hand) (Earth-616)|The Founder]] (formerly)\n| CurrentMembers          = unnamed members \n| FormerMembers           = [[Roger (Red Right Hand) (Earth-616)|The Husband]], [[Founder (Red Right Hand) (Earth-616)|The Founder]], [[Old Woman (Red Right Hand) (Earth-616)|The Old Woman]], [[Ninja (Red Right Hand) (Earth-616)|The Ninja]], [[Son (Red Right Hand) (Earth-616)|The Son]], \n| Allies                  = [[The Mongrels (Earth-616)|Mongrels]]; [[Raven Darkholme (Earth-616)|Mystique]], [[Black Samurai (Team) (Earth-616)|Black Samurai]], [[Akihiro (Earth-616)|Daken]], [[Lord Deathstrike (Earth-616)|Lord Deathstrike]] \n| Enemies                 = [[James Howlett (Earth-616)|Wolverine]], his family and friends\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Jason Aaron; Renato Guedes\n| First                   = Wolverine Vol 4 #1\n| Last                    = Wolverine Vol 4 #14\n\n| HistoryText             = \n===Origin===\nThe Red Right Hand was a criminal organization created by people whose lives had been tragically affected by [[James Howlett (Earth-616)|Wolverine]] in some way or another. The organization was created by a man only known as [[Founder (Red Right Hand) (Earth-616)|The Founder]]. Through the years, The Founder recruited several members who likewise had a personal vendetta against [[James Howlett (Earth-616)|Wolverine]]. \n\nThe Organization decided that the worst punishment for the seemingly un-killable Wolverine was to send his soul to Hell. The [[Roger (Red Right Hand) (Earth-616)|Husband]] was approached by a demon which he made a deal with in exchange for letting the demon possess Wolverine body. The creature became [[Hellverine (Earth-616)|Hellverine]] and decided to track down each of Wolverine’s friends and family to kill them one-by-one. \n\nWhen The Founder created this criminal organization, [[Akihiro (Earth-616)|Daken]] discovered its existence and joined them in order to help them get their revenge against Wolverine.{{r|Daken: Dark Wolverine Vol 1 1}}{{r|Wolverine Vol 4 11}} To that end, Daken decided to find his father’s children all around the world through the years, he then gave them to the Red Right Hand and on his advice, the criminal organization trained them in order to use them as weapons against Logan. Daken knew  that they wouldn't stand a chance against Logan but having his father killing them would hurt him in the worst way possible. Those children would be known as the [[Mongrels (Earth-616)|Mongrels]].{{r|Wolverine Vol 4 14}}\n\n===Quest for Revenge===\nThe Mongrels became the organization's most trusted and loyal enforcers and was composed of [[William Downing (Earth-616)|Gunhawk]], [[Shadow S. (Earth-616)|Shadow S.]], [[Fire Knives (Earth-616)|Fire Knives]], [[Saw Fist (Earth-616)|Saw Fist]], and [[Cannon Foot (Earth-616)|Cannon Foot]]. After the Red Right Hand hired [[Raven Darkholme (Earth-616)|Mystique]] to help them send Wolverine's soul to [[Hell]],{{r|Wolverine Vol 4 5}} the team tracked down Wolverine's current girlfriend, [[Melita Garner (Earth-616)|Melita Garner]] and found her working in the San Francisco Post building. \n\nThe team headed into the building taking out the security on the way. When they found Melita and attacked they were shocked to find her with a Skrull sonic disruptor, which she proceeded to fire at the team. But Melita was saved by Mystique, who decided to betray the Red Right Hand after she learned that they intended to have Logan kill his own children. Thanks to her help, Melita got away from the Mongrels and Gunhawk returned to report to the The Red Right Hand their failure and Mystique's betrayal, it was then decided they were to proceed to their next target in [[Madripoor]].\n      \nGunhawk and the team arrived in Madripoor and traveled through the city to find the [[Princess Bar]]. They entered and massacred the bouncers and staff, but [[Jessán Hoan (Earth-616)|Tyger Tiger]] intervened when Gunhawk tried to open a certain door. Gunhawk told Tyger that “Logan is in hell” and burned down the room filled with mementos and possessions which Wolverine had accumulated over his long lifetime. Tyger asked why they are doing this but all Gunhawk would say was Wolverine has made his and the rest of the team's lives a living hell.  \n\nThe Red Right Hand decided to take care of Mystique for her betrayal and sent Hellverine after her to, but Mystique escaped. Hellverine also confronted Daken after he refused to kill Mystique, but the demon let him live while the rest of world believed he was dead.{{r|Daken: Dark Wolverine Vol 1 2|3}}  Afterwards bothe Hellverine and the Red Right Hand went after a list of other targets such as [[John Wraith (Earth-616)|John Wraith]], [[X-Men (Earth-616)|the X-Men]], [[Yukio (Earth-616)|Yukio]], [[Amiko Kobayashi (Earth-616)|Amiko Kobayashi]], Wolverine's clone [[Laura Kinney (Earth-616)|X-23]], and fellow [[Team X (Earth-616)|Team X]] member [[Christopher Bradley (Earth-616)|Maverick]].{{r|Wolverine Vol 4 3}} Most of them survived except for the Silver Samurai who was killed by the Red Right Hand's army,{{r|Wolverine Vol 4 1}} and John Wraith who was killed by Hellverine.{{r|Wolverine Vol 4 1}}\n\n===Final Revenge===\nAfter Wolverine escaped from Hell and banished Hellverine,{{r|Wolverine Vol 4 8}} he killed Mystique,{{r|Wolverine Vol 4 9}} and was lured to the Red Right Hand's base in Mexico where they pitted him one-by-one against the members of the Mongrels.{{r|Wolverine Vol 4 10}} Despite what they did to his friends, Wolverine gave each one of them a chance to surrender peacefully but the Mongrels attacked him on sight and tried to kill him. As a result Wolverine killed most of them,{{r|Wolverine Vol 4 10}}{{r|Wolverine Vol 4 11}}{{r|Wolverine Vol 4 13}} while the others killed themselve;{{r|Wolverine Vol 4 12}} after defeating the leader of the Mongrels, [[William Downing (Earth-616)|Gunhawk]], Logan confronted the members of the Red Right Hand.{{r|Wolverine Vol 4 13}} But the Red Right Hand's final revenge against Wolverine was to deny him his own revenge against them, to that end each member committed suicide, leaving Wolverine with only a message: the Mongrels were his children, this revelation and the fact that he killed his own children devastated Logan.{{r|Wolverine Vol 4 14}} \n\nThe members of the Red Right Hand then went to hell were they were greeted by their dead loved ones, except for [[Son (Red Right Hand) (Earth-616)|The Son]].{{r|Wolverine Vol 4 14}} \n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "403454"
}