{
    "pageid": 908998,
    "ns": 0,
    "title": "Redfield Electronics (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = \n| Name                    = Redfield Electronics\n| Aliases                 = \n\n| Leaders                 = [[James Redfield (Earth-616)|Jim Redfield]]\n| CurrentMembers          = \n| FormerMembers           = [[Paul Conklin (Earth-616)|Paul Conklin]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Code: Blue (Earth-616)|Code: Blue]] \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Manhattan]], [[New York City]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Roy Thomas; Larry Alexander\n| First                   = Thunderstrike Vol 1 14\n  \n\n| History                 = Redfield Electronics is a company owned by [[James Redfield (Earth-616)|Jim Redfield]]. They specialized in advanced electronic equipment.{{r|Thunderstrike Vol 1 14}} \n\nThe [[Thermal Man (Earth-616)|Thermal Man]] was appropriated by Redfield Electronics, who saw in it the potential for a powerful new weapon. Redfield were able to create a tape of everything the Thermal Man's sensors had seen. Jim Redfield had his company rebuild the Thermal Man, installing an experimental engine, so he could resell it to the Pentagon and keep his company afloat.{{r|Thunderstrike Vol 1 14}} [[Paul Conklin (Earth-616)|Paul Conklin]], who was chief engineer on the project, objected to testing it even on a limited basis. But test it they did, and the Thermal Man was now able to absorb energy, and quickly regained full power, broke his restraints, and once again, started killing scientists and destroyed the lab. Paul Conklin called his wife, Police Captain [[Shelley Conklin (Earth-616)|Shelley Conklin]], and asked her to send in her [[Code: Blue (Earth-616)|Code: Blue]] unit to halt the Thermal Man. She frantically agreed and ordered Code Blue to the scene, despite having been disbanded by the city. Code: Blue attacked with artillery rocket shells, but they had no effect. They tried freezing it with liquid nitrogen, but as it no longer had an atomic pile, this failed. [[Eric Masterson (Earth-616)|Thunderstrike]] arrived, but was only able to momentarily stalemate the Thermal Man, who continued his rampage around the building. Code: Blue received a present from [[Stark Industries (Earth-616)|Stark Industries]] the;  \"monomolecular [[adamantium]] wire\" which they handled with special gloves. While one end was tied down, Thunderstrike took the other end and sliced the Thermal Man at the knees, then decapitated the robot, like a ginsu knife through hot butter. The Thermal Man was finally laid to rest. Documents discovered on the premises revealed that Paul Redfield had secretly programmed the Thermal Man to run wild so he could collect the insurance on his business.{{r|Thunderstrike Vol 1 15}}\n\n| Equipment               = [[Thermal Man (Earth-616)|Thermal Man]]\n| Transportation          = \n| Weapons                 = \n| Notes                   = \n\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Companies]]"
                }
            }
        }
    ],
    "page_id": "908998"
}