{
    "pageid": 707266,
    "ns": 0,
    "title": "Riders of Doom (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Riders of Doom (Earth-616) from Ringo Kid Vol 1 19 001.jpg\n| Name                    = Riders of Doom\n| Aliases                 = Doom Riders\n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Captain Hillcroft, Captain Barclay, [[Raymond Parker (Earth-616)|Corporal Raymond Parker]], [[John Gilliam (Earth-616)|Private John Gilliam]]\n| Allies                  = \n| Enemies                 = [[Ringo Kid (Earth-616)|Ringo Kid]] \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Joe Maneely\n| First                   = Ringo Kid Vol 1 19\n| Last                    = Ringo Kid Vol 1 19\n\n| HistoryText             = The Riders of Doom consist of remaining members of the [[United States Army (Earth-616)|Union]] and [[Confederate States Army (Earth-616)|Confederate]] Armies that fought during the [[American Civil War]]. They consisted of the surviving members of the Twenty-First Regiment of the Union Army under the command of Captain Hillcroft, and the 105th Calvary of the Confederate Army under the command of Captain Barclay. They clashed in the badlands of the American Frontier and although they knew the Civil War eventually ended, they came to believe that they were discarded by their government and so the two armies banded together and began raiding nearby towns and became known as the Riders of Doom. Ironically enough, the Riders were unopposed by anyone due to the fact that both factions of the Riders were considered heroes of the war in the eyes of the citizens, lawmen, and soldiers in the area.{{r|Ringo Kid Vol 1 19}}\n\nEventually, the Riders of the Doom crossed paths with the outlaw hero known as the [[Ringo Kid (Earth-616)|Ringo Kid]]. Ringo did not like how they were raiding towns unopposed and clashed with them on their latest raid, sending them fleeing. Learning how nobody was standing up to them, the Ringo Kid rode out to the badlands where they were camped out. With scouts spotting him, the Ringo Kid was forced to face the best soldiers of each faction one-on-one and eventually won all the duels. When the Captains of the group told the Kid why they were raiding towns, the Kid convinced them that they were wrong and that the Untied States government has land waiting for them all, ending their raids and causing the group to disband.{{r|Ringo Kid Vol 1 19}}\n\n| Equipment               = \n| Transportation          = Horses.\n| Weapons                 = The Riders of Doom had access to weapons such as pistols, guns, and swords that were commonly used by the Union and Confederate Armies during the American Civil War.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "707266"
}