{
    "pageid": 122065,
    "ns": 0,
    "title": "S.H.I.E.L.D. Alpha Team (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = S.H.I.E.L.D. Alpha Team (Earth-616) from Iron Man Director of S.H.I.E.L.D. Vol 1 29 001.jpg\n| Name                    = S.H.I.E.L.D. Alpha Team\n| Aliases                 = Alphas\n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[S.H.I.E.L.D. Helicarrier]]\n\n| Leaders                 = [[Anthony Stark (Earth-616)|Iron Man]]\n| CurrentMembers          = \n| FormerMembers           = [[Bubba (Earth-616)|Bubba]], [[Agent Farrell (Earth-616)|Agent Farrell]], [[Agent Carstairs (Earth-616)|Agent Carstairs]], [[Agent Gomez (Earth-616)|Agent Gomez]], [[Agent Colletti (Earth-616)|Agent Colletti]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = A team hand picked by [[Anthony Stark (Earth-616)|Tony Stark]] during his tenure as Director of [[S.H.I.E.L.D.]] and outfitted with special high-tech armor.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Iron Man Vol 4 15\n| Last                    = Iron Man: Director of S.H.I.E.L.D. Vol 1 32\n\n| HistoryText             = Shortly after becoming the director of S.H.I.E.L.D., [[Anthony Stark (Earth-616)|Tony Stark]] formed a special, four-man team dubbed 'Alpha Team', and produced suits of highly advanced armor based on his own Iron Man suit. The Alpha Team was primarily used as a special-forces counter-terrorism unit, their first mission being stopping a terrorist cell which had taken a group of opera patrons hostage at the Sydney Opera House and armed with several canisters of Venox gas. The team was successful in eliminating each member of the cell, but the last member activated one of the gas bombs, and Iron man was forced to grab it, taking it to a [[Stark Industries]] owned vessel a short distance off the coast and detonating it safely in the ship's decompression chamber. While his participation in the operation was supposed to be limited to observation, [[Dum-Dum Dugan]] was upset by his personal involvement, saying that his presence undermined the team's autonomy. Eventually, however, Dugan came to accept Stark's methods.{{r|Iron Man: Director of S.H.I.E.L.D. Vol 1 29}}\n\nAlpha Team was next involved in an incident in Rumekistan involving the detonation of a number of \"fingernail nukes\" created by onetime business partner of Stark's, [[Nasim Rahimov (Earth-616)|Nasim Rahimov]]. Gomez was injured in the explosion of the first nuke, though his armor saved his life he was put out of commission. The team was later attacked by a group of hired mercenaries led by [[Paladin (Earth-616)|Paladin]], who, using a stun gun modified by Rahimov, was able to temporarily disable Stark's armor, leaving the remaining members of Alpha team to fend off the thugs on their own, which they were able (mostly) to do for a short time. After Stark reactivated his armor and easily disposed of Paladin, Coletti and Carstairs were sent to investigate the [[Overkill Horn|Overkill Mind]], which was attacking the Helicarrier at the time. The Overkill Mind was able to overload the Alpha's armor, killing both of them, and then invaded its computer systems, using the now lifeless soldiers to fend off Dugan's Flying Commandoes. Upon his arrival, Stark triggered his own override, shutting both armors down and having Dugan's team collect the bodies for burial.{{r|Iron Man: Director of S.H.I.E.L.D. Vol 1 31}} Stark was able to defeat the Overkill Mind and stop Rahimov, with Farrell aiding in evacuating civilians from the remaining nuke sites.\n\nWhile it was never confirmed, with half its number dead and Stark fired for [[Norman Osborn (Earth-616)|Norman Osborn]], Alpha Team is presumed to have been effectively disbanded. \n\n| Equipment               = Alpha Team Armor\n| Transportation          = [[S.H.I.E.L.D. Helicarrier]], [[Alpha Team Armor]]\n| Weapons                 = Stark Tactical Assault Repulsors (STARs)\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:S.H.I.E.L.D. Projects]]"
                }
            }
        }
    ],
    "page_id": "122065"
}