{
    "pageid": 12447,
    "ns": 0,
    "title": "Savage Land Mutates (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Savage Land Mutates (Earth-616) from X-Men Vol 1 62 0001.jpg\n| Name                    = [[Savage Land Mutates]]\n| Aliases                 = [[Beast Brood]]\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Savage Land]], [[Antarctica]]\n\n| Leaders                 = [[Brainchild (Earth-616)|Brainchild]]; formerly [[Max Eisenhardt (Earth-616)|Magneto]], [[Zala Dane (Earth-616)|Zaladane]]\n| CurrentMembers          = [[Amphibius (Earth-616)|Amphibius]], [[Barbarus (Earth-616)|Barbarus]], [[Brainchild (Earth-616)|Brainchild]], [[Gaza (Earth-616)|Gaza]], [[Leash (Earth-616)|Leash]], [[Lani Ubanu (Earth-616)|Lorelei]], [[Lupa (Savage Land Mutate) (Earth-616)|Lupa]], [[Lupo (Earth-616)|Lupo]], [[Piper (Savage Land Mutate) (Earth-616)|Piper]], [[Karl Lykos (Earth-616)|Sauron]], [[Whiteout (Earth-616)|Whiteout]], [[Worm (Savage Land Mutate) (Earth-616)|Worm]]\n| FormerMembers           = [[Equilibrius (Earth-616)|Equilibrius]], [[Vertigo (Savage Land Mutate) (Earth-616)|Vertigo]]\n| Allies                  = \n| Enemies                 = [[Avengers (Earth-616)|Avengers]], [[New Avengers (Earth-616)|New Avengers]], [[New Mutants (Earth-616)|New Mutants]], [[X-Men (Earth-616)|X-Men]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Roy Thomas; Neal Adams\n| First                   = X-Men Vol 1 62\n| Last                    = \n\n| HistoryText             = \n\nEarly in his supervillain career, the mutant [[Max Eisenhardt (Earth-616)|Magneto]] created a headquarters in the [[Savage Land]], a tropical jungle existing within [[Antarctica]]. Finding mutations that occurred easily in this land due to high levels of radiation, Magneto assembled various natives from tribes all over the Savage Land and, calling himself \"the Creator,\" subjected them to experiments that greatly enhanced their physiology, creating the Savage Land Mutates.{{r|X-Men #62}}\n\nWhen the superhero team of mutants, the X-Men, were exploring the Savage Land, the Mutates battled the X-Men and the Savage Land protector known as  [[Kevin Plunder (Earth-616)|Ka-Zar]]. Revealing the Creator as Magneto, the X-Men were captured until [[Jean Grey (Earth-616)|Jean Grey]] ultimately destroyed Magneto's headquarters and machines, burying Magneto under the debris and reverting the mutates back to their non-superhuman state.{{r|X-Men #63}}\n\nFor reasons that remain unknown, the Mutates reverted to their superhuman forms and captured scientists hoping to create other Mutates. The superhero team of Avengers with their Asgardian ally, Sif, searched for the scientists and defeated the Mutates, who were remanded to the custody of the nearest legal authorities, in Chile.{{r|Avengers #105}}\n\nLater, Magneto and the Mutate known as Piper captured several of the X-Men and the Avengers, before escaping capture when the Avenger Vision turned the tables on them.{{r|Avengers #110|111}}\n\nThe [[Warren Worthington III (Earth-616)|Angel]] and his ally, [[Peter Parker (Earth-616)|Spider-Man]], later traveled to the Savage Land, searching for Karl Lykos, also known as the villain Sauron. They, along with Ka-Zar, encountered and were captured by some of the Savage Land Mutates (Gaza, Barbarus, Vertigo, Amphibius and Brainchild, who had learned to use Magneto's machines for his own purposes.) Lycos managed to rescue his friends, but doing so freed his evil alter-ego of Sauron, who joined with Savage Land denizen [[Zala Dane (Earth-616)|Zaladane]] in leading the Mutates. The X-Men arrived to defeat the Mutates and free their friends, reverting Sauron to Lycos and the Mutates to their non-superhuman state once more.{{r|Marvel Fanfare #1|4}}\n\nApparently, the effect of the mutation-inducing technology that gave the Savage Land Mutates their powers causes them to eventually regain their superhuman forms should they lose them, since the Mutates, with their leader, Zaladane, encountered and fought the villain known as the [[Herbert Wyndham (Earth-616)|High Evolutionary]].{{r|Uncanny X-Men Annual #12}}\n\nAfterwards, Zaladane led the Mutates in kidnapping scientists, raiding Antarctic stations, and plundering Chilean cities, engaging in war-like acts across the Savage Land. Later, she made the Mutates kidnap the X-Man [[Lorna Dane (Earth-616)|Polaris]] and succeeded in stealing her powers, which led the X-Men to battle the Mutates to rescue her.{{r|Uncanny X-Men #249|251}}\n\nSoon after, Zaladane tried to merge with the south magnetic pole to gain even more power. Investigating, Magneto, the X-Man, Rogue, Ka-Zar, and the espionage organization SHIELD encountered the Mutates and an army of prisoners led by the Mutate, Worm. Magneto succeeded in killing Zaladane, and the heroes destroyed the Mutates' headquarters.{{r|Uncanny X-Men #274|275}}\n\nLater, the X-Men, [[James Howlett (Earth-616)|Wolverine]], [[Rogue (Anna Marie) (Earth-616)|Rogue]], and [[Jubilation Lee (Earth-616)|Jubilee]], traveled to the [[Savage Land]] in order to find traces of Magneto. Instead, they discovered that [[Karl Lykos (Earth-616)|Sauron]] had taken charge of the Savage Land Mutates again, as well as uniting the variant Savage Land tribes. The two Mutates and X-Men fought, but after triumphing, the heroes chose not to reverse Sauron to Karl Lykos.{{r|Wolverine Vol 2 #69|71}}\n\nSauron, however, eventually needed more and more energy, and sought the X-man Havok, since it was touching Havok that created Sauron in the first place. The Mutates Worm and Whiteout kidnapped [[Alexander Summers (Earth-616)|Havok]], which led other X-Men, [[Scott Summers (Earth-616)|Cyclops]], Jean Grey and Polaris, to follow. After a series of battles, Phoenix was finally able to defeat their foes by reducing Sauron to a mindless creature and escaping the [[Savage Land]].{{r|X-Men Unlimited #6}}\n\n...{{r|X-Treme X-Men: Savage Land #1|4}}{{r|Uncanny X-Men #457|459}}\n\nRecently, the team faced the New Mutants.{{r|New Mutants Vol 3 #10}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * The Savage Land Mutates were nicknamed \"the Beast-Brood\" by [[T'Challa (Earth-616)|Black Panther]] in {{cl|Avengers Vol 1 105}}.\n| Trivia                  = \n| Links                   = * [http://www.marvunapp.com/Appendix4/savagelandmutates.htm Savage Land Mutates @ The Appendix to the Handbook of the Marvel Universe]\n}}\n[[Category:Magneto Experiment]]\n[[Category:Savage Land Races]]"
                }
            }
        }
    ],
    "page_id": "12447"
}