{
    "pageid": 523250,
    "ns": 0,
    "title": "Savage Six (Crime-Master's) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Venom Vol 2 21 Textless.jpg\n| ImageSize               = 300px\n| Name                    = [[Savage Six]]\n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = Formerly [[Bennett Brant (Earth-616)|Crime-Master]]\n| CurrentMembers          = \n| FormerMembers           = [[Bennett Brant (Earth-616)|Crime-Master]], [[Roland Burroughs (Earth-616)|Death Adder]], [[Richard Deacon (Earth-616)|Human Fly]], [[Jack O'Lantern (Crime-Master's) (Earth-616)|Jack O'Lantern]], [[Gregory Nettles (Earth-616)|Megatak]], [[Edward Brock (Earth-616)|Toxin]]\n| Allies                  = \n| Enemies                 = [[Eugene Thompson (Earth-616)|Venom]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Rick Remender; Cullen Bunn; Kev Walker; Terry Pallot\n| First                   = Venom Vol 2 17\n| Last                    = Venom Vol 2 21\n\n| HistoryText             = The [[Bennett Brant (Earth-616)|Crime-Master]] created his own super-villain team called the Savage Six by assembling [[Roland Burroughs (Earth-616)|Death Adder]], the [[Richard Deacon (Earth-616)|Human Fly]], [[Jack O'Lantern (Crime-Master's) (Earth-616)|Jack O'Lantern]], and [[Gregory Nettles (Earth-616)|Megatak]] upon offering them protection from the law and [[Wilson Fisk (Earth-616)|Kingpin]]. [[Eugene Thompson (Earth-616)|Venom]] was planning to take out Crime-Master only to be stopped by [[Edward Brock (Earth-616)|Eddie Brock]]. After a fight with Venom, Jack O'Lantern discovered Eddie Brock webbed up as Crime-Master forcefully bonded Eddie Brock to the [[Toxin (Symbiote) (Earth-616)|Toxin symbiote]]. The Savage Six targeted the people Venom cared about including his family and [[Elizabeth Brant (Earth-616)|Betty Brant]].{{r|Venom Vol 2 17}}\n\nJack O'Lantern, in his human guise, went first and targeted Betty Brant only to end up fighting Venom. During the fight, Megatak assisted Jack O'Lantern and punched Venom's phone before he can make a call to the [[Secret Avengers (Black Ops Unit) (Earth-616)|Avengers]] for help. While getting Betty away from Jack O'Lantern and Megatak, Venom was attacked by Toxin, who is in full control of Eddie Brock. Venom managed to use a sonic version of a pepper spray to immobilize Toxin before getting away.{{Citation}}\n\nThe Savage Six soon began to target Betty Brant's family, so Betty and Venom left to go warn them. They arrived at the home of Betty's mother where they found Human Fly about to eat her. Megatak had also been monitoring the phone lines when it came to the loved ones of Flash Thompson. Jack O'Lantern then targeted [[Jessica Thompson (Earth-616)|Jessie Thompson]] and ended up fighting Venom. Venom grabbed Jack O'Lantern's gun and fired on him before Jack O'Lantern spewed acid on him causing Venom to cool down in the fountain. Although Venom managed to get Jessie to safety, Toxin managed to capture Betty Brant while the Human Fly was eating the leftovers of what was supposedly Betty's mother.{{Citation}}\n\nVenom continued to look for Betty and ended up killing Death Adder after ripping Human Fly's wings off to learn where Crime-Master was located. When Betty was brought before Crime-Master, she was shocked when he revealed himself to be her brother, Bennett Brant. When Venom arrived at Crime-Master's hideout, he defeated Megatak and severely burned Toxin. Bennett Brant almost killed Venom with a sonic pistol and a flamethrower, but was shot and killed by Betty. When Venom began to make a comment on this, Betty stated that her brother \"died a long time ago.\"{{Citation}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * Appear to be a darker version of the [[Sinister Six (Earth-616)|Sinister Six]].\n* An [[Savage Six (Funny Face's) (Earth-982)|alternate version]] of the Savage Six were enemies of [[May Parker (Earth-982)|Spider-Girl]].\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "523250"
}