{
    "pageid": 751738,
    "ns": 0,
    "title": "Save Our Offspring From Indecency (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Howard the Duck Vol 1 21.jpg\n| Name                    = S.O.O.F.I.\n| Aliases                 = Service Organization Of PHilanthropic Individuals (S.H.O.O.PH.I)\n\n| Status                  = Active \n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Cleveland]], [[Ohio (State)|Ohio]]\n\n| Leaders                 = [[Sinister Soofi (Earth-616)|Sinister Soofi]] \n| CurrentMembers          = \n| FormerMembers           = [[Sudd (Earth-616)|Sudd]], [[Howard the Duck (Earth-791021)|Howard the Duck]], [[Beverly Switzler (Earth-616)|Beverly Switzler]]\n| Enemies                 = [[Howard the Duck (Earth-791021)|Howard the Duck]]\n\n| Origin                  = \n| PlaceOfFormation        =  \n| PlaceOfDissolution      = \n| Creators                = Steve Gerber; Gene Colan\n| First                   = Howard the Duck Vol 1 21\n\n| HistoryText             = Save Our Offspring From Indecency (S.O.O.F.I) is a terrorist group centering on the censorship of immoral acts across the world. They launched a campaign of terror against all those they find offensive. Blowing up adult theaters and offensive rock concerts with their suicide bombers dressed up as smiley faced cleaners. Their campaign of terror has those who are in support of removing offensive materials from society at odds with S.O.O.F.I.'s violent means to eliminate the perceived problem. Watching the news [[Howard the Duck (Earth-791021)|Howard the Duck]], is suddenly roused by a knock at the door. There to greet him is the [[Sinister Soofi (Earth-616)|Sinister Soofi]] , leader of the S.O.O.F.I. movement. The Supreme S.O.O.F.I. knocks out Howard with one of their gasses Formula 410. When Howard wakes up he finds himself dressed up tacky clothing. Confronted by the Supreme S.O.O.F.I. once more, the Supreme one has decided to select Howard as the first to be put in the S.O.O.F.I. brainwashing device, as their numbers have been thinned out in their campaign. Using the Blanditron device on Howard, the Supreme S.O.O.F.I. is shocked when it doesn't work when Howard punches her in the face, breaking her mask. With her movement ruined, Howard leaves the Supreme S.O.O.F.I. behind begging Howard to return and join her ranks. {{r|Howard the Duck Vol 1 21}}\n\n===Cynical Duck & Swizzle===\n[[File:Howard Duckson (Earth-791021) and Beverly Switzler (Earth-616) from Spider-Man Back in Quack Vol 1 1 001.jpg|left|thumb|Cynical Duck & Swizzle]]\nHoward and Beverly were brainwashed and forced to work for Service Organization Of PHilanthropic Individuals (S.H.O.O.PH.I) as Cynical Duck and Swizzle. They promoted S.O.O.F.I. at a public speech held for them by [[John Jonah Jameson (Earth-616)|J. Jonah Jameson]]. Spider-Man interrupted a S.O.O.F.I. indoctrination at the [[New York Public Library (Main Branch)|New York Public Library]], and Beverly and the other S.O.O.F.I.'s saw Spidey as a semi-demonic figure and attacked. Spidey escaped with Howard and broke his brainwashing because Beverly was threatened. Howard quickly explained S.O.O.F.I.'s goals to Spider-Man. As Spider-Man publicly announced his long-standing support for S.O.O.F.I., Howard confronted Bev as she stood by the Supreme S.O.O.F.I. Howard broke through to Beverly, reminding her of their past. The leader ordered the S.O.O.F.I.'s to throw the pair into the special Blanditron at [[Guantanamo Bay]], and Beverly kept them at bay with her whip. Spidey attacked them and  unmasked the Supreme S.O.O.F.I., while the others escaped though their teleporter. Howard believed S.O.O.F.I.'s would lay low for awhile after such a defeat, he also hoped their Florida Everglades base might lead them to meet up with the Man-Thing. {{r|Spider-Man: Back in Quack Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "751738"
}