{
    "pageid": 60517,
    "ns": 0,
    "title": "Scarlet Spiders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Avengers The Initiative Vol 1 7 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Scarlet Spiders]]\n| Aliases                 = [[Red Team]],{{r|Avengers: The Initiative #3}} \"[[Anthony Stark (Earth-616)|Tony Stark]]'s [[Spider-Slayer]]s\",{{r|Avengers: The Initiative #7}} [[Spider-Man]]/[[Spider-Men]],{{r|Avengers: The Initiative #7}} MVPeople{{r|Avengers: The Initiative Vol 1 10}}\n| Status                  = Defunct\n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Camp Hammond]], [[Stamford]], [[Connecticut (State)|Connecticut]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Michael van Patrick (Patrick) (Earth-616)|Patrick]], [[Michael van Patrick (Michael) (Earth-616)|Michael]] (deceased), [[Michael van Patrick (Van) (Earth-616)|Van]] (deceased)\n| Affiliation             = {{m|Counter Force (Earth-616)|Counter Initiative}}; formerly {{m|Shadow Initiative (Earth-616)|Shadow Initiative}}, {{m|50-State Initiative (Earth-616)|Initiative}}\n| Allies                  = [[Peter Parker (Earth-616)|Spider-Man (Peter Parker)]], [[Wernher von Blitzschlag (Earth-616)|Dr. Blitzschlag]], [[Shadow Initiative (Earth-616)|Shadow Initiative]], [[50-State Initiative (Earth-616)|Initiative]]\n| Enemies                 = [[KIA (Earth-616)|KIA]], [[Vulturions (Earth-616)|Vulturions]], [[Ragnarok (Earth-616)|Ragnarok]], [[Norman Osborn (Earth-616)| Osborn]]'s [[50-State Initiative (Earth-616)|Initiative]], [[Sinister Syndicate (Earth-616)|Sinister Syndicate]]\n\n| Origin                  = A trio of [[Michael van Patrick (Earth-616)|MVP]] [[Clones|clones]] given duplicates of the Iron-Spider costume. \n| PlaceOfFormation        = [[Camp Hammond]], [[Stamford]], [[Connecticut (State)|Connecticut]]\n| PlaceOfDissolution      =\n| Creators                = Dan Slott; Stefano Caselli\n| First                   = Avengers: The Initiative Vol 1 3\n| Last                    = Avengers: The Initiative Vol 1 22\n\n| HistoryText             = The Scarlet Spiders were three clones of the seemingly-deceased [[50-State Initiative (Earth-616)|Initiative]] recruit, [[Michael van Patrick (Earth-616)|MVP]]. After his death via training accident, [[Wernher von Blitzschlag (Earth-616)|Dr. Blitzschlag]] found his genome too valuable to simply throw away and with reluctant permission from [[Henry Pym (Earth-616)|Yellowjacket]] proceeded to clone him. The clones were named [[Michael van Patrick (Michael) (Earth-616)|Michael]], [[Michael van Patrick (Van) (Earth-616)|Van]], and [[Michael van Patrick (Patrick) (Earth-616)|Patrick]]. To accelerate their development, telemetry education was fed into their brains by [[Taskmaster]] to have the martial arts prowess and physical muscle memory and moves of [[Peter Parker (Earth-616)|Spider-Man]]. All three of them wore the '[[Iron Spider]]' Stark armor which Parker formerly wore pre-[[Civil War]] and during the event. Originally, they identified themselves as \"Red Team\" on the field. They took down the [[Sinister Syndicate (Earth-616)|Sinister Syndicate]] consisting of [[Herman Schultz (Earth-616)|Shocker]], [[Frederick Myers (Earth-616)|Boomerang]], and [[Morris Bench (Earth-616)|Hydro-Man]].{{r|Avengers: The Initiative #3}}\n\n[[File:Vulturions (Earth-616) from Avengers The Initiative Vol 1 7 0002.jpg|thumb|left|190px|The Vulturions take on a Scarlet Spider]]\nWhen [[Wernher von Blitzschlag (Earth-616)|Blitzschlag]] was visiting [[New York City]] after the events of [[World War Hulk]], he was attacked by a group of [[Vulturions (Earth-616)|Vulturions]], who stole the plans for a [[Gamma Bomb|gamma bomb]] he was carrying. Coming to his aid, the Scarlet Spiders pursued the Vulturions until being attacked by Peter Parker, angry over [[Anthony Stark (Earth-616)|Stark]]'s use of other Spider-Men. Taking one of the members out, he was eventually convinced by a second to help them against the Vulturions. Arriving in time to help Van, the two Scarlet Spiders utilized a cloaking technology built into their suits to make them appear to be differently-costumed versions of Spider-Man, distracting the newest Vulturions while Peter Parker took down the original member, [[Honcho (Vulturions) (Earth-616)|Honcho]]. Thankful for his help, the Scarlet Spiders went against orders, and instead of capturing Parker, they made it appear as if he had been a member of the team, throwing doubt on whether he was ever actually Spider-Man.{{r|Avengers: The Initiative #7}}\n\nA formerly deceased clone of MVP acquired a top secret weapon known as the [[Tactigon]] and began referring to himself as [[KIA (Earth-616)|KIA]] (Killed In Action). Insane, and greatly influenced by the alien technology, he began systematically hunting down all members of the Initiative whom he felt was responsible for his condition. During the attack, he decapitated one of the three Scarlet Spiders, Van, after they unmasked themselves in an attempt to calm KIA.{{r|Avengers: The Initiative #10}} The surviving Scarlet Spiders, Michael and Patrick, make their way to Bulls Gap, [[Tennessee (State)|Tennessee]] to aid in the capture of KIA.{{r|Avengers: The Initiative #11}}\n\nAfter the defeat of KIA, the surviving Scarlet Spiders, along with the [[Michael van Patrick (Clone) (Earth-616)|MVP clone]] who replaced the original MVP to fool his parents, and the real MVP's [[Brian van Patrick (Earth-616)|father]], joined with [[Vance Astrovik (Earth-616)|Justice]]'s [[New Warriors (Earth-616)|New Warriors]] as a [[Counter Force (Earth-616)|Counter Initiative/Counter Force]] of underground registered heroes. {{r|Avengers: The Initiative #12}}\n\nFollowing the [[Secret Invasion|Skrull invasion]], Counter Force were made wanted criminals when [[Norman Osborn (Earth-616)|Norman Osborn]] began taking control of the 50-State Initiative. The team showed up at [[Camp Hammond]], having retaken the name New Warriors, to battle a rampaging clone of [[Thor Odinson (Earth-616)|Thor]], [[Ragnarok (Earth-616)|Ragnarok]], but with the cost of losing Scarlet Spider Michael.{{r|Avengers: The Initiative #22}} In the aftermath of the battle, Patrick, the last surviving Scarlet Spider, publicly unmasked himself, revealing to the media that the Initiative had secretly cloned MVP.{{r|Avengers: The Initiative #23}}\n\n| Equipment               = \n'''Iron Spider Armor''': The Scarlet Spider's wear a variation of [[Peter Parker (Earth-616)|Spider-man's]] initial Iron Spider armor; the high tech spider suits carry a variety of various systems, weapons and accoutrements.\n** '''Waldoes''': The Iron Spider Armor possesses four mechanical spider-arms, or \"waldoes,\" that can be used to see around corners (via cameras in the tips) and to manipulate objects indirectly. Stark describes them as too delicate to use in combat, yet they have used to smash through the sensors in the Titanium Man's helmet.\n** '''Liquid Metal Nano-Fiber''': The armor is composed of a liquid metal nano-fiber and can more or less disappear when not needed. It responds to neurochemical impulses, as well as blend into a variety of backgrounds. He can give it the shapes and colors of his classic costumes for instance.\n** '''Gliding''': The armor incorporates mesh webbing that grants the suit mid-range gliding capabilities on wind currents, similar to the suit of Spider-Man 2099's.\n** '''Bulletproof and Heatproof''': The armor is both bulletproof and heatproof, thanks to it being composed of a heat-resistant Kevlar micro-fiber that can resist small-caliber bullets.\n** '''Built-in Emergency Scanner''': The armor possesses a built-in police, fire, and emergency scanner that allows the wearer to listen to police, fire, and/or emergency broadcasts through radio-waves.\n** '''Audio/Visual Amplification''': The armor possesses audio and visual amplification, enabling him to see in the infrared and ultraviolet portions of the electromagnetic spectrum.\n** '''Carbon-Filtering System''': The armor possesses a carbon-filtering system in the mouth area that enables the wearer to breathe in toxic environments by filtering out toxic particles in the air. It also grants the ability to breathe underwater.\n** '''Short-Range GPS Microwave Communication System''': The suit possesses a short-range GPS microwave communication system that enables Spider-Man to communicate with others over short distances. \n** '''Detachment''': Part of the costume can detach itself from the wearer to cover an object too dangerous to touch, such as a radioactive asteroid.\n** '''Adaptive Camouflage''': Allows the Scarlet Spiders to appear to be wearing any classic Spider-Man costume, or to copy any nearby clothing or appearance.{{r|Avengers: The Initiative #7}}\n\n| Transportation          = Web shooters\n| Weapons                 = \n* Pulse cannons\n* [[Repulsor|Repulsor grenades]]\n\n| Notes                   =\n* Part of the [[Shadow Initiative (Earth-616)|Shadow Initiative]], a classified, black-ops arm of the Initiative and personal bodyguards to [[Henry Gyrich (Earth-616)|Henry Gyrich]].{{r|Avengers: The Initiative Vol 1 5}}\n* They look to [[Wernher von Blitzschlag (Earth-616)|Baron Blitzschlag]] as a father figure and even share some of his DNA.{{r|Avengers: The Initiative Vol 1 7}}\n\n| Trivia                  =\n* Unlike Spider-Man's Iron Spider outfit, the Scarlet Spiders are equipped with four \"waldoes\" whereas Spider-Man only had three.\n\n| Links                   =\n}}\n[[Category:Armor Users]]\n[[Category:Spider-Slayer]]"
                }
            }
        }
    ],
    "page_id": "60517"
}