{
    "pageid": 645427,
    "ns": 0,
    "title": "Scientists Guild (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Scientists Guild (Earth-616) from Marvel Comics Vol 1 1000 001.jpg\n| ImageSize               = 250px\n| Name                    = Scientists Guild\n| Aliases                 = Three Xs{{r|Marvel Comics Vol 1 1000|; The Loop}}\n\n| Status                  = Active\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = [[James Woo (Earth-616)|Jimmy Woo]], [[Adam Brashear (Earth-616)|Blue Marvel]], [[Dwayne Taylor (Earth-616)|Night Thrasher]]\n| FormerMembers           = [[Carlo Zota (Earth-616)|Carlo Zota]], [[Jerome Hamilton (Scientist) (Earth-616)|Jerome Hamilton]], [[Maris Morlak (Earth-616)|Maris Morlak]], [[Phineas Horton (Earth-616)|Phineas Horton]], [[Jerry Carstairs (Earth-616)|Thunderer (Jerry Carstairs)]], [[Black Knight (Guild of Strange Science) (Earth-616)|Black Knight]]\n| Allies                  = [[Carol Danvers (Earth-616)|Captain Marvel]], [[Reed Richards (Earth-616)|Mr Fantastic]]\n| Enemies                 = [[Percival of Scandia (Earth-616)|The Black Knight]], [[Jim Gardley (Earth-616)|The Masked Raider]], [[Green Terror (3Xs Foe) (Earth-616)|The Green Terror]], [[Jerry Carstairs (Earth-616)|The Dark Avenger]]\n\n| Origin                  = \n| PlaceOfFormation        = [[United Kingdom|6th century Britain]]\n| PlaceOfDissolution      = [[Beehive]]\n| Creators                = Carl Burgos; Robert O. Erisman; Newt Alfred; Stan Lee; Jack Kirby\n| First                   = Marvel Comics Vol 1 1\n| Last                    = \n\n| HistoryText             = \n=== Origins ===\n1500 years ago in [[United Kingdom|Britain]], a guild of warlocks and magic users plotted to overthrow [[Arthur Pendragon (Earth-616)|King Arthur]] and give power back to the common people. To achieve their goals, the guild harnessed the power of the spirit of [[Eternity (Earth-616)|Eternity]] to create the [[Eternity Mask]], a mystical mask that makes its wearer the equal of their opponent. The [[Percival of Scandia (Earth-616)|Black Knight]] was dispatched to locate the guild's hideout where he encountered their champion, who was wearing the mask. After three straight days of fighting, the Black Knight finally killed his adversary. The guild retreated, taking the mask with them. The Mask would survive into the modern day, passing through many hands and influencing key events in human history.{{r|Marvel Comics Vol 1 1000|; The Guild of Strange Science}}\n\n===19th Century===\nThe guild was still active in the 19th century and apparently looking for the Eternity Mask but on his deathbed [[Jim Gardley (Earth-616)|The Masked Raider]] told [[Matthew Masters (Earth-616)|Dr. Matt Masters]] not to let them get to it.{{r|Marvel Comics Vol 1 1000|; The Black Rider}}\n\n===Modern Era===\n====Human Torch====\nBy the late 1930s, the guild was known as the '''Scientists' Guild''' and it consisted of three members: [[Carlo Zota (Earth-616)|Dr. Carlo Zota]], [[Jerome Hamilton (Scientist) (Earth-616)|Dr. Jerome Hamilton]], and [[Maris Morlak (Earth-616)|Dr. Maris Morlack]]. The Guild came to regard themselves as representing the next stage of humanity and were determined to shape or create the next generation of mankind.{{r|Marvel Comics Vol 1 1000|; The Operative and the X Men}}\n[[File:Scientists Guild (Earth-616) from Marvel Comics Vol 1 1 001.jpg|thumb|left|200px|Examining the Human Torch]]\nThe three scientists had a meeting with [[Phineas Horton (Earth-616)|Professor Phineas Horton]] where he revealed his creation, the [[Synthezoids|synthozoid]] [[Jim Hammond (Earth-616)|Human Torch]], at the 1939 World's Fair. The Guild thought that this new invention was too dangerous and that it should be destroyed. This demand, along with public outcry and presidential order,{{r|Marvels Project Vol 1 1}} convinced Professor Horton to bury the Torch in a concrete block.{{r|Marvel Comics Vol 1 1}} Later, Professor Horton himself was accepted as a member of the Scientists Guild.{{r|Marvel Mystery Handbook 70th Anniversary Special Vol 1 1}}\n\n====Three Xs====\n[[File:Scientists Guild (Earth-616) from Mystic Comics Vol 1 1 0001.jpg|thumb|right|200px|As the Three Xs]]\nUnder the alias '''Three X''', the Guild also acted as private investigators specializing in cases of a super-scientific nature. In their only known case, they were hired to find the mysterious kidnapper known as the [[Green Terror (3X's Foe) (Earth-616)|Green Terror]]. While examining the clues left behind during the most recent kidnapping, the Three Xs were attacked by the Green Terror's men. This did not stop them from learning that the Green Terror's men were stationed aboard a ship that was about to leave New York harbor. Rushing to the scene, they were captured. However, they met with the Green Terror and learned that he kidnapped his young victims to drain their blood so that he could maintain his youth.\n\nThe Three Xs broke free and easily defeated the Green Terror and his men in a fight, taking control of the ship and returning it to New York so that the Green Terror could face punishment for his crimes.{{r|Mystic Comics Vol 1 1}}\n\n====Thunderer====\nIn 1940 the Scientists Guild, under their Three Xs alias, acquired the Eternity Mask from its then current owner [[Dennis Piper (Earth-616)|Leslie Lenrow]], a private detective also known as the Ferret.{{r|Marvel Comics Vol 1 1000|; The Operative and the X Men}} Using the mask and a tome of arcane magic, the Guild launched [[Project: Thunderer (Earth-616)|Project: Thunderer]], and turned radio operator Jerry Carstairs into a superhero known as the [[Jerry Carstairs (Earth-616)|Thunderer]] in 1941. The creation of the Thunderer was secretly witnessed by [[Steven Rogers (Earth-616)|Steve Rogers]] prior being injected with [[Super-Soldier Serum]].{{r|Marvel Comics Vol 1 1000|; The Other Door}}\n\nAt a science conference Zota, Hamilton, and Morlak met geneticist [[Wladyslav Shinski (Earth-616)|Wladyslav Shinski]], who would later join the Guild and administer longevity treatments to his comrades, which kept them youthful for decades.{{r|Official Handbook of the Marvel Universe Vol 2 4}}{{r|Marvel Comics Vol 1 1000|; Strange Worlds}}\n\nIn 1946, the Guild funded Professor Horton's creation of [[Adam II (Earth-616)|Adam II]], which Horton hoped would be an improvement on the Human Torch. In exchange for funding, the Guild was allowed to supply their own programming. The Guild's ideas of the next stage of mankind caused Adam II to develop feelings of superiority towards the human race. The rouge synthezoid was eventually defeated by the [[All-Winners Squad (Earth-616)|All-Winners Squad]], but not before he killed [[William Nasland (Earth-616)|William Nasland]], the second Captain America. Disgusted by their recklessness, the Thunderer quit the Scientists Guild, vowing to take them down if they ever came after him or the mask.{{r|Marvel Comics Vol 1 1000|; Calling Frequency X}} The Guild eventually caught up with Thunderer sometime prior to 1956 and killed him, taking the mask and leaving his body in a cave.{{r|Marvel Comics Vol 1 1000|; The Last Stand of the Dark Avenger}}\n\n====Strange New World====\nBy 1958 the Guild's experiments with the Eternity Mask were unsuccessful as it didn't make any of them each other's equal. Dr. Hamilton suggested it was because they wished to rule the world but Dr. Zota disagreed, as their goal was not to rule it, but to save it. Dr. Shinski reasoned that the world ''should'' be controlled, but by a race of perfect humans.  Shinski stated that they too would have to evolve. He then unveiled a sketch of a human sized cocoon and declared the Scientists Guild was dead. From that point on they would be known as the [[Enclave (Earth-616)|Enclave]].{{r|Marvel Comics Vol 1 1000|; Strange Worlds}}\n\n====Masked Raider II====\nThe Three X's were reformed years later by Jimmy Woo (who had been investigating the [[Eternity Mask]] along with [[Roberto Da Costa (Earth-616)|Bobby Da Costa]] and [[Agents of Atlas (Earth-616)|the Agents of Atlas]]),{{r|Marvel Comics Vol 1 1000}} Blue Marvel, and the recently returned Night Thrasher. They began investigating a man going around dressed as [[Jim Gardley (Earth-616)|The Masked Raider]] who they believed was the masks current owner. They also joined a bunch of superheroes in solving the murder of [[Kree]] general [[Bel-Dann (Earth-616)|Bel-Dann]].{{r|Incoming Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = Retelling of [[Jim Hammond (Earth-616)|Human Torch's]] origin in {{cl|Marvel Mystery Comics Vol 1 92}} seems to imply that the Scientists' Guild was also called as the ''Academy of Science''. However, because both are mentioned in the [[Saga of the Original Human Torch Vol 1|Saga of the Original Human Torch]], the organizations are assumed to be different ones.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:British Organizations]]\n[[Category:Think Tanks]]\n[[Category:Super-Soldier Programs]]"
                }
            }
        }
    ],
    "page_id": "645427"
}