{
    "pageid": 582855,
    "ns": 0,
    "title": "Secret Avengers (S.H.I.E.L.D.) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Secret Avengers (S.H.I.E.L.D.) (Earth-616) from Secret Avengers Vol 3 1 Shalvey Variant cover.jpg\n| ImageSize               = 300px\n| Name                    = [[Secret Avengers]]\n| Aliases                 = [[Avengers]], Secret [[Avengers Initiative]]{{r|Secret Avengers Vol 3 8}}\n\n| Status                  = Defunct\n\n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = [[S.H.I.E.L.D. Helicarrier]]\n\n| Leaders                 = Formerly [[Maria Hill (Earth-616)|Director Maria Hill]], [[Daisy Johnson (Earth-616)|Director Daisy Johnson]]\n| FormerMembers           =  [[Natalia Romanova (Earth-616)|Black Widow]], [[Phillip Coulson (Earth-616)|Phil Coulson]], [[Nicholas Fury, Jr. (Earth-616)|Nick Fury, Jr.]], [[Sarah Garza (Earth-616)|Agent Garza]], [[Clinton Barton (Earth-616)|Hawkeye]], [[Bruce Banner (Earth-616)|Hulk]], [[James Rhodes (Earth-616)|Iron Patriot]], [[Barbara Morse (Earth-616)|Mockingbird]], [[Anthony Masters (Earth-616)|Taskmaster]], [[Jessica Drew (Earth-616)|Spider-Woman]]\n| Allies                  = [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]]\n| Enemies                 = [[Advanced Idea Mechanics (Earth-616)|A.I.M.]], [[Al-Qaeda (Earth-616)|Al-Qaeda]], [[Artaud Derrida (Earth-616)|Artaud Derrida]], [[Iron Patriot Drones (Earth-616)|Iron Patriot Drones]], [[Jorma (Earth-616)|Jorma]], [[Maki Matsumoto (Earth-616)|Lady Bullseye]], [[Masters of Evil (Earth-616)|Masters of Evil]]\n\n| Origin                  = Formed as S.H.I.E.L.D.'s own Avengers black ops unit.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Nick Spencer; Luke Ross\n| First                   = Secret Avengers Vol 2 #1\n| Last                    = Secret Avengers Vol 3 15\n\n| HistoryText             = \n===Formation===\nAfter a mysterious traveler from the future who launched an attack on a battalion of [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] agents was killed, acting director of S.H.I.E.L.D. [[Maria Hill (Earth-616)|Maria Hill]] decided to activate the \"Avengers Initiative\", in order to form the agency's own Avengers unit. [[Daisy Johnson (Earth-616)|Daisy Johnson]], at this time director of S.H.I.E.L.D. awaiting approval, also supported that step. The first recruits were two former members of the original black ops unit named the [[Secret Avengers (Black Ops Unit) (Earth-616)|Secret Avengers]], [[Clinton Barton (Earth-616)|Hawkeye]] and [[Natalia Romanova (Earth-616)|Black Widow]], along [[Nicholas Fury, Jr. (Earth-616)|Nick Fury Jr.]], [[Phillip Coulson (Earth-616)|Phil Coulson]], [[Barbara Morse (Earth-616)|Mockingbird]] and [[Maria Hill (Earth-616)|Maria Hill]]. Due to the sensitive nature of their missions, every member (except Fury) would have memory implants, making them forget everything they did for the period of the operation by hearing a codeword, making them believe they were doing hobby activities during their time in the mission. Their first operation was to foil a plan of the terrorist group [[Al-Qaeda (Earth-616)|Al-Qaeda]] from using teleportation knowledge given by [[Andras Bertesy (Earth-616)|Andras Bertesy]] to execute a terrorist attack to the [[United States of America|United States]]. The Secret Avengers followed the terrorist group to [[Budapest]], were they got the coordinates of the attack from one of their members. After Hawkeye was left to be rescued by Black Widow as part of the mission, Fury settled a trap to the Al-Qaeda member who was going to perform the attack, by waiting him in the Oval Office and kill him.{{r|Secret Avengers Vol 2 1}}\n\n[[File:Secret Avengers Vol 2 1 Yu Variant Textless.jpg|thumb|left|Original roster]]\n===Against A.I.M. under Andrew Forson===\nIn their second mission, the team rescued [[Anthony Masters (Earth-616)|Taskmaster]] from [[Bagalia]], in order to use him to infiltrate in [[Advanced Idea Mechanics (Earth-616)|A.I.M.]]'s new High Council.{{r|Secret Avengers Vol 2 2}}\n\nAfter A.I.M. stole an [[Iron Patriot Armor Model 1|Iron Patriot Armor]] during the confusion in a conflict they incited against S.H.I.E.L.D. at a weapons expo,{{r|Secret Avengers Vol 2 3}} the Secret Avengers, with the addition of [[Bruce Banner (Earth-616)|Hulk]], were given the task to kill [[Andrew Forson (Earth-616)|Andrew Forson]].{{r|Secret Avengers Vol 2 4}}\n\nMeanwhile, S.H.I.E.L.D. Intel came to the conclusion the [[Iron Patriot Drones (Earth-616)|Iron Patriot androids]] could be reasoned with, and agent Phil Coulson asked [[James Rhodes (Earth-616)|Colonel James Rhodes]] to talk to them, as he had experience and military training. Using holographic communication, S.H.I.E.L.D. hacked into A.I.M.'s network and allowed Rhodes to talk to the suits, who recognised him as \"the Pilot\", along [[Iron Man (Anthony \"Tony\" Stark)|Tony Stark]] being \"the Maker\". Rhodey managed to make the Iron Patriot army understand their actions of abruptly attacking tactical points of enemies of the US was unacceptable.{{r|Secret Avengers Vol 2 6}}\n\nAfter the Secret Avengers sent to kill Forson seemingly succeeded in their mission, [[Daisy Johnson (Earth-616)|Quake]] was suspended indefinitely for breaking the protocols, as Forson was the leader of a [[United Nations (Earth-616)|U.N.]] member nation, and Maria Hill was put in charge of S.H.I.E.L.D. once more, and the agents who took part in the assassination, Nick Fury, Black Widow and Hawkeye, were held for interrogation.{{r|Secret Avengers Vol 2 5}}\n\nIn the aftermath of the mission, Mockingbird was taken prisoner by A.I.M. and brainwashed. Taskmasker tried to help Mockingbird escape, but was knocked out by A.I.M. agent [[Anton Trask (Earth-616)|Anton Trask]].{{r|Secret Avengers Vol 2 13}} The rest of the Secret Avengers attempted to rescue her, and after she disappearing during her rescue attempt, the team suffered a change of roster. Unknown to the team, Mockingbird went under the radar along with Daisy Johnson and [[James Buchanan Barnes (Earth-616)|Bucky Barnes]].{{r|Secret Avengers Vol 2 16}}\n\n===A Great Culling Is Coming===\nMeanwhile, [[George Tarleton (M.O.D.O.K. Superior) (Earth-616)|M.O.D.O.K.]] had defected from A.I.M. to S.H.I.E.L.D. He brought with himself knowledge about A.I.M. and Maria Hill agreed to let him work for her in exchange for his intel.{{r|Secret Avengers Vol 2 14}}\n\nAfter the A.I.M. Island episode, Iron Patriot and Hawkeye quit the team. After miping their minds one last time, Hill abondoned the idea of memory implants. [[Jessica Drew (Earth-616)|Spider-Woman]] was added to the team roster, and Hawkeye re-joined when A.I.M. goons chased him into a spa where Black Widow and Spider-Woman were relaxing.\n\nWhen Coulson and Nick Fury Jr. were attacked by the [[Fury (Earth-616)|Fury]] while attempting to repair a satellite, the other three team members raced into space and rescued them. Meanwhile, an assassin entered [[S.H.I.E.L.D. Helicarrier Iliad]] and attempted to kill Maria Hill, while stating: \"A great culling is coming.\" However, M.O.D.O.K. rescued her.{{r|Secret Avengers Vol 3 1}}\n\nThe Fury fell from space onto Earth and reappered at the chinese Kowloon Walled City. Nick Fury Jr. and Hawkeye retrieved it from there{{r|Secret Avengers Vol 3 4}} and S.H.I.E.L.D. soon found out that the Fury was pregnant.{{r|Secret Avengers Vol 3 6}}\n\nAfter his fall from space, Phil Coulson seemed to suffer from PTSD. He single-handedly took a week off and traveled to Venezuela, in order to find out about the \"culling\" that was about to come. Hill asked Nick Fury to go through Coulson's possessions in order to find out what he planned. When Fury opened Coulsons locker, an acid was ejected out of it and blinded him, putting him in a coma.{{r|Secret Avengers Vol 3 5}}\n\nMaria Hill soon discovered that everything that had happened recently was orchestrated by M.O.D.O.K., who seeked to destroy S.H.I.E.L.D. from within and then replace Hill as head of the spy organization. What Hill didn't know was that M.O.D.O.K. had already backed down from his plan after falling in love with her.{{r|Secret Avengers Vol 3 8}} When Hill tried to confront M.O.D.O.K., the evil scientist had disappeared from the Helicarrier, and she interrogated his assistant [[Broseph Simpkins the Seventh (Earth-616)|Snapper]].{{r|Secret Avengers Vol 3 9}}\n\nSpider-Woman was able to decipher the language of the Fury with the help of a sentinel bomb named [[Vladimir (Bomb) (Earth-616)|Vladimir]], and it was revealed to repeat the same sentence over and over again: \"The great culling is here.\"{{r|Secret Avengers Vol 3 10}} It was revealed Snapper carried on M.O.D.O.K.'s plan after his men infiltrated the Helicarrier and took Maria Hill hostage, while Spider-Woman was able to fight them off Nick Fury's sickbed. On Venezuela, M.O.D.O.K. met Phil Coulson and Hawkeye and told them about his plan and change of heart, in addition that there had been a misinterpretation on the message: Not a ''culling'' was coming, but a ''calling.''{{r|Secret Avengers Vol 3 11}} After returning to the Helicarrier where they retrieved Nick Fury and The Fury (as the latter had cured Nick's injuries from the acid trap set up by Snapper), M.O.D.O.K. and the Secret Avengers started planning the next course of action to stop Snapper. After clarifying he didn't know of Snapper's location, M.O.D.O.K.'s assistant called him to gloat about his triumph, telling him where he was.\n\nOn the Venezuelan Rainforest, Snapper planned to unleash the monsters from a dimension calle [[Tlön]] on Earth.{{r|Secret Avengers Vol 3 12}} After M.O.D.O.K. and the Secret Avengers arrived to rescue Hill, Snapper tagged him with a transmission conductor, as well as Maria Hill and other people, turning him into the medium of a communal mindscape that used emotional negativity to create a gate for Tlön's rise.{{r|Secret Avengers Vol 3 13}} This was part of a plan, which continued with [[Jessica Drew (Earth-616)|Spider-Woman]] using her pheromones to emotionally subdue Snapper. The rest of the Secret Avengers tagged themselves with transmission conductors to infiltrate the mindscape and try to imagine the best possible universe, hoping the force of their positive thoughts could reach Hill and outweight the negative of Tlön. When everything was coming apart at the seams, the final part of M.O.D.O.K.'s plan to defeat Snapper was put in motion, and Vladimir was dropped on the portal to Tlön. Vladimir opened a black hole which in contact with the Tlön gate created a singularity, reverting everything back to normal.{{r|Secret Avengers Vol 3 14}}\n\nAfter the day was saved, the members of the Secret Avengers took a vacation.{{r|Secret Avengers Vol 3 15}}\n\n| Equipment               = S.H.I.E.L.D. equipment\n| Transportation          = [[S.H.I.E.L.D. Helicarrier]]\n| Weapons                 = Each teammates' arsenal\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:S.H.I.E.L.D. Projects]]"
                }
            }
        }
    ],
    "page_id": "582855"
}