{
    "pageid": 335699,
    "ns": 0,
    "title": "Secret Avengers (Black Ops Unit) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Secret Avengers Vol 1 22 Textless.jpg\n| ImageSize               = 300px\n| Name                    = [[Secret Avengers]]\n| Aliases                 = [[Avengers]]\n\n| Status                  = Defunct\n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Lighthouse (Space Station)|Lighthouse]], [[Earth Orbit]]; [[Quincarrier]]\n\n| Leaders                 = Formerly [[Steven Rogers (Earth-616)|Commander Steve Rogers]], [[Clinton Barton (Earth-616)|Hawkeye]]\n| CurrentMembers          = \n| FormerMembers           = [[Eric O'Grady (Earth-616)|Ant-Man]], [[Eric O'Grady (LMD) (Earth-616)|Ant-Man (LMD)]], [[Henry McCoy (Earth-616)|Beast]], [[Natalia Romanova (Earth-616)|Black Widow]], [[Brian Braddock (Earth-616)|Captain Britain]], [[Steven Rogers (Earth-616)|Commander Steve Rogers]], [[Henry Pym (Earth-616)|Giant-Man]], [[Clinton Barton (Earth-616)|Hawkeye]], [[Jim Hammond (Earth-616)|Human Torch]], [[Marc Spector (Earth-616)|Moon Knight]], [[Richard Rider (Earth-616)|Nova]], [[Sharon Carter (Earth-616)|Sharon Carter]], [[Brunnhilde (Earth-616)|Valkyrie]], [[Eugene Thompson (Earth-616)|Venom]], [[James Rhodes (Earth-616)|War Machine]]\n| Allies                  = Formerly [[Archon (Earth-616)|Archon]], [[Illuminati (Earth-616)|Illuminati]], [[Carol Danvers (Earth-616)|Ms. Marvel]], [[John Aman (Earth-616)|Prince of Orphans]], [[Noh-Varr (Earth-200080)|Protector]], [[Shang-Chi (Earth-616)|Shang-Chi]], [[Thor Odinson (Earth-616)|Thor]], [[Vision (Earth-616)|Vision]]\n| Enemies                 = Formerly [[Bi-Beast (Earth-616)|Bi-Beast]], [[Circus of Crime (Earth-616)|Circus of Crime]], [[Descendants (Earth-616)|Descendants]], [[Yuriko Oyama (Earth-616)|Lady Deathstrike]], [[Master Mold (Earth-616)|Master Mold]], [[Masters of Evil (Earth-616)|Masters of Evil]], [[Mister Negative (Earth-616)|Mister Negative]], [[National Socialist German Workers Party (Earth-616)|Nazi Party]], [[Nimrod (Earth-811)|Nimrod]], [[Phoenix Force (Earth-616)|Phoenix Force]], [[Reavers (Earth-616)|Reavers]], [[Roxxon Energy Corporation (Earth-616)|Roxxon Oil]], [[Shadow Council (Earth-616)|Shadow Council]], [[Anthony Masters (Earth-616)|Taskmaster]], [[U-Foes (Earth-616)|U-Foes]], [[Wrecking Crew (Earth-616)|Wrecking Crew]], [[Zheng Zu (Earth-616)|Zheng Zu]]\n\n| Origin                  = Formed as a black ops strike team led by Steve Rogers to covertly deal with threats that can't be handled by the core [[Avengers (Earth-616)|Avengers]].\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Ed Brubaker; Mike Deodato Jr.\n| First                   = Secret Avengers Vol 1 1\n| Last                    = Secret Avengers Vol 1 37\n\n| HistoryText             = \n{{Quote|Run the mission. Don't get seen. Save the world.}}\n[[File:Secret Avengers Vol 1 1 Solicit Marko Variant.jpg|thumb|left|The original roster of the black ops Secret Avengers.]]\n===Formation & [[Heroic Age]]===\nWhen [[Steven Rogers (Earth-616)|Steve Rogers]] took over [[Norman Osborn (Earth-616)|Norman Osborn]]'s role as top cop, he chose not to continue [[H.A.M.M.E.R. (Earth-616)|H.A.M.M.E.R.]] nor to reestablish [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] Instead, he decided to put the world's security into the hands of a few Avengers sub-teams. One of these teams became the Secret Avengers, and he took direct leadership of it with [[Sharon Carter (Earth-616)|Sharon Carter]] assisting him with tactical operations. The purpose of this team was to covertly clean up the messes left by the Osborn administration. To this end, Steve personally recruited a team that would allow him to carry out surgical strikes in any given circumstance. This included experienced covert operators like [[Natalia Romanova (Earth-616)|Black Widow]], [[Marc Spector (Earth-616)|Moon Knight]] and [[Eric O'Grady (Earth-616)|Ant-Man]]; a scientist in [[Henry McCoy (Earth-616)|Beast]]; a one-man army in [[James Rhodes (Earth-616)|War Machine]]; a powerful magical warrior called the Valkyrie in [[Brunnhilde (Earth-616)|Brunnhilde]]; and the cosmos' top cop [[Richard Rider (Earth-616)|Nova]].{{r|Secret Avengers Vol 1 1}}\n\nSteve's first go on a mission with the team to a mining facility of [[Roxxon Energy Corporation (Earth-616)|Roxxon Energy Corporation]] established on [[Mars (Planet)|Mars]]. Some reports said that Roxxon had acquired the [[Serpent Crown]], so Rogers decide to go to Mars with Black Widow and Valkyrie to find the artifact, which Beast later discovered that was not the real Serpent Crown, but a similar object. Rogers had also dispatched Nova to investigate on Mars and find more information, but he lost communication with him. The rest of the team went to Mars to find him and discovered he was being controlled by the entity of another artifact similar to the Serpent Crown. With the help of a being named [[Archon (Earth-616)|Archon]], who was charged to protect the world against the entity, they freed Nova.\n\nThen, the Secret Avengers were confronted by Archon who wanted to kill Nova to be sure he would not be possessed by the artifact again. Nova left the team after Archon decide to let him live. They were also confronted by the [[Shadow Council (Earth-616)|Shadow Council]], and for beat him, they have to deal with [[Max Fury (Earth-616)|a Nick Fury imposter]] working for the Shadow Council. The real [[Nicholas Fury (Earth-616)|Fury]] confirmed that the imposter was an advanced [[Life-Model Decoy]] modified by [[Jacob Fury (LMD) (Earth-616)|Jake Fury]]. He was going to destroy the LMD, but the Life-Model Decoy was rescued by the Shadow Council and was named Max. Also operating in the \"Shadow Council\" were [[Aloysius Thorndrake (Earth-616)|Aloysius Thorndrake]] and hero [[John Steele (American Soldier) (Earth-616)|John Steele]].{{r|Secret Avengers Vol 1 5}}\n\n===Hulk===\nThe planet named [[K'ai]] entered the [[Sol|solar system]] and was on a collision course with Earth. The Secret Avengers wanted [[Bruce Banner (Earth-616)|Hulk]] to join them in a mission to intercept the planet as he was the only person on Earth who knew the planet and its culture. Hulk accepted it initially but when [[Skaar (Earth-616)|Skaar]] warned him against it, he refused to help the Avengers. The Secret Avengers asked [[Richard Jones (Earth-616)|Rick Jones]] if he would join the team who also turned him down. When the Secret Avengers left, the Hulk learned from Skaar that he has another son, [[Hiro-Kala (Earth-616)|Hiro-Kala]], who is the king of K'ai leading this \"attack\" on Earth.\n\nHulk began a rampage in [[Cape Canaveral]], trashing the spacecraft and equipment that was being prepared to intercept K'ai. The Secret Avengers arrived on the scene to battle the Hulk. After the team managed to subdue the behemoth, things only got worse when [[Jennifer Walters (Earth-616)|She-Hulk]], [[Elizabeth Ross (Earth-616)|Red She-Hulk]], Skaar, A-Bomb and [[Korg (Earth-616)|Korg]] arrived to aid Hulk in battle with the Avengers.\n\nAs a last ditch resort, Captain America threatened to have Black Widow and Moon Knight blast Hulk and his allies with a weapon that [[Iron Man (Anthony \"Tony\" Stark)|Iron Man]] had made as a last-ditch effort to counter future Hulk problems after [[World War Hulk]], that would transport them all to the [[Negative Zone]]. The Hulk reverted to Bruce Banner and again refused Captain America's offer to join him in this mission, and instead he and his allies took control of the mission and left to deal with K'ai and Hiro-Kala by themselves.\n\n===[[Fear Itself]]===\nThe Secret Avengers were trying to help defend the nation during Fear Itself. While half of the Secret Avengers including Ant-Man, Beast, War Machine and the Prince of Orphans battled against Sin and her robots, the other half consisting of Commander Steve Rogers, Moon Knight, Black Widow and Valkyrie rushed to stop a person leaking government secrets to the public under Captain America's previous alias as the The Captain. Captain America finally locates The Captain just in time to stop him from uploading a video confession but he was too late to save several undercover assets and informants that were murdered by the organizations and syndicates they were infiltrating. As The Captain declares Steve a hypocrite for now doing the government's bidding, [[Civil War|something that he previously rebelled against]], as well as forming the Secret Avengers who only answer to him, Captain America gives him a beat-down. The Captain is arrested soon afterwards.\n\nAfter the Captain is arrested, Beast is called away shortly to meet with the army because a member of the United States Congress who has locked himself in the House of Representatives wanted to meet him and refuses to evacuate the building despite that the building won't stand much longer. Leonard Gary, the revealed member of the United States Congress is a civil rights champion and old friend of Beast's who was revealed to be apparently responsible for making sure Senator Kelly's anti-mutant bills never made it. Beast meets with Gary to try to talk sense into him and get him to flee to safety. Gary refuses; showing Beast that when the evacuation came up, the House was still in session and he had the floor pushing a bill he'd been working on for eight years. The session was never officially called, so Gary's proposed health care bill was still officially on the table, so for that, Gary insisted upon staying. In the end, Beast leaves Gary behind to make his speech while he hacks into local news cameras to make sure the speech is given broad media coverage. Later in the speech, the building is heavily damaged and Gary is sadly presumably killed.\n\nAs the remaining Secret Avengers continued to try and defend Washington from Sin's blitzkrieg, one of the mystical war hammers from the Serpent crashed down in China ripping open the entrance to the Eighth City with its blazing trail of power. Prince of Orphans senses it immediately (as he is one of the Immortal Weapons) and he senses that hordes of demons flee out from the gate now opened by the hammer. Immediately, Prince of Orphans and War Machine leave the battlefield to investigate the matter in China, where they suddenly discover the villain Absorbing Man has arrived there to claim the weapon for himself. Then, Prince of Orphans and War Machine, allied with the rest of the Immortal Weapons including Iron Fist, fought against Absorbing Man and his wife Titania, both powered by two of the hammers. Meanwhile, the Black Widow began a quest personally to track down a group of journalists working for a muckraking tabloid who are wanting to post online about the death of the Widow's lover Bucky. She breaks into the offices, resulting is a lengthy meditation on the different meanings of the death of a superhero and the death of a normal person. The reporters agree not to publish the story as the public need to look up to the heroes instead of facing even superhuman's mortality.\n\n[[File:Secret Avengers Vol 1 25 Textless.jpg|thumb|right|Venom joins the team.]]\n===New members===\nAfter Steve Rogers became Captain America again, the roster changed drastically. The marksman [[Clinton Barton (Earth-616)|Hawkeye]] was the new leader, along with the addition of the inter-dimensional hero [[Brian Braddock (Earth-616)|Captain Britain]], the symbiotic soldier [[Eugene Thompson (Earth-616)|Venom]] and the original android [[Jim Hammond (Earth-616)|Human Torch]]. Meanwhile, Moon Knight, War Machine, and Sharon Carter left the team. Also [[Henry Pym (Earth-616)|Giant-Man]] helped to build the team's new base, the space station known as the [[Lighthouse (Space Station)|Lighthouse]]. In a mission against the [[Descendants (Earth-616)|Descendants]] (a group of robots formed by the [[Father (Earth-616)|Father]]), [[Eric O'Grady (LMD) (Earth-616)|Ant-Man]] seemingly died when saving a young boy, recently discovered to be a Descendant. In the end of the mission Human Torch was heavily damaged, but Ant-Man reappeared.\n\n[[File:Secret Avengers (Black Ops Unit) (Earth-616) Avengers vs. X-Men Vol 1 1.png|thumb|left]]\n===[[Avengers vs. X-Men (Event)|Avengers vs. X-Men]]===\nWhen the [[Phoenix Force (Earth-616)|Phoenix Force]] was determined to be heading to Earth, a team of Avengers was assembled with Beast, Captain Britain, Valkyrie, [[Noh-Varr (Earth-200080)|Protector]], War Machine, [[Vision (Earth-616)|Vision]], [[Carol Danvers (Earth-616)|Ms. Marvel]] and [[Thor Odinson (Earth-616)|Thor]] to go on a mission with the intent of stopping it before it reached the planet.{{r|Avengers vs. X-Men Vol 1 1}}\n\nIn the end, the Avengers couldn't destroy the Phoenix, but prevent it from destroying [[Hala (Planet)|Hala]], the homeworld of the [[Kree]] with the help of the, revived using energy of the Phoenix Force, [[Mar-Vell (Earth-616)|Captain Marvel]].\n\n===The Rise of the Descendants===\nAfter preventing the Shadow Council form using a three-part crown to fully unleash the mind-controlling [[Abyss (Entity) (Earth-616)|Abyss]], the Secret Avengers were attacked by the Descendants, who wanted to recover the Descendant child the heroes rescued, with the help of Ant-Man, revealed to be a Life-Model Decoy working for Father. Meanwhile, Hawkeye, Beast and [[Tamara Devoux (Earth-616)|Captain Universe]] traveled to [[Earth-666|another universe]] to retrieve the Orb of Necromancy, the object Father used to create the Descendants.\n\nThe Descendants, with the addition of the Human Torch, reprogrammed to serve them, launched a massive attack on the main cities of the world, starting an invasion to take it and launched a nano-mist, which slowly started turning every human into a Descendant.\n\nThe Secret Avengers fought them, and the Human Torch, who Captain Britain made come into his senses, managed to destroy the Orb of Necromancy, which killed every single one of the Descendants of the High-Breed and eliminated the nano-mist from any human. Before dying, the Father told Captain Britain he still felt the presence of another Descendant who didn't die.\n\nIn the aftermath, the Secret Avengers reunited with Captain America to tell him what happened. Later, Hawkeye decided to disassemble the black ops unit.\n\n| Equipment               = \n| Transportation          = Quincarrier\n| Weapons                 = Each teammates' arsenal\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Heroic Age (Event)]]"
                }
            }
        }
    ],
    "page_id": "335699"
}