{
    "pageid": 493646,
    "ns": 0,
    "title": "Seven Sons of Satan (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Seven Sons of Satan (Earth-616) from Captain America Comics Vol 1 37 001.jpg\n| Name                    = Seven Sons of Satan\n| Aliases                 = Sons of Satan\n| Identity                = Secret\n\n| Status                  = Defunct\n| Relatives               = \n| Reality                 = Earth-616\n| BaseOfOperations        = [[India]]\n\n| Origin                  = \n| Creators                = \n| First                   = Captain America Comics Vol 1 37\n| Last                    = Captain America Comics Vol 1 37\n\n| HistoryText             = [[File:Seven Sons of Satan (Earth-616) from Captain America Comics Vol 1 37 002.jpg|thumb|left|The Sons of Satan at their father's death bed]]\nThe Son of Satan was not one man, but seven identical brothers whose father was a Satan worshiper as well as a staunch Japanese loyalist. On his deathbed, he told his children to \"Go forth and crush our enemies! You are the sons of Satan... Make yourselves hated among the white race!\" He ordered his sons to brand their foreheads with the mark of the cloven hoof and to use black magic and superstition against their enemies.\n\nBy 1944, the Sons of Satan had set up in India just outside the boarder of Berma. There they began a series of attacks on Allied Forces using the trickery they learned from their father to facilitate these attacks. The first such brother disguised himself as a snake charmer and sent a cobra to attack General Montbatten who was to command Allied troop on an attack on Berma. The general was rescued by [[Steven Rogers (Earth-616)|Steve Rogers]] and [[James Buchanan Barnes (Earth-616)|James Barnes]] (secretly Captain America and Bucky). They chased after Montbatten's attacker, and when they cornered him, he attempted to attack Barnes with a knife. In the struggle, he tripped over Barnes and landed on his knife. As he died, he told the two men that he was the \"Son of Satan\" and that he would return from the dead stronger than before. \n\nThat night, the second brother went to the American outpost and attempted to blow up their ammo dump with a small rocket. This rocket was intercepted by Captain America and Bucky. When the two heroes confronted the second brother, he claimed to be the Son of Satan as well. When the two heroes were about to defeat him, he committed suicide, telling them that he will return three times stronger than ever before. Biting down on a specially made capsule as he died, a wisp of smoke came from his mouth, making it look like his soul was leaving his body to further support this belief. \n\nThe attack convinced General Montbatten to begin the attack that night. Their troop had to pass through a canyon that went past a tower. This tower is where the third brother was located. He rigged explosives to the canyon and was prepared to set off the explosives if he was not for the fact he was spotted by Captain America and Bucky. Cornered by the two heroes, the third brother caused the switch to the explosives to short circuit, electrocuting himself to death. \n\nThe fourth brother attempted to get elephants to trample the soldiers by using a flamethrower to make them stampede. Captain America and Bucky turned the elephants the other way with some mice and then confronted the fourth brother -- Captain America convinced they have been fighting different men each time. The remaining four brothers all joined in and knocked out Captain America and Bucky and took them to their hideout. There, the they were told the truth, and were to be beheaded, but the two heroes broke free and beat the four remaining \"Sons of Satan\" into submission.\n\nThe surviving members were turned over to the military,{{r|Captain America Comics Vol 1 37}} their subsequent fate is unknown.\n\n| Equipment               = Each of the Sons of Satan carries a capsule that once bitten into releases a cloud of smoke that resembles a human soul leaving the body.\n| Transportation          = \n| Weapons                 = The Sons had access to explosives, daggers, samurai swords, flame throwers, and at one point used a poisonous cobra as a weapon.\n\n| Notes                   = \n| Trivia                  = \n| Marvel                  = \n| Wikipedia               = \n| Links                   = \n}}\n[[Category:Satanism]]"
                }
            }
        }
    ],
    "page_id": "493646"
}