{
    "pageid": 508626,
    "ns": 0,
    "title": "Seven (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Seven (Earth-616) tattoo from Blade Vol 3 4 0001.gif\n| Name                    = [[The Seven]]\n| Aliases                 = Seofen, Seofen Inc.\n| Distinguish1            = Salem's Seven\n\n| Leaders                 = [[Tomothy (Earth-616)|Tomothy]]\n| CurrentMembers          = [[Percival (Seven) (Earth-616)|Sir Percival]]; [[Kwate (Earth-616)|Kwate]]; [[Couleur (Earth-616)|Couleur]]\n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = [[Eric Brooks (Earth-616)|Blade]]\n| Enemies                 = [[Tryks]], [[Vampires]]\n\n| Origin                  = Created to keep a balance with supernatural creatures\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = New York City \n| PlaceOfFormation        = England 1000 years ago\n| PlaceOfDissolution      = \n\n| Creators                = Christopher Hinz\n| First                   = Blade Vol 3 1\n\n| History                 = The organization known as the Seven, was created over 1,000 years ago to fight the [[Tryks]] and other supernatural creatures. With the realization that they could not wipe all the monsters they decided to follow the policy of \"Vampire Equilibrium\". This goal allowed them to control numbers by not letting any supernatural creature gain too much power, permitting a peaceful coexistence with humanity.\n[[File:Seven (Earth-616) from Blade Vol 3 1 0001.gif|left|thumb]]\nThe Seven's main targets have been the Tryks, a powerful group of [[vampires]] who could wipe out all the others if their numbers were not kept low. The Seven over the centuries changed with the time, changing the name to Seofen and then in the 20th Century to Seofen Inc. The organization went underground, which led the Tryks to believe they had vanished.\n\nThe Seven as a group are very nostalgic as they like to keep trophies of their battles. In the Museum they have a body of a Tryk on display as well as a 16th Cenutry painting of a Tryks Queen, along with the collection of archaic weapons.\n\nFor many years Seofen Inc. spread its network across the globe. They created so if a vampire hunter needed help they would be there. The main purpose of the network was to track \"Fresh Produce\", which was their code name for newly turned Tryks. On a mission [[Kwate (Earth-616)|Kwate]]'s partner was killed when they miss the 24-hour window to kill a newborn Tryk.\n\nSeofen Inc. later receives a call from one of their operatives called Wilbur. Kwate and the rookie recruit Couleur are sent to deal with this Tryk case. Couleur was nervous about his first case but Kwate, calmly explained everything to him. They meet Wilbur in a hotel where the “Produce” is located, and for his help and silent’s he is given two tickets to Hawaii and a brand new Mercedes.\n\nThe partners enter the hotel room to find a middle-aged man asleep in bed. Kwate takes out the portable X-ray scan the “Gut-Sucker”, which is the Seven codename for the Tryks next stage in their metamorphosis. Kwate tested his rookie partner about the V3, as he followed the usual procedure. He removed tow cable fro his suitcase and attached it to the man. He then sent a high-voltage shock through the body, which drove the Gut Sucker out.  Kwate then killed the creature with biogenic poison and placed the specimen in his suitcase. They leave the body for the paramedics as he is now just another case of unexplained death. \n\nAfter the successful mission Kwate decides to take Couleur to meet with their boss, but warned the rookie to stay on subject when talking to him. When couleur meets Tomothy he thinks the bodyguard is his new boss due to his teenage like appearance. Tomothy is fine with the mistake explaining it happens all the time.  Tomothy explains about the history of the seven and how over the centuries they have dealt with their enemies.  He promises Tomothy that he would do his best for the organization, but art that moment Tomothy hits Couleur in his ribs angering the rookie. Tomothy explains is please with the result as aggressive behavior is important as can not have an agent who would wimp away from an attack. When Couleur asks him if there are any other test Kwate says “never let your guard down”.\n\nLater that week Tomothy contacts Kwate at the biannual shareholders meeting for Seofen Inc., he informs about Blades recent attack on the vampires and how he has destroyed to elite Uukog squads. Tomothy has suspected that Blade had help, but his did not matter as once again Blade has gone too far. Tomothy sent Kwate to kill Blade to prevent anymore Vampire clans going to war. \n\n[[Kwate (Earth-616)|Kwate]] and [[Couleur (Earth-616)|Couleur]] are driven to Tomothy's estate, were they witness Sir Percival who now appears to be an infant receive his drink of wine whilst in his playpen. This was Couleur's first trip to the mansion and is given a tour and shown the museum. Couleur was told about the powers of the [[Cilla (Earth-616)|Susan VendermeerTryk Queen]]. It was revealed that the Seven no longer train in combat with a sword, so the Tryk Killer weapon was useless to them. They travel to the modern armory to gain their arsenal of state of the art weaponry.\n\nThe Seven monitored the NSA regularly, and via that they are able to decipher a phone call from a vampire as to where Valencia is keeping Blade.  Kwate and couleur remain hidden on a nearby hill armed with sniper rifles. Couleur was wary about killing Blade but Kwate reminded him they have to follow orders. [[Rowkis (Earth-616)|Rowkis]] sneeks up on Coleur and takes away his weapon and bonds with him.\n\nKwate does not notice him as he is watching, but then [[Rowkis (Earth-616)|Rowkis]] his gun and bonds with him as well. Rowkis then attacks Blade and easily beats the Daywalker. Rowkis takes Couleur and Kwate back to the Tryk lair. They then discovered the Seofen tattoo and plan to interrogate him, but Queen Cilla decides to take them to the Waters of Luthuk.\n\nBlade tracts down Tomothy’s mansion and uses an access card to enter the building, that on of Seofen agent’s hade dropped. Tomothy’s bodyguard warned him of Blades Trespass. Tomothy requests for a weapon and waits for the Daywalker to find him. When Blade enters the library he see Timothy sitting in a chair with alcohol and a cigar. He tells Blade the history of the Seofen and the trouble Blade has caused with his action. [[Percival (Seven) (Earth-616)|Sir Percival]] in his playpen grabs his gun and shoots Blade, but then forgets and continues to chew on his teddy bear. Tomothy realizes he cannot win so makes a deal with Blade and asks him to resuce his agent from the Tryks. He tricks Blade by telling that the Waters of Luthuk could turn a Daywlker into a human. Tomothy gives Blades the Tryk Slayer sword and Blade leaves to find the Tryks lair. \n\nBlade returned home with the sword and planned to find the lair but receives a call from [[Cilla (Earth-616)|Susan Vendermeer]] called and listened to what he thought was a kidnapping.  Blade finds the lair and tries to contact Tomothy, but his phone had no signal and. Tomothy who was in bed with his made wished him luck and hoped he could save his people on his own. \n\nBlade finds Susan and she leads to the captured Seofen agents, handcuffed beneath the Waters of Luthuk.  Susan begged him to save them but once the waters touched him he forgot about them.  He kills all the [[Tryks]] except Cilla, angered by Tomothy lies [[Eric Brooks (Earth-616)|Blade]] decides to keep the sword. \n\nLater [[Kwate (Earth-616)|Kwate]] and [[Couleur (Earth-616)|Couleur]] are of a private jet. They contact Tomothy and tell him that Blade has the sword and Cilla is pregnant with his child. Tomothy warns the agents the male spring of their union would be big trouble for the whole world. Due to the Tryks destruction which brought about the “Vampire Equilibrium”, they decided to let Blade continue his [[Vampire]] slaying mission.{{r|Blade Vol 3 1|5}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = * Seofen is Old English for Seven.\n| Links                   = \n}}\n[[Category:Vampire Hunters]]\n[[Category:Mystical Organizations]]"
                }
            }
        }
    ],
    "page_id": "508626"
}