{
    "pageid": 482702,
    "ns": 0,
    "title": "Sewer People (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Sewer People (Earth-616) from Marvel Mystery Comics Vol 1 36 0001.jpg\n| Name                    = Sewer People\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = Formerly the [[Cyclops (Sewer People) (Earth-616)|Cyclops]] (deceased)\n| CurrentMembers          = \n| FormerMembers           = [[Cyclops (Sewer People) (Earth-616)|Cyclops]], unnamed member\n| Allies                  = \n| Enemies                 = [[Aarkus (Earth-616)|Vision]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Gustav Schrotter\n| First                   = Marvel Mystery Comics Vol 1 36\n| Last                    = Marvel Mystery Comics Vol 1 36\n\n| HistoryText             = The Sewer People were a group of hideously deformed humans that lived in the sewers of New York City during the 1940s, their existence predating the [[Morlocks (Earth-616)|Morlocks]] by at least 20 years. They were led by a ruthless one-eyed man calling himself the Cyclops. After years spent scrounging for food, the Cyclops convinced his people to rise from the sewers and attack the surface people they had grown to hate so much.\n\nThose they did not murder in the streets, they took down into the sewers below and tortured. Their activities were a mystery to the surface world but grabbed the attention of the [[Aarkus (Earth-616)|Vision]]. Appearing in New York, he came to the aid of a young woman being attacked by the creatures and was captured himself. Brought down into their laid, the Cyclops decided to torture him personally. Tied to a table, the Vision was to be tortured with a blow torch, however the smoke from this torch allowed the Vision to transport between dimensions and appear behind the Cyclops.\n\n[[File:Cyclops (Sewer People) (Earth-616) from Marvel Mystery Comics Vol 1 36 0001.jpg|thumb|left|The Cyclops, leader of the Sewer People]]\nCatching the Cyclops off guard, the Vision managed to close down the flood gates in the underground tunnels and begin filling the sewers with water. With his minions trapped, the Cyclops attempted to free himself, but was beaten into unconsciousness by the Vision. With the Cyclops defeated, the Vision left the sewers, leaving the Sewer People to drown, ending their threat.{{r|Marvel Mystery Comics Vol 1 36}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Sewer People were armed with whips and the Cyclops used a blow torch to torture his victims.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "482702"
}