{
    "pageid": 389654,
    "ns": 0,
    "title": "Shadow Council (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Shadow Council (Earth-616) from Secret Avengers Vol 1 1 001.jpg\n| Name                    = Shadow Council\n| Aliases                 = Shadow Empire{{r|Heroic Age: Villains Vol 1 1}}\n\n| Leaders                 = Formerly [[Aloysius  Thorndrake (Earth-616)|Aloysius Thorndrake]], [[John Steele (American Soldier) (Earth-616)|John Steele]], [[Max Fury (Earth-616)|Max Fury]]\n| CurrentMembers          = [[Arnim Zola 4.2.3 (Earth-616)|Arnim Zola 4.2.3]]\n| FormerMembers           = [[Grigory Efimovich Rasputin (Earth-616)|Grigory Rasputin]], Lt. Hood, [[John Steele (American Soldier) (Earth-616)|John Steele]], [[Max Fury (Earth-616)|Max Fury]], [[Tutankhamun (Earth-616)|Tutankhamen]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = [[Jacob Paxton (Earth-616)|Jacob Paxton]], [[Masters of Evil (Earth-616)#Shadow Council's Masters of Evil|Masters of Evil]], [[Zheng Zu (Earth-616)|Zheng Zu]]\n| Enemies                 = [[Secret Avengers (Black Ops Unit) (Earth-616)|Secret Avengers]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = Formerly [[Bagalia]]\n| PlaceOfFormation        = [[Vanishing Point]]{{r|Secret Avengers Vol 1 4}}\n| PlaceOfDissolution      = \n\n| Creators                = Ed Brubaker; Mike Deodato Jr.\n| First                   = Secret Avengers Vol 1 1\n\n| History                 = \n===Origin===\nIn 1865, by the end of the [[American Civil War (Event)|American Civil War]], [[John Steele (American Soldier) (Earth-616)|John Steele]] was discovered to be a spy working for the [[United States Army (Earth-616)|Union]] by a group of [[Confederate States Army (Earth-616)|Confederate]] soldiers led by [[Aloysius Thorndrake (Earth-616)|Aloysius Thorndrake]]. The vengeful soldiers chased Steele through [[Texas (State)|Texas]] until they all stumbled into a portal that connected [[Earth]] to [[Mars (Planet)|Mars]].{{r|Secret Avengers Vol 1 3}}{{r|Secret Avengers Vol 1 12}} The portal was a pathway through a sidereality they would later name the [[Vanishing Point]], where an ancient entity known as the [[Abyss (Entity) (Earth-616)|Abyss]] was trapped since the dawn of time.{{r|Secret Avengers Vol 1 3}} Steele and the Confederate soldiers were tainted by said entity's touch and became his servants.{{r|Secret Avengers Vol 1 12}}\n\nAt an unspecified point after that, the former Confederate soldiers created the subversive organization called the Shadow Council{{r|Secret Avengers Vol 1 12}} and started working towards building an army to give the Abyss.{{r|Secret Avengers Vol 1 30}} They established two bases of operations in each end of the pathway between Earth and Mars they had found, and used it until modern times.{{r|Secret Avengers Vol 1 3}}\n\n===John Steele and Max Fury===\nJohn Steele eventually got free from the Abyss' control{{r|Secret Avengers Vol 1 12}} and actively fought during both [[World War I]] and [[World War II]],{{r|Secret Avengers Vol 1 11}} which was when the Shadow Council lured him into a trap and performed a ritual to rip reality open so the Abyss could take control of his mind again. He joined the Shadow Council soon afterwards.{{r|Secret Avengers Vol 1 12}} Decades later, Steele helped a [[Life-Model Decoy]] of [[Nicholas Fury (Earth-616)|Nick Fury]] who had all of the spy's memories (courtesy of the [[Zodiac Key]] [[Jacob Fury (LMD) (Earth-616)|Scorpio]] used to reprogram him) escape from [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] Naming him [[Max Fury (Earth-616)|Max]], Steeele convinced the LMD to join the Shadow Council{{r|Secret Avengers Vol 1 5}} and he eventually became the organization's head of security.{{r|Secret Avengers Vol 1 3}}\n\n===Dark Children===\nYears later, the Shadow Council allowed [[Roxxon Energy Corporation (Earth-616)|Roxxon]] to dig up in Mars in the hopes that they could find for them the three mystic crowns the [[Martians (Race)|Martians]] created to channel the power of the Abyss' [[Dark Children]]. The [[Thorned Crown]] was found and enshrined by the Shadow Council{{r|Secret Avengers Vol 1 1}} while the [[Crown of Tentacles]] was found by Roxxon, who turned against their backers to take the crown for themselves (presumably under the crown's influence).{{r|Secret Avengers Vol 1 3}} Word of Roxxon having a [[Serpent Crown]] eventually got out, catching the attention of the [[Secret Avengers (Black Ops Unit) (Earth-616)|Secret Avengers]], a strike team assembled by [[Steven Rogers (Earth-616)|Steve Rogers]]. Transferred to a Roxxon facility in [[Dubai]], the Crown of Tentacles was stolen by the Secret Avengers before the Shadow Council had the chance to do so themselves.{{r|Secret Avengers Vol 1 1}}\n\nWhen [[Richard Rider (Earth-616)|Nova]] went missing after going to Mars to check on the Roxxon drilling facility for Steve Rogers, the Secret Avengers traveled to the red planet to rescue him, not knowing he had been influenced into donning the Thorned Crown he found.{{r|Secret Avengers Vol 1 1}} The Shadow Council took advantage of their absence to steal the Crown of Tentacles from their headquarters, the [[Quincarrier]].{{r|Secret Avengers Vol 1 1|2}} The possessed Nova went on to try and break the seal to awaken the [[Darkest Child (Earth-616)|Darkest Child]], but the Secret Avengers arrived just in time to stop him.{{r|Secret Avengers Vol 1 2|4}} The Thorned Crown was then taken to a safer place by [[Archon (Earth-616)|Archon]],{{r|Secret Avengers Vol 1 4}} one of the constructs created by the [[Watchers]] to guard the Abyss.{{r|Secret Avengers Vol 1 3}} Despite this, however, the Shadow Council got their hands on the crown at a later point.{{r|Secret Avengers Vol 1 29}}\n\nIt wasn't without its losses for the Shadow Council though: while the Secret Avengers were investigating Roxxon's operations on the red planet, [[Eric O'Grady (Earth-616)|Ant-Man]] found the Shadow Council's citadel nearby, and was accidentally swallowed by the portal.{{r|Secret Avengers Vol 1 2}} He went through the Vanishing Point and appeared moments later in the Shadow Council's base in Texas.{{r|Secret Avengers Vol 1 3}} Ant-Man then followed a squad of Shadow Council suicide bombers back into the Vanishing Point. When the soldiers noticed his presence, Ant-Man shot them with an energy blast, causing a chain reaction that detonated their suits and destroyed the two citadels at the end of each portal right before he exited it, seemingly causing the Vanishing Point to collapse.{{r|Secret Avengers Vol 1 4}}\n\n===Zheng Zu===\nWith the world changing fast and [[China]] being at its forefront, the Shadow Council needed someone pulling the strings there.{{r|Secret Avengers Vol 1 10}} To this end, they brought the evil magician [[Zheng Zu (Earth-616)|Zheng Zu]] back to life as a half-dead being,{{r|Secret Avengers Vol 1 6}} planning to fully resurrect him later so he would be in debt with them.{{r|Secret Avengers Vol 1 10}} To accomplish such a feat, the Shadow Council needed to collect the [[Eyes of the Dragon]], two magical stones created by Zheng Zu and his brother that Zheng Zu used to steal his brother's (and later his own children's) life essence to live forever, and capture Zheng Zu's son, [[Shang-Chi (Earth-616)|Shang-Chi]], to perform a ritual. Though they managed to do both,{{r|Secret Avengers Vol 1 6|10}} the Secret Avengers' intervention during the ritual resulted in the death of Zheng Zu and the imprisonment of John Steele,{{r|Secret Avengers Vol 1 10}} who was later freed of the Abyss' control.{{r|Secret Avengers Vol 1 12}}\n\n===Other Operations===\nIn [[Serbia]], the Shadow Council abducted several hundred people and rigged their brains in parallel to try and create a bio-computer, but the Secret Avengers stopped them in their tracks.{{r|Secret Avengers Vol 1 17}}\n\n===Masters of Evil===\nBelieving that the Shadow Council was building a weak army for the Abyss,{{r|Secret Avengers Vol 1 30}} Max Fury took over the organization and used their wealth to fund [[Bagalia]], an anarchistic red light nation where he gathered together a new incarnation of the [[Masters of Evil (Earth-616)#Shadow Council's Masters of Evil|Masters of Evil]]{{r|Secret Avengers Vol 1 29}} to serve the Abyss.{{r|Secret Avengers Vol 1 30}} With the [[Crown of Wolves]] already located, the Shadow Council had at least five undead sorcerers (including [[Grigory Efimovich Rasputin (Earth-616)|Grigory Rasputin]] and [[Tutankhamun (Earth-616)|Tutankhamen]]) fly aircrafts all over the world in anticipation of the Abyss' arrival.{{r|Secret Avengers Vol 1 29|30}}\n\nJohn Steele, who was working undercover for the Secret Avengers since they freed him from the Abyss' control, attempted to escape from Bagalia with the Thorned Crown but was caught by the new Masters of Evil and subsequently murdered. Consequently, the Secret Avengers went to Bagalia to try and stop [[Anthony Masters (Earth-616)|Taskmaster]] from delivering the Crown of Wolves to Max Fury as he was hired to do.{{r|Secret Avengers Vol 1 29}} Taskmaster managed to deliver the package, however, and was paid with shots to the chest.{{r|Secret Avengers Vol 1 30}} Once in possession of all three crowns, Max Fury merged them together and donned the merged crown to become the Abyss' vessel, but that didn't work as he was an LMD. The merged crown was then donned by a wounded Taskmaster, who proceeded to take control of the minds of both the Masters of Evil and the Secret Avengers.{{r|Secret Avengers Vol 1 30}}\n\nThe Secret Avengers [[Eugene Thompson (Earth-616)|Agent Venom]] and [[Eric O'Grady (LMD) (Earth-616)|Ant-Man]], who weren't affected by the Abyss' influence due to one being a [[Symbiotes|symbiote]] host and the other secretly an LMD replacement, fought against the Abyss as he tried to spread his influence beyond Bagalia and managed to severe his connection to Earth by bonding the [[Venom (Symbiote) (Earth-616)|Venom symbiote]] to Taskmaster and unmerging the three crowns.{{r|Secret Avengers Vol 1 30|32}} The crowns were then confiscated by the Secret Avengers{{r|Secret Avengers Vol 1 32}} while Max Fury was incarcerated at the [[Lighthouse (Space Station)|Lighthouse]].{{r|Secret Avengers Vol 1 33}}\n\n===Descendants===\nSome time before putting his hands on the Crown of Wolves, Max Fury allied himself with the [[Descendants (Race)|Descendants]], a collection of mechanical lifeforms created by the man only known as [[Father (Earth-616)|Father]] by using the [[Orb of Necromancy]].{{r|Secret Avengers Vol 1 22}}{{r|Secret Avengers Vol 1 24|25}} He planned to use the Abyss to help the Descendants get rid of humanity,{{r|Secret Avengers Vol 1 33}} but got too carried away by the prospect of not feeling life that the entity offered.{{r|Secret Avengers Vol 1 31}} That coupled with him working for no fewer than three organizations was enough to earn Father's distrust. Once Fury had been imprisoned by the Secret Avengers, Father ordered the Ant-Man LMD (now calling himself the Black Ant) to enter his cell and make him sign some papers handing Bagalia over to him. After he signed it, Black Ant killed him.{{r|Secret Avengers Vol 1 33}} What became of the Shadow Council after their leader's death is unknown.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = * Despite being called the Shadow Council in all of its appearances and mentioned as such in most handbook entries, the organization is identified as the Shadow Empire in {{cl|Heroic Age: Villains Vol 1 1}}, where it's also said that their board of directors is the group actually called the Shadow Council.\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Heroic Age (Event)]]\n[[Category:Terrorist Organizations]]\n[[Category:Ed Brubaker/Creator]]\n[[Category:Mike Deodato Jr./Creator]]"
                }
            }
        }
    ],
    "page_id": "389654"
}