{
    "pageid": 559492,
    "ns": 0,
    "title": "Shawmis Tribe (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Shawmis Tribe (Earth-616) from Black Rider Vol 1 11 0001.jpg\n| Name                    = Shawmis Tribe\n| Aliases                 = Shawmis\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Bright Eagle (Earth-616)|Bright Eagle]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Matthew Masters (Earth-616)|Black Rider]], [[Utabi Tribe (Earth-616)|Utabi Tribe]]\n| Enemies                 = [[Crooked Knife (Earth-616)|Crooked Knife]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Shawmis Village\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Al Hartley\n| First                   = Black Rider #11\n\n| History                 = The Shawmis Tribe was a band of Native Americans who were prevalent during the days of the American Frontier. They were led by a warrior named Bright Eagle. For years they were regularly at war with the rival [[Utabi Tribe (Earth-616)|Utabi Tribe]], but eventually the two tribes began negotiating peace. As part of this peace deal, Bright Eagle asked the chief of the Utabi people to marry off his daughter Pale Mist. The chief agreed despite the protests of Utabi warrior [[Crooked Knife (Earth-616)|Crooked Knife]].\n\nAfter a botched attempt at massacring the Utabi envoy disguised as Shawmis warriors, Crooked Knife tried to silence Pale Mist who recognized him. Instead, she was rescued by the western hero the [[Matthew Masters (Earth-616)|Black Rider]]. Crooked Knife used this to his advantage by convincing both tribes that the Black Rider had kidnapped the woman. \n\nBright Eagle was furious and ordered a warpath of Shawmis to join the Utabi in hunting down the Black Rider while Bright Eagle waited with the Utabi chief. They were greeted by Matthew Masters, the Black Rider's alter ego who convinced them of Crooked Knife's duplicity in events. Bright Eagle agreed to lay a trap for Crooked Knife by feigning sickness and placing a dummy in a teepee. When Crooked Knife attempted to assassinate Bright Eagle he was caught in the act. In a fight to the death against Bright Eagle, Crooked Knife was killed.\n\nIn the aftermath, Bright Eagle was reunited with Pale Mist and the two were married, creating a union between the two tribes.{{r|Black Rider #11}}\n\nThe fate of the Shawmis people is unknown.\n| Equipment               = \n| Transportation          = The Shawmis rode horses.\n| Weapons                 = The Shawmis people had access to weapons that were common to Native American tribes of the time: knives, spears, and bows and arrows. They also had access to firearms such as rifles which they obtained through trading with American settlers.\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Native American Tribes]]\n[[Category:Archery]]\n[[Category:Shooting]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "559492"
}