{
    "pageid": 1423412,
    "ns": 0,
    "title": "Shi'ar Imperial Fleet (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Title                   = [[Shi'ar Imperial Fleet]]\n| Image                   = Shi'ar Imperial_Fleet (Earth-616) from X-Men Emperor Vulcan Vol 1 1.png\n| Name                    = Shi'ar Imperial Fleet{{r|Uncanny X-Men Vol 1 154}}{{r|War of Kings Vol 1 6}}\n| EditorialNames          = \n| Aliases                 = Shi'ar Starfleet,{{r|X-Men Annual Vol 1 5}} Shi'ar Armada,{{r|Avengers Vol 1 345}} Shi'ar Fleet,{{r|Guardians of the Galaxy Vol 2 13}} Imperial Fleet,{{r|War of Kings: Ascension Vol 1 4}} Imperial Shi'ar Fleet,{{r|War of Kings Vol 1 1}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Chandilar]]\n\n| Leaders                 = [[Xandra Neramani (Earth-616)|Majestrix Xandra]]; formerly [[Kallark (Earth-616)|Majestro Kallark]], [[Medusalith Amaquelin (Earth-616)|Queen Medusa (Royal Inhumans)]], [[Gabriel Summers (Earth-616)|Emperor Vulcan]], [[Lilandra Neramani (Earth-616)|Majestrix Lilandra]], [[Cal'syee Neramani (Earth-616)|Majestrix Cal'syee (Deathbird)]], [[D'ken Neramani (Earth-616)|Majestro D'Ken]], [[T'Korr (Earth-616)|Majestor T'Korr]] \n| CurrentMembers          = [[Ka'ardum (Earth-616)|Major General Ka'ardum]], [[Vivali (Earth-616)|Commander Vivali]], [[K'rk 'N'Kazaii (Earth-616)|Captain K'rk]]\n| FormerMembers           = [[C'efn (Earth-616)|Commander C'efn]], [[T'kyll Alabar (Earth-616)|Admiral T'kyll Alabar]], [[Samedar (Earth-616)|Admiral Lord Samedar]]\n| Allies                  = [[Galactic Council (Earth-616)|Galactic Council]], [[X-Men (Earth-616)|X-Men]], [[Starjammers (Earth-616)|Starjammers]], [[Avengers (Earth-616)|Avengers]], \n| Enemies                 = [[Kree]], [[Brood (Race)|Brood]], [[Phalanx (Race)|Phalanx]], [[Builders (Race)|Builders]], [[Inciters (Earth-616)|Inciters]], [[Mephitisoids]], [[Uncreated (Aliens)|Uncreated]], [[Starjammers (Earth-616)|Starjammers]], [[X-Men (Earth-616)|X-Men]], [[Inhumans (Inhomo supremis)|Inhumans]]\n\n| Origin                  = [[Shi'ar (Race)|Shi'ar]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = X-Men Vol 1 97\n\n| Overview                = The '''Shi'ar Imperial Fleet''' is a military organization in charge of patrolling Shi'ar space, exploring space, fighting hostile enemy fleets, discovering worlds, transporting Shi'ar troops, orbital bombardment, expanding the empire, and destroying worlds or stars. The crews of Shi'ar starships vary, with some having multi-species crews (though with a Shi'ar majority) and other vessels only having Shi'ar crew members.{{r|Uncanny X-Men Vol 1 157}}{{r|Excalibur Vol 1 70}}{{r|Uncanny X-Men Vol 1 477}} \n\nShi'ar battle groups vary in size, and the larger ones may have hundreds of warships.{{r|Avengers Vol 1 345}} The Shi'ar fleet uses a variety of ship types, including; scout ships,{{r|X-Men Vol 1 107}}, [[Shi'ar Jumpship|jumpships]],{{r|Uncanny X-Men Vol 1 479}}, [[Shi'ar Star Cruiser|cruisers]],{{r|Uncanny X-Men Vol 1 486}} [[Shi'ar Battlecruiser|battlecruisers]],{{r|X-Men Vol 1 135}} [[Shi'ar Dreadnought|dreadnoughts]],{{r|Uncanny X-Men Vol 1 157}} and Star Destroyers.{{r|X-Men: Emperor Vulcan Vol 1 1}} It has ships the size of planetoids, among them the Behemoth-class warships and the Fearless-class dreadnoughts.{{r|Uncanny X-Men Vol 1 275}}{{r|X-Men: Spotlight on...Starjammers Vol 1 1}} Commanders in charge of squadrons or fleets have titles such as Admiral and Major General.{{r|Uncanny X-Men Vol 1 154}}{{r|Uncanny X-Men Vol 1 484}}\n| History                 = The Shi'ar fleet participated in the Shi'ar civil war that erupted when a rumor leaked that Princess [[Lilandra Neramani (Earth-616)|Lilandra Neramani]] had attempted to kill and usurp her brother [[D'ken Neramani (Earth-616)|Majestrix D'Ken]]. The Shi'ar fleet which Lilandra was the Grand Admiral of, split down the middle. Lilandra who opposed D'Ken's plans regarding the [[M'kraan Crystal]], led a great rebellion against him. She was captured and held on [[K'rk 'N'Kazaii (Earth-616)|Captain K'rk]]'s starship, but was then rescued by her elite exploratory fleet, the Pathfinders. In the final battle of the civil war, she escaped but the Pathfinders were wiped out.{{r|X-Men Vol 1 107}} \n\nYears later, after the civil war and during the reign of Majestrix Lilandra, a terrorist attack slaughtered most of the Shi'ar Grand Council and the Majestrix Lilandra was kidnapped. The [[Starjammers (Earth-616)|Starjammers]] were implicated and their trail led to Earth, with a Shi'ar fleet in pursuit. Which was led by [[Samedar (Earth-616)|Lord Admiral Samedar]], who had been bribed by [[Cal'syee Neramani (Earth-616)|Deathbird]] to join her and her allies the [[Brood (Race)|Brood]] in destroying the Earth, and killing both Lilandra and the [[X-Men (Earth-616)|X-Men]]. Discovering the plot, the X-Men were able to delay and ultimately stop the Shi'ar attack on Earth, with Lilandra ordering Samedar's arrest.{{r|Uncanny X-Men Vol 1 154|157}}\n\nWhen the [[Warskrulls]] infiltrated the Shi'ar empire, they replaced the Starjammers and key people in government. The Shi'ar fleet was to commit genocide on various worlds affiliated with the Shi'ar Empire as the Warskrulls nearly brought down the empire, until the conspiracy was discovered and stopped by Deathbird and the X-Men.{{r|Uncanny X-Men Vol 1 276|278}} The Shi'ar fleet would later be involved in the [[Operation Galactic Storm|Kree-Shi'ar War]], an intergalactic conflict brought about by the manipulations of the [[Supreme Intelligence (Earth-616)|Kree Supreme Intelligence]]. A Shi'ar armada came into the Sol System, using a Shi'ar stargate. The use of the stargate was destabilizing the Sun, threatening the Earth which forced the [[Avengers (Earth-616)|Avengers]] to get involved. Shi'ar warships monitored the devastation caused to the Kree galaxy by the Shi'ar [[Nega-Bombs|Nega-Bomb]].{{r|Avengers Vol 1 345}}{{r|Avengers Vol 1 347}}\n\nSome time afterwards, the [[Uncreated (Aliens)|Uncreated]] invaded the Shi'ar empire, torching various worlds and extinguishing all life on their surfaces.{{r|Starjammers Vol 1 1}} The Uncreated had a decisive advantage over the Shi'ar. Unlike the Shi'ar who used guile and precision in their warfare, the Uncreated used pure brute force.{{r|Starjammers Vol 1 3}} Which permitted their ships' weapons to blow thru the shields of Shi'ar warships.{{r|Starjammers Vol 1 1|2}} The Shi'ar decided to make their final stand over the [[Clench Worlds|Clench World]] of [[Standing Still]], which the Starjammers realized would not only likely result in their defeat but would threaten the lives of billions in the world below. The Starjammers created a colossal hologram of the Uncreated's god, which made pushed the Uncreated into committing suicide.{{r|Starjammers Vol 1 4}} \n\nThe [[Phalanx (Race)|Phalanx]] whose dominion had been expanding toward the Shi'ar empire in the previous years, invaded an empire weakened by the Uncreated.{{r|Starjammers Vol 1 4}}{{r|Uncanny X-Men Vol 1 341}} An invasion which the Shi'ar fleet was unable to stop, as the core of their empire was devastated. The Phalanx conquered the [[Chandilar|throneworld]], only the intervention of the X-Men saved the Shi'ar empire.{{r|Uncanny X-Men Vol 1 341|344}} Years later, the Shi'ar fleet was sent to sterilize Earth. The order was given because of the \"thought-plague contamination\" that was ravaging the galaxy. Lilandra and her consort [[Charles Xavier (Earth-616)|Xavier]] were being controlled by [[Cassandra Nova Xavier (Earth-616)|Cassandra Nova]]. She had Lilandra order the Shi'ar fleet to make war on the Shi'ar Empire and turn it into a cosmic pyre. The Shi'ar fleet ceased its attacks on Shi'ar worlds when Cassandra was stopped by the X-Men.{{r|New X-Men Vol 1 123|126}} \n[[File:Shi'ar Imperial Fleet (Earth-616) from War of Kings Vol 1 1.png|right|thumb|300px|Shi'ar fleet invading Kree space.]]\nWhen [[D'ken Neramani (Earth-616)|Majestro D'Ken]] came out of the coma, a new civil war erupted in the Shi'ar Empire and therefore likewise tore apart the Shi'ar fleet. As his sister Lilandra led a new rebellion against him, with the support of [[Ka'ardum (Earth-616)|Major General Ka'ardum]]. It was rebellion that was outnumbered two-to-one and upon [[Gabriel Summers (Earth-616)|Vulcan]] killing D'Ken and seizing control of the throne, the civil war continued with Emperor Vulcan having the support of Deathbird.{{r|Uncanny X-Men Vol 1 483|486}} While the civil war raged, the Shi'ar empire was invaded by the [[M'Kraan (Race)|Scy'ar]] who destroyed a Shi'ar world and headed toward the [[M'kraan Crystal]]. They appeared unstoppable and when Vulcan annihilated them, it ended the civil war as the rebels defected to his side. Lilandra, the X-Men, and the Starjammers fled Shi'ar space.{{r|X-Men: Emperor Vulcan Vol 1 1|5}}\n\nThe Shi'ar fleet then waged campaigns to expand the Shi'ar Empire. Countless worlds fell to the Shi'ar, as civilizations were exterminated or enslaved.{{r|X-Men: Kingbreaker Vol 1 1}}{{r|War of Kings: Warriors Vol 1 1}} Though they were already fighting on many fronts the Shi'ar fleet invaded the Kree empire and struck many Kree Outworlds and Frontier Colonies. Shi'ar ships landed invasion forces on Kree colonies, bombarded Kree outworlds from orbit, and melted Kree planets with Nega-Bombs. A Kree counterattack wiped out a Shi'ar fleet. Soon the Shi'ar fleets had lost momentum, though they continued to have the upper hand and numerial superiority. Because the Shi'ar fleet was overextended on too many fronts, they had to downscale sixteen campaigns to support the war effort in Kree space. The detonation of the [[Terrigen Bomb]] in the void between the Kree and Shi'ar galaxies wiped out 87% of the Shi'ar Imperial Warfleet and created the [[Fault]].{{r|War of Kings Vol 1 1|6}}\n\nAfter the surrender of the Shi'ar empire to the Kree, the Shi'ar fleet was subordinate to the Kree. It was deployed alongside the Kree fleet to stop the monstrous invasion of the universe from the eldritch [[Earth-10011|Cancerverse]] via the Fault. They were soon being overwhelmed and were reinforced by other interstellar powers. Cosmic beings soon joined the fight on their side, but they were still losing ground. The invasion was stopped by the actions of the [[Guardians of the Galaxy (Earth-616)|Guardians of the Galaxy]].{{r|Thanos Imperative Vol 1 1|3}}{{r|Thanos Imperative Vol 1 6}} During the [[Infinity (Event)|Builders War]], the Shi'ar fleet was one of several alien fleets that made up the [[Council Armada (Earth-616)|Council Armada]]. Together with the Avengers, it fought against the Builder Armada in multiple space battles, and taking great casualties. Eventually the tide turned and the Builders were defeated. After which elements of the Shi'ar fleet participated alongside elements of other fleets in the liberation of Earth from [[Thanos (Earth-616)|Thanos]] and his [[Black Order (Earth-616)|Black Order]].{{r|Avengers Vol 5 18}}{{r|Infinity Vol 1 2|6}}\n\n==Technology==\nShi'ar warships possess various technologies, including:\n\n* '''Jump Engines:''' Giving them the ability to travel interstellar distances via FTL speeds, though because of the Shi'ar Stargates, the ships may have it disabled.{{r|Uncanny X-Men Vol 1 486}}\n* '''Cloaking Systems'''{{r|Mighty Thor Vol 3 16}}\n* '''Force Fields'''{{r|Marvel Fact Files Vol 1 24}}\n* '''Nanotechnology'''{{r|Marvel Fact Files Vol 1 24}}\n* '''Teleporation Systems:''' With up to a 50,000 km radius range{{r|Marvel Fact Files Vol 1 24}}\n\n==Weapons==\nShi'ar warships are equipped with the following types of weapon systems:\n\n* '''Plasma Cannons:''' With versions that can produce a gigaton nuclear blast, vaporize all in a 100 mile radius, and split the planetary crust{{r|Uncanny X-Men Vol 1 157}}\n* '''Disruption Bombs:''' Which are used on cities{{r|Starjammers Vol 1 1}}\n* '''Particle Beam Cannons'''{{r|X-Men: Spotlight on...Starjammers Vol 1 1}}\n* '''Fusion Mines'''{{r|Starjammers Vol 1 1}}\n* '''Phasers'''{{r|Captain Marvel Vol 3 4}}\n* '''Missiles:''' Used in space combat{{r|Uncanny X-Men Vol 1 477}}\n* '''Photon Torpedoes'''{{r|X-Men Vol 1 104}}\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Interstellar Fleets]]\n[[Category:Alien Military Forces]]\n[[Category:Interplanetary Organizations]]\n[[Category:Shi'ar Organizations]]"
                }
            }
        }
    ],
    "page_id": "1423412"
}