{
    "pageid": 54944,
    "ns": 0,
    "title": "Shogun Warriors (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Shogun Warriors (Earth-616) from Shogun Warriors Vol 1 2 0001.jpg\n| Name                    = Shogun Warriors \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly Shogun Sanctuary\n\n| Leaders                 = Formerly [[Richard Carson (Earth-616)|Richard Carson]]; [[Genji Odashu (Earth-616)|Genji Odashu]]; [[Ilongo Savage (Earth-616)|Ilongo Savage]]\n| CurrentMembers          = \n| FormerMembers           = [[Raydeen (Earth-616)|Raydeen]] (piloted by [[Richard Carson (Earth-616)|Richard Carson]]); [[Combatra (Earth-616)|Combatra]] (piloted by [[Genji Odashu (Earth-616)|Genji Odashu]]); [[Dangard Ace (Earth-616)|Dangard Ace]] (piloted by [[Ilongo Savage (Earth-616)|Ilongo Savage]])\n| Allies                  = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Godzilla (Earth-616)|Godzilla]], Rodan, [[Avengers (Earth-616)|Avengers]], [[Bruce Banner (Earth-616)|Hulk]]\n| Enemies                 = \n\n| Origin                  = Robot team\n\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Doug Moench; Herb Trimpe\n| First                   = Shogun Warriors Vol 1 1\n| Last                    = Marvel Encyclopedia Vol 1 Fantastic Four\n\n| HistoryText             = The Shogun Warriors were three giant robots (Raydeen, Combatra and Dangard Ace) piloted by, respectively, American stunt driver [[Richard Carson (Earth-616)|Richard Carson]], Japanese pilot [[Genji Odashu (Earth-616)|Genji Odashu]] and African marine scientist [[Ilongo Savage (Earth-616)|Ilongo Savage]], created by the mysterious [[Followers of the Light (Earth-616)|Followers of the Light]] to protect Earth from alien invasion.{{r|Shogun Warriors Vol 1 1|20}} The robots were eventually destroyed, some months after the threat they were created to deal with was vanquished by the Shoguns themselves aided by the [[Fantastic Four (Earth-616)|Fantastic Four]].{{r|Fantastic Four Vol 1 226}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \nShogun Warriors were a line of toys, licensed by Mattel during the late 1970s that consisted of a series of imported Japanese robots all based on then-popular giant robot anime shows. They were originally manufactured in three sizes, the 24 inch plastic versions, the 3.5 inch diecast metal versions and the slightly taller but much more detailed and articulated 5\" diecast versions. There were also several vehicles offered and a set that could be put together to form Combattra (Combattler V).\n\nThe most attractive features on these toys were the spring loaded launcher weapons such as missiles, star shuriken, and battleaxes. Some robots were able to launch their fists. The later diecast versions of these toys were also attractive for the ability to transform into different shapes. Grandizer, for instance, was changeable into a saucer-like spaceship. These \"convertible\" editions were the precursors to the \"[[Transformers]]\" line of toy robots but unlike the later toyline it was not unusual for minor disassembly to be required to achieve the secondary form. Also the second form was not always an apparently useful one, a \"giant skull\" for instance.\n\nLike certain other toylines of the 70s, the Shogun Warriors came under pressure due to safety concerns regarding their spring loaded weapons features. Toy manufacturers were facing new regulations due to reported child injuries as a result of playing with these toys. Consequently, many toy companies were forced to remodel existing toylines with child safe variations (such as spring loaded \"action\" missiles that would remain attached to the toy). For this reason, as well as decreasing sales, the Shogun Warriors toyline disappeared by 1980.\n\nSeveral of the anime from this toyline were seen in the 80s as part of Jim Terry's Force Five series.\n\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "54944"
}