{
    "pageid": 1625583,
    "ns": 0,
    "title": "Shosei Order (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = The Shosei Order's Duty.jpg\n| Name                    = Shosei Order\n| Aliases                 = \n\n| Leaders                 = [[Mana Yanowa (Earth-616)|Mana Yanowa]] \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = \n| Affiliation             = \n| Allies                  = \n| Enemies                 = \n\n| Origin                  = Japan \n| Reality                 = \n| Status                  = \n| BaseOfOperations        = \n| PlaceOfFormation        = Japan \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Wolverine Soultaker Vol 1 3\n| Last                    = \n\n| Overview                = The Shosei Order is a group of mystical guardians that have protected Japan's shores since its feudal era. While it mostly consisted of female priestesses, there have been male priests joining the ranks of the shosei in recent years.\n\n| History                 = Since the Japan's feudal era, the Shosei Order have been the protectors of Japan form supernatural and mystical threats, similar to the [[Masters of the Mystic Arts]], while the shogun and samurai fought each other for land and power. They protected Japan from all the forces [[Hell]] itself conjured up, and when a priestess died in battle their blood was drawn and added to the container that held the Blade of Blood which made a piece of the essence part of the blade making it very powerful.{{Citation}}\n\nWhen [[Mana Yanowa (Earth-616)|Mana]] and [[Hana Yanowa (Earth-616)|Hana Yanowa]] were born, it was clear they were destined to compete for the title of Head Priestess of the order, being members of the family who lead the order as a whole. This did matter since they were just children, but as they grew into adolescence they became bitter rivals, each trying to outdo the other in order to prove themselves the more capable warrior. When the time came to decide who would inherit the mantle as Head Priestess, Mana hailed victorious. While Mana became Head Priestess of the Shosei, Hana turned her back on her family and the order all together and left to walk her own path. In 1884 AD, Hana returned to claim her place as head of the order from Mana through use of the dark and forbidden arts she had studied over the years. To gain the upper hand against Mana, she loosed Ryuki, a demon from Ashurado, the fourth level of Hell, by allowing it to possess her body. In order to stop Hana and Ryuki, Mana used her necklace to seal Ryuki's soul within along with Hana's and her own.{{Citation}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Blade of Blood \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1625583"
}