{
    "pageid": 638439,
    "ns": 0,
    "title": "Silencers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Silencers (Earth-616) from Web of Spider-Man Vol 1 113 001.png\n| Name                    = Silencers\n| Aliases                 = \n\n| Status                  = \n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Manhattan]]\n\n| Leaders                 = \n| CurrentMembers          = Unnamed members\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Felicia Hardy (Earth-616)|Black Cat]], [[Remy LeBeau (Earth-616)|Gambit]], [[Spider-Man (Peter Parker)|Spider-Man]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Terry Kavanagh; Alex Saviuk\n| First                   = Web of Spider-Man Vol 1 #113\n| Last                    = \n\n| HistoryText             = The Silencers invaded the [[Macro Science Museum]] to steal the museum's micro-fusion generator during a demonstration of the [[Full Acclimation Combat And Defence Explo-skeleton (Earth-616)|F.A.C.A.D.E.]] armor. They shut down the power with an electromagnetic pulse, then attacked the generator's guards, beating them badly and stuffing them in a closet. They were soon discovered by the vigilantes [[Spider-Man (Peter Parker)|Spider-Man]], [[Felicia Hardy (Earth-616)|Black Cat]], and [[Remy LeBeau (Earth-616)|Gambit]]. The Black Cat slashed the female Silencer's suit with his vibra-claws; the resulting feedback knocked the Silencer out. Spider-Man's spider-sense alerted him to another Silencer behind him, who he knocked out with a headbutt. Another Silencer threatened to destroy the generator unless they were allowed to escape, but Gambit followed his voice and hit him with a charged playing card. The remaining Silencer grabbed [[Mike Wilson (Earth-616)|Mike Wilson]], the museum's curator, who had just stumbled upon the battle and took him hostage. However, Spider-Man cross-polarized two incompatible wires on an incapacitated Silencer, creating a disruptive counterpulse through the Silencers' mutual camouflage fields. The remaining Silencer was rendered visible, and Wilson elbowed him in the head, knocking him out. Spider-Man webbed all four Silencers up and left them for the [[New York City Police Department (Earth-616)|police]].{{r|Web of Spider-Man Vol 1 #113}}\n\n| Equipment               = A four-man mercenary team clad in suits incorporating light-refractive materials and sonar-reflective implants, which rendered them mostly invisible and inaudible. The Silencers engaged in a spate of violent robberies stretching from [[New Orleans]] to [[New York City]]. At some point, they encountered the [[Felicia Hardy (Earth-616)|Black Cat]].\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * http://www.marvunapp.com/Appendix5/silencerssmbc.htm\n}}\n[[Category:Inaudibility]]\n[[Category:Invisibility]]"
                }
            }
        }
    ],
    "page_id": "638439"
}