{
    "pageid": 10587,
    "ns": 0,
    "title": "Sinister Syndicate (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Sinister Syndicate (Earth-616) from Amazing Spider-Man Vol 1 281 001.jpg\n| ImageSize               = 250px\n| Name                    = Sinister Syndicate\n| Aliases                 = \n| EditorialNames          = Formely [[Deadly Foes of Spider-Man Vol 1|The Deadly Foes of Spider-Man]], [[The Lethal Foes of Spider-Man Vol 1|The Lethal Foes of Spider-Man]]\n\n| Status                  = Defunct \n| Identity                = \n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Abner Jenkins (Earth-616)|Beetle]]\n| CurrentMembers          = \n| FormerMembers           = [[Abner Jenkins (Earth-616)|Beetle]], [[Frederick Myers (Earth-616)|Boomerang]], [[Frank Payne (Earth-616)|Constrictor]], [[Otto Octavius (Earth-616)|Doctor Octopus]], [[Maxwell Dillon (Earth-616)|Electro (Dillon)]], [[Leila Davis (Earth-616)|Hardshell]], [[Morris Bench (Earth-616)|Hydro-Man]], [[Aleksei Sytsevich (Earth-616)|Rhino]], [[Herman Schultz (Earth-616)|Shocker]], [[James Sanders (Earth-616)|Speed Demon]], [[Lonnie Lincoln (Earth-616)|Tombstone]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDefunction       = \n| Creators                = Tom DeFalco; Ron Frenz; Brett Breeding\n| First                   = Amazing Spider-Man #280\n\n| HistoryText             = \n===Origins===\nPatterned after the conglomeration of Spider-Man's deadliest foes who call themselves the [[Sinister Six (Earth-616)|Sinister Six]], the Sinister Syndicate originally was formed by the super-villain Abner Jenkins, aka \"The Beetle\". The original roster of the group consisted of Beetle, Hydro-Man, Rhino, Boomerang, and Speed Demon, who collectively gathered together under the Beetle's leadership. Unlike the Sinister Six, which was formed mainly to destroy Spider-Man, the Syndicate was formed to act as a mercenary group that worked for the highest bidder.{{r|Amazing Spider-Man Vol 1 280}}\n\nThe Syndicate's, where the group successfully prevented Spider-Man and [[Silver Sable]] from capturing famed assassin [[Jason Macendale]], then known as Jack O'Lantern.{{Citation}}\n\n===Deadly Foes of Spider-Man===\nThe group, now featuring [[Shocker]] and getaway driver/Boomerang's girlfriend [[Leila Davis (Earth-616)|Leila Davis]], were the focus of the 1991 mini-series ''Deadly Foes of Spider-Man.'' The four-issue mini-series focused upon the group's break-up due to the Beetle's jealousy towards Boomerang and his attempts to usurp control over the group. Beetle eventually betrayed Boomerang by allowing him to be caught during a robbery and then convincing him to use Beetle's lawyer, not knowing that Beetle had instructed his lawyer to throw the trial to ensure Boomerang's conviction.{{Citation}}\n\nAs Beetle forges an alliance with the Kingpin, Speed Demon begins a relationship with Leila while Rhino locates a scientist who can remove his rhino-themed body-armor, which had been permanently bonded to his body at the time. The scientist however, owes the Kingpin a large sum of  money in unpaid gambling debts, resulting in Beetle killing the scientist. As Shocker helps Boomerang escape jail, Leila betrays Speed Demon and reveals her true purpose for dating Boomerang and involving herself with the Syndicate: Leila was the widow of the super-villain Anthony Davis aka \"The Ringer.\" The Ringer had been kidnapped years earlier by Beetle, who then strapped a (what was ultimately revealed to be fake) bomb to his chest, forcing him to fight Spider-Man. Beetle watched via a camera hidden inside \"the bomb\" in order for him to observe Spider-Man in action. When Spider-Man defeated the Ringer and exposed Beetle's scheme, Ringer was humiliated and branded a loser by his fellow villains, culminating in his being killed by the [[Scourge of the Underworld|Scourge]]. Leila sought to destroy Beetle in order to avenge her husband.{{Citation}}\n\nIn the end, a massive showdown ensued between the members with Leila escaping with Boomerang and Rhino, while Beetle went to jail and his loyalist members Speed Demon and Hydro-Man made their own escapes.{{Citation}}\n\n===Thunderbolts===\nBeetle would go on to join the Thunderbolts, assuming the alias Mach-1. However his act of murder from \"Deadly Foes of Spider-Man\" would cripple the group's attempts to go legit once Beetle and his new teammates broke free from Baron Zemo's control. Beetle would be forced to surrender himself to authorities and plead guilty to murder. Meanwhile Leila Davis would resurface as the new \"Beetle\", piloting a massive mecha-suit that [[Justin Hammer]] had built for Jenkins for when he escaped prison. However, the suit would be Leila's doom, as the villain [[Graviton]] crushed the suit with his gravity powers, killing Leila as a result.{{Citation}}\n\nWhen the series was revived in late 2004, Speed Demon ended up joining the Thunderbolts team. However, to his horror, he had discovered that his Sinister Syndicate friend Abner had truly gone legit and as such, came into constant conflict with Abe due to Speed Demon's utter lack of morals and willingness to sell-out his new teammates to the various evil forces that the group fought.{{Citation}}\n\nHowever, years later Boomerang would join the Thunderbolts; unlike with Speed Demon however, no mention has been made regarding Beetle's betrayal of Boomerang in the pages of Deadly Foes of Spider-Man.{{Citation}}\n\n===The Initiative===\nHalf of the Syndicate (Hydro-Man, Shocker, and Boomerang) reunite and fight Spider-Man. The battle is interrupted by [[Komodo]] and [[War Machine]]. They were later apprehended by the Initiative's [[Scarlet Spiders (Earth-616)|Scarlet Spiders]].{{r|Avengers: The Initiative #3}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * When [[Frederick Myers (Earth-616)|Boomerang]] became the leader of the [[Sinister Six (Earth-616)|Sinister \"Six\"]] alongside [[Janice Lincoln (Earth-616)|Beetle]], [[Herman Schultz (Earth-616)|Shocker]], [[James Beverley (Earth-616)|Overdrive]] and [[James Sanders (Earth-616)|Speed Demon]], the Shocker suggested going back to the name \"Sinister Syndicate,\" but the idea was quickly squelched with Speed Demon objecting, \"the Sinister Syndicate were losers!\"{{r|Superior Foes of Spider-Man Vol 1 2}}\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "10587"
}