{
    "pageid": 866980,
    "ns": 0,
    "title": "Sisters (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = All-New Wolverine Vol 1 6 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Sisters|The Sisters]]\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile; formerly the [[New York City]] Sewers\n\n| Leaders                 = Formerly [[Zelda (The Sisters) (Earth-616)|Zelda]]\n| CurrentMembers          = \n| FormerMembers           = [[X23_3PAR (The Sisters) (Earth-616)|X23_3PAR]], [[Zelda (The Sisters) (Earth-616)|Zelda]], [[Bellona (The Sisters) (Earth-616)|Bellona]], [[Gabrielle Kinney  (Earth-616)|Gabby]], and six other unnamed girls\n| Allies                  = [[Laura Kinney (Earth-616)|Wolverine]], [[Kimura (Earth-616)|Kimura]]\n| Enemies                 = [[Alchemax (Earth-616)|Alchemax]]\n\n| Origin                  = [[Glossary:C#Clone|Clones]] of [[Laura Kinney (Earth-616)|Wolverine]]\n| PlaceOfFormation        = Alchemax Genetics lab, unrevealed North American location\n| PlaceOfDissolution      = \n| Creators                = Tom Taylor; David López; David Navarrot\n| First                   = All-New Wolverine Vol 1 2\n| Last                    = All-New Wolverine Vol 1 6\n\n| Quotation               = [[Alchemax (Earth-616)|They]] took pain away from us. They took feeling away. They need to '''pay.'''\n| Speaker                 = [[Gabrielle Kinney (Earth-616)|Gabby]]\n| QuoteSource             = All-New Wolverine Vol 1 2\n\n| HistoryText             = The Sisters were ten clones of [[Laura Kinney (Earth-616)|Laura Kinney]], created by [[Alchemax (Earth-616)|Alchemax Genetics]] using samples of her DNA obtained via a thus-far unidentified source. Six of the girls were either killed in the field or by Alchemax during demonstrations, with a couple others dying mysteriously in their cells.{{r|All-New Wolverine #4}}\n\nMuch like Laura, each were given a numerical designation: the four identified girls were [[Bellona (The Sisters) (Earth-616)|Bellona (X23_1BEL)]], [[Zelda (The Sisters) (Earth-616)|Zelda (X23_2ZEL)]], [[X23_3PAR (The Sisters) (Earth-616)|X23_3PAR]], and [[Gabrielle Kinney (Earth-616)|Gabby (X23_4GAB)]]. Zelda, the eldest, was the leader of this group, who managed to escape from Alchemax after discovering that the alterations which rendered them unable to sense pain was also killing them.{{r|All-New Wolverine #4}} They subsequently targeted Alchemax's personnel for assassination, which ultimately brought them to Laura's attention.{{r|All-New Wolverine #2}}\n\nThey first ran directly afoul of Wolverine in [[Paris (France)|Paris]], when X23_3PAR attempted to murder Director [[Robert Chandler (Earth-616)|Robert Chandler]]'s son. Laura foiled the attempt and tried to reason with her, but 3PAR insisted Laura should be helping them, not obstructing them, then subsequently jumped to her death from the top of the [[Eiffel Tower]].{{r|All-New Wolverine #1}}\n\nWhen Laura returned to [[New York City]] and confronted Director Chandler regarding the clones, he claimed that they were created to serve as bodyguards for diplomats and humanitarian missions. Afterwards, she returned home to find the youngest of the girls, Gabby, had broken into her apartment. Laura realized that it was Gabby who tipped her off about 3PAR's efforts in Paris, but insisted that she didn't kill her. Gabby echoed 3PAR's comments, that she should be ''helping'' them, then went on to reveal that Alchemax took away their ability to feel pain, and cast doubt on the assertion that the Sisters killed a number of innocent people during their escape.\n\nGabby subsequently slipped out, but unwittingly led Laura to the sewers where she and her sisters are hiding while making their plans. In the confrontation that followed, Laura tried to talk them down, but was shot repeatedly by Bellona against Gabby's objections; however, before they could talk and diffuse the situation, a team led by Captain Mooney, Alchemax's head of security, attacked them. Laura and the Sisters subsequently defeat them before they, in turn, are ambushed by [[Anthony Masters (Earth-616)|Taskmaster]], who appeared to shoot and kill each of the remaining three Sisters.{{r|All-New Wolverine #2}}\n\nThe girls, however, were wearing body armor, and were only knocked unconscious. With Laura's assistance they managed to escape Masters, as well as Mooney's attempt to pursue them. They retreated to a warehouse, where the Sisters revealed to Laura that they were dying; whatever means Alchemax used to take away their pain was also shortening their lives. With no other options, Laura took them to see [[Stephen Strange (Earth-616)|Doctor Strange]], in hopes he might have a way to treat them.{{r|All-New Wolverine #3}}\n\nAt the [[Sanctum Sanctorum]], Bellona's quick temper triggered the escape of a monster kept locked away by Strange, which escaped the house in its rampage. The girls immediately sprung into action to contain the beast and clear the streets of civilians, saving several innocent lives in the process of stopping it. However the action proved too much for a quickly weakening Zelda and she collapsed. Strange was able to determine the cause of their affliction — nanotechnology implanted by Alchemax — but he was unable to reverse the damage himself with his magic. Instead, he teleported the group to one of [[Henry Pym (Earth-616)|Hank Pym]]'s labs, with instructions for Laura to borrow [[Ant-Man's Suit]] so she could deal with the infection directly.{{r|All-New Wolverine #4}}\n\nWith Zelda's health rapidly deteriorating, Wolverine enlisted the aid of [[Janet Van Dyne (Earth-616)|Wasp]] to shrink down to combat the nanites killing her. They entered her bloodstream and began the process of destroying the machines. The attempt was successful and Zelda began to recover. However this triggered a homing device built into the machines that allowed Captain Mooney to track their location. Zelda was shot during his initial assault, marveling that she actually felt the pain. With Bellona trapped beneath rubble Gabby tried to fight Mooney off, but was casually thrown aside. Zelda was shot again coming to her aid. Laura and Janet, sensing something was wrong, left her body and returned to normal size, subduing Mooney before he could finish Zelda off. Unfortunately Zelda's wounds quickly proved fatal, and with her dying breath asked Laura to put an end to Alchemax's experiments once and for all.{{r|All-New Wolverine #5}}\n\nThe Sisters allowed Mooney to escape, and used him to locate Alchemax Genetics' base. Laura and Bellona swapped outfits, and Laura allowed herself to be \"killed\" in a failed attempt to attack the base. She awakened in the lab and escaped, setting off alarms on her way to the entrance to allow Gabby and Bellona inside. While Laura headed off to deal with Chandler, Gabby and Bellona intercepted and incapacitated Mooney. Bellona sent Gabby out into the hall, as she didn't want her sister to see her shoot Mooney. Bellona then announced she would be leaving, despite Gabby's protests. However they made a deal that Bellona was obligated to make good on, so Gabby was left alone to meet up with Laura. She found her having incapacitated Chandler, and asked for a moment alone with him. Laura complied, and when she departed, Gabby admitted her admiration for the Wolverine and the restraint. She admitted to wanting to kill him, but because Laura and Zelda wanted for her to be better — and Gabby's own desire to be ''good'' — let him live. However, before she left, she revealed that contrary to Alcehmax's beliefs she ''did'' develop Laura's claws.\n\nAs Laura and Gabby departed from the ruined installation ahead of a [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] strike called in by Laura, Bellona connected with the contact who originally enabled their escape and supplied them with equipment: [[Kimura (Earth-616)|Kimura]]. In exchange for Gabby's freedom and her assistance, Bellona surrendered to Kimura so she could recover the technology Alchemax implanted in her.{{r|All-New Wolverine #6}}\n\n| Equipment               = The Sisters were remarkably well-equipped for a group of escaped assassins on the run. However, Laura's attempt to inquire into who was providing them with their gear was stymied by Bellona's continued distrust.{{r|All-New Wolverine #3}}\n* Each of the Sisters wore a unique mask to hide their features. These masks also appear to be armored.\n* Body armor.\n* MQ-1B Predator drone.\nIt was later revealed that all of their equipment was provided by [[Kimura (Earth-616)|Kimura]].{{r|All-New Wolverine #6}}\n| Transportation          = The Sisters were in possession of an armored High Mobility Multipurpose Wheeled Vehicle, equipped with a mounted .50 cal machine-gun turret and an M20 3.5 inch Rocket Launcher.\n| Weapons                 = Each of the Sisters appeared to favor different weapons:\n* Bellona: Combat Knives\n* Zelda: Assault Rifle\n* X23_3PAR: Sniper Rifle, Pistol\n* Gabby: MAC-10\n\n| Notes                   = * According to ''[[All-New Wolverine Vol 1|All-New Wolverine]]'' writer [[Tom Taylor]], Zelda is the eldest of the Sisters, and their Alchemax designations make no indications of their relative ages.{{citation}}\n* All of the sisters were named by Alchemax, and according to Taylor their \"given\" names all relate to death.{{citation}}\n* Bellona was born with oculocutaneous albinism, suggesting flaws existed in the cloning process used by Alchemax, beyond merely lacking Laura's mutation.{{citation}}\n| Trivia                  = * According to Taylor, the Sisters are each a deliberate reflection of one stage of Laura's life:{{r|{{cite web|url=http://www.comicbookresources.com/article/x-position-tom-taylor-declassifies-all-new-wolverines-deadly-sisters|title=X-POSITION: Tom Taylor Declassifies \"All-New Wolverine's\" Deadly Sisters|work=CBR|first=Brett|last=White|date=January 5, 2016|accessdate=March 20, 2020}}}}\n** Zelda reflects Laura's icy calm in the face of danger and her tactical abilities.\n** Bellona represents her rage and impulsiveness.\n** 3PAR is her fatalism and drive.\n** Gabby is an embodiment of Laura's lost innocence; the girl she ''could'' have been.\n| Links                   = \n}}\n[[Category:Clones of Laura Kinney]]\n[[Category:Alchemax Projects]]\n[[Category:Clones]]"
                }
            }
        }
    ],
    "page_id": "866980"
}