{
    "pageid": 535274,
    "ns": 0,
    "title": "Six-Gun Syndicate (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Six-Gun Syndicate (Earth-616) from Kid Colt Vol 1 1 0001.jpg\n| Name                    = Six-Gun Syndicate\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly [[Cash Collins (Earth-616)|Cash Collins]]\n| CurrentMembers          = \n| FormerMembers           = [[Cash Collins (Earth-616)|Cash Collins]] (Deceased), [[Boots (Six-Gun Syndicate) (Earth-616)|Boots]] (Deceased), [[Blaine Colt (Earth-616)|Kid Colt]], other members (all likely deceased)\n| Allies                  = \n| Enemies                 = [[Olin Baxter (Earth-616)|Olin Baxter]], [[Betty Baxter (Earth-616)|Betty Baxter]], [[Blaine Colt (Earth-616)|Kid Colt]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Chu Hing\n| First                   = Kid Colt Vol 1 1\n| Last                    = Kid Colt Vol 1 1\n\n| HistoryText             = [[File:Cash Collins (Earth-616) from Kid Colt Vol 1 1 0001.jpg|thumb|left|107px|Cash Collins, leader of the Six-Gun Syndicate]]\nThe Six-Gun Syndicate were a gang of outlaws that were active during the days of the American Frontier. Their leader was Cash Collins who was smitten by Betty Baxter, the daughter of wealthy rancher Olin Baxter. When Collins came courting for her, Olin Baxter sent Cash Collins away. Furious, Collins then had Betty kidnapped and taken to the gang's hideout. Olin went out looking for his daughter to try and liberate her, crossing paths with [[Blaine Colt (Earth-616)|Kid Colt]]. Learning of Olin's plight, Kid Colt agreed to get Betty back for him.\n\nTracking down the gang, Kid Colt used his status as a wanted outlaw to convince Cash Collins to allow him to join their gang. Colt was taken back to the shack they hid out in and he was introduced to Boots an elderly member of the gang who was charged with keeping watch on Betty. Collins and his men then organized a bank robbery, but Kid Colt managed to avoid participation by making his horse [[Steel (Earth-616)|Steel]] pretend to have a limp. However, Collins did not trust Kid Colt and followed him back to camp. There he caught Kid Colt, and Boots (whom Kid Colt convinced to help) attempting to free Betty. Collins got the drop on them, but agreed to draw cards to wager and see who would take Betty. However, Collins cheated, using an ace up his sleeve to win the match. \n\nBoots spotted this, and when Cash attempted to shoot Kid Colt, the Kid shot the gun from his hand. Kid Colt and Boots then took Betty and fled, however Betty woke up and not understanding what was going on cried for help, drawing the rest of the gang after them. As they fled into the woods, Boots took a fatal gun shot wound and died, convincing Betty of their good intentions. However, Cash soon found them and gut shot Kid Colt. Before he could get away with Betty his prisoner once more, Kid Colt shot Cash right between the eyes killing him. Betty then rushed Kid Colt back to her fathers' home to recover from his injuries.{{r|Kid Colt Vol 1 1}}\n\nThe fate of the rest of the Six-Gun Syndicate is unknown, however it's unlikely that the group exists, most of their members either disbanded or dead.\n\n| Equipment               = \n| Transportation          = Each member had their own horse.\n| Weapons                 = Each member carried various firearms that were commonly used during the days of the American Frontier.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "535274"
}