{
    "pageid": 436955,
    "ns": 0,
    "title": "Six Big Men (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Six Big Men (Earth-616) from Marvel Comics Vol 1 1 001.jpg\n| Name                    = Six Big Men\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]]\n\n| Leaders                 = Formerly [[Horace Lang (Earth-616)|The Big Boss (Horace Lang)]]\n| CurrentMembers          = \n| FormerMembers           = [[Dutch Hansen (Earth-616)|Dutch Hansen]], [[Trigger Bolo (Earth-616)|Trigger Bolo]], [[Mike Malone (Earth-616)|Mike Malone]], [[Gus Ronson (Earth-616)|Gus Ronson]], [[John Dillon (Earth-616)|John Dillon]], [[Steve Enkel (Earth-616)|Steve Enkel]] (All deceased), [[Lil (Earth-616)|Lil]]\n| Allies                  = \n| Enemies                 = [[Thomas Halloway (Earth-616)|The Angel]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = New York City\n| Creators                = Paul Gustavson\n| First                   = Marvel Comics #1\n| Last                    = Marvel Comics #1\n\n| Quotation               = Doctor Lang and Lil planned the rackets. The proceeds which were to be deposited in this vault and split seven ways at the end of a year! That was why they wanted the \"Six Big Men\" done away with -- so there wouldn't be any splitting to do and they would have it all to themselves!\n| Speaker                 = [[Thomas Halloway (Earth-616)|The Angel (Thomas Halloway)]]\n| QuoteSource             = Marvel Comics Vol 1 1\n\n| HistoryText             = '''The Six Big Men''' was a gang comprised of six known members all specializing in a different field of criminal enterprise. There was [[Dutch Hansen (Earth-616)|Dutch Hansen]] who specialized in extorting protection money from night clubs; [[Trigger Bolo (Earth-616)|Trigger Bolo]], who controlled a protection racket for retail delivery companies; [[Mike Malone (Earth-616)|Mike Malone]] who controlled all the illegal gambling dens; [[Gus Ronson (Earth-616)|Gus Ronson]] who extorted local restaurants; [[John Dillon (Earth-616)|John Dillon]] who ran a racket on the subway system; and [[Steve Enkel (Earth-616)|Steve Enkel]] who sought to influence politicians, judges and juries. They all answered to \"[[Horace Lang (Earth-616)|The Big Boss]]\", who was secretly the prominent Doctor Horace Lang who sent his orders through his female companion [[Lil (Earth-616)|Lil]].\n\nThe group of criminals had [[New York City]] in a literal strangle hold amassing a great deal of wealth in the process. The law was unable to stop their operations due to their influence and ability to buy off witnesses, juries and judges. The gang was going to split all their ill gotten gains seven ways amongst the six primary members, the Big Boss and Lil. However, Lang had other ideas and attempted to orchestrate the deaths of his six associates so that he would not have to split the loot.\n\nTo this end, Lang, pretending to be a civic minded citizen gathered a bunch of like minded individuals who were then sworn in by a Mayor [[Fiorello La Guardia (Earth-616)|La Guardia]] as special investigators. They sought to hire the costumed hero known as the [[Thomas Halloway (Earth-616)|Angel]] to hunt down and eliminate each of the racket bosses. The Angel had already taken up the job and made his presence known, leaving Doctor Lang to believe that his plan was coming to fruition.\n\nThe Angel first went after Ronson after he was acquitted of crimes thanks to a crooked jury. Unaware that the Angel had sneaked into the back seat of his car, Ronson was strangled to death by the vigilante. Going after Mike Malone next, he landed a killing blow on the crook. Witnessing this John Dillon attempted to flee the Angel, jumping out a window and falling to his death. Lil provided the Angel with the location of Trigger Bolo, but the caped crime-fighter was captured by his thugs. Before Bolo could mow the Angel down, however, Lil ordered him and Steve Enkel to take the Angel out into the woods to be executed. There Lil double crossed Bolo and Enkel, freeing the Angel and in the ensuing fire fight Bolo and Enkel shot each other.\n\nThe Angel caught Dutch Hansen next before he could make a deposit of all the stolen loot and slew him as well. Curious about who would go and pick up the loot at the safety deposit box, the Angel staked it out and caught Lil and Doctor Lang in the act of retrieving the money. He captured them and turned over to the authorities, learning of their plot to double cross their colleagues.{{r|Marvel Comics Vol 1 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]\n[[Category:Crimelords]]"
                }
            }
        }
    ],
    "page_id": "436955"
}