{
    "pageid": 505643,
    "ns": 0,
    "title": "Skeletons of the Glowing Death (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Skeletons of the Glowing Death (Earth-616) from Captain America Comics Vol 1 45 0001.jpg\n| Name                    = Skeletons of the Glowing Death\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = Formerly unnamed leader\n| CurrentMembers          = \n| FormerMembers           = Unnamed members\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Vince Alascia\n| First                   = Captain America Comics Vol 1 45\n| Last                    = Captain America Comics Vol 1 45\n\n| HistoryText             = The Skeletons of the Glowing Death were a group of professional criminals gathered in 1945 in order to stage a series of robberies in the New York area. Their leader was the superintendent of a local powerhouse. With control over the city's electrical grid, the gang created luminescent costumes that made them appear to look like spectral skeletons in the dark. Under the cover of a blackout, the gang would then attack innocent people and store fronts on the streets, gunning down anyone who resisted and collecting their loot.\n\nTheir first hit happened in front of Private [[Steven Rogers (Earth-616)|Steve Rogers]] and [[James Buchanan Barnes (Earth-616)|James Barnes]] who failed to stop the crooks from committing their daring robbery. As Captain America and Bucky, the pair went to the local powerhouse where the found the technicians killed. They hid in the shadows as the police arrived with the superintendent who was furious and demanded that police guard the power house while new technicians arrived. To Cap and Bucky's surprise, they learned that the superintendent was the leader and that the new \"technicians\" arriving were members of the gang and that they were preparing for another hit.\n\nAttacking the crooks, Cap and Bucky were knocked out and tied to a dynamo which the gang leader intended to turn on to electrocute the two heroes to death. Cap managed to struggle his way to the power chord and pull it out with his teeth. Freeing themselves when the dynamo failed to start, Cap and Bucky battled the gang. During the course of the fight, the gang's leader was tossed into a live wire and was electrocuted to death, and the gang soon fell after. By the time the battle was over, the police standing on guard outside had entered and took the gang into custody.{{r|Captain America Comics Vol 1 45}}\n\n| Equipment               = When committing their robberies, the gang wore luminescent costumes that made them appear to look like skeletons in the dark.\n| Transportation          = \n| Weapons                 = Members of the gang had a variety of hand guns and automatic weapons.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "505643"
}