{
    "pageid": 289417,
    "ns": 0,
    "title": "Skrull Cows (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{MessageBox\n|Message = It has been suggested that this article should be split up into several - please join the discussion on the [[Talk:Skrull Cows (Earth-616)|talk page]]}}\n{{Marvel Database:Team Template\n| Image                   = Skrull Cows (Earth-616) from Avengers Vol 1 93 001.jpg\n| Name                    = [[Skrull Cows]]\n| Aliases                 = [[Avengers]],{{r|Avengers #92}} Cows,{{r|Fantastic Four #2}} [[Fantastic Four]],{{r|Fantastic Four #2}} [[Deviant Skrulls|Skrulls]]{{r|Fantastic Four #2}}\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[King's Crossing]], [[Vermont (State)|Vermont]], [[United States of America]], [[Earth]], Formerly; [[Skrull Empire]], [[Andromeda Galaxy]]\n\n| Leaders                 = Unnamed Captain of a Skrull Mothership, [[Kl'rt (Earth-616)|Super-Skrull]]\n| CurrentMembers          = \n| FormerMembers           = [[Reed Richards (Skrull, Cow) (Earth-616)|Mister Fantastic]], [[Benjamin Grimm (Skrull, Cow) (Earth-616)|The Thing]], [[Jonathan Storm (Skrull, Cow) (Earth-616)|The Human Torch]], [[H. Warren Craddock (Skrull) (Earth-616)|Invisible Girl]] (Member of the team but escaped before they were turned into Cows) \n| Allies                  = \n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Avengers (Earth-616)|Avengers]]\n\n| Origin                  = Skrulls turned in cows\n| PlaceOfFormation        = Presumably on their Homeworld\n| PlaceOfDissolution      = A Slaughter-house near [[King's Crossing]]\n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four #2\n| Last                    = \n\n| HistoryText             = \n===Preface===\n\"Skrull Cows\" or \"Cow Skrulls\" is a term commonly used to commonly refer to [[Deviant Skrulls|Skrulls]] that have been turned into cows on the planet Earth. It has been specifically used to reference three particular Skrulls,{{r|Fantastic Four #2}} however there are literally thousands of Skrull Cows that have existed.\n\n===First Record of Skrull Cows===\n[[File:Deviant Skrulls from Fantastic Four Vol 4 10 001.jpg|thumb|110px|left|Skrull Cows circa 1776]]\nThe first recorded instance of Skrulls being turned into cows incidentally was the result of time travel. In the year 1776, a group of Skrull subversives came to the planet Earth during a period of time in which the United States of America was seeking its independence from British rule. A Skrull spy was sent to pose as [[Thomas Jefferson (Earth-616)|Thomas Jefferson]] to ensure passages about slavery remained in the Declaration of Independence and the Bill of Rights. The intent was that if the human race was accustomed to slavery, then it would be easier for the Skrulls to enslave them. However this plan was thwarted by the [[Fantastic Four (Earth-616)|Fantastic Four]], heroes from the 21st Century, who had travelled back in time to this era to locate Chrono-Anchor that was lost in this era. Their leader [[Reed Richards (Earth-616)|Reed Richards]] uncovered the Skrulls, and used hypnosis to make them believe they were cows,{{r|Fantastic Four Vol 4 #10}} a trick that Richards used on Skrulls in his own time many years earlier in his career.{{r|Fantastic Four #2}}\n\nThe fate of these Skrull Cows are unknown, however it could go to explain why there is a large population of Skrull cows in modern times.{{r|Dark Reign: New Nation #1}}\n \n===Invasion===\nA quartet of Skrulls posed as the [[Fantastic Four (Earth-616)|Fantastic Four]] and publicly wreaked destruction and havoc in order to force the real Fantastic Four to fall out of favor with their government and be eliminated, leaving [[Earth]] open for invasion.{{r|Fantastic Four #2}} It has been revealed that one of these early Skrull invaders was related to [[Dorrek VII (Earth-616)|Emperor Dorrek VII]].{{r|New Avengers #40}}\n\n[[File:Skrull Cows (Earth-616) from Fantastic Four Vol 1 2 001.jpg|thumb|left]]\nOn the run from the military, the real Fantastic Four were able to trick the Skrulls into revealing their hideout as well as their master plan. Leaving them subdued, Reed, Sue, Johnny, and Ben traveled to their mother-ship via their [[Skrull-Ship (Water Tower)|Water Tower Ship]]. There, Reed used clippings from \"[[Strange Tales]]\" and \"[[Journey into Mystery]]\" to fool the scout Captain into believing the planet was too fortified by giant monsters for an invasion to be successful. Pretending to 'sacrifice their lives' so that the mother-ship could return home while leaving him behind, Reed was given the Skrulls' highest medal of bravery before the invasion forces left.\n\n[[File:Skrull Cows (Earth-616) from Fantastic Four Annual Vol 1 17 001.jpg|thumb|250px|left|{{cl|Fantastic Four Annual}}|Flashback]]\nBack on Earth, the government still saw the Fantastic Four as a threat and sent police with them back to the Skrull quartet's hideout. There, three of the four had broken free of their bindings and attacked, shape-shifting into different monsters in front of the police and proving they had been posing as the Fantastic Four. The police chief left the aliens in the care of [[Reed Richards (Earth-616)|Mister Fantastic]] since they couldn't be held in any normal prison anyway.{{r|Fantastic Four #2}}\n\nThe remaining fourth member was thought to have been sent home with the invasion fleet, according to Reed.{{r|Fantastic Four #2}} The other three Skrull cows were let to graze in the town of [[King's Crossing]]{{r|Fantastic Four Annual #17}} where the farmers allowed them to breed with other cows, creating Skrull-Cow hybrids.{{r|Skrull Kill Krew Vol 2 #1}}\n\n===Kree-Skrull War===\n[[File:Avengers (Earth-616) and Skrull Cows (Earth-616) from Avengers Vol 1 93 001.jpg|thumb|290px|Former Skrull Cows posing as the Fantastic Four]]\nSometime later the centuries old [[Kree-Skrull War]] was reignited and the lone Skrull that escaped the Fantastic Four in their first encounter with the Skrulls began working with the Super-Skrull who had been exiled following his last failure. The pair used a hyper-beam to revive the Skrulls on Earth who were hypnotized into thinking they were cows.{{r|Avengers #93}} They then joined the Super-Skrull in a plan that K'lrt hoped would win him the favour of his Emperor and win the hand of Anelle in marriage in a bid to gain control of the empire.{{r|Avengers #94}} When the Avenger's battle with Ronan became public knowledge{{r|Avengers #92}} one of the Skrull spies took the place of US Presidential Candidate [[H. Warren Craddock (Earth-616)|H. Warren Craddock]]{{r|Avengers #97}} using his political position to spread xenophobia toward the Kree in general, Mar-Vell in particular and to besmirch the reputation of the Avengers. He also formed the Commission of Alien affairs to begin witch hunts to find aliens hiding among the population. When the Avengers helped Mar-Vell go into hiding this turned the public against them. They were also brought in for questioning by the commission under \"Haddock\". Meanwhile, Super-Skrull disguised as [[Carol Danvers (Earth-616)|Carol Danvers]] brought Mar-Vell to an inconspicuous farm that functioned as their safe house and ensnared him into a trap. The remaining three Skrulls then posed as founding Avengers [[Steven Rogers (Earth-616)|Captain America]], Thor and [[Anthony Stark (Earth-616)|Iron Man]], and ordered the current roster to disband.{{r|Avengers #92}}\n\nGoing to reconvene with Mar-Vell, the Avengers were attacked by the three Skrulls, who then captured the [[Wanda Maximoff (Earth-616)|Scarlet Witch]] and her brother [[Pietro Maximoff (Earth-616)|Quicksilver]], but the [[Vision (Earth-616)|Vision]] escaped. He brought the real founding members of the Avengers with him later, while the Super-Skrull -- posing as Carol Danvers -- tried to trick Mar-Vell into building a [[Omni-Wave Projector]] a communications device which could also double as a devastating weapon. Mar-Vell saw through the ploy, but this did not stop K'lrt from knocking him out and escaping the arriving Avengers, who bested the three Skrull spies.{{r|Avengers #93}} The three captured Skrulls were once more forced to resume thinking they were cows, where they eventually ended up in the town of [[King's Crossing]].{{r|Fantastic Four Annual #17}}\n\n===Food Contamination===\nWhat happened next to the three original Skrull cows becomes mired in facts and later revelations. It has been stated that following the defeat of the Skrull cows on Earth they were turned over to the Alien Activities Commission, who forced them to be turned back into cows and sent to the slaughter-house. This Skrull-beef ended up in the food supply and was consumed by various members of the human population.{{r|Skrull Kill Krew #2}} Further, it has been stated that the original Skrull cows were accidentally mixed in with a King's Crossing farmer's milking herd, and were milked as Dairy cows. Their \"milk\", which was part of them shape-shifted into milk, caused the people of the town to partially mutate, gaining the Skrulls' shape-shifting abilities and warlike tendencies. Those who drank the \"milk\" forced others to drink it until the entire town was affected.{{r|Fantastic Four Annual #17}}\n\nHowever, in more recent times a Skrull has surfaced and had been undergoing psychiatric care from [[Leonard Samson (Earth-616)|Doc Samson]] who claims to have been one of the original three Skrull cows.{{r|Doc Samson Vol 2 #1}} Further confusing the matter is the fact that the Skrull cows were allowed to breed with normal cows creating Skrull-Cow hybrids,{{r|Skrull Kill Krew Vol 2 #1}} and there is further question to the fate of the Skrull cows of 1776 and how they may have impacted the Skrull-Cow hybrid situation.{{r|Fantastic Four Vol 4 #10}} Thus, it is difficult to say with any certainty which of the \"original\" three Skrull Cows may or may not have been slaughtered or involved with the tainting of the milk supply in King's Crossing.\n\n[[File:Skrull Cows (Earth-616) from Skrull Kill Krew Vol 1 2 004.jpg|thumb|left]]\nWhatever the case eventually, [[Sharon Selleck (Earth-616)|Sharon Selleck]], a friend of the Fantastic Four, was captured there when her car broke down. She had a milk allergy, and was able to resist the effects of the \"milk\", sneaking out of town to call for help. By the time the Fantastic Four arrived to help her, the town had become a super-efficient farming community, erecting massive manufacturing plants to produce more \"milk\", and using it to water their local crops. Luckily, before arriving, Mr. Fantastic had recognized the location as where the cow Skrulls had been sent to, and had devised an antidote to the Skrull infection. The entire town was cured and the crops burned. The only lasting effect of the milk was that everyone was in much better health and had not aged in six years. Not all of the \"milk\" produced by these beings was destroyed or rendered inert. A truck full of containers was seen being delivered to Camp Merl, a US Army Depot. {{r|Fantastic Four Annual #17}} However its effect on the soldiers there or anyone else remains to be revealed.\n\n===Skrull Kill Krew===\nWhile it has been stated that the Skrull meat from the slaughtered cows would cause mutagenic changes in humans who consumed it, there have only been five documented cases of this: [[Ryder (Earth-616)|Ryder]], [[Moonstomp (Earth-616)|Moonstomp]], [[Rob Fortune (Earth-616)|Rob Fortune]], [[Heidi Sladkin (Earth-616)|Heidi Sladkin]], and [[Kimberly Dee (Earth-616)|Kimberly Dee]]. By consuming the beef, they were endowed with Skrull shape-shifting powers as well as other super-human abilities. They became the [[Skrull Kill Krew (Earth-616)|Skrull Kill Krew]] and began a campaign to slaughter all Skrulls that were currently active on Earth.{{r|Skrull Kill Krew #1}}\n\nOver the years the Cow/Skrull hybrids began shaking off their cow forms and adopting human ones and entering into human society which they greatly embraced, particularly the entertainment industry. Apparently, these Skrulls in hiding were known to the United States government and an pact was made between them. During the Skrulls' so-called [[Secret Invasion]] of Earth, the Skrull-Cows used the media to boost human morale to fight back the Skrull invasion.{{r|Skrull Kill Krew Vol 2 #5}} However the presence of this race of Skrull/Cow hybrids was soon discovered by Ryder of the Skrull Kill Krew.{{r|Dark Reign: New Nation #1}} He and his teammate Riot later discovered an Los Angeles nightclub full of Cow-Skrulls that were slaughtering the human patrons in horrific slaughterhouse scenarios and wiped them out.{{r|Skrull Kill Krew Vol 2 #1}} However, it appeared that murderous Skrull-Cows were among the minority as when they next uncovered a \"Reverse Rodeo\" where humans were willing participants in rodeo style activities. Despite this, the Kill Krew slaughtered all the Skrulls there.{{r|Skrull Kill Krew Vol 2 #2}}\n\nA café of Skrull-Cows were also slaughtered by the Krew.{{r|Skrull Kill Krew Vol 2 #4}} They followed by slaughtering the Skrull cast and crew on the \"Stampede\" web series. This in turn led to retaliation from the Skrull-Cows who attacked the Kill Krew's home, but were all eliminated as well.{{r|Skrull Kill Krew Vol 2 #3}} This caused the Skrull-Cows to use the media to pressure the government to do something about the Skrull Kill Krew or face repercussions. This prompted [[H.A.M.M.E.R. (Earth-616)|HAMMER]] director [[Norman Osborn (Earth-616)|Norman Osborn]] to travel to LA to meet with the Skrull-Cow elite. However the meeting was attacked by the Skrull Kill Krew who slaughtered all the elite in company and fled.{{r|Skrull Kill Krew Vol 2 #5}}\n\n===Cadre K===\n[[Cadre K (Earth-616)|Cadre K]] landed on [[Earth]] in Midland, [[South Dakota (State)|South Dakota]]{{r|A + X #16}} or in [[North Dakota (State)|North Dakota]]{{r|A + X #18}} and established themselves as cowboys, purchasing any stock of Skrull-cows (who were somehow evolving into \"something else\") they could find to take them out of the food chain and protect them into the [[Sagittarian Farms]] / Ranch.{{r|A + X #16}} \n\n===Skrull Duck===\nIt was later revealed a fifth Skrull was present and not hypnotized into a cow but Reed Richards changed him into a duck. [[Tara Tam (Earth-616)|Tara Tam]] eventually ate the duck infected her with ''[[Skrullovoria Induced Skrullophobia]]'' granting her shape-shifting powers similar to the alien species. She wouldn't learn the origin of her powers until the [[Skrull Kill Krew (Earth-616)|Skrull Kill Krew]] came to recruit her but she didn't join them but she traveled to [[New York]] where she met [[Howard the Duck (Earth-791021)|Howard the Duck]]{{r|Howard the Duck Vol 5 4}}\n\n| Equipment               = Anti-Gravity Gear\n| Transportation          = Their personal [[Skrull-Ship (Water Tower)|Water Tower Ship]], and the Mother Ship it interacted with.\n| Weapons                 = A Concealed Electronic Detonator, and a Low Velocity Thermal Bomb\n\n| Notes                   = \n| Trivia                  = * [[Veranke (Earth-616)|Queen Veranke]] referenced the Skrull Cows in {{cl|Secret Invasion #6}}. It seemed she understandably held a grudge towards the [[Fantastic Four (Earth-616)|Fantastic Four]] for turning her people into cows.\n| Links                   = * [http://www.marvunapp.com/Appendix/kingscrossingskrull.htm Marvunapp's profile of the People of King's Crossing]\n* [http://www.marvunapp.com/Appendix/skrlkk.htm Marvunapp's profile of the Skrull Kill Krew]\n* [http://www.marvunapp.com/Appendix/craddock.htm Marvunapp's profile of H. Warren Craddock]\n* [http://forum.newsarama.com/showthread.php?t=154149 Damn Dirty Skrulls Flashback: Skrull Kill Krew on Newsarama.com, originally by Troy Brownfield]\n}}\n[[it:Mucche Skrull (Terra-616)]]\n[[Category:Skrull/Cow Hybrids]]\n[[Category:Separate pages]]\n[[Category:Deviant Skrulls]]\n[[Category:Skrull Organizations]]"
                }
            }
        }
    ],
    "page_id": "289417"
}