{
    "pageid": 1428682,
    "ns": 0,
    "title": "Skull-Crusher's Clan (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Skull-Crusher's_Clan_from_Deadly_Hands_of_Kung_Fu_Vol_2_2.png\n| Name                    = Clan\n| Title                   = Skull-Crusher's Clan\n| EditorialNames          = \n| Aliases                 = Crime Family{{r|Deadly Hands of Kung Fu Vol 2 4}}\n\n| Leaders                 = [[Leiko Wu (Earth-616)|Leiko Wu]]; formerly [[Chao Sima (Earth-616)|Skull-Crusher]]\n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Shang-Chi (Earth-616)|Shang-Chi]]\n| Enemies                 = [[White Dragon Clan (Earth-616)|White Dragon Clan]], [[MI6 (Earth-616)|MI-6]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[London (England)|London]], [[United Kingdom]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Mike Benson; Tan Eng Huat\n| First                   = Deadly Hands of Kung Fu Vol 2 2\n\n| History                 = Skull-Crusher's Clan was a Chinese crime family in [[London (England)|London]] that was less predatory than the average crime syndicate. The clan were led by [[Chao Sima (Earth-616)|Skull-Crusher]], a crimelord who had become a mostly legitimate businessmen, one who helped his people overcome obstacles. Under his leadership they cleaned up their territory and appeared to have gained the acceptance and/or loyalty of the community. Among the actions they had taken were converting an opium den used by drug addicts into an orphanage housing 30 homeless children and putting an end to protection rackets that were suffocating businesses.\n\n[[MI6 (Earth-616)|MI-6]] tried repeatedly to infiltrate the syndicate without success, until they sent in [[Leiko Wu (Earth-616)|Leiko Wu]]. She was able to go undercover in the criminal clan, with her final test requiring her to take on five soldiers of the [[White Dragon Clan (Earth-616)|White Dragon Clan]], who she slaughtered without blinking an eye. She surprised the clan with her cunning, skill, and ruthlessness. Leiko then worked her way up the clan's totem pole, and proved herself a master thief. \n\nEventually, the admiration and respect she and Skrull Crusher held for each other became love. Leiko told him her secrets, including that she was working undercover for MI-6. She had become not only a general in his clan but his lover too. In case Skrull Crusher was killed, he secretly transferred control of the clan to Leiko Wu and bound themselves to each other using black magic. \n\nWhich corrupted [[M'Nai (Earth-616)|Midnight Sun]]'s ritual when he killed Skrull Crusher, as he wasn't the clan head. Upon her resurrection she wielded the dark power of Mao Shan. Leiko now carried the power of the dead Triad leaders, delivering the retribution of the wrathful ancient spirits of murderers and villains. She drained power of everything within a 50 mile radius. Having resurrected, leadership of Skull-Crusher's clan has reverted back to her.{{r|Deadly Hands of Kung Fu Vol 2 2|4}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Triads]]\n[[Category:Criminal Organizations]]\n[[Category:Chinese Organizations]]\n[[Category:Crime Families]]"
                }
            }
        }
    ],
    "page_id": "1428682"
}