{
    "pageid": 6155,
    "ns": 0,
    "title": "Slingers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Ben Reilly Scarlet Spider Vol 1 12 Textless.jpg\n| ImageSize               = 300px\n| Name                    = Slingers\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Thorne Theater]], [[Las Vegas]], [[Nevada (State)|Nevada]]; formerly [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = [[Richard Gilmore (Earth-616)|Prodigy]]\n| CurrentMembers          = [[Cassie St. Commons (Earth-616)|Dusk]], [[Richard Gilmore (Earth-616)|Prodigy]], [[Johnathon Gallo (Earth-616)|Ricochet]]\n| FormerMembers           = [[Silas Burr (Earth-616)|Hornet (Burr)]], [[Edward McDonough (Earth-616)|Hornet (McDonough)]]\n| Allies                  = [[Daniel Lyons (Earth-616)|Black Marvel]], [[Black Marvel (Demon) (Earth-616)|Black Marvel (Demon)]], [[Kaine Parker (Earth-616)|Scarlet Spider (Parker)]], [[Benjamin Reilly (Earth-616)|Scarlet Spider (Reilly)]], [[Silas Thorne (Earth-616)|Silas Thorne]]\n| Enemies                 = [[Black Marvel (Demon) (Earth-616)|Black Marvel (Demon)]], [[Silas Burr (Earth-616)|Hornet (Burr)]], [[Mephisto (Earth-616)|Mephisto]]; formerly [[Benjamin Reilly (Earth-616)|Scarlet Spider (Reilly)]] \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Joseph Harris; Adam Pollina\n| First                   = Slingers #0\n\n| HistoryText             = \n===Origin===\nThe golden age hero [[Daniel Lyons (Earth-616)|Black Marvel]] acquired the four costumes [[Peter Parker (Earth-616)|Peter Parker]] wore while he was accused of murder and couldn't go out as Spider-Man. He then proceeded to give them to four youngsters, forming a team that he named the Slingers. Each member adopted one of the costumes and the respective alias that Spider-Man used when wearing that specific costume. \n\nThey started to train and on one training session [[Cassie St. Commons (Earth-616)|Dusk]] fell to her death from a roof. [[Johnathon Gallo (Earth-616)|Ricochet]] and [[Edward McDonough (Earth-616)|Hornet]] were devastated by what just happened, [[Richard Gilmore (Earth-616)|Prodigy]], unaffected emotionally by the loss, told them to move on and they left. The first mission the Slingers were ordered to undertake by Black Marvel was at a construction yard. Prodigy, their field leader, told Ricochet and Hornet to take a look around, but neither of them noticed a dark figure following them. After some investigation they noticed that the [[Maggia (Earth-616)|Maggia]] had stored nuclear waste under the building and that waste had mutated rats to grow into huge mutated beasts. When they saw the rats coming for them, they retreated and Ricochet collapsed part of the tunnel using his throwing disk, but Hornet couldn't get clear and was buried under the rocks. Simultaneously on the surface, Prodigy was fighting against gangsters when the ground collapsed and he retreated. \n\n[[File:Slingers Vol 1 0.jpg|left|thumb]]\nRicochet called Prodigy on his radio about Hornet but he simply crushed his radio and flew away. Ricochet tried to dig Hornet out but was too devastated to do so. Hornet was still alive under the ruble when that dark figure appeared over him and next he noticed he was standing in front of Ricochet who was shocked to see him. After they got out of the tunnel they had a run-in with Spider-Man who was trying to solve how four of his former costumes ended up on these guys.\n\nThe slingers managed to get away. Later in his room, Eddie was visited apparently by Dusk. She was the one who saved him in the underground tunnel and seems to have manifested her powers after her death. Prodigy had returned to Black Marvel and informed him that mission was a failure and that Ricochet and Hornet were dead. Black Marvel revealed the next mission to Prodigy at the opening of a new hotel. When Ricochet and Hornet learned that Black Marvel didn't tell them the truth about his plans, they also headed to the hotel, with Dusk close behind. When Ricochet and Hornet got to the hotel Prodigy attacked them. In the midst of the fight Ricochet was knocked down from the ledge and Prodigy prevented Hornet from saving him by throwing him through a window. Same time as this fight was going Black Marvel was planting bombs around the building. \n\nA couple of stories down, Ricochet was falling to his death when Dusk appeared and teleported him to safety. Prodigy and Hornet were under gunfire from Maggia's goons. Prodigy took them down by throwing a round wooden table at them and grabbed one mobster by the throat. He almost killed him but Hornet intervened. Prodigy took off and Ricochet reunited with Dusk. Meanwhile Black Marvel had finished his bomb planting and detonated them. His ploy was to again be a hero and save people from the fire. Dusk teleported them to Black Marvel and Prodigy also appeared. Black Marvel ran from the flame leaving Ricochet, Hornet, and Dusk to save the civilians, while Prodigy just stood there. They saved several people and Ricochet took out the insane Black Marvel. \n\nProdigy stayed behind to hold up the building so it wouldn't collapse on the others. Everybody except Prodigy managed to get out. Prodigy was buried under the rubble and they handed Black Marvel to the police. Feelings in the team started to be closer after their first real mission and Dusk found Ricochet to be attractive. Not knowing that Hornet saw the kiss Dusk gave to him and couldn't help but feel jealous. It was not known to the rest of the team that Prodigy was still alive and managed to dig himself out of the hotel ruins. Ricochet, Dusk, and Hornet then had a brief encounter again with sewer mutant rats and their leader Griz. \n\n[[File:Slingers Vol 1 2 Textless.jpg|thumb|right]]\nProdigy spent some time cleaning the city by his own methods and with his fists. Prodigy joined the group again and they were all pulled into [[Mephisto (Earth-616)|Mephisto's]] domain to fight for Black Marvel's soul. Mephisto put them through their biggest fears and ordered his armies to kill them but in the end they managed to free Black Marvel's soul. Leaving Mephisto to his kingdom they teleported back to earth. \n\nThe group disbanded for uncertain reasons. Ricochet left the team to join the [[Loners (Earth-616)|Loners]], Hornet died when he tried to stop a mind controlled [[James Howlett (Earth-616)|Wolverine]], Dusk wasn't seen for a long while, and Prodigy was an unregistered superhero who was hunted during the [[Civil War]].\n\n===Reunion===\nA demon from [[Hell]] became fixated with the Black Marvel's desire to continue teaching the Slingers. When the demon was liberated by the [[Diogenes Initiative (Earth-616)|Diogenes Initiative]], he confined himself to the form of the Black Marvel, gaining his knowledge and his abilities. The demon also brought back from Hell the former supervillain [[Silas Burr (Earth-616)|Cyber]], and outfitted him with the equipment of the late Hornet.{{r|Ben Reilly: Scarlet Spider Vol 1 13}} The Black Marvel impersonator proceeded to contact Prodigy, and had him and Hornet work for [[Las Vegas]] millionaire [[Silas Thorne (Earth-616)|Silas Thorne]].\n\nAt Prodigy's request, Ricochet trailed Las Vegas vigilante [[Benjamin Reilly (Earth-616)|Scarlet Spider]],{{r|Ben Reilly: Scarlet Spider Vol 1 11}} and to his surprise stumbled upon the new Hornet, of whose existence he wasn't aware.{{r|Ben Reilly: Scarlet Spider Vol 1 8}} Ricochet teamed up with Scarlet Spider to investigate Hornet,{{r|Ben Reilly: Scarlet Spider Vol 1 9}} and when they confronted him, Dusk made an appearance to help them out.{{r|Ben Reilly: Scarlet Spider Vol 1 10}} Ricochet decided to put aside his mistrust for Hornet to bring the Scarlet Spider to justice after he brutally attacked Thorne. Prodigy subsequently reunited with the other three, effectively marking the return of the Slingers.\n\nAfter the Slingers kidnapped the Scarlet Spider's ally [[Cassandra Mercury (Earth-616)|Cassandra Mercury]] to force him to turn himself over for hospitalizing Thorne,{{r|Ben Reilly: Scarlet Spider Vol 1 11}} they met up with the Black Marvel at the [[Thorne Theater]]. The quartet and their mentor were soon confronted by the Scarlet Spider and his namesake [[Kaine Parker (Earth-616)|Kaine Parker]]. In the middle of the battle, Dusk turned against Black Marvel, since her powers allowed her to detect his true nature. The Hornet additionally revealed his real identity to his teammates.{{r|Ben Reilly: Scarlet Spider Vol 1 12}} Having learned of the truth behind his mentor's apparent return, the Prodigy turned against him as well. When Hornet and Black Mask were driven off, the Slingers attempted but failed to capture Hornet. The Scarlet Spiders went up against Black Marvel, and seemingly killed him. The Slingers then made peace with the Scarlet Spider, but promised to ensure he would hold to his promise to refrain from acting violently again.{{r|Ben Reilly: Scarlet Spider Vol 1 13}}\n\n| Equipment               = '''[[Prodigy's Suit]]''', '''[[Ricochet's Suit]]''', '''[[Dusk's Suit]]''' and '''[[Hornet's Suit]]'''\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * The identities of the Slingers were originally created by Peter Parker.\n\n| Trivia                  = \n| Links                   = * [http://slingers1.tripod.com/ Ricochet's SLINGERS Page!]\n}}"
                }
            }
        }
    ],
    "page_id": "6155"
}