{
    "pageid": 506832,
    "ns": 0,
    "title": "Snake Skulls (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Snake Skulls (Earth-616) from Captain America Comics Vol 1 46 0001.jpg\n| Name                    = Snake Skulls\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Nameless leader\n| CurrentMembers          = \n| FormerMembers           = Nameless leader, unnamed members\n| Allies                  = \n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Vince Alascia;\n| First                   = Captain America Comics Vol 1 46\n| Last                    = Captain America Comics Vol 1 46\n\n| HistoryText             = [[File:Snake Skulls (Earth-616) from Captain America Comics Vol 1 46 0002.jpg|thumb|left|Snake Skull's leader.]]\nThe Snake Skulls are a cult that was active in the United States during the 1940s. Their exact origins are unknown, but in the spring of 1945 they began targeting some of the most wealthy men on Wall Street. To this end, their leader sent their minions to obtain jobs as butlers, chauffeurs, and other labor for the rich men. Then using puff adder venom, on their victims as they were withdrawing large sums of money from their accounts. All their intended victims had weak hearts to begin with, as such the interaction with the venom would cause heart failure, thus throwing off any investigation.\n\nHowever, when the cult performed this scheme on their latest victim, Mr. Ramsey, it was on the day when Privates [[Steven Rogers (Earth-616)|Steve Rogers]] and [[James Buchanan Barnes (Earth-616)|James Barnes]] were at the bank. When the butler attempted to leave with Ramsey and a withdrawn amount of fifty thousand dollars without calling a doctor, Steve and James chased after him. Attacked by some thugs outside, who bloodied James' nose, both he and Steve lost the butler and their attacker. Later, when the police arrived the were told that Ramsey died of heart failure, but the skull of a puff adder and a black book listing names of local wealthy men were found at the scene of the crime.\n\nRealizing what was going on, Steve and James then raced off to warn the next victim, businessman Cyrus Little, as Captain America and Bucky. Getting the drop on the cult members, Cap and Bucky saved Little's life and learned the location of the Snake Skulls' hideout. There they were welcomed into their home and brought to their nameless leader. Cap instantly noticed that the leader was wearing some kind of special face mask. The leader revealed that the room was filled with puff adder venom as Cap began to succumb to its effects. Bucky, immune to the poison because his nose was packed with cotton, then smashed a window to let fresh air into the room. Cap and Bucky then easily defeated the leader and his fellow cultists and turned them over to the authorities.{{r|Captain America Comics Vol 1 46}}\n\nTo date there have been no further appearances of the Snake Skulls.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Members of the Snake Skulls who were posted within their leaders mansion were armed with scimitars. The group used Puff Adder poison in gas form to murder their victims. \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "506832"
}