{
    "pageid": 1176252,
    "ns": 0,
    "title": "Societe des Sadiques (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Moon Knight Vol 1 197 Textless.jpg\n| Name                    = Société des Sadiques\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = Formerly [[Ernst (Nazi) (Earth-616)|Ernst]]\n| CurrentMembers          = [[Lyla DeCriscio (Earth-616)|Lyla DeCriscio]], [[Sol Edmund (Earth-616)|Sol Edmund]], [[Liberation McAllister (Earth-616)|Liberation McAllister]], [[Tilt (Earth-616)|Tilt]]\n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Anti-Carrier\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Max Bemis; Jacen Burrows\n| First                   = Moon Knight Vol 1 197\n\n| History                 = The Société des Sadiques was an underground cult of people who shared a fixation for sadism in all its shapes and forms. Throughout its eighty years of activity, the group became increasingly selective. In modern times it was led by a Nazi named [[Ernst (Nazi) (Earth-616)|Ernst]].\n\nThe Société's latest inductees were drug lord [[Lyla DeCriscio (Earth-616)|Lyla DeCriscio]], serial killer [[Sol Edmund (Earth-616)|Sol Edmund]], photographer [[Liberation McAllister (Earth-616)|Liberation McAllister]], and a body piercer only known as [[Tilt (Earth-616)|Tilt]]. [[Marc Spector (Earth-616)|Moon Knight]] infiltrated the biannual feast for new inductees disguised as a servant on a hunt for Ernst. To his surprise, after Moon Knight revealed himself, Ernst personally invited him to join the Société.{{r|Moon Knight Vol 1 197}}\n\nMoon Knight and the other inductees took part in the Société's induction ritual, which consisted of six trials to put to the test different aspects of themselves. The fifth trial pit each inductee against each other, and Moon Knight defeated the others effortlessly. For the sixth and final trial, Moon Knight was faced with the choice to either kill an innocent child, abstain and have his own daughter [[Diatrice Alraune (Earth-616)|Diatrice]] killed, or confront the Société's full might focused solely on him. Moon Knight stopped his personality of Jake Lockley from murdering the kid, and braced himself to fight the entirety of the Société.{{r|Moon Knight Vol 1 198}} Marc was shot with drugs and isolated with Ernst on a tour through [[Brooklyn]] where he attempted to subjugate him.{{r|Moon Knight Vol 1 199}}\n\nAfter Ernst was killed by Moon Knight, [[Sun King (Patient 86) (Earth-616)|Sun King]] was sent as a back-up plan, but he turned against Ernst's beliefs and agreed to help Spector take down the remaining members of the Société before they could murder Diatrice. Togehter with an army of followers of his own and Sun King, Moon Knight attacked the Société's flying base, a repurposed [[S.H.I.E.L.D. Helicarrier|Helicarrier]] named the \"Anti-Carrier.\" Most of the acolytes were defeated, presumably putting an end to the Société itself.{{r|Moon Knight Vol 1 200}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1176252"
}