{
    "pageid": 15298,
    "ns": 0,
    "title": "Sons of the Tiger (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Sons of the Tiger (Earth-616) from Marvel Team-Up Vol 1 40 0001.jpg\n| ImageSize               = 250px\n| Name                    = Sons of the Tiger\n| Aliases                 = Tigers\n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Lin Sun (Earth-616)|Lin Sun]]\n| CurrentMembers          = \n| FormerMembers           = [[Abraham Brown (Earth-616)|Abe Brown]], [[Robert Diamond (Earth-616)|Bob Diamond]]; [[Lotus Shinchuko (Earth-616)|Lotus Shinchuko]]\n| Allies                  = [[Daniel Rand (Earth-616)|Iron Fist]], [[Luke Cage (Earth-616)|Luke Cage]], [[Peter Parker (Earth-616)|Spider-Man]], [[Hector Ayala (Earth-616)|White Tiger]], [[Shang-Chi (Earth-616)|Shang-Chi]], [[Daughters of the Dragon (Earth-616)|Daughters of the Dragon]]\n| Enemies                 = [[Fu Manchu]]\n\n| Origin                  = Team of Martial art experts \n| PlaceOfFormation        = San Francisco\n| PlaceOfDissolution      = \n| Creators                = Gerry Conway;  Dick Giordano\n| First                   = Deadly Hands of Kung Fu # 1 \n| Last                    =\n\n\n| HistoryText             = The Sons of the Tiger were three friends and Martial arts students of Master Kee:\n* [[Lin Sun (Earth-616)|Lin Sun]] - Chinese, leader of the trio, and adopted son of Master Kee. \n* [[Abraham Brown (Earth-616)|Abe Brown]] - African American member of the trio from the mean streets of Harlem. \n* [[Robert Diamond (Earth-616)|Bob Diamond]] - Caucasian member of the trio, Hollywood actor. \n\nLin Sun was walking back from a Martial arts tournament with his 1st place trophy when he was suddenly attacked by ninja in front of his school in [[San Francisco]]. After defeating the villains he went into the \"Tiger Dojo\" which had been ransacked. He found a dying Master Kee who told him that there were forces in this world which would destroy us and then pointed to a box on a shelf after which he died. In the box Lin found three amulets made of jade, a tiger's head and two claws: the symbol of their school. The inscription at the base of the box read: \"When three are called and stand as one, as one they'll fight, their will be done... For each is born anew, The Tiger's Son.\" They were later known as \"The [[Amulets of Power]]\".\n\nSoon after, Lin met up with his two friends Abe Brown and Bob Diamond who had also been attacked by ninja. Lin recounted the story of Master Kee's death and gave each of them one of the Jade Tiger claw amulets. They soon discovered that when they joined hands and chanted the inscription from the box they became mystically connected. Their martial arts skills combined to become one force: their physical abilities were tripled when they wore the amulets.{{r|Deadly Hands of Kung Fu #1}} The trio then went on to fight the [[Silent Ones (Earth-616)|Silent Ones]], an evil organization with mystical ties attempting to rule the world. During this period, they were joined by [[Lotus Shinchuko (Earth-616)|Lotus]], a former slave to the Silent Ones, whom they freed from their control.{{r|Deadly Hands of Kung Fu #8|10}}\n\nThe trio eventually broke up (due to a romantic triangle between Lin Sun, Lotus, and Diamond) and Lin Sun threw all three amulets into a trash can located in an alley. There, [[Hector Ayala (Earth-616)|White Tiger]] found the amulets and wore them to become The White Tiger.{{r|Deadly Hands of Kung Fu #19}}\n\nAfter the team split up, Diamond renewed his acting career,{{r|Deadly Hands of Kung Fu #21}} while Lin Sun and Lotus unsuccessfully tried to find employment in New York.{{r|Deadly Hands of Kung Fu #22}} Meanwhile, Abe Brown became involved in a plot that led to him becoming the Black Tiger.{{r|Deadly Hands of Kung Fu #20|24}}{{r|Deadly Hands of Kung Fu #26}}{{r|Deadly Hands of Kung Fu #30}}\n\n| Equipment               = The [[Amulets of Power]]\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * Sons of the Tiger were three Martial arts heroes featured in the comic book magazine published by Curtis Magazines (a short lived imprint of Marvel Comics) called The Deadly Hands of Kung Fu. The \"Origin\" issue appeared in DHKF #1 entitled appropriately enough \"The Sons of the Tiger\". The series was created by Gerry Conway and drawn by Dick Giordano. The series was published in the early 1970s amidst the \"Kung Fu\" or Chopsocky movie craze.\n\n* The Sons of the Tiger also made appearances in Special Collector's Edition #1 entitled \"Savage Fists of Kung Fu\". They also appeared in the Special Album Edition of Deadly Hands of Kung Fu. As a note; both of these appearances contained the exact story entitled: \"The Master Plan of Fu Manchu\". In this story the Sons of the Tiger team up with Iron Fist and Shang-Chi. The SCE contained the story in color while the SAE contained it in Black-and-white.\n\n* Interestingly, the book continued using the title \"Sons of the Tiger\" even though the trio had split up and power was transferred to the \"White Tiger\", although the characters still appeared in the book.\n\n* Following the cancellation of the book, Bob Diamond made occasional appearances in Power Man and Iron Fist as Colleen Wing's lover.\n| Trivia                  = \n| Links                   = * http://en.wikipedia.org/wiki/Sons_of_the_Tiger\n}}"
                }
            }
        }
    ],
    "page_id": "15298"
}