{
    "pageid": 1034174,
    "ns": 0,
    "title": "Southeast Asia Crime Syndicate (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Southeast Asia Crime Syndicate (Earth-616) from Invincible Iron Man Vol 4 2 001.jpg\n| Name                    = Southeast Asia Crime Syndicate\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = [[Tomoe (Earth-616)|Tomoe]]\n| CurrentMembers          = [[Biohack Ninja (Earth-616)|Biohack Ninja]], [[Yukio (Earth-616)|Yukio]], [[Zhang (Earth-616)|Zhang]]\n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Anthony Stark (Earth-616)|Iron Man]], [[Riri Williams (Earth-616)|Ironheart]], [[Virginia Potts (Earth-616)|Rescue]], [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]], [[Miles Morales (Earth-1610)|Spider-Man]], [[James Rhodes (Earth-616)|War Machine]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Osaka]], [[Japan]]\n| PlaceOfFormation        = [[Osaka]], [[Japan]]\n| PlaceOfDissolution      = \n\n| Creators                = Brian Michael Bendis; Mike Deodato Jr.\n| First                   = Invincible Iron Man Vol 3 6\n\n| History                 = The Southeast Asia Crime Syndicate was a secretive criminal enterprise with global reach headquartered in [[Osaka]], [[Japan]]. It was founded by the [[Inhumans (Inhomo supremis)|Inhuman]] technopath [[Tomoe (Earth-616)|Tomoe]] in her process to drive away the different nefarious organizations that preyed on her land, and it comprised people Tomoe considered \"disowed and disenfranchised\" like herself. The syndicate's strike force was an army of highly-trained [[Biohack Ninja (Earth-616)|biohack ninja]].{{r|Invincible Iron Man Vol 3 10}}\n\nDuring her journey to retrieve powerful mystical objects, [[Giuletta Nefaria (Earth-616)|Madame Masque]] crossed paths with the syndicate's ninja clan, and made enemies of them.{{r|Invincible Iron Man Vol 3 1}} [[Anthony Stark (Earth-616)|Iron Man]] first came into contact with the clan when he came across several ninja while investigating Masque's operations, and they tried to murder him to remain in the shadows.{{r|Invincible Iron Man Vol 3 3}}\n\nAfter Masque's defeat, Tony Stark enlisted the help of his friend [[James Rhodes (Earth-616)|War Machine]] to find out why were they trailing her. During the investigation, he was abducted by two of them and taken to a warehouse,{{r|Invincible Iron Man Vol 3 6}} where he encountered Tomoe. Tomoe used her abilities to strip Rhodes of his armor and don it herself, making it bulkier by additionally using other components from the warehouse.{{r|Invincible Iron Man Vol 3 7}}\n\n[[File:Southeast Asia Crime Syndicate (Earth-616) from Invincible Iron Man Vol 4 3 001.jpg|thumb|left|The Techno Golem and her Biohack Ninja]]\nBefore she could interrogate and kill Rhodes, Ïron Man and [[Peter Parker (Earth-616)|Spider-Man]] appeared on the scene to rescue him; however, she absorbed Stark's armor into her as well, gaining even more power and creating a devastating explosion that seemingly killed Stark.{{r|Invincible Iron Man Vol 3 8}}\n\nStark actually survived, but went under the radar and adopted the identity of \"Richard Franco,\" an alleged former [[United States Navy (Earth-616)|Navy SEAL]] and ex-[[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] agent. Under the alias of Franco, Stark made his way through the Japanese underground for weeks until Tomoe took notice of him and enlisted his help in finding War Machine and killing him in order to tie up loose ends.{{r|Invincible Iron Man Vol 3 10}}\n\nWhen Rhodes decided to put an end to Tony's undercover operation for his own good, he enlisted the help of the [[Avengers (Earth-616)|Avengers]]. The growing presence of superheroes in Osaka worried Tomoe, thinking they had arrived to avenge Tony Stark. The heroes eventually attacked Tomoe's base of operations, disrupting her enterprise; however, Tomoe herself had preemptively escaped.{{r|Invincible Iron Man Vol 3 11}}\n\nTomoe eventually reorganized her criminal empire. Having caught notice of [[Riri Williams (Earth-616)|Ironheart]] having taken up the legacy of Tony Stark when he fell into a coma following the [[Civil War II|second superhuman civil war]], she decided to take her down to prevent her operations from being disturbed again.{{r|Invincible Iron Man Vol 4 2}} Tomoe proceeded to attack Ironheart and [[Virginia Potts (Earth-616)|Rescue]] in Chicago, backed up by an army of ninja and having stripped the heroines of her suits to encase herself in a new armor.{{r|Invincible Iron Man Vol 4 3}}\n\nRiri managed to slip away to get help while Pepper Potts fended off Tomoe's ninja and tried to stall for time. When Tomoe grew tired of Pepper's shenanigans, she prepared to execute her. The Techno Golem was interrupted by the apparent return of Tony Stark, sporting an Iron Man armor.{{r|Invincible Iron Man Vol 4 4}} Tomoe absorbed the suit, only to discover that was nobody inside, and that who confronted her was a [[Anthony Stark (Third A.I.) (Earth-616)|digital duplicate]] of Stark's mind. When Tomoe took control of the armor, the Stark A.I. uploaded a virus into her systems which disrupted her powers, knocking out her ninja in the process. Tomoe emerged from the rubble of her disarmed armor and tried to kill Riri with a sword, she was, however, knocked unconscious by Rescue's remotelly-controlled gauntlet. When S.H.I.E.L.D. arrived to the scene shortly afterwards, they apprehended Tomoe and her ninja.{{r|Invincible Iron Man Vol 4 5}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Japanese Organizations]]\n[[Category:Criminal Organizations]]"
                }
            }
        }
    ],
    "page_id": "1034174"
}