{
    "pageid": 391917,
    "ns": 0,
    "title": "Soviet Super-Troopers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "\n{{Marvel Database:Team Template\n| Image                   = Incredible Hulk Vol 1 163.jpg\n| Name                    = Soviet Super-Troopers\n| Aliases                 = Super-Troopers\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Kondrati Topolov (Earth-616)|Gremlin]]\n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Bruce Banner (Earth-616)|Hulk]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Steve Englehart; Herb Trimpe\n| First                   = Incredible Hulk Vol 1 163\n| Last                    = \n\n| HistoryText             = The Super Trooper armor was created by the [[Kondrati Topolov (Earth-616)|Gremlin]] and given to select men working for him. While  the [[Bruce Banner (Earth-616)|Hulk]] was being pursued by [[Thaddeus Ross (Earth-616)|Thunderbolt Ross]] he came near the Gremlin's hidden base and the Gremlin decided this would be an ideal opportunity to test out his Super Troopers. Sending out his men they were initially unable to beat the Hulk, but then they gassed him knocking him out. When General Ross came by they captured him and put him in a cell with Banner. Ross was able to make Banner angry enough to become the Hulk and he smashed his way out and fled{{r|Incredible Hulk #163}}.\n\nSome time later when it was learned that [[Glenn Talbot (Earth-616)|Glenn Talbot]] was being held by the Gremlin at [[Bitterfrost]] General Ross led a rescue mission to save him. Bruce Banner stowed away on the transport and when they reached Gremlin's base turned into the Hulk. When his other defenses didn't stop the Hulk the Gremlin called out his improved Super Troopers who managed to defeat the Hulk using their electro-stasis rifles. The Hulk was then held in electro-stasis until Ross was able to free him and they fled the base before it was destroyed by a nuclear satellite{{r|Incredible Hulk #187|188}}.\n\n| Equipment               = Mechanical suits which gave the wearer enhanced strength and flight as well as employing electro-stasis rifles and gas guns.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "391917"
}