{
    "pageid": 68117,
    "ns": 0,
    "title": "Spaceknights (Galadorian) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Spaceknights (Galadorian) (Earth-616) from Avengers Vol 5 16.jpg\n| ImageSize               = 300px\n| Name                    = Spaceknights\n| Distinguish1            = Spaceknights\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Alignement              = Good\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Galador]]\n\n| Leaders                 = Formerly [[Rom (Earth-616)|Rom]]\n| CurrentMembers          = '''[[Spaceknights (Third Generation) (Earth-616)|Third Generation]]'''<br>'''[[Angel Elite (Earth-616)|Angel Elite]]'''\n| FormerMembers           = '''[[Spaceknights (First Generation) (Earth-616)|First Generation]]:''' '''[[Spaceknight Squadron (Earth-616)|Spaceknight Squadron]]'''<br>'''[[Spaceknights (Second Generation) (Earth-616)|Second Generation]]'''\n| Allies                  = \n| Enemies                 = [[Dire Wraiths]], [[Deathwings]], [[Hellhounds]], [[Skrulls]], [[Watchwraiths]], [[Wraithknights (Earth-616)|Wraithknights]]\n\n| Origin                  = Cyborg Warriors created to defend Galador from the Dire Wraiths\n| PlaceOfFormation        = Galador\n| PlaceOfDissolution      = \n| Creators                = Bill Mantlo; Sal Buscema\n| First                   = Rom #1\n| Last                    = \n\n| HistoryText             = The Spaceknights are an elite corps of cyborg warriors created by the humanoids of the planet [[Galador]] to battle the [[Dire Wraiths]]. About two hundred years ago, a fleet of Galadorian starships entering the so-called [[Dark Nebula]] was destroyed by the Dire Wraiths. A Dire Wraith warfleet prepared to invade Galador itself. The [[Prime Director (Earth-616)|Prime Director]] of Galador asked the general populace of the planet for volunteers to give up their humanoid bodies and undergo surgical conversion into an army of cyborg warriors called Spaceknights who would be adapted for the rigors of combat in outer space. \n\nThe first to volunteer was a man named [[Rom (Earth-616)|Rom]], who became the greatest and most heroic of the Spaceknights.{{r|Rom Vol 1 1}} Millions volunteered, but only a few hundred were accepted and underwent surgery in which much of his or her body, including his or her brain, was transplanted into a computerized exoskeleton onto which his or her autonomic and central nervous systems were grafted. Those portions of the subjects' bodies which were not used in the conversion process were cryogenically preserved on Galador in the [[Halls of Science]]. The [[Galadorians]] intended to restore the Spaceknights to their original humanoid forms once the war with the Dire Wraiths was over.{{r|Official Handbook of the Marvel Universe Vol 2 12}}\n\n[[File:Rom (Earth-616) and Spaceknight Squadron (Earth-616) from Rom Annual Vol 1 2 0001.jpg|First Generation Spaceknights on Wraithworld|thumb|left]]\nThe Spaceknights were dispatched with rocket pods and offensive weapons especially suited to each Spaceknight's particular cybernetic strengths. Each Spaceknight was thus equipped with a different weapon than the others, or had armor designed so as to give him or her a special power or powers. In the major confrontation that ensued, the Spaceknights destroyed the bulk of the Dire Wraiths's fleet and their monstrous creature [[Deathwing]].  \n\nLarge numbers of Wraiths had escaped the battle, however, and Wraith strongholds were believed to exist in other parts of the universe. Hence, Rom and the other Spaceknights left Galador to stalk Dire Wraiths throughout the universe, and did so for over 200 Earth year.{{r|Official Handbook of the Marvel Universe Vol 2 12}}\n\nA number of Spaceknights, including [[Raak (Earth-616)|Breaker]], [[Plor (Earth-616)|Pulsar]], [[Skera (Earth-616)|Scanner]], [[Tarm (Earth-616)|Seeker]], [[Vola (Earth-616)|Trapper]], and the [[Unam (Earth-616)|The Unseen]], worked together as the so-called [[Spaceknight Squadron (Earth-616)|Spaceknight Squadron]].\nMost of the original [[Spaceknights (First Generation) (Earth-616)|First Generation of Spaceknights]] possess (in their cyborg forms) superhuman strength, the ability to fly (using rocket pods on their backs), the ability to survive indefinitely in outer space, and high resistance to injury by conventional means. Each Spaceknights' armor was principally made of [[Plandanium]], an extremely strong metal alloy. Large power requirements, such as movement and the picking up of objects, made use of a meson/antimeson thermo-electric battery which can operate under normal conditions for five Earth centuries. The flexible metal exoskeletons contained fluid \"motors\" which give the Spaceknights their great strength. The Spaceknights' brains are kept alive in a blood-like fluid that circulates through the body organs within the exoskeleton.{{r|Official Handbook of the Marvel Universe Vol 2 12}}\n\n===First Generation===\nWhen the Galadorian Armada entered the sector of space known as the Dark Nebula bringing gifts of technology and peace, they were savagely attacked and massacred by the sorcerous Dire Wraiths. The Wraiths then assaulted Galador itself. In desperation, the Prime Director called on the youth to sacrifice their humanity to become cyborg warriors as a last ditch line of defense.\n\nA thousand brave Spaceknights formed a line of battle around Galador and in savage combat defeated the Wraith fleet scattering it across the cosmos.{{r|Rom Vol 1 1}} Realizing the decimated Wraiths would infiltrate whatever worlds they came to and rebuild their strength to once again assail Galador, the first generation of Spaceknights set forth on the quest to rid the Universe of their evil.\n\nTwo centuries later, Rom would return to Galador just in time to lead a portion of the First Generation Spaceknights against [[Galactus]]. Rom was able to strike a bargain with the devourer to lead him to an entire star system that he could consume instead. When Galactus was unable to stomach the [[Black Sun]] he still kept his bargain with Rom in part by moving the approaching Galador to another location where none of the First Generation knew.{{r|Rom Vol 1 27}}\n\n===Second Generation===\nWith their home system relocated and now defenseless, the Galadorians created the Second Generation of Spaceknights to be more powerful than the first by utilizing less of their humanity. When no threats arose, these members became renegades and eventually turned on the Galadorians and depopulated the planet. Rom and the [[Spaceknight Squadron (Earth-616)|Spaceknight Squadron]] later found their home and confronted these renegades with only Rom surviving. The remainder of the First Generation went to the stars to continue to do good.{{Citation}}\n\n===Third Generation===\nThe Third Generation were created by the revitalized Galador under the leadership of Rom and [[Brandy Clark]] of Earth.  With Galador once again in contact with it colonies, the planet once again established itself at the forefront of cyborg technology. This group took part in the Annihilation wars aiding [[Richard Rider (Earth-616)|Nova]], [[Phyla-Vell (Earth-616)|Quasar (Phyla-Vell)]] and [[Blastaar (Earth-616)|Blastaar]] against the Annihilation wave.  The Galadorians began a \"Restitution Initiative\" in aiding the rebuilding of other worlds after the war. One cadre would be corrupted by the [[Phalanx]] when they answered a distress call and used to infect the war-net of the [[Kree]] Empire.{{r|Annihilation: Conquest Prologue Vol 1 1}}\n\n===Fourth Generation===\nWhen [[Peter Quill (Earth-616)|Starlord]] began the formation of a team of universal protectors known as the [[Annihilators (Earth-616)|Annihilators]], the Galadorians sent [[Ikon (Earth-616)|Ikon]] as their representative. Soon upon her arrival, a [[Skrull]] named [[Klobok (Earth-616)|Klobok]] assumed the identity of the Wraith Warlock known as [[Doctor Dredd (Earth-616)|Doctor Dredd]] and relocated the sorcerous [[Black Sun (Dark Nebula)|Black Sun]] from its shielded cloak inside the [[Dark Nebula]] to the Galadorian home system. This led to the return of [[Wraithworld]] from Limbo and the fusing of both Galador's Sun and the Wraith's into one stellar mass. The Annihilators then shifted the orbits of both worlds so that Galador always faced the natural yellow sun and Wraithworld the half that was the Black Sun.{{r|Annihilators Vol 1 4}} An uneasy truce now exists between the two races.\n\n| Powers                  = Superhuman Strength and Resilience.  \n| Equipment               = All Spaceknights are equipped with Galadorian armor made of Plandanium\n| Transportation          = Personal via stardrive rocket pods and starships.\n| Abilities               = Flight: both Atmospheric and Interstellar.\n| Weapons                 = Each Spaceknight has unique weapons and abilities attuned to their own personal attributes.\n\n| Notes                   = * There are only a few known instances of Non-Galadorians wielding Spaceknight armor:\n** The Earthling Brandy Clark inherited the powers of Landra (Starshine) and was merged with the Starshine armor by the Dire Wraith Warlock [[Doctor Dredd (Earth-616)|Doctor Dredd]]\n** [[Quasi-Motivational Destruct Organism (Earth-616)|Quasimodo]] temporarily inhabited the armor of Rom after cloning and removing his human remains. He was slain & expunged from the armor by Brandy Clark (Starshine)\n** The Earthling [[Archie Stryker (Earth-616)|Archie Stryker]] became a dupe of the Dire Wraiths and was merged with the Firefall armor they captured wielded by the Galadorian [[Karas (Earth-616)|Karas]] two centuries earlier.\n** [[Tyreseus (Earth-616)|Tyreseus]], a ship's surgeon for the Shi'ar would merge himself with the Pulsar armor of [[Plor (Earth-616)|Plor]] after the wounded Spaceknight died in battle with the Imperial Guard and try to mount an insurrection against the Shi'ar Empire.\n** [[Ultron (Earth-616)|Ultron]] used the body of a deactivated Spaceknight to return to Earth.{{r|Avengers Vol 4 12.1}}\n| Trivia                  = \n| Links                   = * http://en.wikipedia.org/wiki/Spaceknights\n}}\n[[Category:Galadorian Organizations]]\n[[Category:Alien Military Forces]]"
                }
            }
        }
    ],
    "page_id": "68117"
}