{
    "pageid": 505932,
    "ns": 0,
    "title": "Specialized Unit, Enhanced Soldiers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = All-Winners Squad Band of Heroes Vol 1 1 Textless.jpg\n| Name                    = Specialized Unit, Enhanced Soldiers\n| Aliases                 = Crazy S.U.E.S., Crazy Sues\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = Formerly [[Steven Rogers (Earth-616)|Captain America]]\n| CurrentMembers          = \n| FormerMembers           = [[Sargent Byrd (Earth-616)|Sargent Byrd]], [[James Buchanan Barnes (Earth-616)|Bucky]], [[William Bryon (Earth-616)|Young Avenger]], [[Merzah (Earth-616)|Merzah the Mystic]], [[Frank Cortez (Earth-616)|Captain Flame]], [[Albert Jones (Slow Motion) (Earth-616)|Sargent \"Slow Motion\" Jones]], [[Elton Morrow (Earth-616)|Blue Diamond]], [[Leonard Gade (Earth-616)|Invisible Man]], [[Archie the Gruesome (Earth-616)|Archie the Gruesome]], [[Jim Taylor (Earth-616)|Taxi Taylor]], [[Victory Boys (Earth-616)|The Victory Boys]], [[Robert Foster (Earth-616)|Flash Foster]], [[William Prince (Earth-616)|Fighting Yank]], [[Doug Johnson (Earth-616)|Jap Buster Johnson]], [[Moon Man (Earth-616)|Moon Man]], [[Larry Scott (Earth-616)|Father Time]], [[Roddy Colt (Earth-616)|Secret Stamp]], [[Robert Strong (Earth-616)|Captain Strong]], [[Pat Murphy (Earth-616)|Vagabond]], [[Davey Drew (Earth-616)|Davey Drew]], [[Transisto-Mech (Earth-616)|T-Mech]], [[Peter Noble (Earth-616)|Fin]], [[Perry Webb (Earth-616)|American Ace]]\n| Allies                  = [[Invaders (WWII) (Earth-616)|Invaders]]\n| Enemies                 = [[National Socialist German Workers Party (Earth-616)|Nazis]], [[Imperial Japan (Earth-616)|Imperial Japan]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Paul Jenkins; Carmine Di Giandomenico\n| First                   = All-Winners Squad: Band of Heroes #1\n| Last                    = All-Winners Squad: Band of Heroes #5\n\n| HistoryText             = \n===Overview===\nThe '''Specialized Unit, Enhanced Soldiers''' or '''\"SUES\"''' was an [[American]] combat unit composed of various diversely-enhanced [[Super-Soldiers]] which was commissioned by special order of General [[Dwight D. Eisenhower (Earth-616)|Dwight D. Eisenhower]] and initially led by [[Steven Rogers (Earth-616)|Captain America]] after the [[United States]]' entry into [[World War II]].{{r|All-Winners Squad: Band of Heroes #1}}\n\n===Events===\nThe official record states that the SUES were a specialized Ranger unit attached to the 101st Air Assault Division for the purposes of combat operations deep behind enemy lines.{{r|All-Winners Squad: Band of Heroes Vol 1 2}} The real, and much more insidious, reason for the unit's existence, however, is that it was used as a training grounds for training superhuman operatives for a different mission. Not much is known about what this mission was, but in 1940 the American government embarked upon on a very unique and expensive project that was believed to eventually be able to turn the tide of war in the Allies' favour. While referred to informally by those in the know as the \"Silver Plated Project,\" it's official designation was Project Alberta. Of particular interest to the project was [[Frank Cortez (Earth-616)|Frank Cortez]], known as Captain Flame. [[Steven Rogers (Earth-616)|Captain America]] was actually given special orders by a Colonel Ledford in 1944 detailing how to guide Captain Flame's development, stating that they needed him in the worst way and that the Captain would \"have to push him to his absolute limit.\"{{r|All-Winners Squad: Band of Heroes Vol 1 5}} The Captain was forbidden from making any of this information known to any of the other members of the unit. Presumably Cortez was unknowingly a major component of \"Operation Firefly,\" a top-secret culmination of a number of secret projects running concurrently during the war, including Project Alberta.{{r|All-Winners Squad: Band of Heroes Vol 1 5}}\n\nWhen the Crazy SUES were first assembled, they were sent to basic training and stayed in barracks, much like any other new unit. Most of the heroes were meeting each other for the very first time and mostly got along. There were some racial tensions, however, which developed from the inclusion of [[Albert Jones (Slow Motion) (Earth-616)|Slow-Motion Jones]], an African-American, particularly from the racist [[Robert Strong (Earth-616)|Captain Strong]].{{r|All-Winners Squad: Band of Heroes Vol 1 2}}\n\nThe unit's first action came on August 7th, 1942, when they were deployed to the Japanese-held island of Guadalcanal. Despite being shot at while parachuting in, and landing in a particularly vulnerable position, the SUES only had one casualty during their first assault, a broken leg by the [[Roddy Colt (Earth-616)|Secret Stamp]]. This was mostly due to Captain Flame's devastating release of energy that incinerated the incoming wave of Japanese soldiers. This was inadvertent on Cortez's part. He had actually frozen up during the combat, but Sergeant Byrd had thrown a live grenade at him, knowing of his energy absorption and redirection abilities. When asked about Cortez later, Byrd said he just \"needed a little push.\"{{r|All-Winners Squad: Band of Heroes Vol 1 2}} Nearly a week later, on August 13th, the unit were still clearing out the underground tunnels of the island of hostile forces when they were ambushed by a large Japanese contingent. Cortez tried to absorb the energy from all of the explosions around him, but it was too much. Most the unit managed to get out of range before he expelled the energy, but [[Doug Johnson (Earth-616)|\"Jap-Buster\" Johnson]] was too consumed with bloodlust to heed the Captain's warnings and was incinerated. [[Davey Drew (Earth-616)|Davey Drew]] was also caught in the explosion, but survived, suffering scars and blisters which his teammates thought \"just made him crazier.\"{{r|All-Winners Squad: Band of Heroes Vol 1 3}} Also injured was Slo-Mo Jones, who told the others to leave him and get out of danger. A stubborn Captain Strong, however, rescued Slo-Mo, seemingly having gained a grudging respect for the man after seeing him hold his own in combat.{{r|All-Winners Squad: Band of Heroes Vol 1 3}} It appears that the Crazy SUES remained in the Pacific Theatre of war until shortly before the D-Day invasion of Normandy in June of 1944. The unit encountered hard fighting on the Pacific Islands and suffered more losses, including [[Pat Murphy (Earth-616)|Vagabond]], who was killed in an ambush the day before they shipped out.{{r|All-Winners Squad: Band of Heroes Vol 1 4}} \n\nThe Crazy SUES were next tasked with being part of the Normandy invasion, their target being a small village called Sainte Mere Eglise. The unit was able to take the village, despite the continuing mental unhinging of Cortez. Later in June, the [[Elton Morrow (Earth-616)|Blue Diamond]] and [[Leonard Gade (Earth-616)|Invisible Man]] allowed themselves to be captured in order to discern German troop strengths in France. Once this was accomplished, they were rescued by the [[William Bryon (Earth-616)|Young Avenger]] and [[Jim Taylor (Earth-616)|Taxi Taylor]].{{r|All-Winners Squad: Band of Heroes Vol 1 1}} Once entrenched in Europe, the unit began periodically receiving new recruits, including the [[Victory Boys (Earth-616)|Victory Boys]] and [[Perry Webb (Earth-616)|American Ace]]. Cortez and Ace hit it off immediately and began a secret relationship together. The only others who knew about this were Slo-Mo, who followed the pair out into an alleyway where he saw them embrace and kiss,{{r|All-Winners Squad: Band of Heroes Vol 1 4}} and [[Merzah (Earth-616)|Merzah]], whose psychic and empathic abilities made him privy to Cortez's secrets.{{r|All-Winners Squad: Band of Heroes Vol 1 2}} Shortly thereafter, Merzah approached Slo-Mo and told him that there would soon come a time when he would be tempted to betray Cortez and reveal his secret, but Merzah begged him not to when that time came. \n\nAround this same time, Taxi Taylor and his [[Transisto-Mech (Earth-616)|T-Mech]] were transferred out of the Crazy SUES and into the direct command of the aforementioned Colonel Ledford, much to the chagrin of Captain America.{{r|All-Winners Squad: Band of Heroes Vol 1 5}} In August, the unit participated in the liberation of Paris which presented some of the heaviest street fighting that the unit had yet encountered. It would only get worse, though, as the SUES marched across the French countryside on their way to Belgium. While scouting through one French town, the unit was ambushed and [[Moon Man (Earth-616)|Moon Man]] was shot through the throat, killing him. The rest of the unit were pinned down under heavy fire with only Slo-Mo and Cortez able to provide help. Cortez, however, was having a breakdown, claiming that he just couldn't do it anymore. Desperate to help his friends, Slo-Mo threatened to reveal Cortez's secrets about his relationship with American Ace and his homosexuality if he didn't get out there and save the unit. Realizing that he had betrayed Cortez just as Merzah said he would, Slo-Mo watched as Cortez destroyed the enemy force, saving their friends.{{r|All-Winners Squad: Band of Heroes Vol 1 5}}\n\nBy December of 1944 the SUES had pushed their way into Germany. They met particularly heavy resistance in Saarlautern when they were pinned down by a German Panzer and several columns of soldiers. The Victory Boys were mowed down by a German half-track during this attack. Despite the best efforts of the medic, [[Archie the Gruesome (Earth-616)|Archie the Gruesome]], the last living boy, Piotr, was too far gone to be saved. The Young Avenger had Archie pump him full of morphine before shooting the boy in the head with a pistol, ending his misery. Probably suffering from post-traumatic stress disorder, Cortez wandered around the battlefield like a zombie before being fired upon by the Panzer. He redirected this explosion back towards the tank, however, completely decimating it.{{r|All-Winners Squad: Band of Heroes Vol 1 1}}\n\nThe rest of the Crazy SUES activities during the Second World War are as yet unrecorded, though it is known that after the war ended, the surviving members of the squad were forced to sign a contract forbidding them from ever talking about what they witnessed.{{r|All-Winners Squad: Band of Heroes Vol 1 3}}\n\n| Equipment               = Standard issue United States Army equipment.\n| Transportation          = \n| Weapons                 = Each teammates' arsenal\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Allied Organizations]]"
                }
            }
        }
    ],
    "page_id": "505932"
}