{
    "pageid": 35750,
    "ns": 0,
    "title": "Spinsterhood (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Spinsterhood_(Earth-616)_from_Silver_Surfer_Vol_2_81.png\n| Name                    = Spinsterhood\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Ganymede (Alien) (Earth-616)|Ganymede]]; [[Persephone (Spinsterhood) (Earth-616)|Persephone]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Tyrant (Earth-616)|Tyrant]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Ron Marz; Ron Lim\n| First                   = Silver Surfer Vol 3 80\n\n| History                 = \"When the universe was young\", the order of the Spinsterhood flourished. These women took sacred vows, forfeiting carnal pleasure to learn combat. They marked themselves with the symbol of the ceremonial dagger. They gained eminent expertise with their energy staffs and flight belts.\n\nThey engaged the powerful malcontent Tyrant in a war that took place over centuries amongst many galaxies. They eventually drove him to uncharted space. Unable to think of anything else to do upon the defeat of Tyrant, the Spinsterhood elected to retire to various hibernation chambers disguised as space rock. They would wait till Tyrant returned. After a few billion years, he did.{{r|Silver Surfer Vol 3 80|81}} \n\nHowever, over the billions of years in stasis, all of the Spinsters, with the exception of Ganymede, perished. Ganymede confirmed the deaths of all of the Spinsters in stasis within their former base. Another of the Spinsters, Persephone, was cloned by Jakar. \n\nAfter fulfilling a false mission for Jakar, she joined with Ganymede in renewing their mission against Tyrant. It is unclear whether they have yet learned that Tyrant met his apparent demise at the hands of others. Their former temple exists in ruins beneath the surface of an unnamed planetoid, guarded by a powerful android duplicate of one of the Spinsters. The android can be deactivated by a simple touch of a button on the back of its neck.{{r|Cosmic Powers Vol 1 3}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = * [http://www.marvunapp.com/Appendix/ganymede.htm#SPINSTERHOOD Spinsterhood at marvunapp.com]\n}}\n[[Category:Interplanetary Organizations]]\n[[Category:Alien Military Forces]]"
                }
            }
        }
    ],
    "page_id": "35750"
}