{
    "pageid": 661971,
    "ns": 0,
    "title": "Spirits of Vengeance (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database: Team Template\n| Image                   = Spirits of Vengeance (Earth-616) from Ghost Riders Heaven's on Fire Vol 1 6 001.jpg\n| ImageSize               = 250px\n| Name                    = [[Spirits of Vengeance]]\n| EditorialNames          = \n| Aliases                 = \"C.I.A. of the Afterlife\",{{r|Ghost Rider Vol 6 33}} [[Ghost Rider]]s,{{r|Ghost Rider Vol 6 30}} \"God's Enforcers\",{{citation}} \"Heaven's Black Ops\",{{r|Ghost Rider Vol 6 33}} \"Heaven's Greatest Weapon\",{{citation}} \"The Clenched Fist of God\",{{citation}} \"The Divine Black Ops\"{{citation}}\n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = [[Johnathon Blaze (Earth-616)|Johnny Blaze]]; formerly [[Zadkiel (Earth-616)|Zadkiel]], [[Mephisto (Earth-616)|Mephisto]]\n| CurrentMembers          = [[Ghost Rider (1,000,000 BC) (Earth-616)|Ghost]], [[Alejandra Jones (Earth-616)|Alejandra Jones]], [[Alejandra Jones (Earth-15513)|Alejandra \"Nicaraguan Hellfire\" Jones]], [[Bai Gu Jing (Earth-616)|Bai Gu Jing]], [[Baron Skullfire (Earth-616)|Baron Skullfire]], [[T-Rider Rex (Earth-15513)|\"Big Boy\" T-Rider Rex]], [[Caleb (Earth-616)|Caleb]], [[Carter Slade (Earth-15513)|Carter \"Satan Stomper\" Slade]], [[Ghost Rider (Cowboy) (Earth-616)|Cowboy Ghost Rider]], [[Daniel Ketch (Earth-616)|Danny Ketch]], [[Devil Rig (Earth-616)|Devil Rig]], [[Ghost Flyer (Earth-616)|Ghost Flyer]], [[Johnathon Blaze (Earth-616)|Johnny Blaze]], [[Knuckles O'Shaugnessy (Earth-616)|Knuckles O'Shaugnessy]], [[Marinette Bwa Chech (Earth-616)|Marinette Bwa Chech]], [[Molek (Earth-616)|Molek]], [[Ghost Rider (Frontier Era) (Earth-616)|Chief Hellhawk]], [[Nima (Earth-616)|Nima]], [[Noble Kale (Earth-616)|Noble Kale]], [[Roberto Reyes (Earth-616)|Robbie Reyes]], [[Shoba Mirza (Earth-616)|Shoba Mirza]], [[Ghost Rider (Undead G-Man) (Earth-616)|Undead G-Man Ghost Rider]], [[Yoshio Kannabe (Earth-616)|Yoshio Kannabe]]\n| FormerMembers           = [[Hell-Driver (Earth-616)|Hell-Driver]], [[Max Parrish (Earth-616)|Max Parrish]], [[Naomi Kale (Earth-616)|Naomi Kale]], [[Ghost Rider (Kale) (Earth-616)|WWII Ghost Rider]]\n| Allies                  = [[Black Host (Earth-616)|Black Host]]<!-- Shadowland -->, [[Phantom Riders of the Congo (Earth-616)|Phantom Riders of the Congo]]\n| Enemies                 = [[Zadkiel (Earth-616)|Zadkiel]]; formerly [[Black Host (Earth-616)|Black Host]]\n\n| Origin                  = The (loosely-affiliated) [[Glossary:Spirits of Vengeance|Spirits of Vengeance]] (humans bonded to vestige of [[Yahweh (Earth-616)|God]])\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Howard Mackie; Ron Garney\n| First                   = Ghost Rider Vol 3 42\n| Last                    = \n\n| Overview                = The '''Spirits of Vengeance''' were a team of benevolent beings who protected mankind during ancient times. Their exact origins are a mystery, as some have claimed that they were the vestiges of \"[[Yahweh (Earth-616)|God]]'s power\" bonded to human hosts and calling themselves [[Ghost Rider]]s, while others have claimed them to be demons in the service of [[Mephisto (Earth-616)|Mephisto]].{{r|Avengers Vol 8 22}} There have been different sorts of Spirits of Vengeance around the world based on each region's customs, beliefs, and religions. Keeping them under control was the archangel [[Zadkiel (Earth-616)|Zadkiel]], whose sole purpose was to keep the Spirits' purportedly true origin a secret.{{r|Ghost Rider Vol 6 33}}\n\n| HistoryText             = \n===[[Stone Age]]===\nThe earliest known occurrence of a Spirit of Vengeance indwelling a human occurred in 1,000,000 BC, when a young boy belonging to a mammoth-riding tribe of early humans bargained with [[Mephisto (Earth-616)|Mephisto]] to obtain revenge against a [[Wendigo (1,000,000 BC) (Earth-616)|Wendigo]] who had slaughtered his people.{{r|Avengers Vol 8 4}}{{r|Avengers Vol 8 7}} At some point afterwards, the [[Ghost Rider (1,000,000 BC) (Earth-616)|Rider]] joined the [[Stone Age]] [[Avengers (1,000,000 BC) (Earth-616)|Avengers]] and defeated [[Zgreb (Earth-616)|Zgreb the Sorrower]], a corrupted Celestial.{{r|Marvel Legacy #1}} When the [[Glossary:First Host|First Host]] arrived, the Rider fought alongside his allies to repel them.{{r|Avengers Vol 8 4}} Following this, the Rider and his allies opposed Mephisto and other threats to the nascent humanity, such as time-travelling conquerors.{{r|Avengers Vol 8 31}}\n\n===Purported Origins===\n<!--The tale here is told by Sister Sara, the Caretaker. It is unknown how the previous mention of a Stone Age Ghost Rider fits in it.-->\nAccording to [[Caretaker (Sara) (Earth-616)|Sister Sara]], following the [[Great Flood]] that wiped out almost the entire human population ended, [[Yahweh (Earth-616)|God]] created a rainbow signifying his promise to humanity that he would never smite his wrath upon the face of the [[Earth]]. However, he continued to witness mankind committing countless misdeeds and ungodly actions, which eventually infuriated him. The Spirits of Vengeance, vestiges of God's power bonded to human hosts, were designed to fight off the thriving supernatural and satanic threats, as well as purify sin and wreak havoc on the guilty for their mistreatment towards the innocent and undeserving. Over the generations, the Spirits pursued their cause to purge the unrighteous.<!--{{r|Ghost Rider Vol 6 33}}-->\n\nThe archangel Zadkiel was put in charge of monitoring the Spirits of Vengeance and keeping the truth of their origins a secret throughout the millennia;{{r|Ghost Rider Vol 6 33}} with one purportedly false origin story being that they were an order of benevolent demons opposing by the devil [[Zarathos (Earth-616)|Zarathos]] - who is often counted among them due to his similar powers and appearance; connected to the Ketch and Blaze bloodlines through the [[Medallion of Power]].{{r|{{cl|Ghost Rider Vol 2 42}}-[[Ghost Rider Vol 2 43|43]]}} Regardless of their origins, there have been dozens - if not hundreds - of Spirits of Vengeance throughout the centuries, many of them found in what became the United States of America.{{r|Ghost Rider Vol 6 33}}\n\n===The Last Stand of the Spirits of Vengeance===\nDuring this event, most of the Spirits of Vengeance population disappeared due to the corrupted motive brought by [[Daniel Ketch (Earth-616)|Danny Ketch]], which was given to him by Zadkiel, whose plan was to collect all of the Spirits' power to break down the walls of [[New Jerusalem]] and wage war on [[Heaven (Paradise)|Heaven]].{{r|Ghost Rider Vol 6 26|32}} After the walls were felled, the Spirits rained down from the sky and were returned to their rightful hosts. and to others such as [[Vengeance (Kowalski) (Earth-616)|Vengeance]].{{r|Ghost Rider Vol 6 32}}\n\n===War of [[Damnation]]===\nWhen Mephisto brought Hell to Las Vegas via the [[Hotel Inferno]], he bonded [[Stephen Strange (Earth-616)|Doctor Strange]], [[Samuel Wilson (Earth-616)|Falcon]], [[Carol Danvers (Earth-616)|Captain Marvel]], [[Jane Foster (Earth-616)|Thor]], [[Clinton Barton (Earth-616)|Hawkeye]], [[T'Challa (Earth-616)|Black Panther]], and [[Kaine Parker (Earth-616)|Kaine]] to Spirits of Vengeance, turning them into [[Ghost Rider|Ghost Riders]] under his control.{{r|Doctor Strange: Damnation Vol 1 1}}{{r|Ben Reilly: Scarlet Spider Vol 1 17}}\n\nAfter Johnny Blaze became the King of [[Mephisto's Realm|Hell]], he recalled the Spirits of Vengeance possessing his allies and summoned every Ghost Rider that had the Hell-Lord had ever created to take revenge.{{r|Doctor Strange: Damnation Vol 1 4}}\n\n==Powers==\nAccording to [[Caretaker (Sara) (Earth-616)|Sister Sara, the Caretaker]], the Spirits of Vengeance were the divine wrath of God, while according to others they are demonic entities that serve [[Mephisto (Earth-616)|Mephisto]] and others who sit upon the throne of his [[Mephisto's Realm|Hell]].{{r|Avengers Vol 8 22}} Regardless of their muddled origins, their powers are \"boundless\" and \"god-like\" -- capable of doing incredible feats and competence as explained by [[Stephen Strange (Earth-616)|Doctor Strange]] making them one of the strongest and most powerful supernatural entities to exist but are only limited due to the human host lack of imagination. The host itself acts as a \"built-in safety lock\" to prevent the Spirit from exacting its full potential. If the Spirit is controlling the Ghost Rider, the results would be biblically catastrophic and the human host can only influence the Spirit's decisions. If the host is in control, it would not be as powerful as the Spirit. Nevertheless, the Ghost Rider is still very powerful even in its weakest state.{{r|Ghost Rider Vol 6 13}}\n\n'''Vessel Possession:''' The Spirits do not require any human host to bond with. They're capable of enduring for themselves rather than needing a vessel to live. However, as immortal and benevolent weapons, they must possess a human host through various means in order to thwart any evil presence. The Spirits are considered to be ruthless against impurity and will torture the host for preventing it to fight off wickedness. This could cause several psychological and spiritual predicaments. If the act of prevention does occur, it will lead to either the Spirit having absolute control or losing the host's humanity succumbing to an incurable monstrous state.{{citation}}\n* '''Host Empowerment:''' Any human being possessed by a Spirit of Vengeance will be granted unimaginable capabilities. Some of its abilities are visibly demonstrated due to how the host utilizes its powers. But because of the lack of imagination and knowledge, the majority of the Spirit's powers aren't in use and will only be seen if the user is familiar and imaginative with it's feats.{{citation}}\n\n'''God-like Capabilities:''' Like other overpowering figures, the Spirits have various capacities that challenges those of godly-powered individuals.{{citation}}\n* '''God-like Speed:''' They are extremely fast entities vastly accelerating that almost couldn't be seen through the human naked eye.{{citation}}\n* '''God-like Durability:''' Their durability greatly exceeds their Ghost Rider counter parts. The Spirits are invulnerable to almost any form of attack from earthly to cosmic.{{citation}}\n* '''God-like Reflexes:''' Their reflexes surpasses even the fastest being to the point where their actions are invisible.{{citation}}\n* '''Superhuman Capabilities:''' In their Ghost Rider form, their feats are decreased and are on par with other super-powered characters.{{citation}}\n** '''[[Superhuman Strength |Superhuman Strength]]:''' If in full control, the Spirit can lift objects and other materials to incalculable levels, and even when not in full control it bestows great strength upon its host.{{r|Official Handbook of the Marvel Universe Master Edition #3}}\n** '''[[Superhuman Durability |Superhuman Durability]]:''' The Spirits are impervious to any physical attacks making them difficult characters to kill. However, when come in contact or inflicted by a weapon of heavenly origin, this will greatly damage the Spirit.{{citation}}\n** '''Superhuman Stamina:''' Due to their mystical nature, the Spirits have unlimited superhuman stamina.{{citation}}\n** '''Superhuman Agility:''' The Spirit's grants it's user's with heightened movements, reflexes and coordination.{{r|Avengers #214}}\n\n* '''Immortality:''' The Spirits themselves are immortal beings. They can live for an eternity and cannot be killed unless a weapon forged from Heaven decapitates them. Since the Spirit is a weapon of Heaven itself, it is possible that it can kill its own kind.{{citation}}\n* '''Spirit Transferal:''' If a situation occurs where the host is killed by any physical means, the Spirit will detach itself from the current deceased host and will seek out a new body to inhabit.{{r|Ghost Rider Vol 6 32}}\n\n* '''Regenerative Healing Factor:''' Their supernatural origins grants them the ability to regenerate any damaged or loss limbs through the mystical energies they possess.{{citation}}\n\n* '''Empathic Reading:''' They possess the ability to read the heart and souls of individuals they encounter and determine whether or not they are innocent, guilty, and in need of punishment. This is most evidently done when becoming the Ghost Rider. The human host as well can without transformation can detect innocence and evil.{{citation}}\n* '''Identity Tracking:''' Mostly seen in Ghost Riders, they can detect the individual's identity by simply looking at their souls. Other figures without souls can be detected by sensing their presence.{{citation}}\n\n'''Sin Manipulation:''' The Spirit's main purpose is to cleanse sin. They can control and be empowered with the negativity released from the world.{{citation}}\n* '''Sin Perception:''' A sub-power to reading a character's heart and soul, they can also tell, sense and smell what kind of sin or crime the individual committed whether it be a small sin such as petty theft or great one like murdering a person or being cruel to a loved one.\n* '''Sin Eating:''' Also known as Sin Removal. They can remove a person's immoral acts to the point where the individual loses their humanity.{{citation}}\n* '''Negative Energy Augmentation:''' Not only can the Spirit's remove or absorb an individual's transgressions, they can also be strengthened by the negativity released. This could be both sins, from the smallest of actions such as slapping one's wife to committing unforgivable crimes, and negative emotions a person is currently experiencing like misery and depression.{{citation}}\n\n'''Soul Manipulation:''' They can manipulate the very life giving essence of each being. They can do a number of things:{{citation}}\n* '''Soul Reading:''' They can read a person's soul to determine whether they are innocent or guilty and tell what kind of sin they commit.{{citation}}\n* '''Soul Consumption:''' If desired, the Spirit's can remove the soul of the person until they are lifeless.{{citation}}\n** '''Soul Consumption Empowerment:''' Through consuming the souls of other living entities, the Spirit's can be strengthened to increase their powers and become more intimidating.{{citation}}\n* '''Soul Mutilation:''' Through different means of mutilation, they can destroy the soul from within the individual's body.{{citation}}\n\n'''Elemental Manipulation:''' All Spirits can control elements, whether earthly, supernatural or cosmic; and use it to their advantage.{{citation}}\n* '''Nature Manipulation:''' The Spirit of Vengeance can manipulate the forces of the world to their whim. They possess many abilities granting them dominion over the earth, sea and sky which they can impart upon the hosts of whom they possesses, i.e. making the earth crack open and swallow people or create impaling stalagmites, conjuring the weather to create and summon down lighting as is the case with Alejandra Jones. The Spirits can also, through their proxy, expel a host of ravenous locusts which burn and consume the flesh and spirit of those their set upon from his mouth.{{citation}}\n\n'''Magic Manipulation:''' Whether it is divine or malevolent, angelic or demonic; the Spirits can control, project and generate mystical energies that empowers them and can utilize it in a multitude of ways. One of the Spirit's known magical elements to control is hellfire, a demonic element that can do physical and spiritual damage.{{citation}}\n* '''Demon Magic Manipulation:''' A sub power to their manipulation to most mystical elements, artifacts and symbols, they can also control elements of demonic origin. Some spirits have even demonstrated to use satanic symbolism and pentagrams to their advantage.{{r|Thunderbolts Vol 2 20.NOW}}\n** '''Necromancy:''' They have the power to control the dead. They can resurrect the deceased and use them to as form of communication to the world of the living by simply returning their souls from their bodies.{{citation}}\n** '''Possession:''' As mentioned, they can use the deceased as a form of communication to warn their enemies.{{citation}}\n\n'''Immunity/Resistance:''' The Spirits are immune to almost many of conditions such as infections. They're highly resistant to such conventions that apparently, reality warpers seem to give them no complications.{{citation}}\n\n'''Demonic Transformation:''' As the Ghost Rider, the Spirit will reveal itself through the process of transformation. The reason it appears to be a flaming skeleton is because of its purpose to unleash unholy vengeance. It's nether worldly appearance strikes fear unto those who look at it. Most of the Spirit's powers are more evident through the Ghost Rider.\n* '''Hellfire Manipulation:''' Also known as Infernal Pyrokinesis. As the Ghost Rider, the most prominent ability of the Spirit is control, project, generate and manipulate the ethereal element known as hellfire. They can perform a number of capabilities:\n** '''Hellfire Infusion:''' They can imbue any object and materials with hellfire.{{r|Ghost Riders: Heaven's on Fire Vol 1 1}}\n** '''Hellfire Forgery:''' In addition to infuse hellfire to objects, they can alter its appearance into something more sinister. Also, they can even create their own piece of equipment made out of the fire.{{citation}}\n** '''Hellfire Constructs:''' They can structure walls and wings made out of hellfire.{{citation}}\n** '''Hellfire Telekinesis:''' They can control any object infused with hellfire and do multiple things through their mind.{{r|Ghost Rider Vol 6 7}}\n** '''Hellfire Attacks:''' They can project hellfire through their eyes, mouth, hands and chest. They can create balls, shoot a laser-like beam, spew out massive waves and perform omnidirectional explosions resulting to devastation.{{citation}}\n** '''Hellfire Weather:''' In some cases, The Rider can bring forth paranormal weather conditions whenever they travel. They can even rain down from the sky a destructive fire storm.{{r|Ghost Rider Vol 6 35}}\n** '''Biblical Representations:''' Other Riders have demonstrated to unleash creatures in the form of a plague found in biblical scriptures such as locusts.{{citation}}\n* '''Dimensional Travel:''' They can traverse through different dimensions. Through the use of their mystical powers, they can travel to other realms without any complications.{{citation}}\n** '''Vortex Creation:''' They can even construct portals that lead them to other places.{{citation}}\n* '''Cloning:''' A sub-power to constructing various objects, they have the ability to craft duplicates of themselves. They will act similarly to their creator. When killed, they will burst into a puff of hellfire.{{r|Ghost Rider Vol 6 32}}\n* '''Spirit Absorption:''' By simply touching another individual possessing the Spirit, they can absorb its essence leaving the host paralyzed or killed by the effect.{{r|Ghost Rider: Danny Ketch Vol 1 4|5}}{{r|Ghost Rider Vol 6 30}}\n* '''Self-Size Size:''' They can increase their normal sizes to gigantic proportions making them a difficult target.{{r|Uncanny Avengers Annual #1}}\n** '''Size Alteration:''' Not only can they alter their own size, they can even change the size of other materials as well.{{citation}}\n* '''Penance Ability:''' All forms of Spirits of Vengeance / Ghost Riders have an ability to strike penance on its victims. It can be in the form of a physical attack such as a fist or a piece of weaponry. One of the most known penance abilities is the [[Penance Stare]], a traumatizing ability where it locks it's victim's eyes to theirs and incapacitates them physically, mentally, and spiritually. It can be focused on certain sins, for example Wolverine was once given the Penance Stare focusing on his sins committed during a single day during World War I.{{r|Spider-Man and the Fantastic Four Vol 1 3}}   Various circumstances can allow one to resist the Penance Stare such as having multiple eyes,{{r|Ghost Rider Vol 3 20}} lack of regret,{{r|Empyre Vol 1 1}} or having suffered great emotional or physical pain.{{r|Nightstalkers Vol 1 7}} The [[Venom (Symbiote) (Earth-616)|Venom symbiote]] has twice proven immune to the Penance Stare, and attempting to use it backfired and incapacitated Johnny Blaze.{{r|Thunderbolts Vol 2 23}}\n\n| Equipment               = \n| Transportation          = As Ghost Riders, they can utilize any form of transportation, whether it be a vehicular machine or an animal, they can alter its appearance and mechanics transforming it to a Hell Vehicle.{{citation}}\n| Weapons                 = Anything they can imbue their hellfire with is a weapon. Their most known weapon to use is a mystical chain capable of growing in great lengths, control the movements with the Rider's mind and penetrate almost anything it breaks.{{citation}}\n\n'''Heavenly Weapons:''' Mostly, the weapons they use are weapons created from Heaven.{{citation}} It is possible that the weapons they wield can kill themselves.{{citation}}\n\n| Notes                   = * The exact nature of the Spirits of Vengeance has been subject to numerous retcons, something that has even been acknowledged in-universe.{{r|Avengers Vol 8 22}} In [[Ghost Rider Vol 2]] the Spirit of Vengeance bonded to [[Johnathon Blaze (Earth-616)|Johnny Blaze]] was retconned into being a powerful demonic entity called [[Zarathos (Earth-616)|Zarathos]], who had been enslaved by [[Mephisto (Earth-616)|Mephisto]].{{r|Ghost Rider Vol 2 77}} ''Ghost Rider'' Vol. 3 established that Zarathos was not an actual Spirit of Vengeance, and that the actual Spirits of Vengeance were demons who had been his enemies and were linked to the bloodlines of Johnny Blaze and [[Daniel Ketch (Earth-616)|Daniel Ketch]] through the [[Medallion of Power]].{{r|{{cl|Ghost Rider Vol 2 42}}-[[Ghost Rider Vol 2 43|43]]}} ''Ghost Rider'' Vol. 6 and [[Heaven's on Fire]] retconned the Spirits of Vengeance into being [[Angels (Monotheism)|angelic]] in origin - vestiges of [[Yahweh (Earth-616)|God]]'s power bonded to human hosts after the [[Great Cataclysm|Great Flood]].{{r|{{cl|Ghost Rider Vol 6 26}}-[[Ghost Rider Vol 6 33|33]]}} However, the origin story of [[Ghost Rider (1,000,000 BC) (Earth-616)|Prehistoric Ghost Rider]] contradicts this, and alongside [[Damnation]] depicts the Spirits of Vengeance as demonic entities nominally under the command of [[Mephisto (Earth-616)|Mephisto]] or whoever sits upon the throne of [[Mephisto's Realm|his underworld]].{{r|Avengers Vol 8 7}}{{r|Doctor Strange: Damnation Vol 1 2}}\n| Trivia                  = * Despite not actually being Spirits of Vengeance, [[Zarathos (Earth-616)|Zarathos]] (who empowered Johnny Blaze and Alejandra Jones), [[Noble Kale (Earth-616)|Noble Kale]] (who empowered Daniel Ketch), and [[Elias Morrow (Earth-616)|Eli Morrow]] (who empowered Robbie Reyes) are often referred to as such,{{r|Venom Vol 2 13.2}}{{r|Venom Vol 2 13.4}} and bestow their hosts with nigh-identical powers.{{r|All-New Ghost Rider #1}}{{r|Marvel Legacy #1}} In {{cl|Avengers Vol 8 22}}, Eli Morrow is revealed to not actually be the source of Robbie's powers, which come from an actual Spirit of Vengeance that possessed him at the same time Eli did. \n* The race known as the [[Skull Men]] have a similar appearance to the spirit of vengeance, but there is seemingly no known connection.{{r|Invaders Vol 2 #3}}\n| Links                   = \n}}\n[[Category:Mystical Organizations]]\n[[Category:Spirits of Vengeance]]\n[[Category:Demonic Form]]\n[[Category:Demonic Organizations]]"
                }
            }
        }
    ],
    "page_id": "661971"
}