{
    "pageid": 12073,
    "ns": 0,
    "title": "Squadron Sinister (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = New Thunderbolts Vol 1 16 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Squadron Sinister]]\n| Aliases                 = [[Supreme Power]]{{r|Thunderbolts Vol 1 102}}\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Manhattan penthouse apartment of [[Alice Nugent (Earth-616)|Alice Nugent]]; formerly [[Nugent Technologies]], Old Tappan, [[New Jersey (State)|New Jersey]]; [[Crayton Observatory]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Alice Nugent (Earth-616)|Doctor Spectrum (Alice Nugent)]], [[Kinji Obatu (Earth-616)|Doctor Spectrum (Kinji Obatu)]], [[William Roberts (Earth-616)|Doctor Spectrum (Billy Roberts)]], [[Hyperion (Grandmaster's Creation) (Earth-616)|Hyperion]], [[Zhib-Ran (Earth-616)|Hyperion (Zhib-Ran)]], [[Kyle Richmond (Earth-616)|Nighthawk (Kyle Richmond)]], [[James Sanders (Earth-616)|Speed Demon (Jim Sanders)]]\n| Allies                  = [[En Dwi Gast (Earth-616)|Grandmaster]]\n| Enemies                 = [[Avengers (Earth-616)|Avengers]], [[Defenders (Earth-616)|Defenders]], [[Thunderbolts (Earth-616)|Thunderbolts]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Roy Thomas; Sal Buscema\n| First                   = Avengers Vol 1 69\n| Last                    = Thunderbolts Vol 1 106\n\n| HistoryText             = The Squadron Sinister was a team of super-villains created by the [[En Dwi Gast (Earth-616)|Grandmaster]], after he had encountered the [[Squadron Supreme (Earth-712)|Squadron Supreme]] during one of his time-travels.{{r|Squadron Supreme Vol 1 8}} He returned to his own universe and transformed four men ([[Kinji Obatu (Earth-616)|Kinji Obatu / Doctor Spectrum]], [[Kyle Richmond (Earth-616)|Kyle Richmond / Nighthawk]] and [[James Sanders (Earth-616)|Jim Sanders / Whizzer]]{{r|Avengers Vol 1 69}}) into counterparts of the Squadron members. He also created a counterpart to the Squadron's [[Hyperion (Grandmaster's Creation) (Earth-616)|Hyperion]] out of non-living extra dimensional matter and invested it with consciousness and artificial memories. These five men became the criminal team known as the Squadron Sinister.{{r|Avengers Vol 1 69}}\n\n[[File:Avengers Vol 1 70.jpg|thumb|left|The Squadron Sinister as they appeared in ''Avengers'' #70]]\n\nThey were first used in one of the Grandmaster's games against [[Nathaniel Richards (Kang) (Earth-6311)|Kang the Conqueror]], where they were pitted against the [[Avengers (Earth-616)|Avengers]], but were unable to defeat them.{{r|Avengers Vol 1 70}} After the game, the Grandmaster abandoned the defeated Squadron, including Hyperion, who was left floating through outer space in a small glass globe as a result of his battle with [[Thor Odinson (Earth-616)|Thor]].{{r|Avengers Vol 1 70}} The rest of the members went their own separate ways with [[Kyle Richmond (Earth-616)|Nighthawk]] retiring from a life of crime and [[Kinji Obatu (Earth-616)|Doctor Spectrum]] later being defeated by [[Anthony Stark (Earth-616)|Iron Man]] and had his [[Doctor Spectrum's Power Prism|Power Prism]] destroyed.{{r|Iron Man Vol 1 66}}\n\nThe Squadron Sinister was later reformed by [[Nebulon (Earth-616)|Nebulon the Celestial Man]]. Nebulon was searching the galaxy for other planets that possessed resources that would help keep his own planet alive. During this expedition, Nebulon came across Hyperion who was still floating helplessly through space in a glass globe. Hyperion wanted revenge on humanity and so offered to sell the Earth to Nebulon. Nebulon agreed on the condition that the Earth be fully submerged under water.{{r|Defenders Vol 1 14}} Hyperion wanted the assistance of his former colleagues in the Squadron Sinister, so Nebulon restored [[Doctor Spectrum's Power Prism]] and located the [[James Sanders (Earth-616)|Whizzer]] and Nighthawk. Nighthawk was horrified at the plan that the Squadron presented to him, which involved melting the polar ice caps with a giant laser cannon before selling the world to Nebulon, and left the group. He tried to alert his old foes, the Avengers, but was unable to due to a spell placed upon him by Nebulon. Richmond, however, overheard the Avengers discussing the [[Defenders (Earth-616)|Defenders]] and went to warn that group instead.{{r|Defenders Vol 1 13}}\n\nThe Defenders, with Nighthawk's help, defeated both the Squadron Sinister and Nebulon. Nebulon expended so much energy during the battle that he was forced to abandon the disguise he was using and revert back to his true form which disgusted the members of the Squadron. Nighthawk turned the laser cannon that was being used to melt the icecaps on Nebulon, forcing so much energy upon him that he imploded, seemingly taking the other three members of the Squadron with him. The laser canon then exploded as a result of the tremendous energy expenditure and Nighthawk nearly died. His life was saved by the quick actions of [[Stephen Strange (Earth-616)|Doctor Strange]] who used a spell to give a fraction of each of the Defenders life essences to Nighthawk, thereby restoring him to health. Nighthawk was then offered admittance into the ranks of the Defenders.{{r|Defenders Vol 1 14}} \n\nMonths later, the other members of the Squadron Sinister resurfaced. It was revealed that, rather than being destroyed, Nebulon and the Squadron were transported into the an extra-dimensional world called Zaar. Here they met a race of philosophers known as the [[Ludberdites]]. Nebulon eventually returned the Squadron to Earth with a weapon that would allow them to get revenge on the Defenders, while he decided to stay behind to learn the secrets of the Ludberdites philosophy. Before the Squadron could even manage to mount an attack on their old foes, however, the Defenders stormed into their secret hideout, somehow learning of their return to Earth. The Defenders mistakenly believed the Squadron to be the ones behind the planting of a car-bomb in their old teammate's (Nighthawk's) car. The Squadron initially defeated and captured the Defenders but, with the aid of [[Henry Pym (Earth-616)|Yellowjacket]], they soon escaped and subdued the Squadron again.{{r|Giant-Size Defenders Vol 1 #4}}\n\nThe Grandmaster had them briefly reformed to go up against the [[Thunderbolts (Earth-616)|Thunderbolts]] and [[Helmut Zemo (Earth-616)|Baron Zemo]], gathering the members and convincing them to join one by one. Once they were fully formed they went up against Zemo and his team and were defeated{{r|New Thunderbolts Vol 1 15|16}}{{r|Thunderbolts Vol 1 102|106}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * The original Squadron Sinister was created as a pastiche of DC Comics' Justice League characters [[w:c:dc:Superman|Superman]] (Hyperion), [[w:c:dc:Batman|Batman]] (Nighthawk), [[w:c:dc:Green Lantern|Green Lantern]] (Doctor Spectrum), and [[w:c:dc:Flash|The Flash]] (Whizzer).\n* DC Comics created a pastiche of the Avengers called [[w:c:dc:Assemblers|The Assemblers]], first appearing in [[w:c:dc:Justice League of America Vol 1 87|''Justice League of America'' #87]], February, 1971. The team consisted of Blue Jay (the Wasp / Ant-Man), Wandjina (Thor), Silver Sorceress (Scarlet Witch), and Jack B Quick (Quicksilver).\n| Links                   = * http://en.wikipedia.org/wiki/Squadron_Sinister\n}}\n[[Category:DC Comics Pastiches]]"
                }
            }
        }
    ],
    "page_id": "12073"
}