{
    "pageid": 468598,
    "ns": 0,
    "title": "Squad of Mystery (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Squad of Mystery (Earth-616) from Captain America Comics Vol 1 11 0001.jpg\n| Name                    = Squad of Mystery\n| Aliases                 = Company B\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Camp Lehigh]], [[Arlington County|Arlington]], [[Virginia (State)|Virginia]]; Mariposa Cafe, [[Washington, D.C.]]\n\n| Leaders                 = Herr Grotz\n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Syd Shores\n| First                   = Captain America Comics #11\n| Last                    = Captain America Comics #11\n\n| HistoryText             = The so called \"Squad of Mystery\" were a group of [[National Socialist German Workers Party (Earth-616)|Nazis]] Fifth Columnists who were active in the United States during [[World War II]]. They were stationed in [[Washington, D.C.]] using the Mariposa Cafe as a front; they were led by a Nazi operative named Herr Grotz. Grotz would hang out at the Traveler's Bureau and entice an entire squad (Company B) on furlough to go to the cafe. They were then drugged so a number of Nazi operatives took their place and return to Camp Lehigh. Their plan was to go on murder sprees in order to lower American morale and shake the faith of the people in their Armed Forces. \n\nTheir undoing, however, would begin with a routine test of the squad's various skills. When the squad they were posing as did a lot better than the previous round of tests, it aroused the suspicions of [[Steven Rogers (Earth-616)|Private Steve Rogers]] (secretly Captain America). When awarded for their top marks, the squad leader nearly blew their cover when he almost gave a \"Sieg Heil\" in salute. Not only Steve saw this but a lieutenant on duty as well. That night, as the Nazi subversives were celebrating their ability to fool the American soldiers, they were be confronted by the lieutenant. Hiding in the shadows outside their tent, Herr Grotz shot the lieutenant dead. Arriving on the scene of the murder were Captain America and his partner [[James Buchanan Barnes (Earth-616)|Bucky]], but Grotz escaped.\n\nStill suspicious but needing proof, Captain America convinced the base's commander to reassign his civilian identity to the squad. From the start, the Nazi spies attempted to eliminate Steve Rogers in order to protect their cover. Attempting to crush Steve under a tree led to another clash with Captain America and Bucky, confirming Cap's suspicions.\n\nSeeking actual proof, Cap and Bucky then traced back the soldiers' footprints to the Mariposa Cafe. Confronting the manager, they recognized him as the shooter from the night before, despite the fact he was wearing a wig. Before they could subdue Herr Grotz, the Nazi trapped Cap and Bucky in his dungeon. There, they found the replaced soldiers and learned all about the Nazi's plots. When Grotz's men came down to kill Cap and Bucky, the two heroes easily defeated their would-be killers and freed the captured soldiers. With the soldiers, they returned to Camp Lehigh and subdued the impostors, turning them over to the military authorities.{{r|Captain America Comics #11}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = When posing as U.S. soldiers, the Squad of Mystery were armed with weapons that were standard issue to soldiers during the year 1941. Herr Grotz was armed with a German model rifle.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "468598"
}