{
    "pageid": 343902,
    "ns": 0,
    "title": "Strategic Hazard Intervention Espionage Logistics Directorate (Heroes Reborn) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Title                   = [[S.H.I.E.L.D.]]\n| Image                   = No Image Available At All.png\n| Name                    = Strategic Hazard Intervention Espionage Logistics Directorate\n| Aliases                 = S.H.I.E.L.D.\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = S.H.I.E.L.D. Helicarrier on [[Counter-Earth (Heroes Reborn)|Counter-Earth]]\n\n| Leaders                 = [[Nicholas Fury (Heroes Reborn) (Earth-616)|Nick Fury]]\n| CurrentMembers          = [[Strategic Hazard Intervention Espionage Logistics Directorate (Heroes Reborn) (Earth-616)#Andy (Heroes Reborn) (Earth-616)|Andy]],[[Timothy Dugan (Heroes Reborn) (Earth-616)|Dum Dum Dugan]], [[Sharon Carter (Heroes Reborn) (Earth-616)|Sharon Carter]], [[Valentina Allegra de Fontaine (Heroes Reborn) (Earth-616)|Valentina Allegra de Fontaine]], [[General Darlengung (Heroes Reborn) (Earth-616)|General Darlengung]], [[Joseph Litvak (Heroes Reborn) (Earth-616)|Joseph Litvak]], [[Sellars (Heroes Reborn) (Earth-616)|Sellars]], [[Benjamin Shalboub (Heroes Reborn) (Earth-616)|Benjamin Shalboub]]\n| FormerMembers           = [[Wyatt Wingfoot (Heroes Reborn) (Earth-616)|Wyatt Wingfoot]], [[Kl'rt (Heroes Reborn) (Earth-616)|Kl'rt]] (Super-Skrull, posed as Wyatt Wingfoot), Agent Hunt (Deceased), [[Nicholas Fury (LMD, Heroes Reborn) (Earth-616)|Nick Fury LMD]] (Posed as the real Nick Fury), [[Clay Quartermain (Heroes Reborn) (Earth-616)|Clay Quartermain]] (deceased)\n| Allies                  = [[Avengers (Heroes Reborn) (Earth-616)|Avengers]], [[Fantastic Four (Earth-616)|Fantastic Four]], [[Hulkbusters (Heroes Reborn) (Earth-616)|Hulkbusters]], [[Rebecca Barnes (Heroes Reborn) (Earth-616)|Bucky]], [[Samuel Wilson (Earth-616)|Falcon]]\n| Enemies                 = [[World Party]], [[Sons of the Serpent (Heroes Reborn) (Earth-616)|Sons of the Serpent]], [[Victor von Doom (Earth-616)|Dr. Doom]], [[Galactus (Heroes Reborn) (Earth-616)|Galactus]]\n\n| Origin                  = Organization was brought to life when [[Franklin Richards (Earth-616)|Franklin Richards]] created [[Counter-Earth (Heroes Reborn)|Counter-Earth]]\n| PlaceOfFormation        = United States\n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Heroes Reborn Vol 1 ½\n\n| History                 = \n\n===Fabricated Reality===\nWhen the [[Fantastic Four (Earth-616)|Fantastic Four]] and the [[Avengers (Earth-616)|Avengers]] sacrificed their lives to destroy [[Onslaught (Psychic Entity) (Earth-616)|Onslaught]], [[Franklin Richards (Earth-616)|Franklin Richards]], the son of the Fantastic Four's [[Reed Richards (Earth-616)|Mr. Fantastic]] and [[Susan Storm (Earth-616)|Invisible Woman]] subconsciously created a pocket universe to save their lives from death. There they spent an entire year reliving living new lives \"reborn\" into a reality where they had recently gained their abilities that vaguely mirror how they gained their powers originally.\n\nThis new reality was entirely populated with recreations of these heroes old allies and foes, including an entire population of individuals unique to this reality all with their own uniquely manufactured histories. Among the many organizations created on what would be called Counter-Earth would be a version of S.H.I.E.L.D. \n\n===Mysterious Origins===\nThe true origins of SHIELD remain unconfirmed, the origin story that was presented by a [[Life-Model Decoy|LMD]] of [[Nicholas Fury (LMD, Heroes Reborn) (Earth-616)|Nick Fury]] has been put into doubt by the real [[Nicholas Fury (Heroes Reborn) (Earth-616)|Fury]] as not necessarily being true.{{r|Captain America Vol 2 12}} However some elements are likely true as they have been substantiated by [[Valentina Allegra de Fontaine (Heroes Reborn) (Earth-616)|Valentina Allegra de Fontaine]].{{r|Captain America Vol 2 7}} The only origin presented was as such:\n\nIn 1945, just after President Truman ordered the atomic bomb to be dropped on Hiroshima, the President asked [[Steve Rogers (Earth-616)|Captain America]] to stand by his side and support his decision to drop the bomb. Captain America found the act of dropping the bomb morally wrong and refused to do so. Not wishing to let the symbol of America speak badly of the current administration. [[Thaddeus Ross (Heroes Reborn) (Earth-616)|General Ross]] would appoint Nick Fury to head a group called SHIELD to deal with the issue of Captain America. According to one account the name SHIELD originates from an association with Captain America's own symbolic weapon.{{r|Captain America Vol 2 4}}\n\nThe organization became a secret black ops organization working in secret to keep track of America's best interests and keep Captain America in tow. Accounts on how Captain America was kept vital differ, both accounts were made by the Fury LMD. Initially he stated to Steve Rogers that after the war SHIELD obtained the [[Johann Shmidt (Heroes Reborn) (Earth-616)|Red Skull]]'s notes on \"Operation: Sleeper\", a method of reprogramming an individual, and it was the Super-Soldier serum in Roger's body that kept him vital.{{r|Captain America Vol 2 4}} However, when speaking to President Clinton, Fury would state that they kept Captain America under wraps by means of suspended animation.{{r|Captain America Vol 2 7}} It is likely that both methods were used to keep Captain America young and vital.\n\nOver the years they would reactivate Captain America during various US conflicts. In the Korean War they reactivated him as \"Captain John Battle\", in Vietnam he was \"Captain Jack Strike\". However with each conflict, the violence and destruction would force Rogers to rebel prompting SHIELD to shut him down again. They would reprogram his mind to make him thing he was someone else and get him normal jobs between missions.{{r|Captain America Vol 2 7}}\n\nBy modern times, SHIELD had amassed it's own advanced technology, a flying helicarrier as a base of operations and various high tech vehicles and gadgets. Over the years Nick Fury would remain leader of SHIELD, kept youthful through unrevealed means. \n\nIn recent times, a secret covert organization working within the US government with an agenda targeted against minorities would replace Nick Fury with a Life-Model Decoy.{{r|Captain America Vol 2 11}} On top of acting in Nick Fury's place, this LMD of Fury would also organized and act as the leader of the racist terrorist organization the [[Sons of the Serpent (Heroes Reborn) (Earth-616)|Sons of the Serpent]] providing them with SHIELD technology to reverse engineer for their own purposes for a plotted attack against America.\n\n===Captain America & The World Party===\n\nOne of SHIELD major preoccupations in modern times was dealing with the World Party, a grass-roots political organization that had a thinly veiled racist platform. This organization was a front created by surviving Nazi super-soldiers [[Master Man (Heroes Reborn) (Earth-616)|Master Man]] and [[Johann Shmidt (Heroes Reborn) (Earth-616)|the Red Skull]]. Both sought to use the organization to rally white supremacists to be their army while arming themselves with nuclear weapons to ethnically cleanse the United States. They also became interested in claiming Captain America's shield, which had gone missing over the years and came into the possession of [[Abraham Wilson (Heroes Reborn) (Earth-616)|Abraham Wilson]]. \n\nSHIELD would plant an agent Hunt within the World Party to learn the truth, however he would be captured and tortured. His ultimate fate is unrevealed but he was presumably killed by the Red Skull. Abraham would meanwhile succeed in partially reactivating Captain America's mind, giving him the shield. Abraham would die in Cap's battle against minions of the World Party.{{r|Captain America Vol 2 1}} \n\nCap, who was programmed to believe he was a construction worker with a loving wife and child would rush home to find the Fury LMD waiting for him. The impostor would fill in the blanks about Cap's origins and show him the truth by revealing his \"wife\" Peg, and his child \"Steve Jr.\" are nothing more than LMD's and asks him to come back into service as Captain America. During this time, they would also inform Abraham's son [[Samuel Wilson (Earth-616)|Samuel \"Falcon\" Wilson]] to report to SHIELD headquarters.{{r|Captain America Vol 2 2}} Cap would be told the LMD's version of his past history before being brought up to the SHIELD helicarrier and meets [[Sharon Carter (Heroes Reborn) (Earth-616)|Sharon Carter]] and [[Timothy Dugan (Heroes Reborn) (Earth-616)|Dum Dum Dugan]] and given his Captain America uniform. Fury also suggests that Cap meet a group of costumed heroes SHIELD is organizing called the [[Avengers (Heroes Reborn) (Earth-616)|Avengers]]. However, before Cap meet the group, while paying his respects to Abraham Wilson at [[Arlington National Cemetery]], he and Sam Wilson get into an altercation before they are ambushed and taken prisoner by the World Party's mercenary [[Brock Rumlow (Heroes Reborn) (Earth-616)|Crossbones]].{{r|Captain America Vol 2 4}} \n\nWhen SHIELD finally storms the World Party's headquarters they find that their plot to launch nukes all over the US was already thwarted by Cap, Wilson (now empowered thanks to drinking some of Cap's blood) and [[Rebecca Barnes (Heroes Reborn) (Earth-616)|Rikki Barnes]] (Now Bucky). Master Man is taken into SHIELD custody, but the Red Skull would escape.{{r|Captain America Vol 2 5}} SHIELD would next be attacked by [[Advanced Idea Mechanics (Heroes Reborn) (Earth-616)|AIM]] led by [[George Tarleton (Heroes Reborn) (Earth-616)|MODOK]] and [[Heinrich Zemo (Heroes Reborn) (Earth-616)|Baron Zemo]], however SHIELD would turn back the attacks with the aid of Captain America, Bucky and the dimensionally displaced [[Nathan Summers (Earth-616)|Cable]].{{r|Captain America Vol 2 6}}\n\n===The Avengers and Fantastic Four===\nSHIELD would have a vested interest in [[Reed Richards (Earth-616)|Reed Richards's]] Excelsior warp-drive project and would assign a SHIELD team led by [[Wyatt Wingfoot (Heroes Reborn) (Earth-616)|Wyatt Wingfoot]]. This group would be captured and replaced by [[Skrulls]] led by [[Kl'rt (Heroes Reborn) (Earth-616)|Kl'rt]] who were in league with [[Victor von Doom (Earth-616)|Dr. Doom]] to investigate and capture a vastly powerful cosmic energy source. While Doom sought it's power to rule the Earth, the Skrulls knew it was a Herald of [[Galactus (Heroes Reborn) (Earth-616)|Galactus]] and sought it's power also to get revenge against Galactus for destroying their home world. Ultimately the encounter led to the creation of the [[Fantastic Four (Earth-616)|Fantastic Four]].{{r|Fantastic Four Vol 2 1}}\n\nSHIELD would also commission their own group of super-heroes dubbed the [[Avengers (Heroes Reborn) (Earth-616)|Avengers]] a team that would comprise of Captain America, [[Clinton Barton (Earth-616)|Hawkeye]], [[Wanda Maximoff (Earth-616)|Scarlet Witch]], [[Vision (Earth-616)|The Vision]], [[Janet Van Dyne (Earth-616)|Wasp]], [[Patricia Walker (Heroes Reborn) (Earth-616)|Hellcat]], and the [[Swordsman (Heroes Reborn) (Earth-616)|Swordsman]]. The group would be set up with a headquarters off the coast of New York called Hydro-Base, powered by Stark Industries technology, notably a gamma reactor power source. The groups first mission would lead them into a clash with [[Asgardian|Asgardian]] trickster [[Loki Laufeyson (Heroes Reborn) (Earth-616)|Loki]] and gaining the aid of the thunder god [[Thor Odinson (Heroes Reborn) (Earth-616)|Thor]]{{r|Avengers Vol 2 1}}\n\nFollowing the newly formed Fantastic Four's battle with the [[Harvey Elder (Heroes Reborn) (Earth-616)|Mole Man]], SHIELD had them captured and brought to the Fury LMD. The impostor Fury would ask them to help the Avengers in their battle against [[Namor McKenzie (Earth-616)|the Submariner]] and his invasion force from [[Atlantis]]. With SHIELD assistance the two groups would stop Namor and expose [[Krang (Heroes Reborn) (Earth-616)|Warlord Krang's]] plot to trick Namor into waging war on the surface world and usurp the throne.{{r|Fantastic Four Vol 2 #2|3}} The faux Fury would next lead SHIELD in aiding the Avengers battle [[Nathaniel Richards (Heroes Reborn) (Earth-616)|Kang the Conqueror]] and his lover [[Mantis (Heroes Reborn) (Earth-616)|Mantis]], the resulting battle would lead to the Vision becoming severely damaged.{{r|Avengers Vol 2 #2|3}}\n\nMeanwhile, SHIELD agent Wyatt Wingfoot would escape from Doom's prisons and flee to America seeking out the Fantastic Four. He would find only [[Jonathan Storm (Earth-616)|Johnny Storm]] and [[Benjamin Grimm (Earth-616)|Ben Grimm]] learning that [[Reed Richards (Earth-616)|Reed Richards]] and [[Susan Storm (Earth-616)|Sue Storm]] were in [[Wakanda]] with [[T'Challa (Earth-616)|the Black Panther]] searching for a strange energy anomaly linked to their powers.{{r|Fantastic Four Vol 2 4}} Learning that they were captured by Dr. Doom and transported to [[Latveria]] they would go there and expose Doom and Kl'rt's attempt to exploit the [[Norrin Radd (Heroes Reborn) (Earth-616)|Silver Surfer's]] [[Power Cosmic]] and foil the plot.{{r|Fantastic Four Vol 2 #5|6}}\n\n===Industrial Revolution===\n\nWhen [[Bruce Banner (Earth-616)|Bruce Banner]] is exposed to a dose of Gamma radiation becoming the Hulk, he would clash with the newly active [[Anthony Stark (Earth-616)|Iron Man]] however the clash would end with the Hulk escaping.{{r|Iron Man Vol 2 #1|2}} Since that escape SHIELD would attempt to track down the monstrous creature, sending the Avengers after the brute as well.{{r|Avengers Vol 2 4}} As the Hulk is seeking out Bruce Banner (unaware that they are one in the same) Loki would goad the brute into attacking the Hydro base. Despite the Avengers and SHIELD's best efforts to stop the beast, the Hulk would cause massive damage to the island and cause a breach in the Gamma core.{{r|Avengers Vol 2 5}} \n\nThe Hulk would revert back to Bruce Banner and seek out the Fantastic Four's help, while SHIELD would recover the Avengers. The Fury LMD would be visited by Loki who would come to mockingly watch over the coming battle to see if his brother Thor would survive. Learning that his own technology is involved in the impending disaster Iron Man would also force his hand to get involved using his override protocols to hardball SHIELD into letting him intervene. Attempting to get Bruce Banner to fix the damage to the Gamma core would come too late as Banner would once more turn into the Hulk.{{r|Avengers Vol 2 6}} The combined efforts of the Avengers, Iron Man, Hulk and the Fantastic Four would repair the damage done to the Gama core but Avengers Island would be decimated in the process.{{r|Iron Man Vol 2 6}} In the aftermath of the battle Iron Man would join the Avengers and they would break away from SHIELD to act as an independent group.{{r|Captain America Vol 2 6}} \n\n===Dealing with the Avengers===\nAlthough they had broken away from SHIELD, the Avengers would still have to deal with the organization. As the group were collecting all their Stark owned property, SHIELD would refuse to hand over the damaged Vision to the group as he is SHIELD property.{{r|Avengers Vol 2 7}} Following the Avengers clash with the [[Masters of Evil (Heroes Reborn) (Earth-616)|Masters of Evil]] (which included a defected Scarlet Witch), SHIELD would come to apprehend it's members and the Fury LMD would be pressured into letting Captain America interview Baron Zemo and MODOK, however upon their arrival to the SHIELD helicarrier they would find the villains missing, as unknown to them Loki had absorbed their unique energies into himself.{{r|Avengers Vol 2 8}} Shortly thereafter before the fake Fury, the Contessa and President Clinton, Captain America would resign from government service.{{r|Captain America Vol 2 7}}\n\nWhen [[Janet Van Dyne (Earth-616)|Janet van Dyne]] would ask Iron Man to help find her husband [[Henry Pym (Earth-616)|Ant Man]] they would break into the SHIELD helicarrier to recover him from inside the Vision where he had been for many days trying to repair the android. The fake Fury and SHIELD soldiers would confront them, although Pym would convince them that the Vision is dead and that his body is about to explode, Iron Man would then fly the inert body out of the helicarrier throwing it a safe distance where it would detonate harmlessly.{{r|Avengers Vol 2 9}} \n\nWhile SHIELD would find Kang's ship and learn that he and Mantis were absorbed into Loki, the Avengers Hawkeye, Hellcat, and Thor would defect over to Loki's team. The group would also find that the Gamma core somehow is a ripple in reality that is creating new super-powered beings out of seemingly nothing. To their surprise the core would bring them another [[Thor Odinson (Earth-616)|Thor]] who would recall their lived prior to the Onslaught disaster. This Thor would join the Avengers in clashing with Loki's agents while Loki would absorb a massive amount of power from the Gamma core itself gaining massive power.{{r|Avengers Vol 2 10}} It would take the combined effort of the Avengers and SHIELD to stop Loki, building a device that would reverse the flow of power, and Loki would seemingly perish as would the first Thor.{{r|Avengers Vol 2 11}} Following this battle, SHIELD would assist in given the fallen Thor a proper Viking burial.{{r|Avengers Vol 2 12}}\n\n===The Sons of the Serpent Conspiracy===\nAfter his involvement with SHIELD, Captain America would decide to travel to the country to find out what America is all about. Ending up in Mexia Texas, he would learn about the group known as the Sons of the Serpent, a racist organization that has a compound outside of town. Breaking up an attempt at the group terrorizing the town he would accompany local authorities to their compound and be nearly helpless to watch them blast out of the location with their advanced technology, leaving Cap to wonder where their weapons came from.{{r|Captain America Vol 2 8}}\n\nTracking the terrorist group to Hollywood, California, Cap would smash up their operations and learn that they got their technology from the US government. After preventing a cell of the Sons that were attempting to blow up a number of Jewish writers on the Hollywood Hills signs, Cap would watch a televised call to arms from the Serpent's leader and decide to go to the source of the Son of the Serpent: Washington DC.{{r|Captain America Vol 2 9}}\n\nGoing to Washington DC, Cap would organize to meet with SHIELD, there he would be reunited with his sidekick Bucky who believes something strange is going on, Cap would tell her to keep an eye open and she would snoop around in his absence finding one room in the SHIELD helicarrier that is cordoned off with armed guards. Cap would meet with the fake Fury and agree to go along with a heavily armed SHIELD unit and Sam Wilson (now a costumed operative called the Falcon) and try to find the Serpents laid. They would stumble into a Serpents trap, and the Falcon would get captured, when Cap realizes that all the SHIELD agents in the squad are all non-Christians he suspects Fury when they are ambushed. Cap allows the fight to end with the group thinking that he had died in battle. Sneaking into the trunk of Fury's car, Cap snoops around his mansion to find that Fury is seemingly the leader of the Son of the Serpent and they have the Falcon as their prisoner.{{r|Captain America Vol 2 10}}\n\nCap would clash with the Sons of the Serpent and then agree to go into a one on one battle with the fake Fury until the real Nick Fury, freed by Bucky would lead a SHIELD counter strike force, take down the Serpents and destroy the Fury LMD. After word, Nick Fury would explain to Captain America the truth behind the conspiracy before Cap would be called to New York to battle Galactus.{{r|Captain America Vol 2 11}}\n\n===Heroes Reunited===\nWhen Galactus invaded Earth with his Heralds the Silver Surfer, [[Tyros (Heroes Reborn) (Earth-616)|Terrax]], [[Pyreus Kril (Heroes Reborn) (Earth-616)|Firelord]], [[Gabriel Lan (Heroes Reborn) (Earth-616)|Air-Walker]] and [[Plasma (Heroes Reborn) (Earth-616)|Plasma]], SHIELD would get involved in the conflict.\n\nCollecting the Fantastic Four after their failed battle with the heralds, SHIELD would collect the worlds heroes to clash with Galactus's various heralds across the globe while Reed Richards would stay aboard and attempt to construct a device that siphon the powers. All the heroes would succeed in destroying all of Galactus' terraformers but they would all perish in the battle. With only one left in New York, Fury would direct his helicarrier at Galactus forcing everyone to abandon ship. However, Fury's efforts would be in vein and the helicarrier would be destroyed and Fury killed without any effect on Galactus. Galactus would soon consume the Earth thanks in part to a fourth unknown terraformer placed on the South Pole by Air-Walker, however Dr. Doom would travel back in time to try to prevent this catastrophe from happening{{r|Fantastic Four Vol 2 12}}\n\nDoom would fail two more times, each time he would travel back would cause events to play out differently, likely due to the nature of Franklin's Counter-Earth.\n\nIn Doom's second attempt, SHIELD apparently sent a manned space shuttle (as opposed to satellites in the previous future) piloted by [[Clay Quartermain (Heroes Reborn) (Earth-616)|Clay Quartermain]] his shuttle would be attacked by Galactus' Heralds and sent crashing into the SHIELD helicarrier. Doom would appear before them and attempt to warn them of Galactus' coming, however the Avengers and SHIELD would be unwilling to let Doom help them, prompting the dictator to retreat. \n\nThis time around most heroes would be dispatched separately (like the Fantastic Four), Ant-Man would revive the Vision, and the Hulk would be involved in the battle as well. Dr. Doom would attempt to stop Galactus with nuclear weapons but this would also end in failure. Galactus would have his heralds place the terraformers in different locations. Fighting Plasma in Los Angeles, SHIELD would be decimated and Nick Fury, mortally wounded, would fly the helicarrier into the terraformer destroying it. Ultimately this attempt would end in failure prompting Dr. Doom to travel back a third time.{{r|Avengers Vol 2 12}}\n\nIn his third attempt, Dr. Doom would convince Nick Fury and SHIELD to work with him, collecting Iron Man from the hospital and include the newly formed [[Hulkbusters (Heroes Reborn) (Earth-616)|Hulkbusters]] in the counter attack. The Fantastic Four would confront Galactus' heralds first and all die. Doom would work with Iron Man, Bruce Banner, and Ant-Man to create an \"ultimate nullifier\" weapon to destroy Galactus. While the Avengers and Hulkbusters are decimated by the heralds, this plot also would fail prompting Doom to travel back in time once more.{{r|Iron Man Vol 2 12}}\n\nThe final attempt did not involve SHIELD at all, however working with Mr. Fantastic, Bruce Banner, Iron Man, Ant-Man and a defecting Silver Surfer, Doom would succeed in creating a device that would destroy Galactus. After the battles end, Nick Fury would meet with Captain America at the grave of Abraham Wilson, and reintroduce him to [[Richard Barnes (Heroes Reborn) (Earth-616)|Richard]] and [[Margaret Carter (Heroes Reborn) (Earth-616)|Peggy Barnes]] and then tell Cap that a lot of what was told to him by the Fury LMD was to get him to go back into action as Captain America and not necessarily the truth.{{r|Captain America Vol 2 12}}\n\n===World Without Heroes===\nShortly after the Galactus war, the Avengers and Fantastic Four and most of Counter-Earth's other heroes were forced to return to their native Earth to space both Earth's from destruction. This situation was taken advantage of by [[Tiamut (Earth-616)|The Dreaming Celestial]] who would throw Counter-Earth into a strife by disrupting it's geography and manipulating it's political powers. \n\nThe full effect on SHIELD remains unrevealed however Nick Fury has not been present within the organization, nor any of the other long standing SHIELD agents, their disappearances remain unrevealed.\n\nSHIELD [[General Darlengung (Heroes Reborn) (Earth-616)|General Darlengung]] would gather a group of misfit heroes called the [[Remnants (Heroes Reborn) (Earth-616)|Remnants]] stop the rogue Avenger Swordsman who would become this world's Deadpool and launch a nuclear bomb that would cause a fracture in reality.{{r|Heroes Reborn: Remnants #1}} SHIELD would also find a crashed [[Kymalian]] space ship and experiment it turning [[Elric Freedom (Heroes Reborn) (Earth-616)|Elric Freedom]] into the human/Kymalian hybrid known as Kid Colt. Kid Colt would escape from SHIELD custody and join the [[Young Allies (Heroes Reborn) (Earth-616)|Young Allies]].{{r|Heroes Reborn: Young Allies #1}}\n\nWhen Dr. Doom was forcing his bid to conquer Counter-Earth he was opposed by SHIELD who would hire [[Otto Octavius (Heroes Reborn) (Earth-616)|Otto Octavius]] to create an army of [[Iron Men (Heroes Reborn) (Earth-616)|Iron Men]] to stop Doom. Doom would succeed in his conquest of Counter-Earth and ruled it for a time, and likely dismantled SHIELD.{{r|Doom #1|3}}\n| Equipment               = Various SHIELD equipment\n| Transportation          = SHIELD Helicarrier\n| Weapons                 = Various SHIELD weapons\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Heroes Reborn (1996 Event)]]"
                }
            }
        }
    ],
    "page_id": "343902"
}