{
    "pageid": 260378,
    "ns": 0,
    "title": "Strikeforce X (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Wolverine Weapon X Vol 1 3 Textless.jpg\n| ImageSize               = 300px\n| Name                    = Strikeforce X\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Unknown\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = 12 unnamed\n| Allies                  = \n| Enemies                 = [[James Howlett (Earth-616)|Wolverine]]\n\n| Origin                  = Created to take down the [[Homo Superior|mutant]] known as [[James Howlett (Earth-616)|Wolverine]]\n| PlaceOfFormation        = Blackguard research facility, Washington, somewhere along the Canadian border\n| PlaceOfDissolution      = \n| Creators                = Jason Aaron; Ron Garney\n| First                   = Wolverine Weapon X Vol 1 1\n| Last                    = Wolverine and the X-Men Vol 1 16\n\n| HistoryText             = Strikeforce X is a team of agents that used humans as test subjects and were given animal-like senses, enhanced strength and reflexes (probably drug-induced), an artificially engineered healing factor (techno-organic), nanites in their blood to help regrow tissue, adamantium-laced skeletons, energy claws, and maybe some bionic implants as well. They are not actually [[Homo Superior|mutants]] but humans with enhancements given to them.{{r|Wolverine Weapon X Vol 1 2}}\n\nEach amongst the crew are equipped with unique ammunition stock tailored specifically to hamper the hyper regenerative abilities of more robust individuals. The slugs cost a few hundred grand per-bullet to manufacture, so discharging them recklessly is rather costly.{{r|Wolverine Weapon X Vol 1 3}}\n\nThe mercenary unit Strikeforce X had been manufactured by a [[Roxxon]] corp. subsidiary known as [[Blackguard (Earth-616)|Blackguard]] using stolen Weapon X files.{{r|Wolverine Weapon X Vol 1 1}} Their services sold to politically sensitive hot zones all across the globe for a hefty sum, all of which being a long play in order to draw [[James Howlett (Earth-616)|Logan]] to them so the commissioner of their creation; a Chief Executive of said PMC facilitator, can present evidence of termination to ready & waiting military figures on top of the shareholders at his next board meeting.{{r|Wolverine Weapon X Vol 1 3}} \n\nThe true purpose of this new private militia was to show off a living weapons test, using dishonorably discharged army renegades as viable test subjects whom the executive would deploy to volatile case areas touched by Roxxon or any other developmental contractors with deep pockets and black souls to serve whatever grizzly ends they need to meet.\n\nAll for the general purpose of overtaking the armed forces market in the long run, generally replacing nationally coopted servicepeople with Strikeforce X platoons in a bid to push a massive multi-governmental spanning contract. Making them the de-factor military of the USA by a half decades end.{{r|Wolverine Weapon X Vol 1 4}}\n\nSuch plans were eventually stymied indefinitely by the intervention of Nord, Wolverine and the published article of one [[Melita Garner (Earth-616)|Melita Garner]] which exposed Blackguards amoral dealings under the table to the wider public. All while Wolverine dispatched what remained of the Chief's remaining forces by blasting the oilrig they'd all been waiting on in the middle of the ocean, taking advantage of the buoyancy deficiency the mercs new modifications come with to finish most of them in one fell swoop. Meanwhile, Maverick would find the whistleblower whom he'd sold the files to that were used in creating Strikeforce X and cutting him down as punishment for his misdeeds. On top of covering his own tracks in the long run.{{r|Wolverine Weapon X Vol 1 5}}\n\nThe last remining operatives stranded on a deserted island with the fallen executive would find new employment in the services of [[Kade Kilgore (Earth-616)|Kade Kilgore]], whom would order said remnants to slaughter one another to earn positions as his bodyguards.{{r|Wolverine Vol 2 304}}{{r|Wolverine and the X-Men Vol 1 16}}\n\n| Equipment               = Adamantium laced skeletons, protective body armor  \n| Transportation          = \n| Weapons                 = Heavy artillery; possess special bullets designed to release 38 different kinds of cancer.{{r|Wolverine Weapon X Vol 1 2|3}} Laser talons can be launched like projectile stilettos.{{r|Wolverine Weapon X Vol 1 4}} \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Adamantium]]\n[[Category:Roxxon Projects]]\n[[Category:Techno-Organic Virus]]\n[[Category:Nanobots]]\n[[Category:Energy Projection on contact]]"
                }
            }
        }
    ],
    "page_id": "260378"
}