{
    "pageid": 510155,
    "ns": 0,
    "title": "Suicide Battalion (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Suicide Battalion (Earth-616) from Young Allies Vol 1 16 0001.jpg\n| Name                    = Suicide Battalion\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Undisclosed island on the South Pacific\n\n| Leaders                 = Formerly Prince Shinto\n| CurrentMembers          = \n| FormerMembers           = Prince Shinto (Deceased), various young Japanese (deceased)\n| Allies                  = [[Imperial Japan (Earth-616)|Imperial Japan]]\n| Enemies                 = [[Young Allies (WWII) (Earth-616)|Young Allies]]\n\n| Origin                  = \n| PlaceOfFormation        = Somewhere in Japan\n| PlaceOfDissolution      = Unnamed island\n| Creators                = Vince Alascia\n| First                   = Young Allies Vol 1 16\n| Last                    = Young Allies Vol 1 16\n\n| HistoryText             = The Suicide Battalion was a group of Japanese youth indoctrinated to following the [[Imperial Japan (Earth-616)|Imperial Japanese Army]] during [[World War II]]. Selected by Prince Shinto, they were trained to be loyal suicide bombers. Just prior to the end of the war, Shinto and his Suicide Battalion were deployed to an island almost completely lost to the Japanese that was of great strategic importance. There he sent his young charges to blow up various American air fields, military bases, and ammunition depots.\n\nWhen the American military realized what they were dealing with, they called in the [[Young Allies (WWII) (Earth-616)|Young Allies]] to help deal with the problem. When Shinto and his men learned of the Allies arrival, he ordered them captured but stressed to his youthful charges that they should gun down [[Thomas Raymond (Earth-616)|Toro]] as he posed the biggest threat to them. When the Suicide Battalion found the who they thought were the Young Allies, they soon found they had captured decoys -- after gunning down the one disguised as Toro. \n\nSoon the Young Allies came to rescue their decoy and everyone but Toro was captured as well. However, Toro soon arrived with American bombers and freed his friends while American bombs leveled the Japanese base. As Shinto and his wards attempted to escape Toro went after them. While the Suicide Battalion attempted to shoot Toro, one of their stray bullets struck a crate of TNT causing an explosion that killed the remaining members of the team.{{r|Young Allies Vol 1 16}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Members of the Suicide Battalion were armed with pistols, machine guns, and knives. While on suicide bombing missions they would strap belts of TNT onto their bodies. \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Japanese Organizations]]"
                }
            }
        }
    ],
    "page_id": "510155"
}