{
    "pageid": 24134,
    "ns": 0,
    "title": "Sunrise Society (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Sunrise Society (Earth-616) from Shadowmasters Vol 1 2 0001.jpg\n| Name                    = [[Sunrise Society]]\n| Aliases                 = [[Eternal Sun]]\n\n| Leaders                 = [[Kantaro Umezu (Earth-616)|Kantaro Umezu]]\n| CurrentMembers          = [[Iris Green (Earth-616)|Iris Green]], [[Character Index/Y#Yohei|Yohei]]\n| FormerMembers           = [[Kantaro Umezu (Earth-616)|Kantaro Umezu]], [[Character Index/I#Ito|Dr. Ito]], [[Mas Kimura (Earth-616)|Mas Kimura]], [[Fujimura (Earth-616)|Fujimura]]\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Shadowmasters (Earth-616)|Shadowmasters]], [[Shigeru Ezaki (Clone) (Earth-616)|Mace]], [[Frank Castle (Earth-616)|Punisher]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Tokyo]], [[Japan]]\n| PlaceOfFormation        = [[Japan]]\n| PlaceOfDissolution      = \n\n| Creators                = Carl Potts; Dan Lawlis\n| First                   = Shadowmasters Vol 1 1\n\n| History                 = The Sunrise Society was originally a group of Japanese soldiers who refused to surrender after WWII. While they were planning on killing the American troops in a small village called Ueno they were attacked by the village's protector Shigeru Ezaki in his guise as Tengu. During the struggle Shigeru's mask was knocked off and his face was seen by the Society's leader Umezu as well as Captain James Richards the man in charge of the American troops. After the fight Richards offered to keep Ezaki's identity secret as long as he promised to hunt down the rebel soldiers. Over the next few months Ezaki pursued them relentlessly until they were reduced to a small handful of men and then gave them the choice to either disband or be killed. Umezu told his men to pretend to disband while in reality working from within the system to gain power. Over the decades the former renegades formed themselves into a very powerful and successful Japanese business. The Society got into various fields such as cloning and hi-tech weaponry as well as creating branches abroad.<br /> One day Umezu spotted Ezaki's picture in a newspaper and decided to strike killing James Richards and kidnapping Ezaki's family. Ezaki saved his family apparently at the cost of his life. In fact Ezaki was taken and used in cloning experiments until the Society had a virtual army of his clones. One of these clones was given special enhancements as well as training, but the Society believed they could no longer trust his creator and had him killed and the clone captured and put in suspended animation at their California facility.       <br /> Years later the Society struck at the Ezaki's again prompting them and Captain Richards son Philip to resume the training Shigeru had begun with them and hunt down his killers as the [[Shadowmasters (Earth-616)|Shadowmasters]]. In the course of their struggle they crossed paths with the [[Frank Castle (Earth-616)|Punisher]] and the [[Natalia Romanova (Earth-616)|Black Widow]] taking the battle to the Society's main base where they discovered their father still alive. They managed to destroy the base and the army of Shigeru clones, but at the cost of Shigeru's life.      <br /> That setback forced the Society to reopen their California facility where the enhanced clone of Shigeru was accidentally revived after which he quickly fled. Despite sending both their special High Tech Ninjas and later their High Tech Soldiers they were unable to recapture the clone now calling himself [[Shigeru Ezaki (Clone) (Earth-616)|Mace]].<br />Later while studying under Hatsu Yakamoto the Shadowmasters were again attacked by the Society now going under the name Eternal Sun. With the help of the Punisher the Shadowmasters defeated them and destroyed their Tokyo base. \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]\n[[Category:Japanese Organizations]]"
                }
            }
        }
    ],
    "page_id": "24134"
}