{
    "pageid": 43671,
    "ns": 0,
    "title": "Sunset Riders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Sunset Riders (Earth-616) from Two-Gun Kid Sunset Riders Vol 1 2 001.jpg\n| Name                    = Sunset Riders\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Alaska\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Matthew Liebowicz (Earth-616)|Two-Gun Kid]], [[Marcel Fournier (Earth-616)|Marcel Fournier]], [[Running Fish (Earth-616)|Running Fish]], [[Hijiro Nguri (Earth-616)|Hijiro Nguri]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = Alaska\n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Two-Gun Kid: Sunset Riders #1\n| Last                    = \n\n| HistoryText             = In 1885, the American, Canadian, Russian and Japanese governments and various private businessmen all began vying to locate and control a mountain filled with above-ground crude oil in Alaska, so much easily accessible oil that whoever held it could easily dominate the world economy for good. French Canadian trapper and spy [[Marcel Fournier (Earth-616)|Marcel Fournier]] participated in this quest as an agent for the Canadian government, and was nearly hanged for killing rival agents in self-defense, but the [[Two-Gun Kid]] rescued him, faking Matt Hawk's death in the process. The fugitive duo soon joined forces with young half-Mexican Apache warrior [[Running Fish (Earth-616)|Running Fish]], sole survivor of a tribe slaughtered by the U.S. Cavalry in pursuit of Two-Gun and Fournier; and Japanese samurai [[Hijiro Nguri (Earth-616)|Hijiro Nguri]], an expert swordsman who had turned against his clan since he regarded Japan's participation in the bloody oil conspiracy as dishonorable. Together, aided by the Two-Gun Kid's collection of weapons from the future, the unlikely quartet eluded their various pursuers, located the oil mountain and blew it up, foiling the conspiracy. Seemingly killed, the quartet actually survived the blast and remained together for a time as the Sunset Riders.\n\nThe quartet soon drifted apart, however, as Running Fish returned to the Apache people under the name Geronimo, Hijiro Nguri dropped out of sight in San Francisco, and the Two-Gun Kid retired from adventuring for a time to practice law as \"Clay Harder.\"\n\n| Equipment               = \n| Transportation          = Horses, dog-sleds\n| Weapons                 = In addition to their traditional weapons, the group also had access to a cache of advanced weaponry which the Two-Gun Kid had brought back to his time from the future.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Defunct Teams]]\n[[Category:Western Teams]]\n[[Category:Western Characters]]"
                }
            }
        }
    ],
    "page_id": "43671"
}