{
    "pageid": 8099,
    "ns": 0,
    "title": "Super-Apes (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Venom Vol 4 9 Fantastic Four Villains Variant Textless.jpg\n| Name                    = Super-Apes\n| Aliases                 = Red Ghost's Super-Apes, Gamma-Apes\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Ivan Kragoff (Earth-616)|Red Ghost]] (deceased)\n| FormerMembers           = [[Peotor (Earth-616)|Peotor]] (deceased), [[Igor (Earth-616)|Igor]] (deceased), [[Grigori (Earth-616)|Grigori]] (deceased), [[Miklho (Earth-616)|Miklho]] (deceased), [[Alpha (Ape) (Earth-616)|Alpha]], [[Beta (Ape) (Earth-616)|Beta]], [[Dmitri (Ape) (Earth-616)|Dmitri]]{{r|Wolverine Vol 2 165}}, Various other unnamed primates\n| Allies                  = {{M|Intelligencia (Earth-616)|Intelligencia}}\n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Bruce Banner (Earth-616)|Hulk]], [[Jennifer Walters (Earth-616)|She-Hulk (Jennifer Walters)]], [[Lyra (Earth-8009)|She-Hulk (Lyra)]], [[Richard Jones (Earth-616)|A-Bomb]], [[Korg (Earth-616)|Korg]], [[James Buchanan Barnes (Earth-616)|Winter Soldier]], [[Peter Parker (Earth-616)|Spider-Man]], [[X-Men (Earth-616)|X-Men]], [[T'Challa (Earth-616)|Black Panther]], [[Power Pack (Earth-616)|Power Pack]], [[Anthony Stark (Earth-616)|Iron Man]]\n\n| Origin                  = Experiment subjects of the [[Ivan Kragoff (Earth-616)|Red Ghost]].\n| PlaceOfFormation        = The {{WP|Van Allen Belts}}, Earth Orbit \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four #13\n\n| HistoryText             = ===General===\n\nThe Super-Apes is a general term given to the name of the primates used by the Russian scientist and criminal [[Ivan Kragoff (Earth-616)|Ivan Kragoff]], aka the Red Ghost. The purpose of this entry is to catalogue the history of all the apes that Kragoff has used over the years.\n\n===The Original Apes===\n\nThe original apes that became the first incarnation of Ivan Kragoff's Super-Apes included the gorilla [[Miklho (Earth-616)|Miklho]], the orangutan [[Peotor (Earth-616)|Peotor]]<ref>Sometimes his spelling varies, for example he was named Piotr in {{cl|Fantastic Four Vol 3 #3}}</ref>, and [[Igor (Earth-616)|Igor]] the baboon<ref>Although he is sometimes erroneously depicted as a Mandrill a specials related to the baboon family. As was the case in {{cl|Black Panther Vol 4 #9}}</ref>. These apes were trained to be obedient and follow the verbal commands of Kragoff. When Ivan sought to replicate the accident that gave the [[Fantastic Four (Earth-616)|Fantastic Four]] their powers, he brought the apes along with him aboard his ship. As per his specifications they were bombarded with even more [[Cosmic Rays]] than the Fantastic Four and were endowed with enhanced abilities. Miklho gained super-strength, Peotor the power over magnetism, and Igor gained shapeshifting abilities. Their missing coincided with the Fantastic Four's mission to investigate the [[Blue Area]] of the Moon. There the Igor -- now calling himself the Red Ghost due to his ability to become intangible -- and his Super-Apes attacked the Fantastic Four. The battle attracted the attention of the [[Uatu (Earth-616)|Watcher]] an alien being charged with observing and recording human history. After briefly subduing the Super-Apes he allowed the two factions to fight it out. The Ghost captured the Fantastic Four's [[Susan Storm (Earth-616)|Invisible Girl]] and had his apes watch over them. When the Invisible Girl learned that Ivan kept his apes obedient by withholding food she fed them and they soon turned on their master, allowing the Fantastic four to leave and strand the Red Ghost and his apes on the moon{{r|Fantastic Four #13}}\n\nThe Red Ghost managed to make his apes obedient to him again and he constructed a ship that could be controlled by Peotor's magnetic powers. He used this ship to later strand the Fantastic Four on the moon. When the Fantastic Four sought refuge in the Watcher's citadel, the Red Ghost and his apes went after him. When the Red Ghost was lost in a dimensional portal, the Super-Apes fled back to Earth in their own ship{{r|Fantastic Four #29}}. When the Red Ghost resurfaced he found his Super-Apes and returned to the Moon to try and loot the Watcher's citadel for its advanced technology. He and his Super-Apes walked through a chronal spike which transported them a number of years in the future where they interacted with future versions of themselves before ultimately being returned back to their own time empty handed<ref>{{cl|FF Vol 2 #13}}. See [[Super-Apes (Earth-616)#Recent History|recent history]] for more details</ref>. The Super-Apes later accompanied their master when he was manipulated by [[Victor von Doom (Earth-616)|Dr. Doom]] into attacking the wedding of [[Reed Richards (Earth-616)|Mr. Fantastic]] and the Invisible Girl. The apes clashed with the Fantastic Four until they and the Red Ghost were banished to a mystical realm by Sorcerer Supreme [[Stephen Strange (Earth-616)|Dr. Strange]]. {{r|Fantastic Four Annual #3}} Kragoff and the Super-Apes were later pulled forward in time by [[Aron (Earth-616)|Aron the Rogue Watcher]] to battle the Fantastic Four and [[Fantastic Force (Earth-616)|Fantastic Force]]. When Aron was defeated, all his pawns were returned to their proper eras with no memories of the battle. {{r|Fantastic Four #400}}.\n\n===Alpha and Beta===\n\nBelieving that his original Super-Apes were destroyed, the Red Ghost trained two new apes he named [[Alpha (Ape) (Earth-616)|Alpha]] and [[Beta (Ape) (Earth-616)|Beta]]. At first they were normal apes, but after the Red Ghost had the [[Milos Masaryk (Earth-616)|Unicorn]] steal a Cosmic Ray from [[Stark Industries]] he intended to endow them with super powers. After a clash with the armored hero [[Anthony Stark (Earth-616)|Iron Man]], the Red Ghost did just that, endowing Alpha with enhanced strength and Beta with the ability to control minds{{r|Iron Man #15}}. Taking his new Super-Apes to Africa he sent them into the jungles to amass an army of primates to assist in his take over of a [[Strategic Hazard Intervention Espionage Logistics Directorate (Earth-616)|SHIELD]] satellite facility. Although Red Ghost managed to take control of the facility he was attacked by Iron Man and the Unicorn. The tables were turned when Alpha and Beta -- their intelligences enhanced by the Cosmic Ray -- turned on their master forcing him to flee. Alpha and Beta then went into the jungle to lead their army of apes{{r|Iron Man #16}}. Their subsequent fate is unknown.\n\n===Return of the Original Apes===\n\nRed Ghost later learned that his original Super-Apes were alive and well and recovered them. They assisted him in battling [[Kree]] soldier [[Mar-Vell (Earth-616)|Captain Marvel]] in an attempt to duplicate his [[Nega-Bands]]. A plan that ended in failure{{r|Marvel: Shadows and Light #1}}. They also assisted him in trying to steal Mr. Fantastic's new Gravity Localizer but were opposed by the [[Jonathan Storm (Earth-616)|Human Torch]] and [[Peter Parker (Earth-616)|Spider-Man]]. Spider-Man was able to stop the Super-Apes from stealing his [[Spider-Buggy]] by using fruit pies{{r|Spider-Man Human Torch #3}}. When the Red Ghost became trapped in his intangible form he attempted to steal Stark Industries new Cosmitronic Cannon to cure himself, sending his Super-Apes to capture its inventor [[Anthony Stark (Earth-616)|Iron Man]]{{r|Iron Man #82}}. This led to another clash with Iron Man, which ended in the Red Ghost's apparent demise when the Cosmitronic Cannon made it so if he turned intangible again it would dissipate his atoms{{r|Iron Man #83}}. When the Red Ghost reconstituted himself{{r|Fantastic Four #197}} he recovered his Super-Apes when he joined the [[Samuel Sterns (Earth-616)|Leaders']] group of genius criminals the [[Intelligencia (Earth-616)|Intelligencia]]. The Super-Apes were used to recover long lost Alexandrian texts from the [[Eternals|Eternal]] realm of [[Olympia]]. {{r|Fall of the Hulks: Alpha #1}}\n\nThe Super-Apes were also used in an attempt to steal a rare mathematical treatise from Empire State University{{r|Amazing Spider-Man #223}}, and the [[Black Fox (Thief) (Earth-616)|Black Fox]] was forced to use the Super-Apes in a bank robbery{{r|Amazing Spider-Man #255}}. In both cases these thefts were thwarted by Spider-Man, but the Super-Apes and their master managed to escape. The Super-Apes were also utilized in trying to steal the memory core of the [[Smartship Friday (Earth-616)|Smartship Friday]], but this attempt was thwarted by the [[Power Pack (Earth-616)|Power Pack]]{{r|Power Pack #61}}{{r|Power Pack #62}}. Relocating to Belgium, the Red Ghost and his apes were captured by [[Guillaume Courage (Earth-616)|Commander Courage]] of the Belgium defence ministry. The Super-Apes were fitted with [[Were-Borg]] technorganic implants and put under the control of Commander Courage. By this point the Red Ghost and his apes had formed a mental bond, and due to the Were-Borg tech this bond was slowly killing him. The Super-Apes were used to battle the [[Henry McCoy (Earth-616)|Beast]] and the [[Frank Payne (Earth-616)|Constrictor]]. However the Beast reprogrammed the Were-Borg tech making the Super-Apes help him defeat Commander Courage, who was later slain by the Red Ghost{{r|Marvel Comics Presents #92}}. The Apes were also used when the Red Ghost briefly joined the [[Bentley Wittman (Earth-616)|Wizard's]] latest incarnation of the [[Frightful Four (Earth-616)|Frightful Four]], but were once again defeated by the Fantastic Four. {{r|Fantastic Four Unlimited #5}}\n\nSome months later, the Super-Apes gained enhanced intelligence due to their link to the Red Ghost, while the Ghost himself became a simpleton. Becoming aware of animal testing the Super-Apes intended to get revenge by hiding in an research lab at Empire State University where they prepared a nerve gas attack. But this was thwarted by the Fantastic Four{{r|Fantastic Four Vol 3 #3}}. When the Super-Apes were seen again, they and their master were back to their normal mental capacities and shared a cell in the [[Cage (Prison)|Cage]] prison. The apes afforded Red Ghost the protection he needed from the more aggressive inmates{{r|Wolverine Vol 2 #164}}. During this period he had an ape named Dmitri sharing a cell with him. Dmitri's powers are unrecorded and his fate after Red Ghost escaped the Cage are unknown{{r|Wolverine Vol 2 #165}}. When the Fantastic Four were out hunting their various foes, the Red Ghost was also attacked. Despite the assistance of his Super-Apes he was captured once again{{r|Fantastic Four: Foe #5}}. Miklho and Peotor soon began developing a renewed intelligence and the Red Ghost put them through communist education before bringing them to the nation of [[Niganda]] where their master was working with scientist [[Erich Paine (Earth-616)|Erich Paine]] to create a race of intelligent apes{{r|X-Men Vol 2 #176}}. Finding that Paine tortured his test subjects, Miklho and Peotor helped a rogue baboon in attempting to unleash a virus that would kill off the human population, but their attempt was thwarted by the [[X-Men (Earth-616)|X-Men]] and the [[T'Challa (Earth-616)|Black Panther]]. {{r|Black Panther Vol 4 #9}}\n\nThe Super-Apes, having reverted back to their base intelligence, were next used by the Red Ghost in a bank robbery, but this was thwarted by the Avengers{{r|Marvel Apes #1}}. Later, the Red Ghost took his loyal creations with him to LA to investigate sightings of [[Roy Reyna (Earth-616)|Ape-X]] where they clashed with [[Robert Baldwin (Earth-8101)|Speedball]] a simian hero from [[Earth-8101]].{{r|Marvel Apes: Speedball Special #1}} Speedball and Ape-X defeated Red Ghost and the Supe-Apes and send them running.{{r|Marvel Zombies: Evil Evolution #1}}<ref>The events of {{cl|Marvel Apes: Amazing Spider-Monkey Special Vol 1 1}} and {{cl|Marvel Zombies: Evil Evolution #1}} happened in [[Earth-38831]] instead of [[Earth-616]].</ref>\n\n===Fall of the Hulks===\n\nRed Ghost brought his Super-Apes with Intelligentia on the delivery of the final cache of Alexandrian texts from Atlantis to Dr. Doom's castle in Latveria. When Doom betrayed them, the Super-Apes defender the master and covered his escape{{r|Fall of the Hulks: Alpha #1}}. Soon the Super-Apes were utilized in Intelligentia's upcoming conflict against the Hulk{{r|Fall of the Hulks: Gamma #1}}. They were sent with their master to Wakanda to kidnap the Black Panther and Beast of the X-Men as part of a plot to capture the eight most intelligent men on Earth. Their kidnapping was interrupted by the [[Thaddeus Ross (Earth-616)|Red Hulk]] who slew Miklho. Furious, the Red Ghost used his powers to knock out the Hulk and escape with his prisoners{{r|Hulk Vol 2 #20}}. When Intelligentia's plans eventually failed, the Red Ghost fled to St. Petersburg, Russia. There he found a new baby gorilla named [[Grigori (Earth-616)|Grigori]] and endowed it with enhanced strength. He and his apes were soon captured by the [[Jennifer Walters (Earth-616)|Sensational]] and [[Lyra (Earth-8009)|Savage]] She-Hulks{{r|She-Hulks #2}}. They tried to escape capture over Nevada airspace and when this failed, Red Ghost tried to crash the ship but they were stopped by the [[Bruce Banner (Earth-616)|Hulk]] and incarcerated.{{r|She-Hulks #3}}\n\n===Recent Events=== \n\nBroken out of prison, the Red Ghost and his Super-Apes reconnected with Intelligentia and began working on a new Zero Cannon which used Peotor's magnetic abilities to power it. They were quickly defeated in battle against [[Otto Octavius (Earth-616)|Dr. Octopus]] and his [[Sinister Six (Earth-616)|Sinister Six]]{{r|Amazing Spider-Man #676}}. When the Red Ghost began working with disposed Latverian Prime Minister [[Lucia von Bardas (Earth-616)|Lucia von Bardas]] he provided a number of intelligent apes with combat training to assist in their mission to destroy Latveria. These apes were easily bested by the [[James Buchanan Barnes (Earth-616)|Winter Soldier]] and the [[Natasha Romanoff (Earth-616)|Black Widow]] who foiled Lucia's plot{{r|Winter Soldier #1}}{{r|Winter Soldier #2}}{{r|Winter Soldier #3}}{{r|Winter Soldier #4}}{{r|Winter Soldier #5}}. The Red Ghost's regular Super-Apes and the rest of Intelligencia were almost drowned later when they were attacked by the mercenary [[Wade Wilson (Earth-616)|Deadpool]]{{r|Deadpool Vol 4 #55}}. \n\nMost recently the Super-Apes accompanied their master to the moon on another attempt to steal the Watcher's equipment. Passing through the same chronal spike the Super-Apes were separated from their master. Wandering along the surface they encountered past and future versions of themselves. The apes were then attracted to bananas being produced by the [[Future Foundation (Earth-616)|Future Foundation's]] wards -- [[Bentley Wittman (Clone) (Earth-616)|Bentley-23]], [[Adolf Impossible (Earth-616)|Adolf Impossible]], [[Leech (Earth-616)|Leech]], [[Arthur Maddicks (Earth-616)|Artie Maddicks]], [[Onome (Earth-616)|Onome]], [[Vil (Earth-616)|Vil]], [[Wu (Earth-616)|Wu]], [[Mik (Moloid) (Earth-616)|Mik]], [[Korr (Moloid) (Earth-616)|Korr]], [[Turg (Moloid) (Earth-616)|Turg]] and [[Tong (Moloid) (Earth-616)|Tong]] -- who made fast friends with the apes. However when various Red Ghost's from different points in history appeared before them the children attacked them and drove them away. {{r|FF Vol 2 #13}}\n\n===End===\nThe Super-Apes as well as the Red Ghost were later killed by Steve Rogers so he could take over their hideout and use it to hide [[Erik Selvig (Earth-616)|Erik Selvig]] from the [[Johann Shmidt (Clone) (Earth-616)|Red Skull]].{{r|Captain America: Steve Rogers Vol 1 4}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n\n| Trivia                  = \n| Links                   = \n* [http://marveldirectory.com/groupsandteams/redghostssuperapes.htm Super Apes at the Marvel Directory]\n\n}}"
                }
            }
        }
    ],
    "page_id": "8099"
}