{
    "pageid": 981226,
    "ns": 0,
    "title": "Survivors (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Survivors (Earth-616) from Fantastic Four Vol 1 518 0001.jpg\n| Name                    = [[Survivors]]\n| EditorialNames          = \n| Aliases                 = <nowiki></nowiki>\n\n| Leaders                 = [[Zius (Earth-616)|Zius]]\n| CurrentMembers          = [[Zius (Earth-616)|Zius]], various unnamed members of unrevealed extraterrestrial races\n| FormerMembers           = \n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| Alignment               = \n| BaseOfOperations        = Mobile\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Mark Waid; Mike Wieringo\n| First                   = Fantastic Four Vol 1 517\n\n| History                 = Centuries ago, [[Zius (Earth-616)|Zius]] started to save those few that he could from the ravages of [[Galan (Earth-616)|Galactus]]. Under his leadership the fleet of survivors would grow, with the goal to find a way to shield worlds from Galactus. They invented a machine that could be easily built from technologies and base elements present in nearly any sentient\nworld. It created a completely full spectrum cloaking field. A world protected by it temporarily faded from view, becoming invisible to not only eyes but Galactus's sensors too. They freely shared their technology, and it spread throughout the cosmos. Millions of worlds and trillions of sentient civilizations are now protected by the system.{{r|Fantastic Four Vol 1 518}}\n\nRecently they were advised by both the [[Shi'ar (Race)|Shi'ar]] and the [[Deviant Skrulls|Skrulls]] that the technology was not foolproof and that what was capable of negating their technology was on Earth. The Survivors headed to Earth to prevent Galactus from acquiring that ability. They planned to eject [[Manhattan]] into the sun as that is where they located the threat which turned out to be the [[Susan Storm (Earth-616)|Invisible Woman]]. When [[Reed Richards (Earth-616)|Mr. Fantastic]] fooled them into thinking her powers had been removed by temporarily switching Sue and Johnny's powers, they returned Manhattan to Earth. With their technology they quickly reversed the damage they caused to the electrical systems, tunnels, bridges, etc. When Galactus arrived on Earth to take the Invisible Woman to find those hidden worlds, he destroyed one of their anti-gravity obelisks.{{r|Fantastic Four Vol 1 517|519}}\n| Equipment               = Anti-gravity obelisks (2 mile high, able to lift Manhattan)\n| Transportation          = Warp-capable starships\n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Interstellar Fleets]]"
                }
            }
        }
    ],
    "page_id": "981226"
}