{
    "pageid": 30585,
    "ns": 0,
    "title": "Swamp Men (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Swamp_Men_(Earth-616)_Incredible_Hulk_Vol_1_109_001.jpg\n| Name                    = Swamp Men\n| Aliases                 = [[Swamp Tribe]], [[Swampers]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Amphibius (Earth-616)|Amphibius]], [[Barbarus (Earth-616)|Barbarus]], [[Brainchild (Earth-616)|Brainchild]], [[Gaza (Earth-616)|Gaza]], [[Leash (Earth-616)|Leash]], [[Lani Ubanu (Earth-616)|Lorelei]], [[Lupa (Savage Land Mutate) (Earth-616)|Lupa]], [[Lupo (Earth-616)|Lupo]], [[Piper (Savage Land Mutate) (Earth-616)|Piper]], [[Rojash (Earth-616)|Rojash]], [[Karl Lykos (Earth-616)|Sauron]], [[Whiteout (Earth-616)|Whiteout]], [[Worm (Savage Land Mutate) (Earth-616)|Worm]], [[Equilibrius (Earth-616)|Equilibrius]], [[Vertigo (Savage Land Mutate) (Earth-616)|Vertigo]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Savage Land Mutates (Earth-616)|Savage Land Mutates]], [[Namor McKenzie (Earth-616)|Namor]], [[Zaladane]], [[Stegron]], [[Max Eisenhardt (Earth-616)|Magneto]]\n| Enemies                 = [[Kevin Plunder (Earth-616)|Ka-Zar]], [[Zabu (Earth-616)|Zabu]]\n\n| Origin                  = A [[Neanderthal]] tribe that living in the Savage Land\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Swamp Men Village]], [[Savage Land]] \n| PlaceOfFormation        = [[Savage Land]] \n| PlaceOfDissolution      = \n\n| Creators                = Stan Lee; Jack Kirby\n| First                   = X-Men Vol 1 10\n\n| History                 = \n===Overview===\nThe '''Swamp Men''' are a [[Neanderthal]] society of hunter-gatherers that live in the swamp lands of the [[Savage Land]].{{r|Marvel Atlas #2|; [[Savage Land]]'s entry}}  They are known for their superior hunting skills that ride on giant bird beasts. They are a war-like tribe who are frequently at war with each other or with neighboring cultures.{{r|Official Handbook of the Marvel Universe Vol 2 #19}} However they did have some trade links with the agrarian tribe of the [[Hill-Forest People (Earth-616)|Hill-Forest People]].{{r|Ka-Zar Vol 4 1}}\n\n===Ancient History===\nThe Swamp Men are the descendants of the humans of the empire of [[Atlantis]]. When the empire fell the people were scattered throughout the land forming their own tribes.{{r|Official Handbook of the Marvel Universe Vol 2 #19}}\n\nAt one point, they worshiped [[Umbu (Earth-616)|Umbu the Unliving]], an android that had been left on Earth by the [[Sagittarians]], an alien race who had visited the Earth centuries ago.{{r|Incredible Hulk #109|110}}\n\n===Modern Era===\n[[File:Swamp_Men_(Earth-616)_X-Men_Vol_1_10_001.jpg|left|thumb]]\nThe Swamp Men encountered the [[X-Men (Earth-616)|X-Men]] who traveled to [[Antarctica]] to investigate the Savage Land. They attacked the outsiders and easily get the drop on them, knocking most of their numbers out with swamp gas and kidnapped [[Jean Grey (Earth-616)|Jean Grey]]. Witnessing the battle, [[Ka-Zar]] went to the X-Men's rescue with the aid of his tiger [[Zabu]], he agreed to help them free their friend from the Swamp Men. The Swamp People also captured [[Warren Worthington III (Earth-616)|Angel]] who was scouting the land from the air and brought back to their village. [[File:Swamp_Men_(Earth-616)_X-Men_Vol_1_10_002.jpg|right|250px|thumb]]They brought them to the top of a hill where they were to be sacrificed to a deadly [[Dinosaurs|Tyrannosaurus Rex]]. The X-Men and Ka-Zar break into the village,  Jean managed to compose herself to use her telekinetic powers to trip up the T-Rex and free herself and Angel. Able to fly away, Warren grabbed Jean and the two join their comrades in battle. Smashing through the defenses, Ka-Zar helped the X-Men dodge the Swamp Men's death traps and called a herd of [[Mammoths|Woolly Mammoths]] to smash through the wooden fence that surrounds the village. Ka-Zar and the X-Men made short work of the Swamp Men, sending them fleeing into the jungles in defeat.{{r|X-Men #10}}\n\n[[File:Swamp_Men_(Earth-616)_Daredevil_Vol_1_12_001.jpg|thumb|250px|left]]\nKa-Zar and Zabu became aware of an attacking party of Swamp Men that were seeking out the jungle lord in order to destroy him. When the Swamp Men attacked [[Skull Island]], Ka-Zar and Zabu went to stop them.{{r|Daredevil #12}}\n\nTwo members of the Swamp Men went to Skull Island to investigate the constant burning fires. Their they discover the The Plunderer's base  and get the drop on two of the [[Plunderer]]'s guards. With the guards downed, one of them picked up his vibra-gun and accidentally activated it, blasting a hole in the Plunderer's base. The explosion prompts the Plunderer to send his troops out to chase after the savages. [[File:Swamp_Men_(Earth-616)_Tales_to_Astonish_Vol_1_97_001.jpg|right|350px|thumb]] They also freed [[Namor McKenzie (Earth-616)|Namor]] the Sub-Mariner was being kept prisoner at the time. He attacked the Plunderer, however the chief of the Swamp Men, unable to make a distinction between the two combatants dropped a rock down on both of them, pinning Namor under the rock.The Plunderer blasted the savage with his vibra-gun  and escaped, however  Namor revived and he rescued the chief of the Swamp People before Skull Island exploded. Taking the chief to the shore, he was welcomed to the Swamp People's home to celebrate. {{r|Tales to Astonish #97|98}}\t\n[[File:Swamp_Men_(Earth-616)_Incredible_Hulk_Vol_1_109_001.jpg|left|250px|thumb]]\nThe Swamp Men encountered the Hulk again after he crashed into the Savage Land after stopping a Chinese missile. He changed back the Banner and was  captured the the Swamp Men who prepared him for a ritual of human sacrifice. Ka-Zar, Lord of the Savage Land finds the Swamp Men, and battles them, freeing Banner. Later when they tried to stop a device that could destroy the Earth, the Swamp Men attacked. Banner transformed into the Hulk and attacked the Swamp Men, but Ka-Zar is stunned during the melee. After the Swamp Men were defeated, the Hulk destroyed the device.{{r|Incredible Hulk #109|110}} {{r|Marvel Super-Heroes #63}}\t\n\n[[Max Eisenhardt (Earth-616)|Magneto]] came to the Savage Land, finding mutations that occurred easily in this land due to high levels of radiation, Magneto assembled members from the Swamp Men himself \"the Creator,\" subjected them to experiments that greatly enhanced their physiology, creating the [[Savage Land Mutates (Earth-616)|Savage Land Mutates]].{{r|X-Men #62}} When the superhero team of mutants, the X-Men, were exploring the Savage Land, the Mutates battled the X-Men and X-ally, the Savage Land protector known as Ka-zar. Revealing the Creator as Magneto, the X-Men were captured until [[Jean Grey (Earth-616)|Jean Grey]] ultimately destroyed Magneto's headquarters and machines, burying Magneto under the debris and reverting the mutates back to their non-superhuman state.{{r|X-Men #63}}\n\nA couple Carla and Ralph come to the [[Savage Land]] with a Swamp Tank to steal [[Ka-Zar]]'s [[vibranium]], but when they force him to open the door to where it is stored the vibranium destroys the tank. Carla is carried off and killed by the Swamp Men when Ralph is not able to save her because the gun he was using only had blanks due to Carla replacing the bullets with blanks in an effort to get Ralph killed.{{r|Savage Tales #1}}\t\n\nThe Swamp Men encountered [[Spider-Man]] who had come to the Savage Land to find [[Stegron]]. Spidey teamed up with Ka-Zar and battled Dinosaurs and Swamp Men at all sides, the two fail to stop Stegron who escaped in an airship loaded with Dinosaurs.{{r|Marvel Team-Up #19|20}}\n\n[[Clete Brandon (Earth-616)|Clete Brandon]] a former and soldier and mercenary who crash-landed in the [[Savage Land]] after a failed coup in South America. Ater destroying a village of the Swamp Men who had attacked him, he began living with a tribe of apes.{{r|Savage Tales #11}}\n\nThe Swamp Men and the mutates later allied with [[Zala Dane (Earth-616)|Zaladane]] when she attempted to conquer the [[Savage Land]]. They kidnapped [[Lorna Dane (Earth-616)|Polaris]] from Punta Arenas, [[Chile]]. The X-Men tried to intervene but fought to a stalemate and Zaladane and her forces agreed to leave in peace taking Polaris with them, but failed to notice that one soldier in her army is none other than the disguised [[Alexander Summers (Earth-616)|Havok]].{{r|Uncanny X-Men #249|250}}{{r|Uncanny X-Men #274|275}}\t\n\nDuring the ''[[Secret Invasion]]'', some of the Swamp Men joined Ka-Zar to fight the [[Skrulls]].{{r|New Avengers #41}}\n\nThe Swamp Men were invited to join the [[United Council of Tribes (Earth-616)|United Council of Tribes]]. It was created by the [[Zebra People]] to bring peace to [[Pangea (Savage Land)|Pangea]]. A member of the tribe was present when [[Torran]] of the [[Ethereals (Savage Land)|Ethereals]] crashed the meeting.{{r|Ka-Zar Vol 4 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   =\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Savage Land Tribes]]\n[[Category:Homo neanderthalensis]]"
                }
            }
        }
    ],
    "page_id": "30585"
}