{
    "pageid": 893338,
    "ns": 0,
    "title": "Takers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Takers_(Earth-616)_Thing_Vol_1_11.jpg\n| Name                    = Takers\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Defunct\n| Alignment               = \n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Battleworld (Beyonder)|Battleworld]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = [[Benjamin Grimm (Earth-616)|Thing]], [[Llrrllllnnllyyrrl (Earth-616)|Llrrllllnnllyyrrl]]\n| Enemies                 = [[Ultron (Earth-616)|Ultron]], [[Grimm the Sorcerer (Earth-616)|Grimm the Sorcerer]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = John Byrne; Ron Wilson\n| First                   = Thing #11\n| Last                    = Thing #20\n\n| HistoryText             = Like every creature found on the [[Beyonder (Earth-616)|Beyonder's]] [[Battleworld (Beyonder)|Battleworld]] following the events of the first [[Marvel Super Heroes: Secret Wars|Secret Wars]], the Takers were the product of the subconscious mind of the [[Fantastic Four (Earth-616)|Fantastic Four's]] [[Benjamin Grimm (Earth-616)|Thing]], {{r|Thing #22}} the Thing had decided to remain on Battleworld {{r|Marvel Super Heroes Secret Wars #12}} after discovering he could change back and forth between human and Thing forms. {{r|Marvel Super Heroes Secret Wars #2}} Each of these creations were based off some aspect of Ben's memories or personality, with entirely fabricated backgrounds and origins. {{r|Thing #22}}\n\nThe Takers were a race of green skinned creatures who made their living robbing valuable objects while riding on the backs of massive flying creatures. They then took their stolen wares to the top of a massive smooth obelisk. This obelisk then transported those who reached its top to another part of Battleworld where the Taker's home was located. Those who they stole from built a city around the obelisk in the hopes of one day discovering a means of climbing it and recovering their stolen property. \n\nBen Grimm encountered the Takers when one of their number stole the device that would allow him to return to Earth whenever he was ready to go home. He followed the thief to the city that was constructed below the obelisk. There he got the assistance of a young alien named [[Llrrllllnnllyyrrl (Earth-616)|Llrrllllnnllyyrrl]] who claimed that she was seeking to recover her stolen dowry from the Takers. Having captured one of their flying beasts, Llrrllllnnllyyrrl turned it over to Ben to ride up to the top of the obelisk. Transported to the Taker's hideout, Ben turned into the Thing and forced his way into their base. Realizing that they had stolen an object belonging to a great and noble warrior, the Takers returned the device to the Thing and quickly became his loyal worshipers. Before leaving, the Thing demanded that the Takers locate Llrrllllnnllyyrrl's dowry and return it to her. {{r|Thing #11}}\n\nForgetting what Llrrllllnnllyyrrl's dowry was, the Takers brought back what they thought was the stolen property, a gem encrusted piece of gold, only to be told that it wasn't correct. {{r|Thing #13}} The second item they brought to Llrrllllnnllyyrrl was a Tantorian P-Z Lanta, a powerful weapon that had the curious ability to teleport itself to wherever the holder wished it. Thinking that it was the only gun that could stop her friend the Thing, Llrrllllnnllyyrrl accidentally caused it to temporarily end up in the hands of [[Gruhl (Earth-616)|Gruhl]], a creature that bore a grudge against the Thing. {{r|Thing #15}} They continued on with little to nor success. At one point the Takers and Llrrllllnnllyyrrl were interrupted by one of the priestesses of Maub who were seeking for their missing child [[Juneyar (Earth-616)|Juneyar]]. {{r|Thing #18}} They continued their appointed task, still failing to find that which Llrrllllnnllyyrrl sought. {{r|Thing #19}} Finally they located Llrrllllnnllyyrrl's \"dowry\" which turned out to be the head of [[Ultron (Earth-616)|Ultron]], which was trapped on Battleworld since the end of the Secret Wars. {{r|Thing #20}}<ref group=\"note\">[[Ultron (Earth-616)|Ultron's]] body was destroyed in {{cl|Marvel Super Heroes Secret Wars #12}}</ref> Llrrllllnnllyyrrl then had her people rebuild Ultron's body. {{r|Thing #21}} The Thing later defeated Ultron, and opted to leave Battleworld. Upon that moment, the Takers ceased to exist and Battleworld exploded into nothingness. {{r|Thing #22}}\n\n| Equipment               = \n| Transportation          = The Takers rode on massive dragon-like ceatures.\n| Weapons                 = \n\n| Notes                   = <references group=\"note\" />\n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "893338"
}