{
    "pageid": 172437,
    "ns": 0,
    "title": "Taylor Foundation (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Taylor Foundation (Earth-616) from Night Thrasher Vol 1 5 0001.jpg\n| Name                    = Taylor Foundation\n| Aliases                 = \n\n| Leaders                 =  [[Donyell Taylor (Earth-616)|Donyell Taylor]]; Formerly [[Dwayne Taylor (Earth-616)|Dwayne Taylor]], Daryl Taylor \n| CurrentMembers          = [[Michael Janes (Earth-616)|Father Michael Janes]], [[Gai No Don (Earth-616)|Gai No Don]], [[Walter Rosen (Earth-616)|Walter Rosen]], \n| FormerMembers           = Taylor Madsden, Eve Magdalene, [[Andrew Chord (Earth-616)|Andrew Chord]], [[Daryl Taylor (Earth-616)|Daryl Taylor]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[New Warriors (Earth-616)|New Warriors]], [[Anthony Stark (Earth-616)|Tony Stark/Iron Man]]; \n| Enemies                 = [[Air Force (Earth-616)|Air Force]]; [[Gideon (Earth-616)|Gideon]]\n\n| Origin                  = Formed by Daryl Taylor as a controlling board for his Taylor Industries\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Ambrose Building]], [[Manhattan]] \n| PlaceOfFormation        = New York City\n| PlaceOfDissolution      = \n\n| Creators                = Fabian Nicieza\n| First                   = Night Thrasher Vol 1 5\n\n| History                 =[[Daryl Taylor (Earth-616)|Daryl Taylor]] used the money he inherited from his parents to found the Taylor Foundation which is a conglomeration of financial intuitions. Daryl parents had made several good investments. Daryl made the company a billion dollar enterprise. When Daryl was 18 he married his high school sweetheart Melody. Some time later they had a son named Dwayne.\n\nWhen [[Daryl Taylor (Earth-616)|Daryl Taylor]] and his wife [[Melody Taylor (Earth-616)|Melody]] were murdered by his best friend [[Andrew Chord (Earth-616)|Andrew Chord]] and Chord's mother-in-law [[Tai (Well of All Things) (Earth-616)|Tai]] they took custody of Daryl and Melody's son [[Dwayne Taylor (Earth-616)|Dwayne]] and cemented their control of the Taylor Foundation. Andrew Chord managed most of the day to day affairs of the company. Despite being responsible for his parents murder Chord and Tai made a point to encourage Dwayne Taylor's desire to become a one man weapon in the war against crime and the company financed Dwayne's expenses as Night Thrasher. While Dwayne was busy concentrating on the fight against crime he was oblivious to the corruption of the Taylor Foundation. Dwayne thought most of the business the Taylor Foundation dealt with were philanthropic donations of worthy causes.\n\nEventually Night Thrasher uncovered some of the shady deals the Taylor Foundation had been involved in. Monies from the Taylor Foundation financed Roxxon, Genetech, SHIELD, a senate subcommittee involving Superhuman research and something called the Latverian Conservation Society as well as a gun runner. When Night Thrasher confronted Chord with the evidence Chord attempted suicide by shooting himself in the head.\n\nNight Thrasher slowly began taking control of the company and began rooting out the corruption that had infested it. To this end he set up a new board of directors including himself, [[Gai No Don (Earth-616)|Gai No Don]], [[Walter Rosen (Earth-616)|Walter Rosen]] the CEO of Genetech, and [[Michael Janes (Earth-616)|Father Michael Janes]]. Gai No Don himself was a North Korean war criminal but Dwayne wanted someone who was cunning to help navigate the ruthlessness of the business world.\n\nEventually Dwayne and some of the other New Warriors were killed by Nitro. At this time the company fell to [[Donyell Taylor (Earth-616)|Donyell Taylor]]. Donyell was the illegitimate son of Daryl Taylor conceived during a drunken one night with a woman he met on a business trip to Chicago. Donyell had previously taken the name Bandit and stole Night Thrasher's girlfriend [[Silhouette Chord (Earth-616)|Silhouette]] and actively plotted to destroy his life. Apparently they had made peace some time before Dwayne's death and Donyell had chosen to turn his life around and be a true hero. Donyell eventually became the new Night Thrasher. As CEO he steered money from the Taylor Foundation to his own group of New Warriors.\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Companies]]"
                }
            }
        }
    ],
    "page_id": "172437"
}