{
    "pageid": 483801,
    "ns": 0,
    "title": "Terror Squad (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Terror Squad (Earth-616) from U.S.A. Comics Vol 1 6 0001.jpg\n| Name                    = Terror Squad\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Chuck Wilson (Earth-616)|Chuck Wilson]], Stanisofski, Twimbly\n| Allies                  = \n| Enemies                 = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n\n| Origin                  = \n| PlaceOfFormation        = Berlin, Germany\n| PlaceOfDissolution      = \n| Creators                = \n| First                   = U.S.A. Comics Vol 1 6\n| Last                    = U.S.A. Comics Vol 1 6\n\n| HistoryText             = The men who would form the Terror Squad were all prisoners of war who found themselves in the same concentration camp in December of 1942. American Chuck Wilson and Russian Stanisofski both broke out by crawling under the barbed wire fences that surrounded the camp. They were spotted and fled into the forest. While the [[National Socialist German Workers Party (Earth-616)|Nazi]] guards chased them, Twimbly -- a Briton -- jumped one of the guards, stole his uniform, and managed to sneak out in the commotion.\n\nWilson and Stanisofski eventually ran into Twimbly, and the three decided to work together to get out of Nazi Germany together. When they were spotted by a jeep patrol, Twimbly -- still clad in a Nazi SS uniform -- pretended to be a guard who had captured his new found friends, allowing them to get close enough to jump the men in the jeep and steal their uniforms and transport.\n\nDriving to a German village, they spotted a trio of British fighters that were put on display by the Nazis. Because the ships were unarmed, they grabbed machine guns and stole the planes. As they were flying across the German country side, Stanisofski blew up a convoy carrying fuel to a Nazi base. Their flight attracted the attention of the Luftwaffe and soon a dog fight broke out. Using the machine guns they had in the cockpits of their planes to defend themselves, the three escapees managed to fight off the Nazi fighters and cross over into Russian territory.\n\nLanding in a Russian airfield, they were greeted by Sanisofski's brother who welcomed them to the base. Having worked well together, they decided to keep on fighting side-by-side as the Terror Squad.{{r|U.S.A. Comics Vol 1 6}}\n\nTheir subsequent activities during [[World War II]] are unrecorded. \n\n| Equipment               = \n| Transportation          = Each member of the Terror Squad flew a British Spitfire fighter jet.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "483801"
}