{
    "pageid": 823632,
    "ns": 0,
    "title": "The Ancients (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = The Ancients (Earth-616) from Daredevil Annual Vol 1 4B 001.png\n| Name                    = The Ancients\n| Aliases                 = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Aurwel (Earth-616)|Aurwel]], [[Psycatos (Earth-616)|Psycatos]], [[Bekkit (Earth-616)|Bekkit]], [[Jhandark (Earth-616)|Jhandark]]; others\n\n| Identity                = \n| Affiliation             =\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Lemuria; Antarctica\n| PlaceOfFormation        = [[Lemuria (Pacific Ocean)|Lemuria]]\n| PlaceOfDissolution      = \n\n| Creators                = Roy Thomas; Gene Colan; Peter Sanderson; Mark Bagley\n| First                   = Sub-Mariner #10\n\n| History                 = The Ancients were a group of Lemurian telepaths who opposed the insane Lemurian king [[Naga (Lemurian) (Earth-616)|Naga]] several centuries ago. Naga had become immortal due to his wearing the Serpent Crown (making him a puppet of the ancient god Set). Naga had Aurwel killed. Soon after Aurwel's brothers Psycatos and Bekkit snuck into Naga's palace while he slept and stole the serpent crown protecting themselves from its dark influence via self hypnosis.{{r|Sub-Mariner #10}} \n\nThe brothers made their way to Antarctica and established a community there. While there they found an ancient dynamo left behind by the humans from the human city of Atlantis prior to the Great Cataclysm that sank Atlantis and Lemuria.\n\nBekkit's wife Jhandark concocted a potion that turned the Lemurians green scaly skin pink and smooth. Bekkit encased the Serpent Crown in a metal designed to limit the Serpent Crown's influence. For a time Bekkit and Psycatos ruled their community jointly but eventually Bekkit, Jhandark and their children left the community leaving the serpent crown with Psycatos. As time went on Psycatos became old and infirm and became susceptible to the lure of the Serpent Crown. Bekkit meanwhile founded a community of telepaths amongst mankind.\n\nEventually Bekkit returned to visit the community in Antarctica and found that everyone including his brother had become Serpent Men. Psycatos slew Bekkit but was so disgusted with himself he cast off the serpent crown and killed himself with a dagger after he rigged the dynamo to blow. With the dynamo's destruction the serpent crown would not be found again until the 20th Century. {{r|Daredevil Annual #4B}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = [[Sea Leopard (Earth-616)|Sea Leopard]] claimed to be one of the Ancients.{{r|Namor the Sub-Mariner #53}}\n| Trivia                  = The Ancients were first mentioned in {{cl|Sub-Mariner #1}}.\n| Links                   = \n}}\n[[Category:Lemurians]]\n[[Category:Telepaths]]"
                }
            }
        }
    ],
    "page_id": "823632"
}