{
    "pageid": 30273,
    "ns": 0,
    "title": "Thor Corps (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Thor Corps (Earth-616) from Thor Vol 1 440 0001.jpg\n| Name                    = Thor Corps\n| Aliases                 = Hammer Brothers, Brotherhood of the Hammer\n\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Thunderstrike (Eric Masterson)|Eric Masterson]], [[Thor (Dargo Ktor)|Dargo]], [[Beta Ray Bill]]\n| Allies                  = [[Thor Odinson (Earth-616)|Thor]]\n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Tom DeFalco; Pat Olliffe\n| First                   = Thor Vol 1 440\n| Last                    = Thor Corps #4\n\n| HistoryText             = When [[Tomorrow Man|Zarrko]] tricked the Thor of the future, Dargo Ktor, to travel to the past in order to combat the Thor of the present, Eric Masterson, the fighting brought another hammer wielder, Beta Ray Bill, to Earth. Beta Ray stopped the senseless violence between the two, and together, they formed the Thor Corps. Reluctant to aid the others, Masterson quickly decided to help Dargo and Bill stop Zarrko’s mad scheme to become the undisputed master of time, and the three “Hammer Brothers”, as Beta Ray called them, made their way to Zarrko’s ship. There they were tested against various enemies from the collective pasts, presents and futures of the Thunder god. Foes such as the [[Cobra]], [[Mercurio]], the [[4-D Man]], [[Demonstaff]], [[Skurge]], the Executioner and [[Loki]] were pulled from the time stream by Zarrko to halt the progress of the Thor Corps. However, Loki, unwilling to be controlled like the others, turned on Zarrko and was ultimately responsible for his downfall. Beta Ray Bill used Zarrko’s technology to return each of the heroes to their respective time lines before Zarrko’s ship exploded. {{r|Thor #440|441}}\n\nBefore long, the Thor Corps was called into action again when Demonstaff forced Dargo to reunite with Masterson, now known as Thunderstrike, and Beta Ray Bill in order to find his estranged wife, Ellene. Dargo had no choice but to accept since his archenemy had kidnapped his wife, Salla, and threatened to destroy all reality. The Thor Corps were transported, by Demonstaff, to the dimension his wife now inhabited, but the ruler there, Warlord Kargul, used the powers at his disposal to send them back in time to World War II. Once there, the Thor Corps were attacked by Captain America and the Invaders, but soon they found a portal that led them back to Kargul’s realm. They found Demonstaff’s wife, but Ellene wanted no part of her husband fearing that he only wanted to see her dead.\n\nMeanwhile, Warlord Kargul found out that Demonstaff wanted to end all reality, so he and his demon hordes invaded the dimension of Earth to stop the madman’s plans even as Ellene, still in Kargul's world, activated more dimensional portals to banish the members of the Thor Corps to separate timelines. Each of them found themselves up against such foes as the Guardians of the Galaxy, Spider-Man (2099) and even Kid Colt and the Rawhide Kid, but it wasn’t until the three came together again and summoned the one true Thor that they stood a chance of defeating Demonstaff. As the dimensions began collapsing upon one another, the Thor Corps used the awesome powers contained within their enchanted hammers to prevent the end of all reality. Demonstaff finally realized the error of his ways when his wife Ellene finally confronted him, and he reversed the catastrophic events that he initially set in motion. {{r|Thor Corps #1|4}}\n\n[[File:Thor Corps Vol 1 4.jpg|thumb]]\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each member of the Thor Corps had their own personal version of Thor's original warhammer, [[Mjolnir]], Beta Ray Bill had [[Stormbreaker]], Dargo Ktor wields Mjolnir itself, and Eric Masterson wields his mace, [[Thunderstrike]].\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Asgardian Organizations]]"
                }
            }
        }
    ],
    "page_id": "30273"
}