{
    "pageid": 8120,
    "ns": 0,
    "title": "Those Who Sit Above in Shadow (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Those Who Sit Above in Shadow (Earth-616) from Thor Vol 2 84 001.jpg\n| ImageSize               = 250px\n| Name                    = Those Who Sit Above in Shadow\n| Aliases                 = Gods of Gods;{{r|Thor Vol 2 #85}} Shadow Gods;{{r|Thor Vol 2 #85}} They Who Sit Above in Shadow;{{citation}} We Who Sit Above in Shadow;{{r|X-Men/Alpha Flight #1}} We Who Live Above in Shadow{{r|X-Men/Alpha Flight #2}}\n| Status                  = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = \n\n| Origin                  = Gods of the [[Asgardians]]; possible [[Beyonders]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Chris Claremont; Paul Smith\n| First                   = X-Men/Alpha Flight #1\n\n| HistoryText             = The realm of Asgard existed in an endless cycle of death and rebirth. Those Who Sit Above in Shadow lived off the energy released by [[Ragnarok (Event)|Ragnarök]], and caused the cycle to continue.{{r|Thor Vol 2 #81|85}}\n\nThey were allegedly the creators of the [[Asgardians]], but were possibly created by them instead, as myths which became reality.{{r|Loki: Agent of Asgard #17}}\n\nThose Who Sit Above in Shadow were first seen when Loki tried to win their favor. [[Loki Laufeyson (Earth-616)|Loki]] attempted good deeds, but they were not pleased by his actions and rejected him.{{r|X-Men/Alpha Flight #1|2}}\n\nWhen [[Odin Borson (Earth-616)|Odin]] sent [[Thor Odinson (Earth-616)|Thor]] to Earth to learn a lesson in humility by becoming human, a loophole was created in the cycle, as Those Who Sit Above in Shadow could no longer predict what Thor would do when influenced by man, and thus could not keep Thor bound by his strand of fate. This was part of Odin's plan. When the final Ragnarok arrived Thor hung himself on Yggdrasil to gain vast wisdom and runic magic, and learned who was behind the cycle. Thor destroyed the Loom of the Fates, and broke the thread that holds the destiny of [[Asgardians]], from which Those Who Sit Above in Shadow were absorbing energy. With their source of energy destroyed and the cycle broken, Those Who Sit Above in Shadow seemingly perished along with the rest of the Asgardian worlds and people.{{r|Thor Vol 2 #84|85}}\n\nThose Who Sit Above in Shadow revealed themselves to still be alive a few hours before the universe collapsed due to the Multiversal phenomena known as the [[Glossary:Incursion|incursions]]. They appeared before Odin in his dreams, announcing the upcoming end of all there was.{{r|Loki: Agent of Asgard #14}}\n\nWhen all of reality was eventually destroyed, the trickster [[Loki Laufeyson (Ikol) (Earth-616)|Loki]] was one of the few survivors of the universe, having used magic to both exit reality and safely contain the essence of his fellow Asgardians.{{r|Loki: Agent of Asgard Vol 1 16}} After finding himself in a blank void of nothingness, Loki was confronted by Those Who Sit Above in Shadows, who demanded to be given the Asgardians' essence to feed on it. Loki defied Those Who Sit Above in Shadow, and even put into question their origin and existence. If the gods such as the Asgardians come from the stories that have been told about them, it was possible that the gods of the gods didn't create the gods, but had been created by them. Unable to answer or even counter the questions posed by Loki, Those Who Sit Above in Shadows fled.{{r|Loki: Agent of Asgard #17}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * Those Who Sit Above In Shadow possess a scale of power well beyond the level of Asgardians. They have demonstrated the ability to manipulate great power, feeding off energy given by the Ragnarok cycle. They once teleported Loki to [[Svartalfheim]] when he fell out of their favor. Yet they could not predict Thor destroying the Loom of the Fates, so their claim of omniscience is hyperbole.{{r|Thor Vol 2 85}}\n* It was hypothesized by [[Loki Laufeyson (Ikol) (Earth-616)|Loki]] that Those Who Sit Above In Shadow could have been created by the [[Asgardians]]' beliefs, or were even [[Beyonders]].{{r|Loki: Agent of Asgard #17}}\n** To be noted that their sentences \"Slay your enemies and all you desire shall be yours\" and \"Nothing you dream of is impossible for us to accomplish\"{{r|Loki: Agent of Asgard #14}} mimicked the [[Beyonder (Earth-616)|Beyonder]]'s.{{r|Marvel Super Heroes Secret Wars #1}}\n* They were also stated to share certain similarities with the [[Primal Gods]].{{r|All-New Official Handbook of the Marvel Universe A to Z #11|; Those Who Sit Above in Shadow's entry}}\n* It was recently revealed that Thor would go to the Elder-Sleep where he could commune with the spirits and the old dead kings whenever he used [[Mjolnir]] to switch places with [[Donald Blake (Earth-616)|Donald Blake]]. When Thor most recently traded places with Blake, the elder spirits and the ancient kings who turned their eyes from him looked like three of Those Who Sit Above In Shadow.{{r|Thor Vol 6 9}}\n| Trivia                  = * [[Stan Lee|Stan Lee]] (jokingly) stated that their names were Larry, Larry, Larry, Ralph and Larry.<ref>[http://brevoortformspring.tumblr.com/post/139069925913/those-who-sit-above-in-shadow-do-you-have-any Stan Lee's post on Brevoort Tumblr]</ref>\n| Links                   = * [http://www.marvunapp.com/Appendix2/thosewhositthor.htm Those Who Sit Above in Shadow at the Marvel Appendix] \n}}\n[[Category:Deities]]\n[[Category:Unknown Origin]]\n[[Category:Possible Beyonders]]\n[[Category:Possible Primal Gods]]"
                }
            }
        }
    ],
    "page_id": "8120"
}