{
    "pageid": 484210,
    "ns": 0,
    "title": "Three Witches (Nowhere) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Three Witches (Nowhere) (Earth-616) from Marvel Mystery Comics Vol 1 39 001.jpg\n| Name                    = Three Witches\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = The Land of Fairies, [[Nowhere]]\n\n| Leaders                 = \n| CurrentMembers          = Minerva, Melissa, Third unnamed member\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Jimmy Jankovicz (Earth-616)|Jimmy Jupiter]], [[Knobby (Earth-616)|Knobby]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Ed Robbins\n| First                   = Marvel Mystery Comics #39\n| Last                    = \n\n| HistoryText             = The Three Witches live in the potentially imaginary world of [[Nowhere]] in the Land of Fairies. The three sisters have bad vision and require glasses, however they only had a single pair which also was the source of their magical powers. When [[Jimmy Jankovicz (Earth-616)|Jimmy Jupiter]] and his pal [[Knobby (Earth-616)|Knobby]] happened by on their way to see [[King Ra (Earth-616)|King Ra]], the women used their magic to trap them in a mystic circle. \n\nJimmy promised the three women that when he went to see the king he would get two more pairs of glasses for them. However, their agreement reach a stalemate when neither side could trust the other. Realizing that the glasses were also the source of their power, Jimmy grabbed them and used them to free himself and Knobby. He almost gave the glasses back when Knobby suggested that they keep them. Jimmy and Knobby then left, but promised to bring the witches three pairs of glasses without magical powers.\n\n| Equipment               = The Three Witches shared a pair of glasses that allowed them to see. These glasses also had magical powers, the exact extent of which is unknown. They could at least allow the wearer to conjurer a mystical circle that trapped those in its confines. \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Nowhere]]"
                }
            }
        }
    ],
    "page_id": "484210"
}