{
    "pageid": 507723,
    "ns": 0,
    "title": "Three Aces (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Three Aces (Earth-616) from Marvel Mystery Comics Vol 1 63 0001.jpg\n| Name                    = Three Aces\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[New York]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Three unnamed crooks\n| Allies                  = Carter Blackstone\n| Enemies                 = [[Jim Hammond (Earth-616)|Human Torch]], [[Thomas Raymond (Earth-616)|Toro]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mort Lawrence;\n| First                   = Marvel Mystery Comics Vol 1 63\n| Last                    = Marvel Mystery Comics Vol 1 63\n\n| HistoryText             = The Three Aces were a trio of criminals-for-hire who were actived in the 1940s. In 1945, they were hired by Apex Steel Mill owner Carter Blackstone who wished to sabotage his rival \"Steel\" McArthy's steel mill in order to win a contract from a potential employer. When Blackstone's step-daughter Ann Gibson attempted to warn the [[Jim Hammond (Earth-616)|Human Torch]] and [[Thomas Raymond (Earth-616)|Toro]] about the impending attack, Blackstone ordered the Three Aces to deal with them.\n\nBreaking into the Torch's apartment, the Three Aces caught Torch, Toro, and Anne off guard and were able to blackjack them. Taking the trio out to a lake out of town, they dumped the bodies in the water and left them to drown. Surviving the attempt on their lives, the Torch and Toro raced to the McArthy Steel Mill and prevented the Three Aces from dumping tons of scrap steel on the mills machinery. When the Three Aces attempted to flee the scene they were knocked out by Bill McArthy, \"Steel\" McArthy's seemingly meek son. The Three Aces and Blackstone were turned over to the authorities.{{r|Marvel Mystery Comics Vol 1 63}}\n\nThe fate of the Three Aces is unknown.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Three Aces all carried blackjacks to knock out their targets.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "507723"
}