{
    "pageid": 12282,
    "ns": 0,
    "title": "Thunderiders (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Thunderiders (Earth-616) from Team America Vol 1 10 001.jpg\n| Name                    = Thunderiders\n| Aliases                 = Team America\n| Distinguish1            = Team America\n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Marauder (Earth-616)|Marauder]], [[James MacDonald (Thunderiders) (Earth-616)|Honcho]], [[Wolf (Thunderiders) (Earth-616)|Wolf]], [[Winthrop Roan, Jr. (Earth-616)|R.U. Reddy]], [[Wrench (Leonard Hebb)|Wrench]], [[Luke Merriweather (Earth-616)|Cowboy]], [[Georgianna Castleberry (Earth-616)|Georgianna Castleberry]], [[Sharon Ventura (Earth-616)|Sharon Ventura]], [[Benjamin Grimm (Earth-616)|Thing]]\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = J.M. DeMatteis; Mike Zeck\n| First                   = Captain America #269\n| Last                    = Thing #28\n\n| HistoryText             = \nThe Thunderiders are a world-class motorcycle stunt-riding exhibition team based in the United States. Five of the Thunderiders' six regulars are mutants who possess a special mental link with one another that enables them to share certain information and feelings as well as project into a host body their combined mental and physical attributes during times of stress. This host body takes on the masked identity of the Marauder, also known as the Black Marauder, the Dark Rider, or the Black Rider. The parents of James McDonald, Winthrop Roan, Jr., Leonard Hebb, Luke Merriweather, and \"The Wolf\" (real name unrevealed) were among the undisclosed number of couples who were the unwitting test subjects in an experiment conducted by the subversive organization [[Hydra]]. {{Citation}}\n\nThe experiment, called \"Project: New Genesis,\" was designed by Hydra scientists to create a race of mutants who could be trained as superhuman agents for the group. The expectant mothers were surreptitiously administered a mutagenic compound; and after the children were born; Hydra agents kept the children under surveillance as they grew to adulthood. When none of the test subjects seemed to exhibit any extraordinary superhuman power, the project was terminated. Unknown to Hydra, five of the test subjects did develop latent superhuman abilities, but they would not manifest themselves until the men neared adulthood and each other. Perhaps not coincidentally, the five latent mutants each developed an aptitude and passion for motorcycles. \n\nThree of the five met in Daytona Beach, Florida, when motorcyclists from around the world congregated there for the first race of the new Unlimited Class Racing Competition, a tournament organized to test race high-performance vehicles. It was called \"Unlimited Class\" because there were no restrictions placed on engine size or power or technological innovation permitted in the races. McDonald, Roan, and \"Wolf\" each met for the first time at Daytona, but they manifested their collective self, the Marauder, a few days earlier. The Marauder had stolen into the corporate headquarters of Universal Technologies, a front for Hydra, in order to purge the computer files of records about them. When Hydra learned of the purge, it deduced the identities of the five file-subjects from cross-referenced data, but now lacked the detailed histories of the five. \n\nBelieving that McDonald, Roan, or \"Wolf\" must be the Marauder, Hydra sent an agent to Daytona to assassinate all three. James McDonald, who had recently resigned from the Central Intelligence Agency to work as a free agent, went to Daytona to investigate rumored Hydra activity. Winthrop Roan, Jr., preferring to be known by his stage name \"R.U. Reddy,\" went to Daytona in hopes of being hired as a racer. \"Wolf\" went to watch the cycles and the people. Each of the three narrowly evaded the Hydra assassin and was left a note by the Marauder claiming that they had a common destiny and should join together. After much deliberation, they agreed to do so. {{Citation}}\n\nCalling themselves Team America, they entered the first Unlimited Class Racing competition and won. Moments after victory, Hydra attacked the raceway in an effort to procure a unique guidance system used by one of the Japanese teams. Team America managed to foil their raid. \n\nAt the next Unlimited Class event in the Rocky Mountains, Luke Merriweather (alias Cowboy) and Leonard Hebb (alias Wrench), hearing about Team America's surprise victory, met with the three founding members and petitioned for membership. Merriweather and Hebb were the other two Hydra test subjects. Feeling a rapport with the newcomers, the three original Team Americans welcomed them into their ranks. \n\nUnofficially, Hebb's girlfriend Georgianna Sue Castleberry also became a member of the team. Hebb was a gifted mechanic and designer of high-performance vehicles, and his Winnebago recreational vehicle became Team America's mobile headquarters. His girlfriend, Castleberry, it was later learned, was usually the host body for their collective persona, the Marauder, although she did not know it. Hebb designed and built a race car for Team America to compete in the Rocky Mountain race, but a Hydra assassin prevented them from winning. \n\nWhen the three original Team Americans performed at a charity exhibition at Madison Square Garden in New York, one of the spectators, a prominent Nobel prize winner, was kidnapped by a large android. The Team assisted Captain America in rescuing him and several other well-known intellectuals whom the Mad Thinker had abducted to provide himself companionship \n\nThe next race event was held on the Sahara Desert in Egypt. Taking a commercial flight there, the Team was dismayed when their team leader McDonald (called Honcho) left the group to take a freelance assignment for the CIA to foil a weapons-smuggling operation. Honcho failed to show up in time to assist his teammates in the race, and Team America lost. \n\n[[Image:Team America Vol 1 9.jpg|thumb|left]]\nDeeply in debt, Team America returned to the United States. Talk of disbanding arose when their last motorcycle broke down and they had no money to fix it, but the Marauder left the team its own state-of-the-art motorcycle. With it, Team America traveled across the country entering every motorcycle race they could find. With all of the prize money, they paid their debts and rented a garage in Hoboken, New Jersey, to serve as their headquarters. Investing everything they had in a new high-performance vehicle for the next Unlimited Class competition, the team was disheartened when it broke down in a time trial. \n\nDesperate, they accepted an offer from a recruiting agent of Stark International, who was more interested in acquiring the Marauder's motorcycle than he was in having their services. Learning that they would be absorbed into a team of seventy-two other drivers, the Team began to regret their decision. However, when Stark president Anthony Stark learned of his recruitment agent's disreputable transaction, he made restitution and released the Team from their contracts. In Lakebed, Oklahoma, the next Unlimited Class Racing event was held and Wolf of Team America came in first. However, the race was disrupted first by the demonic Ghost Rider, who wished to settle a score with the Marauder, and then by Hydra, which wanted to kill Team America in revenge. \n\nIn the melee, the Ghost Rider assisted the Team to fight off Hydra, but the Marauder was injured. Unmasking the silent cyclist, the Team was stunned to discover its identity to be Georgianna Castleberry. Later when Elsie Carson, regional leader of Hydra, failed a second assassination attempt, she revealed to them their connection with \"Project: New Genesis\" in exchange for her freedom. Believing her to be a victim of circumstances, the Team helped rescue her from her own agents who were supposed to kill her and her family should she fail in her mission. \n\nAfter this battle, Team America disbanded. Wrench and Castleberry married. Honcho wanted to devote more time to espionage work. Cowboy invited Wolf and Reddy to join him in a series of charity exhibitions to promote Cowboy's school, and the two accepted. At one such event, in upstate New York, the criminal Viper and her associate the Silver Samurai attacked the New Mutants, teenaged students at Professor Xavier's School for Gifted Youngsters, who happened to be in attendance. The three Team Americans joined the fray but were unable to stop the criminals from abducting Danielle Moonstar whom the Team had caused to become the host-body for the Marauder.{{r|New Mutants Vol 1 5}}\n\nOn the threat of killing Moonstar, the Viper had James McDonald assemble Team America to raid a fortress in the Sierra Madre Mountains for a special crystal.{{r|New Mutants Vol 1 5}} While the New Mutants rescued Moonstar, Team America infiltrated the fortress, which was headquarters of one of the splinters groups of the Advanced Idea Mechanics and managed to procure the crystal. However, it was lost before it could be turned over to the Viper. The New Mutants did manage to rescue Moonstar. In exchange for their cooperation, Xavier taught the mutants in Team America to control the appearance of the Marauder. {{r|New Mutants Vol 1 6}}\n\nDeciding that they missed the excitement of being in the team, the six decided to band together permanently once more. They changed their name to the Thunderiders and began training as a precision-riding stunt team as well as racers. Seeking to expand the team, the Thunderiders have held open auditions. Champion sportswoman [[Sharon Ventura (Earth-616)|Sharon Ventura]] was a member of the Thunderiders for a few months prior to becoming the second Ms. Marvel. \n\nThe [[Benjamin Grimm (Earth-616)|Thing]] of the [[Fantastic Four (Earth-616)|Fantastic Four]] was also a member for a few weeks, although he resigned before performing with them in public. The Thunderiders remain America's best daredevil motorcycle team as well as a top contender in the Unlimited Class Racing competitions. {{Citation}}\n| Equipment               = \n| Transportation          = Motorcycles\n| Weapons                 = \n\n| Notes                   = They have no connection to the \"Team America: World Police\" film or its characters.\n| Trivia                  = \n| Links                   = * http://en.wikipedia.org/wiki/Thunderiders\n* Unofficial Handbook of the Marvel Universe\n}}"
                }
            }
        }
    ],
    "page_id": "12282"
}