{
    "pageid": 120461,
    "ns": 0,
    "title": "Thunderbolts (Gang) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Thunderbolts (Gang) (Earth-616) from Daredevil Vol 1 69 001.jpg\n| Name                    = [[Thunderbolts]]\n| Aliases                 = \n| Distinguish1            = Thunderbolts \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Hell's Kitchen]], [[Manhattan]] [[New York City]], [[New York (State)|New York]]\n| Leaders                 = \n| CurrentMembers          = [[Turk Barrett (Earth-616)|Turk Barrett]], [[Paul Donovan (Earth-616)|Paul Donovan]], Clyde, Eddie, [[Character Index/H#Herbie|Herbie]], [[Character Index/J#Jackie|Jackie]], [[Character Index/L#Levron|Levron]], [[Character Index/C#Charlie|Charlie]]\n| FormerMembers           = [[Lonnie Carver (Earth-616)|Lonnie Carver]]\n| Allies                  = [[Ulysses Klaw (Earth-616)|Klaw]]\n| Enemies                 = [[Matthew Murdock (Earth-616)|Daredevil]], [[T'Challa (Earth-616)|Black Panther]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Roy Thomas; Gene Colan\n| First                   = Daredevil Vol 1 69\n\n| HistoryText             = The Thunderbolts Gang were a radical African-American gang operating in [[Hell's Kitchen]]. While crashing in on a minor theft, the driver of the getaway truck crashes while trying to escape [[Matthew Murdock (Earth-616)|Daredevil]], looking inside he was shocked to find that the driver is a boy no older than 15. Running into the [[T'Challa (Earth-616)|Black Panther]], the two rush the boy to the hospital.Black Panther explained that he was investigating the criminal activities of a local gang of youths known as the Thunderbolts. The Thunderbolts, Panther explained have been recruiting members from the kids that he teaches in his civilian guise of Lucas Charles. \n\nThe group itself, is anti-establishment and is under the belief that the \"white man\" is the cause of their ills, and believes that violence and theft is the only way to get out from under the perception of oppression. Daredevil also learned that the boy he saved Lonnie Carver had an older brother [[William Carver (Earth-616)|Billie]] who has infiltrated the group. Daredevil teamed up with Black Panther to break up the group, and with the help of Billy, they broke it up and turned them over to police. {{r|Daredevil #69}}\n\n[[Ulysses Klaw (Earth-616)|Klaw]] began to realize that his sonic powers had been waning over the years and undertook an elaborate scheme to manipulate a youth gang into restoring him to full power. Klaw had the local Thunderbolts Gang accost and and take his powerful Sonic Horn. The Black Panther tried to stop the threat but a gang member used the horn to blast him. The Panther retrieved the comatose Klaw and took him to [[Avengers Mansion]] and stored him with his team mates in a protective stasis. The Panther then pursued the gang but they used the sonic weapon to create a creature of sound, a winged elephant with deadly claws.{{r|Black Panther #14}} [[Captain America]] and Black Panther managed to defeat the winged elephant sound construct and rushed to the docks fearing Klaw hd a plan to escape his suspended state.\n\nAt the docks [[Henry McCoy (Earth-616)|Beast]]  and [[Vision (Earth-616)|Vision]] are attempted to ship Klaw's body to Wakanda when the Thunderbolts show up with Klaw's sonic-horn. They made a construct of a rhino and lion to keep the [[Avengers (Earth-616)|Avengers]] at bay while they blast Klaw with his horn to revive him. Revived and stronger than ever Klaw battled Vision behind a sound dome the other Avengers can't penetrate. Suddenly N'Yaga and [[Taku (Wakandan) (Earth-616)|Taku]] show up in a limo with the Panther's vibranium claws which dampen sound waves and will allow him to fight Klaw one on one. Black Panther ripped through the dome and finding Vision defeated attacked Klaw. The dock is blasted in the melee dropping Klaw and Black Panther underwater. The Panther managed to blast Klaw with his own horn causing his body to dissipate. {{r|Black Panther #15}}\n\n| Equipment               = * '''[[Sonic Disruptor]]'''\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Criminal Organizations]]\n[[Category:Gangs]]"
                }
            }
        }
    ],
    "page_id": "120461"
}