{
    "pageid": 1586550,
    "ns": 0,
    "title": "Tiger Division (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = Tiger Division\n| Image                   = Tiger Division (Earth-616) from Black Cat Annual Vol 2 1 001.jpg\n| Name                    = Horang-i Buseo\n| EditorialNames          = \n| Aliases                 = Tiger Division\n\n| Leaders                 = [[Ami Han (Earth-616)|White Fox]] \n| CurrentMembers          = [[Auntie Ante (Earth-616)|Auntie Ante]], [[General (Tiger Division) (Earth-616)|General]], [[Gun-R II (Earth-616)|Gun-R II]], [[Mr. Enigma (Earth-616)|Mr. Enigma]], [[Tae-Won (Earth-616)|Taegukgi]]\n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             = {{m|National Intelligence Service}}\n| Allies                  = [[Felicia Hardy (Earth-616)|Black Cat]], [[Seol Hee (Earth-616)|Luna Snow]]\n| Enemies                 = [[Choi Faction (Earth-616)|Choi Faction]], [[Mongdal (Earth-616)|Mongdal]]\n\n| Origin                  = Governmental super hero team\n| Status                  = Active\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Tiger Division Base]], [[Buramsan Mountain]], [[Seoul]], [[South Korea]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Jed MacKay; Alessandro Vitti; Joey Vazquez\n| First                   = Taskmaster Vol 3 3\n\n| History                 = Tiger Division was the government-sanctioned superhuman response team of [[South Korea]]. They were under the direct employ of the [[National Intelligence Service (Earth-616)|National Intelligence Service]] and their leader was director [[Ami Han (Earth-616)|Ami Han]]'s alter ego, White Fox. The heart of the team was patriotic hero [[Tae-Won (Earth-616)|Taegukgi]].{{r|Black Cat Annual Vol 2 1}}\n\nWhen mercenary [[Anthony Masters (Earth-616)|Taskmaster]] worked with [[Nicholas Fury, Jr. (Earth-616)|Nick Fury]] to access a secret project called the Rubicon Trigger, one of the kinesic signatures they needed to open it Director Han's. Taskmaster infiltrated South Korea and provided a local terrorist group with injections of gene enhancements. He then tipped off Tiger Division, and Taegukgi arrested them on behalf of the team. Using [[Pym Particles]] to shrink himself, Taskmaster hitched a ride on Taegukgi to the [[Tiger Division Base]]. Using his powers, Taskmaster took in Han's kinesic signature until he was spotted and forced to retreat. He managed to evade both the White Fox and the [[Natalia Romanova (Earth-616)|Black Widow]] by triggering the enhancements on the terrorists, who had been detained at the headquarters, causing them to release a psychic blast that incapacitated everyone in the building.{{r|Taskmaster Vol 3 3}}\n\nIn an attempt to stage a coup, a gangster family called the [[Choi Faction (Earth-616)|Choi Faction]] employed the body-snatcher [[Mongdal (Earth-616)|Mongdal]] and augmented his powers to take control of Taegukgi, threatening to unleash the hero on the [[Seoul]] if the government didn't cede control to them. After conscripting the [[Felicia Hardy (Earth-616)|Black Cat]], the White Fox led Tiger Division on an attack on the Choi Faction's base of operations, the abandoned [[Alps Ski Resort]]. Most of the team performed a frontal assault and engaged Taegukgi, providing the White Fox and the Black Cat a distraction to sneak into the building and disable the Choi Faction's means of mind control. After finding the entirety of the Choi Faction dead, they were confronted by the mercenary cult named the [[Maidens (Earth-616)|Maidens]]. In the meantime, the rest of Tiger Divison had been incapacitated by Taegukgi. After defeating the Maidens, the Black Cat and the White Fox stumbled into Mongdal. Before waking him up, the Black Cat injected him with a nanomunition whose injector she had stolen from the White Fox. After being woken up, Mongdal revealed he had enlisted the Maidens to kill the Choi Faction since he only wanted Taegukgi's body to just wreak havoc. Once Mongdal finished monologuing, the Black Cat detonated the nanomunition and killed him. Afterward, Tiger Division regrouped with the White Fox.{{r|Black Cat Annual Vol 2 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1586550"
}