{
    "pageid": 12200,
    "ns": 0,
    "title": "Torrid Twosome (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Torrid Twosome (Earth-616) from Strange Tales Vol 1 106 001.png\n| Name                    = Torrid Twosome\n| Aliases                 = \n\n| Status                  = Defunct\n\n| Identity                = Public\n| Reality                 = 616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Acrobat (Carl Zante)]], [[Human Torch (Johnny Storm)]]\n\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Larry Lieber; Dick Ayers; \n| First                   = Strange Tales #106\n| Last                    = \n\n| HistoryText             = The [[Carl Zante (Earth-616)|Acrobat]] met with the young [[Jonathan Storm (Earth-616)|Human Torch]], telling him that the rest of the [[Fantastic Four (Earth-616)|Fantastic Four]] were taking credit for his accomplishments and exploiting him. He proposed teaming with him as part of the Torrid Twosome. They could use their abilities to collect reward money and get rich. Johnny wanted some time to think it over, but after an argument with the rest of the Fantastic Four, he called Zante and agreed to join him.\n\nAs a member of the Torrid Twosome, the Human Torch donned a new costume. Following The Acrobat's instructions, their first case was to rescue a teller trapped in the [[Glenville]] bank's safe. Melting his way into the safe, the Torch found it empty, then turned to find that the Acrobat had tricked him. The Acrobat blasted the Torch with a liquid asbestos spray and shot him in the arm, escaping with a million dollars in cash from the vault. The rest of the Fantastic Four, who had followed the Torch in order to investigate his odd behavior, had captured the Acrobat, but were distracted when they learned that Johnny had been injured, allowing him to escape. The Human Torch flew after the Acrobat, and melted the ground under his feet, immobilizing him before he could jump into a manhole cover and escape. The Acrobat was presumably turned over to the police. {{r|Strange Tales #106}}\n\n| Equipment               = Liquid Asbestos Gun\n| Transportation          = Carl Zante's Convertible\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * [http://www.marvunapp.com/Appendix/acrobath.htm The Acrobat at the Marvel Appendix]\n}}"
                }
            }
        }
    ],
    "page_id": "12200"
}