{
    "pageid": 336336,
    "ns": 0,
    "title": "Tough Kid Squad (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Tough Kid Squad (Earth-616) from Tough Kid Squad Comics Vol 1 1 0001.jpg\n| Name                    = Tough Kid Squad\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Wally Danger (Earth-616)|Wally Danger]], [[Tom Danger (Earth-616)|Tom Danger]]\n| CurrentMembers          = \n| FormerMembers           = [[Butch (Tough Kid Squad) (Earth-616)|Butch]], [[Derrick Dawes (Earth-616)|Derrick Dawes]], [[Eagle (Tough Kid Squad) (Earth-616)|Eagle]], [[Wally Danger (Earth-616)|Wally Danger]], [[Tom Danger (Earth-616)|Tom Danger]]\n| Allies                  = \n| Enemies                 = [[Doctor Klutch (Earth-616)|Dr. Klutch]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Mike Sekowsky\n| First                   = Tough Kid Squad Comics Vol 1 1\n| Last                    = Tough Kid Squad Comics Vol 1 1\n\n| HistoryText             = The Tough Kids Squad were a group of unlikely friends who decided to group together while attending Westfield High School after various victories playing together on the school football team. Their members included [[Wally Danger (Earth-616)|Wally]] and [[Tom Danger (Earth-616)|Tom Danger]], two recently reunited orphans, football champ [[Derrick Dawes (Earth-616)|Derrick Dawes]], the rough and tumble [[Butch (Tough Kid Squad) (Earth-616)|Butch]], and the Native American known as [[Eagle (Tough Kid Squad) (Earth-616)|Eagle]].\n\nIn their only recorded adventure, the Tough Kid Squad was captured by the evil scientist [[Doctor Klutch (Earth-616)|Dr. Klutch]]. As it turned out, the Danger brothers' late father had injected the boys with a serum that made their bodies physical and mental capabilities always remain at their peak. Klutch, the man responsible for the death of the Danger twins parents, sought to isolate the formula from the boys blood and use it for his own ends. \n\nCapturing the entire squad, Dr. Klutch took them to his hide out, examining the Danger brothers while locking up the others. The Squad broke free, but not before Klutch managed to extract blood from Wally. With Klutch's hideout was set ablaze, the team fled out a secret passage, only to face the newly empowered [[Komba (Earth-616)|Komba]], Klutch's bodyguard whom Klutch had just injected with the Danger blood. In order to save themselves, the group were forced to kill Komba in order to escape the burning house alive. \n\nRecaptured, the group was taken to another one of Klutch's hideouts where he extracted blood from Tom Danger and injected himself with the blood. Empowered by the blood, Klutch put the boys in his \"Vault of Oblivion\", a room with a descending roof that threatened to crush them alive. The boys dug themselves free and overheard Klutch organizing three bank heists at one time. Stealing guns, most of the Squad then held Klutch and his men at arms while Eagle brought the police. In a final battle, the Danger brothers knocked Klutch out with a vial of gas just before the authorities arrive to arrest the crooks.{{r|Tough Kid Squad Comics Vol 1 1}}\n\nSubsequent adventures of the Tough Kid Squad and their ultimate fate remain unrecorded.\n\n| Equipment               = Originally part of a football team, the Tough Kid Squad wore standard football gear that was commonly worn in the 1940's. \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "336336"
}