{
    "pageid": 339992,
    "ns": 0,
    "title": "True Believers (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = True Believers Vol 1 1 Textless.jpg\n| Name                    = [[True Believers]]\n| Aliases                 = \n\n| Status                  = Unknown\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Dreamlovers.com Office, [[New York City]], [[New York (State)|New York]]; True Believers Safe House, Hudson Valley, [[New York (State)|New York]]\n\n| Leaders                 = [[Mavis Trent (Earth-616)|Payback]]\n| CurrentMembers          = [[Ozzie Tanaka (Earth-616)|Battalus]], [[Tayln Roark (Earth-616)|Headtrip]], [[Theo Bomba (Earth-616)|Red Zone]]\n| FormerMembers           = \n| Allies                  = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Anthony Stark (Earth-616)|Iron Man (Tony Stark)]]\n| Enemies                 = [[Hydra (Earth-616)|Hydra]], [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] [[Rupert Vitz (Earth-616)|Surge (Rupert D. Vitz}]]\n\n| Origin                  = A group of counter-culture subversives, so called 'warriors of the information age' who were brought together to expose lies, cover ups and secrets\n| PlaceOfFormation        = [[New York City]], [[New York (State)|New York]]\n| PlaceOfDissolution      = \n| Creators                = Cary Bates; Paul Gulacy\n| First                   = True Believers #1\n| Last                    = True Believers #5\n\n| HistoryText             = The True Believers were a group of 'counter-culture subversives' who were also called 'warriors of the information age'. The group had dedicated themselves to the pursuit and exposure of the truth at all costs and no matter who they had to go up against to ensure they achieved their goals of exposing secrets, lies, cover-ups and conspiracies. They were willing to pit themselves against any government, organisation or superhero.{{r|True Believers Vol 1 2}}\n\nThe group was formed and led by [[Mavis Trent (Earth-616)|Mavis Trent]], an agent of [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] who used her position within that agency to track down those she believes could help her mission to expose her father's murderer, because of their own 'motivations to defy the establishment', as well as her father's last girlfriend due to her power and skills.{{r|True Believers Vol 1 3|4}} Mavis also used her position at S.H.I.E.L.D. to help the team and to ensure that the investigation into them was fed enough disinformation to ensure they were not caught.{{r|True Believers Vol 1 1}} The team exposed several superhero related scandals on their website which attracted them a lot of attention.{{r|True Believers Vol 1 2}}\n\nThe True Believers took down a group of wealthy and influential men who were having sex workers kidnapped, drugged with [[Mutant Growth Hormone]] and [[Wikipedia:Lysergic_acid_diethylamide|LSD]] in a 'bikini fight club', with Mavis herself going undercover to expose them.{{r|True Believers Vol 1 1}} The team then exposed a cover up involving a covered up charge of driving under the influence involving [[Reed Richards (Earth-616)|Reed Richards]], only to learn that the entire thing was a set up by [[Rupert Vitz (Earth-616)|Rupert D. Vitz]] who called himself [[Surge]], a man obsessed with becoming a member of the [[Fantastic Four (Earth-616)|Fantastic Four]] who the team then helped to expose.{{r|True Believers Vol 1 2}}\n\nWhile investigating her fathers computer a bomb went off in his lab, throwing Mavis across the street and knocked into a coma, leading to her then being captured by former [[Hydra (Earth-616)|Hydra]] agents, though she was quickly rescued by the other True Believers. Tayln was able to use her empathic powers to learn that former Hydra agents had been hired by another party to steal information on a bioweapon from Mavis' father as well as rigging his car and lab with bombs. The bioweapon was a neurotoxin called Anathema and it was capable of reversing a person's behaviour, turning [[Antonio Rodriguez (Earth-616)|Armadillo]] from an enraged combatant to a frightened coward for example. The former Hydra agents were planning on selling this weapon to [[Ophelia Sarkissian (Earth-616)|Madame Hydra]], which Mavis heard while still in her coma. Shortly before Mavis woke up, the former Hydra agents were attacked by Madame Hydra for their defection.{{r|True Believers Vol 1 4}}\n\nMavis had learned that S.H.I.E.L.D. were responsible for the Anathema project that her father became a whistleblower to stop and which then led to his death.{{r|True Believers Vol 1 4}} To learn more about the situation, the True Believers kidnapped and used Tayln's powers to question [[Maria Hill (Earth-616)|Maria Hill]], the current Deputy Director of S.H.I.E.L.D., about Anathema which they learned had been developed during the first [[Civil War (Event)|Superhuman Civil War]] and was intended solely for use on [[Steven Rogers (Earth-616)|Captain America (Steve Rogers)]] to get him to stand down and end the fighting, once Rogers stood down by himself the project was shut down and to the best of Maria Hill's knowledge also destroyed. After leaving Hill they were found by [[Anthony Stark (Earth-616)|Tony Stark]], S.H.I.E.L.D.'s Director and [[Iron Man]] at the time, leading to a fight which injured Mavis and knocked Iron Man unconscious. The fight caused a break in Mavis' connection to her symbiote, preventing her from accessing its powers.{{r|True Believers Vol 1 5}}\n\nMavis and the True Believers decided to take a break from their activities, leading Mavis to go and see her supervisor [[Chet Fleming (Earth-616)|Chet Fleming]] for a date. Chet used an experimental cologne to paralyse Mavis and reveal that he had been the one to restart the Anathema project and that when the former Hydra Agents stole her father's work and he wanted to blow the whistle on the project, Chet planted a bomb in his car to kill him and also planted one in his lab to try and kill Mavis. Chet revealed he was going to blow up his home to kill Mavis and pin the murder on Hydra but Mavis was able to recharge her symbiote by jamming a screwdriver into an electrical socket and kill him instead. Iron Man arrived and made no attempt to arrest Mavis, simply asking her not to publish Maria Hill's name when the True Believers published the truth about Chet Fleming on their blog in exchange for setting up the Trent Foundation to offer financial and legal aid to anyone who was harassed or victimised for coming forward to tell the truth. Mavis then continued working with the True Believers.{{r|True Believers Vol 1 5}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "339992"
}