{
    "pageid": 449017,
    "ns": 0,
    "title": "Trustees of Hate (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Trustees of Hate (Earth-616) from Mystic Comics Vol 1 4 0001.jpg\n| Name                    = Trustees of Hate\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Balkan Mountains\n\n| Leaders                 = Formerly [[Volos Teixeira (Earth-616)|Doctor Vortex]]\n| CurrentMembers          = \n| FormerMembers           = [[Volos Teixeira (Earth-616)|Doctor Vortex]] (deceased), [[Character Index/L#Lara|Lara]], [[Weasel (Trustees of Hate) (Earth-616)|Weasel]] (possibly deceased), [[Character Index/L#Lor|Lor]]\n| Allies                  = \n| Enemies                 = [[Spencer Keen (Earth-616)|Blue Blaze]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Harry Douglas\n| First                   = Mystic Comics #4\n| Last                    = Mystic Comics #4\n\n| HistoryText             = The '''Trustees of Hate''' were a group that occupied a castle in the [[Balkan Mountains]] between the nations of [[Borsia]] and [[Gratzia]]. They were led by the evil [[Volos Teixeira (Earth-616)|Doctor Vortex]] who sought to push the two nations into warring with each other for unrevealed reasons. Their members included a thug named [[Weasel (Trustees of Hate) (Earth-616)|Weasel]], female operative [[Character Index/L#Lara|Lara]], and a green skinned executioner named [[Character Index/L#Lor|Lor]]. Those who would oppose them were tossed into a lime pit that was outside of their castle.\n\n[[File:Lara (Trustees of Hate) (Earth-616) from Mystic Comics Vol 1 4 0001.jpg|thumb|left|Lara using the hate ray]]\nTheir evil deeds attracted the hero known as the [[Spencer Keen (Earth-616)|Blue Blaze]] who rose out of the lime, scaring Lor to the point of fainting. Attempting to stop the Trustees' plot, he was held at gun point by Lara. She drove him into Borsia to give the hero a show of the Trustees' powers. Using a special hate ray, she caused Borsia's greatest speaker to break out into an anti-Gratzia tirade, hoping to push the two countries to war.\n\nWith their plot revealed, Lara forced the Blue Blaze to return to the Trustees' castle to be eliminated. The Blue Blaze defended himself; however, the Trustees' minions piled onto the hero, and Dr. Vortex attempted to kill them all by detonating his lab. Only the Blaze survived and was chained to a wall. Seeking to kill the hero still, Vortex allowed one last cigarette; however, the Blue Blaze tricked him into allowing him to activate his blue flame, allowing the Blaze to break free. Then he grabbed Vortex and forced him into the limp pit to a fitting death.\n\nWith the hate ray destroyed, hostilities between the two nations sorted itself out and without their leader the Trustees disbanded.{{r|Mystic Comics Vol 1 4}} Weasel was possibly killed in the lab explosion; the fate of Lor and Lara remain unrevealed.\n\n| Equipment               = The Trustees of Hate had many scientific devices, all were destroyed when Vortex destroyed his lab.\n| Transportation          = The Trustees had at least one car.\n| Weapons                 = The Trustees had access to a natural lime pit to dispose of their enemies, using the lime's natural properties to dissolve human flesh. They also utilized a hate ray, those struck by the rays beam would come to fell uncontrollable urges to hate whatever subject the Trustees suggested. The effects of the rays proved to only be temporary.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "449017"
}