{
    "pageid": 76267,
    "ns": 0,
    "title": "Twelve (WWII) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Twelve Vol 1 12 Textless.jpg\n| ImageSize               = 250px\n| Name                    = The Twelve\n| Aliases                 = \n| Distinguish1            = Twelve\n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          =\n| FormerMembers           = [[Claire Voyant (Earth-616)|Black Widow]], [[Roy Chambers (Earth-616)|Blue Blade]], [[Jeff Jordan (Earth-616)|Captain Wonder]], [[Dynamic Man (Earth-616)|Dynamic Man]], [[Electro (Robot) (Earth-616)|Electro]], [[Jack Castle (Earth-616)|Fiery Mask]], [[Dennis Burton (Earth-616)|Laughing Mask]], [[Earl Everett (Earth-616)|Mastermind Excello]], [[Victor Jay (Earth-616)|Mister E]], [[Dick Jones (Earth-616)|Phantom Reporter]], [[Daniel Rose (Earth-616)|Rockman]], [[Witness (WWII) (Earth-616)|Witness]]\n| Allies                  = [[Philo Zogolowski (Earth-616)|Professor Zogg]]\n| Enemies                 = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Origin                  = \nDuring a raid on Berlin, these adventurers were randomly taken prisoner by the Nazis and held in suspended animation, with the intent of studying them to learn of their abilities as a weapon against the Allies.\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = J. Michael Straczynski; Chris Weston\n| First                   = Twelve #0\n| Last                    = Twelve #12\n\n| HistoryText             = \n\n===1940's===\nTwelve superhumans randomly kidnapped by the Nazis during [[World War II]] in order to study their powers for the Nazis' \"Master Race\" efforts. The superhumans were put in cryonic suspended-animation until the present day, when a construction project in [[Berlin]], [[Germany]] inadvertently uncovers them.{{r|Twelve Vol 1 1}} The series explores the culture shock of people from the 1940's being revived in the present day.\n\n===Modern Times===\nOnce reawakened, the government attempted to delay the shock of now being in the 21st Century for the heroes by recreating a 1940s hospital. The [[Dick Jones (Earth-616)|Phantom Reporter]], however, saw through the ruse as there were several idiosyncrasies that did not make sense to him. The government soon drops the ruse and tells the Twelve the truth. They tell them that they would like them to become government operatives, but are willing to give them a year to get acquainted with the world they now find themselves in before making a decision. In the meantime, the military purchases a mansion for them to live in as they become adjusted to the 21st Century.{{r|Twelve Vol 1 1}} \n\nThe Twelve attempt to adjust to modern life in various ways: The [[Roy Chambers (Earth-616)|Blue Blade]] becomes a entertainer and celebrity;{{r|Twelve Vol 1 5}} the [[Dick Jones (Earth-616)|Phantom Reporter]] continues his career in the newspaper industry and starts a column for the [[Daily Bugle]],{{r|Twelve Vol 1 3}} [[Dynamic Man (Earth-616)|Dynamic Man]] starts to work again with the [[Federal Bureau of Investigation (Earth-616)|FBI]] and other law-enforcement agencies;{{r|Twelve Vol 1 2}} the [[Claire Voyant (Earth-616)|Black Widow]] reconnects as the \"Instrument of Vengeance\" for an unknown party and begins to go on missions again;{{r|Twelve Vol 1 3}} and the powerful [[Daniel Rose (Earth-616)|Rockman]] becomes distraught over being cut off from an underground Kingdom of Abyssmia that may or may not exist. He spends his time pounding the floor in the basement of the mansion where they are housed.{{r|Twelve Vol 1 2}} On ballistics evidence, police arrest the [[Dennis Burton (Earth-616)|Laughing Mask]] for a 1940's murder.{{r|Twelve Vol 1 5}} [[Victor Jay (Earth-616)|Mister E]] is shunned by his family and Jewish community for hiding his ethnic background.{{r|Twelve Vol 1 3}} The [[Witness (WWII) (Earth-616)|Witness]] continues his battle with crime.{{r|Twelve Vol 1 5}} [[Jeff Jordan (Earth-616)|Captain Wonder]] has lost his family and friends but continues fighting crime and helping people.{{r|Twelve Vol 1 5}} [[Earl Everett (Earth-616)|Mastermind Excello]] uses his vast wealth which has accumulated due to compound interest to retire in a mansion in upstate New York. Not much is known about the [[Jack Castle (Earth-616)|Fiery Mask]], other than carrying guilt over the way he acquired his powers, but he was seen helping other heroes fight crime.{{r|Twelve Vol 1 9}}\n \nIn addition, [[Elizabeth Zogolowski (Earth-616)|Elizabeth Zogolowski]], the daughter of the creator of [[Electro (Robot) (Earth-616)|Electro]] reclaims possession of the robot. In order to increase the ratings of his faltering show, the [[Roy Chambers (Earth-616)|Blue Blade]] contacts Ms. Zogolowski and asks her to consider letting him use Electro on his show. She agrees, but when the Blade attempts to use its remote controlling equipment he inadvertently downloads Electro's recent memories to his own mind, learning a terrible secret in the process.{{r|Twelve Vol 1 8}} The [[Roy Chambers (Earth-616)|Blue Blade]] attempts to blackmail [[Dynamic Man (Earth-616)|Dynamic Man]] with this secret, but is later killed by a remotely accessed Electro. Investigating the crime scene, the [[Dick Jones (Earth-616)|Phantom Reporter]] is told by [[Elizabeth Zogolowski (Earth-616)|Ms. Zogolowski]] that the Blue Blade had learned something important when remotely accessing Electro, so he does the same. The connection is unexpectedly broken early, causing the [[Dick Jones (Earth-616)|Phantom Reporter]] to go unconscious, but when he wakes up he believes he has learned the secret that cost the Blade his life.{{r|Twelve Vol 1 9}} He gathers together all the remaining members of the group to tell them what he's learned. He attests that Dynamic Man is actually an android whose robotic mind connected with that of Electro while the group were in cryogenic suspension, establishing a remote connection. He believes that Dynamic Man was then able to use the robot to destroy those things that were a moral affront to him, such as a gay bar downtown, without drawing any suspicion to himself. When the Blue Blade discovered this secret, he tried to blackmail Dynamic Man, prompting the android to kill him. The Phantom Reporter then has [[Jack Castle (Earth-616)|Fiery Mask]] burn off Dynamic Man's costume, revealing an artificial body with no genitals.{{r|Twelve Vol 1 10}} Dynamic Man vows to kill the group, destroying their mansion before taking off. Rockman is able to hold up the building long enough to let the others escape before it collapses on him. Mastermind Excello, Captain Wonder, Phantom Reporter and Fiery Mask all track Dynamic Man back to the castle where he was created. During the ensuing battle, Dynamic Man kills Fiery Mask, who transfers his power to the Phantom Reporter. He then uses his newfound power to melt Dynamic Man into slag, though he also badly burned the right side of Captain Wonder's face and body.{{r|Twelve Vol 1 11}} After Dynamic Man is destroyed, the rest of the members begin to move on and find their own paths. The Phantom Reporter and Black Widow join Mastermind Excello, who buys the world's largest private investigation firm, in an effort to make the world a better place.{{r|Twelve Vol 1 12}} \n\n==The Twelve==\n* [[Roy Chambers (Earth-616)|Blue Blade]] - (Roy Chambers)\n* [[Claire Voyant (Earth-616)|Black Widow]] - (Claire Voyant)\n* [[Witness (WWII) (Earth-616)|Witness]] - (Unkown)\n* [[Jack Castle (Earth-616)|Fiery Mask]] - (Jack Castle)\n* [[Dennis Burton (Earth-616)|Laughing Mask]] - (Dennis Burton)\n* [[Dick Jones (Earth-616)|Phantom Reporter]] - (Dick Jones)\n* [[Victor Jay (Earth-616)|Mister E]] - (Victor Jay)\n* [[Daniel Rose (Earth-616)|Rockman]] - (Daniel Rose)\n* [[Earl Everett (Earth-616)|Mastermind Excello]] - (Earl Everett)\n* [[Jeff Jordan (Earth-616)|Captain Wonder]] - (Jeff Jordan)\n* [[Dynamic Man (Earth-616)|Dynamic Man (Android)]] - (alias Curt Cowan)\n* [[Electro (Robot) (Earth-616)|Electro (Robot)]]\n\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Allied Organizations]]"
                }
            }
        }
    ],
    "page_id": "76267"
}