{
    "pageid": 10105,
    "ns": 0,
    "title": "U-Foes (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = U-Foes (Earth-616) from Amazing Spider-Man Vol 5 75 001.jpg\n| ImageSize               = 250px\n| Name                    = U-Foes\n| Aliases                 = North Carolina (State)'s team{{r|Siege: Storming Asgard - Heroes & Villains #1}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[North Carolina (State)|North Carolina]]\n\n| Leaders                 = [[Simon Utrecht (Earth-616)|Vector]] \n| CurrentMembers          = [[Michael Steel (Earth-616)|Ironclad]], [[Ann Darnell (Earth-616)|Vapor]], [[James Darnell (Earth-616)|X-Ray]]\n| FormerMembers           = \n| Allies                  = {{m|Alpha Flight (Space Program) (Earth-616)|Alpha Flight Space Program}}, [[Henry Gyrich (Earth-616)|Henry Gyrich]]; formerly [[H.A.M.M.E.R. (Earth-616)|H.A.M.M.E.R.]], {{m|50-State Initiative (Earth-616)|Initiative}}, [[Hood's Gang (Earth-616)|Hood's army]], [[Eshu (Earth-616)|Master of the World]], [[Samuel Sterns (Earth-616)|Leader]], [[Masters of Evil (Earth-616)|Masters of Evil]], {{m|Army of Evil (Earth-616)|Army of Evil}}\n| Enemies                 = [[Spider-Man (Peter Parker)|Spider-Man]], [[Secret Avengers (Black Ops Unit) (Earth-616)|Secret Avengers]], [[Bruce Banner (Earth-616)|Hulk]], [[New Warriors (Earth-616)|New Warriors/Avengers Resistance]], [[Heroes for Hire]], [[Avengers West Coast (Earth-616)|West Coast Avengers]], [[Daniel Rand (Earth-616)|Iron Fist]], [[Avengers (Earth-616)|Avengers]], [[Jennifer Walters (Earth-616)|She-Hulk]], [[Christopher Powell (Earth-616)|Darkhawk]], [[Eugene Thompson (Earth-616)|Agent Venom]] \n\n| Origin                  = Voluntary cosmic-ray induced powers\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Bill Mantlo; Sal Buscema\n| First                   = Incredible Hulk #254\n\n| HistoryText             = \n[[File:U-Foes (Earth-616) from Heroes for Hire Vol 1 1 0001.jpg|thumb|left]]\n===Origin===\nIn an attempt to duplicate the creation of the [[Fantastic Four (Earth-616)|Fantastic Four]], these four power-hungry individuals went to great lengths to copy the accident that created the FF, even hiring the engineers responsible for creating the original shuttle to try and copy it exactly. The attempt succeeded, but the 'project' was interrupted by [[Bruce Banner (Earth-616)|Bruce Banner]], who discovered their ground control facility and was able to bring the shuttle down because he thought it had been exposed to the cosmic radiation by accident. Despite gaining power, the four immediately attacked Banner once they landed, believing they could have gained even more power if he hadn't interfered, but were defeated when Banner transformed into the Hulk, their new powers no match for Banner's raw strength and their lack of coordination as a team. They were defeated on this occasion, but went on to become the super-criminals known as the U-Foes.{{r|Incredible Hulk Vol 1 254}}\n\nThe U-Foes escaped from the [[Raft]] when [[Maxwell Dillon (Earth-616)|Electro]] instituted a mass prison break.{{r|New Avengers Vol 1 1|2}}\n\n===Dark Reign===\nThe U-Foes became a part of [[Norman Osborn (Earth-616)|Norman Osborn]]'s new [[50-State Initiative (Earth-616)|Initiative]] as the team for the state of [[North Carolina (State)|North Carolina]],{{r|Avengers: The Initiative Vol 1 26}} proving themselves loyal to both [[Hood's Gang (Earth-616)|Hood's army]] and Initiative.{{r|Siege: Storming Asgard - Heroes & Villains Vol 1 1}}\n\n===Siege===\nThe U-Foes later play a role in the beginning of Siege. Norman Osborn sent them to fight Volstagg. The resulting clash led to Volstagg destroying [[Soldier Field]] and giving Osborn the event necessary to start his war with Asgard. They were also among the first of Norman Osborn's forces during the start of the battle. They along with Osborn and his forces were eventually defeated by a large alliance of heroes.{{r|Siege Vol 1 1|4}}\n\n===Immortal Hulk===\nWhen [[Gamma Flight (Alpha Flight Space Program) (Earth-616)|Gamma Flight]], who were supposed to go after the Hulk, quit due to obnoxious behavior of their boss [[Henry Gyrich (Earth-616)|Henry Gyrich]], Gyrich hired the U-Foes to go after the Hulk in exchange for full pardons for their past crimes.{{r|Immortal Hulk Vol 1 42}}\n\nWhen Hulk popped up while hiding in [[New York City]], the U-Foes attacked him and took turns fighting him. The fight was temporarily halted when Vector accidentally sent Hulk flying to [[New Jersey (State)|New Jersey]] with his telekinesis. After finding Hulk, X-Ray hit Hulk with anti-gamma rays that eventually killed him.{{r|Immortal Hulk Vol 1 43|44}}\n\nHowever, the anti-gamma rays had the unexpected effect of turning Hulk's Joe Fixit persona into a [[Red Hulk]], allowing him and the Savage Hulk persona to escape the [[Below-Place]]. Hulk then resurrected fully repowered.{{r|Immortal Hulk Vol 1 45}} With his restored strength, Hulk badly injured Ironclad. When Vapor turned into sulfuric gas in an attempt to stop him, Hulk turned the gas on Vector, blinding him. In a panic, Vector sent Hulk away all the way to Manhattan with telekinesis. Gyrich later lambasted the team for letting Hulk get away while X-Ray and Vapor put the blame on Gyrich because his retrieval team took too long to arrive.{{r|Immortal Hulk Vol 1 46}}\n\n==Line-up==\n* [[Simon Utrecht (Earth-616)|Vector (Simon Utrecht)]] was an industrialist and politician who craved more power. He used his resources to copy everything about the Fantastic Four's flight into space, and hired a crew in the hopes of gaining superpowers. Vector gained the power of Telekinesis from cosmic rays . Enormously powerful, as by focusing his power into blasts he was even capable of flaying most of the Hulk's skin and muscle tissue from his body. Also capable of flight.\n* [[Ann Darnell (Earth-616)|Vapor (Ann Darnell)]] was hired by Simon Utrecht to be the life-support engineer on his space ship. Ann Darnell is Jimmy Darnell's older sister. Vapor has the ability to alter her form into any known gas, usually the most lethally poisonous she can imagine while invading an opponent's body. Vapor can transform into her fully human state for only brief periods.\n* [[James Darnell (Earth-616)|X-Ray (Jimmy Darnell)]] was hired by Simon Utrecht  to be the fuel-propulsion systems engineer. X-Ray has been permanently transformed into a living energy field, intangible and immune to most physical harm. Has the power to expel various forms of heavy radiation in the form of very potent blasts, shown capable of hurting even the Hulk. X-Ray has the ability to fly and  turn invisible. X-Ray is able to emit negative-gamma rays that turn the Hulk back into Bruce Banner, but this is only effective so long as he is conscious.\n* [[Michael Steel (Earth-616)|Ironclad (Michael Steel)]] was hired by Simon Utrecht  as he is a skilled scientist, engineer, and skilled pilot. Ironclad has been permanently transformed into organic metal. Steel has superhuman strength, durability, and the ability to increase or decrease his own weight, hovering in the air or crushing like a mountain.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * The team name is based on the intended acronym of UFO. Which is more commonly pronounced as you-foe, an initialization.{{citation}}\n| Links                   = *http://en.wikipedia.org/wiki/U-Foes\n}}\n[[Category:50-State Initiative]]"
                }
            }
        }
    ],
    "page_id": "10105"
}