{
    "pageid": 846212,
    "ns": 0,
    "title": "Ultimates (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Ultimates 2 Vol 2 2 Rudy Variant Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Ultimates]]\n| EditorialNames          = Ultimates²\n| Aliases                 = Ultimates Program{{r|Ultimates Vol 3 8}}\n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Worldship (Taa II)|Taa II]]; [[Triskelion]], [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = [[America Chavez (Earth-616)|Ms. America]]\n| CurrentMembers          = [[T'Challa (Earth-616)|Black Panther]], [[Adam Brashear (Earth-616)|Blue Marvel]], [[Carol Danvers (Earth-616)|Captain Marvel]], [[America Chavez (Earth-616)|Ms. America]], [[Monica Rambeau (Earth-616)|Spectrum]]\n| FormerMembers           = \n| Allies                  = [[Galan (Earth-616)|Galactus]], [[Ami Han (Earth-616)|White Fox]], [[Conner Sims (Earth-616)|Anti-Man]], [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight Space Program]], [[A-Force (Earth-616)|A-Force]], [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]], [[Raz Malhotra (Earth-616)|Giant-Man]]\n| Enemies                 = [[Celestial Destructor's Servitors (Earth-616)|Celestial Destructor's Servitors]], [[Hydra (Earth-616)|Hydra]], [[Bruce Banner (Earth-69413)|Maestro]], [[Symbioids]], [[Thanos (Earth-616)|Thanos]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Al Ewing; Kenneth Rocafort\n| First                   = Avengers Vol 6 0\n\n| HistoryText             = \n\n{{Quote|We're the '''Ultimates'''. The ultimate '''team''', to solve the ultimate '''problems.'''|[[Carol Danvers (Earth-616)|Captain Marvel]]|Ultimates Vol 3 1}}\n\n===Origin===\nThe Ultimates originated from [[Carol Danvers (Earth-616)|Captain Marvel]]'s proposal of a proactive task force with the purpose of looking into potential threats and solve them before they could become a problem to [[Earth]], applying nonviolent solutions whenever possible. After consulting the project with [[T'Challa (Earth-616)|Black Panther]], Captain Marvel was directed to another potential member, [[Adam Brashear (Earth-616)|Blue Marvel]], a hero experienced in cosmic-level threats, who in turn recommended the addition of [[Monica Rambeau (Earth-616)|Spectrum]], a powerhouse with high-level of super hero strategy. The final proposed member was [[America Chavez (Earth-616)|Ms. America]], suggested by Spectrum due to her knowledge in cosmic territory.{{r|Ultimates Vol 3 8}}\n\n===The Outside===\nOne of the Ultimates' first missions involved the threat of Galactus' hunger. To solve this problem, they confronted Galactus by trapping him inside his old [[Lifebringer One (Item)|Incubator]] and used a similar process that was used to create him, but using Neutronium to accelerate it. After a flash of light and the Incubator's destruction, Galactus emerged anew with a new purpose in life, he became a lifebringer. The first planet that Galactus restored was Archeopia, which had been the very same first victim of his hunger.{{r|Ultimates Vol 3 1|2}}\n\nDuring an ensuing mission to exit the [[Omniverse]] to attempt to assess any damage caused to the structure of the time by the abuse of time travel, the Ultimates encountered the [[Conner Sims (Earth-616)|Anti-Man]] trapped within the [[Exo-Space|Neutral Zone]].{{r|Ultimates Vol 3 3}} Blue Marvel attempted to kill him, partially in revenge for the death of his wife, but his son [[Kevin Brashear (Earth-616)|Kevin]] stopped him. Instead, the Anti-Man was rescued and the Ultimates brought him in their continuing journey.{{r|Ultimates Vol 3 4}} When their ship, the [[Abeona]], was destroyed barely before reaching their objective, the Ultimates were saved by Galactus. Galactus stopped them, and returned them home after the Anti-Man reached a state of hyper-cosmic awareness, as Galactus wished for them not to see the full scope of reality, which would've been too much for them to bear.{{r|Ultimates Vol 3 5}}\n\n===Civil War II===\nSoon after returning home, the Ultimates became involved in the [[Civil War II|second superhuman Civil War]], provoked by the appearance of an [[Inhumans (Inhomo supremis)|Inhuman]] named [[Ulysses Cain (Earth-616)|Ulysses Cain]] with the ability to profile the future. Ms. America adamantly opposed Captain Marvel's initiative to actively use Ulysses to proactively fight crime, while the rest of the Ultimates supported her, to a certain degree. The difference of opinions led to physical conflict between the Ultimates.{{r|Ultimates Vol 3 10}} During this brawl, the Anti-Man escaped custody and fled.{{r|Ultimates Vol 3 11}} Black Panther eventually also publicly disavowed Captain Marvel's actions and joined [[Anthony Stark (Earth-616)|Iron Man]]'s faction that opposed predictive justice.{{r|Civil War II Vol 1 6}}\n\nThe team was terminated as a consequence of these altercations, which were reported by [[Philip Nelson Vogt (Earth-616)|Philip Nelson Vogt]], leader of the [[Troubleshooters (Earth-616)|Troubleshooters]] and federal agent who was tasked to covertly monitor the Ultimates' activities.{{r|Ultimates Vol 3 12}}\n\n===Cosmic Jailer===\nThe members of the Ultimates were assembled once again in secrecy by Ms. America at the request of Galactus to serve as his heralds together with Anti-Man and investigate the mystery of who had chained [[Eternity (Multiverse)|Eternity]].{{r|Ultimates 2 Vol 2 1}} While Galactus was facing his own tribulations at the hands of [[Lord Chaos (Earth-616)|Lord Chaos]] and [[Master Order (Earth-616)|Master Order]], who went as far as merging into [[Logos (Cosmic Entity) (Earth-616)|Logos]] in an attempt to become the Multiverse's new ruling cosmic being, the Ultimates were confronted by the Troubleshooters, who had grown suspicious of Black Panther and Captain Marvel's activities and followed their trail to Galactus' ship.{{r|Ultimates 2 Vol 2 3}}\n\nTroubleshooter [[Simon Rodstvow (Earth-616)|Simon Rodstvow]] revealed his true form, that of a servant of Eternity's Cosmic Jailer, and revealed that Logos had turned Galactus back in a devourer,{{r|Ultimates 2 Vol 2 5}} albeit one whose hunger had no limit and would only siphon all energy and life until there was only his master, Eternity's cosmic jailer, the [[First Firmament (First Cosmos)|First Firmament]] and embodiment of the original universe that had existed before the [[Multiverse]]. Anti-Man sacrificed himself to restore Galactus to his form of the Lifebringer, and the Troubleshooters summoned the [[Emmett Proudhawk (Earth-616)|Psi-Hawk]] to defeat Rodstvow. Galactus subsequently dismissed the Ultimates until he would require their services again after resting.\n\nThe team-up between the Ultimates and the Troubleshooters opened the doors to a permanent alliance in order to stop the First Firmament. The Ultimates were officially absorbed into [[Alpha Flight (Space Program) (Earth-616)|Alpha Flight]], being reinstated as an openly sanctioned team.{{r|Ultimates 2 Vol 2 6}}\n\n===Eternity War===\nAs the Ultimates were helping Alpha Flight defend itself from an intermittent wave of [[Chitauri]] invaders, Galactus had them teleported to the [[Counter-Earth (High Evolutionary)|Counter-Earth]], where the [[Reed Richards (Earth-1610)|Maker]] had used the [[Herbert Wyndham (Earth-616)|High Evolutionary]]'s machines to disrupt and bring down the [[Superflow]], the space that separated universes from each other, in a foolish attempt to strengthen Eternity by merging all the universes that composed it into a single one.{{r|Ultimates 2 Vol 2 9}} However, said process proved to be counterproductive, as it actually made it easier for the First Firmament to consume Eternity.\n\nBefore getting into fixing the detriment caused by the Maker, the Ultimates had to confront [[Ultimates (Earth-1610)|their namesake]] team from the defunct [[Earth-1610|Ultimate Universe]], who had been brought back to life by the Maker. Eventually, both teams realized they shouldn't be fighting each other. Following the Maker's defeat at the hands of Spectrum and the High Evolutionary, both teams turned their attention to restoring the Multiverse to its normal state. Using the nanites from his armor, [[Antonio Stark (Earth-1610)|Iron Man]] managed to interface with the High Evolutionary's technology, which had been advanced beyond its creator's understanding by the Maker. Spectrum subsequently used her powers to link the minds of both teams of Ultimates, with the combined brain power managing to control the technology and revert the Maker's endeavour.\n\nDoing so allowed Eternity to break free from the First Firmament, giving Galactus and his [[Eternity Watch (Earth-616)|Eternity Watch]] the chance to defeat the [[Aspirants]] and [[Logos (Cosmic Entity) (Earth-616)|Logos]]. Eternity subsequently summoned the embodiments of the past Multiverses to his aid. These \"[[Ultimates (Multiverse)|Ultimate Ultimates]]\" chained the First Firmament and took it away to another plane of existence in hopes to heal him. With Eternity rescued, Galactus and the Ultimates bid farewell, and parted their own ways.{{r|Ultimates 2 Vol 1 100}}\n\n| Equipment               = \n| Transportation          = Formerly the [[Abeona]]\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Carol Danvers (Earth-616)/Quotes]]"
                }
            }
        }
    ],
    "page_id": "846212"
}