{
    "pageid": 15643,
    "ns": 0,
    "title": "Undying (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Undying (Earth-616) from All-New Official Handbook of the Marvel Universe A to Z Vol 1 12 001.jpg\n| Name                    = Undying\n| Aliases                 = \n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = [[Aentaros (Earth-616)|Aentaros]], Lothan, [[Semijan (Earth-616)|Semijan]], Tiamet, Vaudois\n| FormerMembers           = \n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Robert Weinberg; Michael Ryan\n| First                   = Cable Vol 1 79\n| Last                    = \n\n| HistoryText             = Unable to leave their own world due to their extremely fragile bodies, an alien race of super-scientists known as the Serayn created a group of five energy beings which they could send to other planets in order to learn everything they could about other races. They also created an artificial intelligence program called Azazel to control the energy beings' spaceship.\n\nThe energy beings, who became known as the Undying, were created with the ability to meld their energy field with the mind of any living creature. Once an Undying gained control of a host body, it could only be released by the host's death, after which the Undying fed off of the victim's final energy released in its death throes. The Undying were also created with no sense of right or wrong, and they ultimately turned on their creators to satiate their unquenchable thirst for death. After a thousand years, the Serayn were annihilated.\n\nFor millions of years, the Undying roamed the universe, devouring the death energies of a multitude of lifeforms. Growing bored of this, the Undying started a competition, aided and judged by Azazel, in which whoever killed the most lifeforms won. Each match would last up to ten thousand years or until all life on a given planet was destroyed.\n\nThe Undying`s ship eventually landed on Earth. Semijan possessed the mutant named Randall Shire, a mutant with the ability to project his emotions to nearby people whenever he spoke. Semijan`s presence boosted Shire`s power to astonishing levels, causing anyone who heard his voice to become his slave. Using Shire, Semijan planned to conquer the world and win the contest. However, Azazel wanted to level the playing field by using Aentaros as Semijan`s executioner, but the mutant hero Cable intervened during one of Aentaros' attempts to kill the Semijan-possessed Shire.\n\nAttempting revenge, Aentaros possessed a number of people in order to battle Cable directly, namely the mutant mercenary Blockade, Cable`s associate, Irene Merryweather, and Cable's former partner Domino. Each time, Aentaros was thwarted by Cable.\n\nCable then located the Undying's lair in the Sinai desert, and with Shire's former bodyguard Wall, and his then-teammates from the X-Men, Phoenix and the Beast, he fought the Undying. Shire`s former assistant Key managed to defeat the Undying by reprogramming Azazel to only allow the Undying to possess the bodies of common cockroaches.\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = * Danny Wall's Unofficial Handbook to the Marvel Universe\n}}"
                }
            }
        }
    ],
    "page_id": "15643"
}