{
    "pageid": 344922,
    "ns": 0,
    "title": "Unholy Legion (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Unholy Legion (Earth-616) from Captain America Comics Vol 1 4 0001.jpg\n| Name                    = Unholy Legion\n| Aliases                 = Legion of Beggars\n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formerly [[Herr Snupp (Earth-616)|Herr Snupp]]\n| CurrentMembers          = \n| FormerMembers           = Herr Snupp, unnamed members\n| Allies                  = [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Enemies                 = [[Steven Rogers (Earth-616)|Captain America]], [[James Buchanan Barnes (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Joe Simon; Jack Kirby\n| First                   = Captain America Comics Vol 1 4\n| Last                    = Captain America Comics Vol 1 4\n\n| HistoryText             = [[File:Herr Snupp (Earth-616) from Captain America Comics Vol 1 4 0001.jpg|thumb|left|194px|Herr Snupp]]\nThe Unholy Legion were a group of [[National Socialist German Workers Party (Earth-616)|Nazi]] spies that infiltrated the United States in the 1940's. Posing as homeless people, they could identify themselves with the \"Mark of Hitler\", a swastika branded on their chests. They were led by the sadistic [[Herr Snupp (Earth-616)|Herr Snupp]], and they were charged with gathering money as homeless individuals to fund their subversive efforts and use specially prepared means to eliminate military officials.\n\nThey assassinated noted labor leader John L. Green while giving a speech at a seminar. Another killed two munitions manufacturers with poison apples. After another body was pulled out of the Hudson River, officials were at a loss to explain the series of strange murders. \n\nWhile out on a stroll, [[Steven Rogers (Earth-616)|Steve Rogers]] and [[James Buchanan Barnes (Earth-616)|Bucky]] spotted a seemingly legless homeless man get up and run off upon hearing nearby church bells. Steve sent Bucky to follow after him. Seeing a legion of seemingly homeless people run into a nearby church, Bucky disguised himself as a panhandler to investigate further.\n\nHe was soon discovered when he failed to show the Mark of Hitler and was forced to watch as they branded an [[Federal Bureau of Investigation (Earth-616)|FBI]] agent with their swastika brand. Before they could do the same to Bucky, Captain America arrived, and in the ensuing battle, Bucky forced all the Nazi spies to stand down with a Gatling gun. Herr Snupp fled the scene, followed by Captain America and Bucky. Snupp arrived at a hidden Nazi U-Boat; however, the pair fought their way aboard and forced Snupp to flee back to the mainland. Freeing his captured fellows, they tried once more to defeat Captain America and Bucky but were beaten into submission and turned over to the authorities.{{r|Captain America Comics Vol 1 4}}\n\n| Equipment               = The Unholy Legion would equip themselves with fake crutches and blind mans glasses and other implements to pose as homeless men.\n| Transportation          = \n| Weapons                 = They had a number of weapon disguised as common implements common to homeless men such as  guns disguised as crutches, and poisoned apples. Herr Snupp used a branding iron to mark his minions and his enemies with the swastika. \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "344922"
}