{
    "pageid": 1290565,
    "ns": 0,
    "title": "United States Hulk Operations (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Immortal Hulk Vol 1 26 Textless.jpg\n| Name                    = United States Hulk Operations\n| Aliases                 = Shadow Base\n\n| Leaders                 = Formerly [[Bruce Banner (Earth-616)|The Hulk]], [[Reginald Fortean (Earth-616)|Gen. Reginald Fortean]]\n| CurrentMembers          = \n| FormerMembers           = [[Jeffrey Clive (Earth-616)|Dr. Jeff Clive]], [[Carl Burbank (Earth-616)|Bushwacker]], [[Carl Creel (Earth-616)|Absorbing Man]], [[Reginald Fortean (Earth-616)|Gen. Reginald Fortean]], Euler, Cortez, [[Elizabeth Ross (Earth-616)|Betty Ross-Banner]], [[Charlene McGowan (Earth-616)|Dr. Charlene McGowan]], [[Monitor Team (Earth-616)|Monitor Team]], [[Leonard Samson (Earth-616)|Doc Samson]], [[Richard Jones (Earth-616)|Rick Jones]] unnamed others\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Avengers (Earth-616)|Avengers]]\n| Enemies                 = [[Gamma Flight (Alpha Flight Space Program) (Earth-616)|Gamma Flight]], the [[Samuel Sterns (Earth-616)|Leader]]; formerly [[Bruce Banner (Earth-616)|Hulk]], [[Leonard Samson (Earth-616)|Doc Samson]], [[Elizabeth Ross (Earth-616)|Betty Ross]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = [[Shadow Base Site G]]; formerly [[Area 51|Shadow Base Site B]]; [[Shadow Base Site A]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = [[Shadow Base Site G]]\n\n| Creators                = Al Ewing; Lee Garbett\n| First                   = Immortal Hulk Vol 1 6\n\n| Overview                = The United States Hulk Operations, also known as '''Shadow Base''', was a clandestine U.S. Military organization tasked with hunting down the [[Bruce Banner (Earth-616)|Hulk]] and his allies.{{r|Immortal Hulk Vol 1 6}}\n| History                 = \n===Formation===\nShadow Base was established by [[Reginald Fortean (Earth-616)|Gen. Reginald Fortean]] after the [[United States Department of Defense (Earth-616)|Department of Defense]] and [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] failed to retaliate against the Hulk after he seemingly killed [[Thaddeus Ross (Earth-616)|Gen. Thaddeus \"Thunderbolt\" Ross]] in battle.{{r|Immortal Hulk Vol 1 21}} Ross entrusted the command of Shadow Base to Fortean in an effort to maintain plausible deniability. Fortean believed that in order to fight monsters, they would need monsters on their side. They closely monitored the Hulk's allies.{{r|Immortal Hulk Vol 1 6}}\n\n===Early Confrontations===\nAs part of their mission, Shadow Base captured a [[Glossary:Gamma Mutates|gamma mutate]] named [[Delbert Frye (Earth-616)|Del Frye]] and brought him to their [[Shadow Base Site A|headquarters]] for study. Base scientists indicated that to fully understand [[Glossary:Gamma Radiation|gamma radiation]] and create more beings like Frye, they needed to study an actual Hulk. Fortean used his influence to send the [[Avengers (Earth-616)|Avengers]] after the Hulk, which resulted in Bruce Banner's death and capture. Banner's corpse was cut up and his various parts places in separate jars, but the Hulk eventually pulled himself back together and killed head researcher [[Jeffrey Clive (Earth-616)|Dr. Jeffrey Clive]] before escaping. An increase in public notoriety in the wake of the Avengers fight with the Hulk forced Fortean to relocate operations to [[Area 51|Site B]].{{r|Immortal Hulk Vol 1 6|8}}\n\nAgents [[Carl Burbank (Earth-616)|Bushwacker]] and [[Carl Creel (Earth-616)|Absorbing Man]] were sent to find and kill the Hulk following his escape, ultimately cornering him at the abandoned [[Los Diablos Missile Base]]. The mission proved disastrous when an entity called the [[One Below All (Multiverse)|One Below All]] took possession of Creel's body and sent Hulk, Creel, Burbank, as well as members of [[Gamma Flight (Alpha Flight Space Program) (Earth-616)|Gamma Flight]], to [[Below-Place|Hell]].{{r|Immortal Hulk Vol 1 9}}\n\n===Abomination===\nShadow Base resumed their experiments and pursuit of the Hulk upon the latter's return from Hell. Bushwacker tracked Banner to [[Elizabeth Ross (Earth-616)|Betty Ross']] home in California. Disobeying a direct order not to engage, Bushwacker shot at Bruce, but accidentally hit Betty by mistake, killing her. The ensuing fight between the Hulk and Bushwacker was stopped by the sudden appearance of [[Leonard Samson (Earth-616)|Doc Samson]]. Meanwhile, Shadow Base dug up the body of [[Richard Jones (Earth-616)|Rick Jones]] and grafted [[Gamma-Activated Tissue|genetic material]] recovered from [[Emil Blonsky (Earth-616)|Emil Blonsky]] onto it, turning Rick into a new Abomination.\n\nHulk and Samson tracked Rick’s body to the now abandoned Site A where they were ambushed by Bushwacker. Hulk was doused with high levels of UV radiation and forcibly turned back into Banner, and shot in the stomach. The combination of these two events allowed the Joe Fixit personality to emerge in Banner’s body. Through some quick thinking, Joe absorbed massive amounts of gamma radiation and transformed into a giant, multi-headed Hulk and destroyed Site A, seemingly killing Bushwacker in the process.{{r|Immortal Hulk #14|17}}\n\nShadow Base deployed the Abomination to [[Reno (Nevada)|Reno]], [[Nevada (State)|Nevada]], where Banner was attempting to lay low. The Abomination killed two civilians before engaging in battle with the Hulk, all while Fortean watched from a camera embedded in the Abomination's head. Fortean also sent mercenaries in an effort to contain the civilians. The situation grew grew out of control with the arrival of [[Jacqueline McGee (Earth-616)|Jackie McGee]] and Betty, who, due to here status as a [[Glossary:Gamma Mutates|gamma mutate]], revived from death in her Harpy form, albeit with red plumage instead of green. After a vicious between the three gamma beings and Shadow Base forces, Fortean called in air support in the form of two [[War-Wagon|War-Wagons]]. Harpy and Hulk teamed up to take down the Wagons and successfully separated Rick from the Abomination tissue. Fortean pulled all units back when Gamma Flight arrived on the scene.{{r|Immortal Hulk #18|20}}\n\nGamma Flight took possession of the [[Qlippoth|shell-like]] Abomination tissue and brought it to their [[Alpha Flight Low-Orbit Space Station|space station]] for further study. Fortean, clad in [[Redeemer Armor]], translocated on board the station and forcibly retrieved it. Fortean returned it to Shadow Base scientists and ignored warnings not to touch it with his bare hands. As he approached, the tissue suddenly became animated and lunged at him, completely enveloping him, and transforming him into the monster.{{r|Immortal Hulk #21}}\n\nFortean and his forces were later confronted by Gamma Flight first and then the Hulk and his allies, leading to a battle between them. Fortean personally battled Hulk and disfigured him with acid spray. However, the Abomination tissue caused to lose control and kill two of his own men. [[Charlene McGowan (Earth-616)|Dr. Charlene McGowan]], head of the science division, decided that Fortean was no longer fit to command and relieved him of his duties. Despite that, Fortean continued to battle Hulk, resulting in both killing each other. They were sent to the [[Below-Place]] where Banner finally finished Fortean by breaking his neck. After resurrecting, Hulk decided to take command of the Hulk Operations with Samson acting as a moderating force.{{r|Immortal Hulk #22|24}}\n\nAfter Hulk was apprehended by [[Gamma Flight (Alpha Flight Space Program) (Earth-616)|Gamma Flight]] and [[Shadow Base Site G]] came under attack by Del Frye and Rick Jones, who were both under the control of the [[Samuel Sterns (Earth-616)|Leader]], Hulk Operations disbanded and Shadow Base was abandoned.{{r|Immortal Hulk Vol 1 37|41}}\n| Equipment               = \n| Transportation          = [[War-Wagon|War-Wagons]]\n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:American Organizations]]"
                }
            }
        }
    ],
    "page_id": "1290565"
}