{
    "pageid": 1338905,
    "ns": 0,
    "title": "Unparalleled (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Unparalleled (Earth-616) from Fantastic Four Vol 6 15 001.jpg\n| ImageSize               = 250px\n| Name                    = Unparalleled\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Hall of Heroes]], [[Hightown (Capital City)|Hightown]], [[Capital City]], [[Spyre]]\n\n| Leaders                 = [[Revos (Earth-616)|Overseer]]\n| CurrentMembers          = [[Belter (Earth-616)|Belter]], [[Dellig (Earth-616)|Citadel]], [[Eylen (Earth-616)|Elementa]], [[Kaylo (Earth-616)|Kaylo]], [[Kor (Earth-616)|Kor]], [[Revos (Earth-616)|Overseer]], [[Darmo (Earth-616)|Sidearm]], [[Kaila (Earth-616)|Sky]]\n| FormerMembers           = \n| Allies                  = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Monster Mob (Earth-616)|Monster Mob]]\n| Enemies                 = Formerly; [[Fantastic Four (Earth-616)|Fantastic Four]], [[Monster Mob (Earth-616)|Monster Mob]]\n\n| Origin                  = [[Spyricans]] [[Glossary:Mutate|mutated]] via exposure to [[Glossary:Cosmic Radiation|cosmic rays]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Dan Slott; Sean Izaakse\n| First                   = Fantastic Four Vol 6 15\n\n| HistoryText             = The Unparalleled were the protectors of the planet [[Spyre]]. [[Spyricans]] were a utopian society until their patriarch, the [[Revos (Earth-616)|Overseer]], detected a probing emission from [[Earth]] scientist [[Reed Richards (Earth-616)|Reed Richards]], who was scanning space for an Earth-like planet to explore. Alarmed by the foreign incursion, the Overseer secretly manipulated a storm of [[Glossary:Cosmic Radiation|cosmic rays]] that Richards' rocketship had to pass through and increased its intensity to scuttle the vessel. The ship crashed back to Earth, but its tripulants were bestowed powers by the cosmic rays and they became the [[Fantastic Four (Earth-616)|Fantastic Four]]. Dreading that the now-powered explorers would attempt to resume their mission, the Overseer decided to harness cosmic rays and irradiate his own people with them to create a force capable of taking down the Fantastic Four if they were ever to come.{{r|Fantastic Four Vol 6 18}}\n\nOut of all the Spyricans that volunteered for the procedure, most emerged transformed into monsters who were shunned by society and banished to the [[Lowtown (Capital City)|Lowtown]] of Spyre's [[Capital City]]. The few that gained powers without a drastic change in appearance became the Unparalleled.{{r|Fantastic Four Vol 6 16}} Headquartered in the [[Hall of Heroes]], these champions were [[Darmo (Earth-616)|Sidearm]], [[Eylen (Earth-616)|Elementa]], [[Belter (Earth-616)|Belter]], [[Dellig (Earth-616)|Citadel]], [[Kor (Earth-616)|Kor]], [[Kaylo (Earth-616)|Kaylo]], and [[Kaila (Earth-616)|Sky]].{{r|Fantastic Four Vol 6 16}} Since Spyre was a society without crime or war, the Overseer secretly staged a rivalry between the Unparalleled and Lowtown's [[Monster Mob (Earth-616)|Monster Mob]] in order to have a threat for Spyre's heroes to fight in preparation for the Fantastic Four, with the Unparalleled regularly fending off terrorist attacks from the Monster Mob.{{r|Fantastic Four Vol 6 18}}\n\nOver a decade after Richards' attempted flight, the Fantastic Four decided to complete their first mission.{{r|Fantastic Four Vol 6 14}} When they approached Spyre, the Unparalleled intercepted and cornered the Fantastic Four, who managed to establish they meant no harm. During the fight, [[Benjamin Grimm (Earth-616)|The Thing]] was flung into Lowtown. The [[Jonathan Storm (Earth-616)|Human Torch]] was taken by Sky to her quarters since Spyre's [[Great Eye]] had decided he was her soulmate, and Mister Fantastic and the [[Susan Storm (Earth-616)|Invisible Woman]] were taken to the [[Tower of Over-Site]] for an audience with the Overseer, who welcomed them into Spyrican society.{{r|Fantastic Four Vol 6 15}} When Mister Fantastic deduced that the Overseer had manipulated the cosmic rays that gave the Fantastic Four their powers, he ordered the Unparalleled to kill them, and they went on the run.\n\nIn the meantime, The Thing had fought and befriended the Monster Mob and rallied them out of Lowtown to reclaim their place in society.{{r|Fantastic Four Vol 6 16}} The Unparalleled were deployed to stop the rebellion, and they were joined by Sky and the Human Torch. The Overseer had Citadel and Belter remain at the Hall of Heroes, where they failed to stop Mister Fantastic and the Invisible Woman from raiding the building for evidence of the Overseer's tampering. After Mister Fantastic exposed the Overseer in public,{{r|Fantastic Four Vol 6 17}} Sky turned against the Unparalleled while her team confronted both the Monster Mob and the Fantastic Four. When The Thing confronted the Overseer at the Tower of Over-Site, the building collapsed due to their fight. The Unparalleled joined forces with the Fantastic Four and the Monster Mob to contain the falling debris.{{r|Fantastic Four Vol 6 18}} Once he recovered from the fall, the Overseer challenged Mister Fantastic and they fought until Richards convinced him to instead join forces. After making peace with the Unparalleled, Mister Fantastic shared with the Spyricans a temporary cure that would revert any mutate back to normal once a year. Most Spyricans began to welcome the Monster Mob back into society, but Elementa led some of the pushback. The Unparalleled bid the Fantastic Four farewell when they departed back to Earth, but Sky joined the explorers on their journey since she wanted to try to work out a relationship with the Human Torch.{{r|Fantastic Four Vol 6 19}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "1338905"
}