{
    "pageid": 559490,
    "ns": 0,
    "title": "Utabi Tribe (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Utabi Tribe (Earth-616) from Black Rider Vol 1 11 0001.jpg\n| Name                    = Utabi Tribe\n| Aliases                 = \n\n| Leaders                 = Unnamed Chief\n| CurrentMembers          = \n| FormerMembers           = [[Crooked Knife (Earth-616)|Crooked Knife]] (deceased), [[Pale Mist (Earth-616)|Pale Mist]]\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[Matthew Masters (Earth-616)|Black Rider]], [[Shawmis Tribe (Earth-616)|Shawmis Tribe]]\n| Enemies                 = \n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Defunct\n| BaseOfOperations        = Utabi Village\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Al Hartley\n| First                   = Black Rider #11\n\n| History                 = The Utabi Tribe was a band of Native Americans who were predominant in the American west during the days of the American Frontier. For years they warred with the rival [[Shawmis Tribe (Earth-616)|Shawmis tribe]]. Eventually the two tribes decided to forge peaceful relations and as a token of this peace the Utabi chief allowed his daughter [[Pale Mist (Earth-616)|Pale Mist]] to marry the Shawmis' greatest warrior [[Bright Eagle (Earth-616)|Bright Eagle]]. This move was opposed by Utabi warrior [[Crooked Knife (Earth-616)|Crooked Knife]] who loved Pale Mist and resented the Shawmis after years of battle against them. When Crooked Knife failed to convince the chief to prevent this union, he gathered other braves who had suffered losses against the Shawmis to join his cause. They disguised themselves as Shawmis warriors and murdered the group escorting Pale Mist in the hopes of framing the Shawmis and continuing aggressions. \n\nThis backfired when Pale Mist recognized Crooked Knife and fled into the arms of the western hero the [[Matthew Masters (Earth-616)|Black Rider]]. The Black Rider drove Crooked Knife and his renegades away, but Crooked Knife in turn turned both the Utabi and Shawmis against the hero by convincing them both that the Black Rider kidnapped Pale Mist for himself. Crooked Knife's plot fell apart when the Black Rider, in his alter-ego of Frontier doctor Matthew Masters went to the Utabi village and convinced both the Utabi chief and Bright Eagle of Crooked Knife's plot. They then set up a dummy of Bright Eagle in a teepee and allowed Crooked Knife to believe that Bright Eagle was sick. When Crooked Knife attempted to slay Bright Eagle he was caught in the act and Bright Eagle killed him in combat. Soon after Pale Mist was reunited with her people and was soon married to Bright Eagle.{{r|Black Rider #11}} The fate of the Utabi tribe is unknown.\n| Equipment               = \n| Transportation          = The Utabi people traveled by horse.\n| Weapons                 = The Utabis used weapons that were common among Native American people during the days of the American Frontier: spears, bows and arrows, tomahawks, and had some access to conventional firearms such as rifles from trading with American settlers. \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Native American Tribes]]"
                }
            }
        }
    ],
    "page_id": "559490"
}