{
    "pageid": 593082,
    "ns": 0,
    "title": "Ute People (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Ute People (Earth-616) from Texas Kid Vol 1 9 001.jpg\n| Name                    = Ute People\n| Aliases                 = Ute\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = [[David Laramee (Earth-616)|Arizona Kid]]\n| Enemies                 = [[Lance Temple (Texas Kid) (Earth-616)|Texas Kid]]\n\n| Origin                  = \n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Utah (State)|Utah]], [[Colorado (State)|Colorado]], [[New Mexico (State)|New Mexico]]\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = \n| First                   = Texas Kid #9\n\n| History                 = \n===Overview===\nThe Ute Native Americans are the indigenous population of the Great Basin of the United States, a geography that includes the states of Utah, Colorado, and New Mexico. Prior to settlers from Mexico moving into the area, they were mainly a nomadic tribe of people. However, as settlers expanded into the west, the Ute became a more unified band.<ref>[[Wikipedia:Ute people|Wikipedia]]</ref> Presumably, their history on [[Earth-616]] is the same as their real world counterparts.\n\n===American Frontier===\nLike many other Native American tribes of the time, the Ute people had many encounters with the various heroes of the old west, sometimes as allies, other times as enemies depending on the circumstances.\n\nOne of the earliest encounter with Ute natives, was when a tribe was attacking coaches in Texas. Their leader, Kicking Horse was arrested by the Texas Rangers and it was determined that he was drunk at the time. The rangers sent their scout the [[David Laramee (Earth-616)|Arizona Kid]] to stop the sale of liquor to the natives and keep the peace. The Kid soon uncovered that the tribes medicine man -- White Elk -- had been murdered and that trader Jules Dubois was responsible for inflaming the Ute people. Exposing Dubois, the Kid left the trader to face Ute justice. A group of renegade Ute warriors were also active around the [[Caliber City]] area stealing horses in the region. When they stole [[Thunder (Texas Kid) (Earth-616)|Thunder]], the white stallion belonging to the [[Lance Temple (Texas Kid) (Earth-616)|Texas Kid]], he and his allies [[Emilio Diaz (Earth-616)|Emilio Diaz]] and [[Red Hawk (Texas Kid Ally) (Earth-616)|Red Hawk]] liberated the horse and slew the Ute renegades.{{r|Texas Kid #9}} A group of Ute led by Totonka were forced to live on a reservation run by Link Farnum who sold the cattle meant to feed the Utes for his own personal gain. Totonka almost started war until [[Blaine Colt (Earth-616)|Kid Colt]] exposed Link's shady dealings.{{r|Two-Gun Kid #17}} \n| Equipment               = \n| Transportation          = \n| Weapons                 = \n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Native American Tribes]]"
                }
            }
        }
    ],
    "page_id": "593082"
}