{
    "pageid": 11124,
    "ns": 0,
    "title": "V-Battalion (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = V-Battalion (Earth-616) from All-New Official Handbook of the Marvel Universe Vol 1 12 001.png\n| Name                    = V-Battalion\n| Aliases                 = Penance Council\n\n| Status                  = Defunct\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Castle Masada, [[Symkaria]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = [[Thomas Halloway (Earth-616)|Angel]], [[Fred Davis Jr. (Earth-616)|Bucky]], [[Paulette Brazee (Earth-616)|Citizen V (Paulette Brazee)]], [[Dallas Riordan (Earth-616)|Citizen V (Dallas Riordan)]], [[John Watkins (Earth-616)|Citizen V (John Walkins)]], [[John Watkins Jr. (Earth-616)|Citizen V (John Watkins, Jr)]], [[John Watkins III (Earth-616)|Citizen V (John Watkins III)]], [[Roger Aubrey (Earth-616)|Destroyer]], [[Eamonn (Earth-616)|Eamonn]], [[Gwendolyne Sabuki (Earth-616)|Golden Girl]], [[Kenji Sabuki (Earth-616)|Golden Sun]], [[Ameiko Sabuki (Earth-616)|Goldfire]], [[David Mitchell (Earth-616)|Human Top]], [[Jim Hammond (Earth-616)|Human Torch]] , [[Helmut Gruler (Earth-616)|Iron Cross]], [[Irene Martinez (Earth-616)|Irene Martínez]], [[Isadora Martinez (Earth-616)|Isadora Martínez]], [[Madeline Joyce (Earth-616)|Miss America]], [[Robert Frank Jr. (Earth-616)|Nuklo]], [[Piers (Earth-616)|Piers]], [[Robert Ralston (Earth-616)|Rebel Ralston]], [[Hijiri Sabuki (Earth-616)|Dr. Sam Sabuki]], [[Elizabeth Barstow (Earth-616)|Silver Scorpion]], [[Jacqueline Falsworth (Earth-616)|Spitfire]], [[Andrea Sterman (Earth-616)|Andrea Sterman]], [[Darren Mitchell (Earth-616)|Topspin]], [[Brian Falsworth (Earth-616)|Union Jack]], [[Vradec (Earth-616)|Vradec]], [[Miles Warton (Earth-616)|Warbeck]], [[Robert Frank (Earth-616)|Whizzer]]\n| Allies                  = \n| Enemies                 = (First incarnation) [[Heinrich Zemo (Earth-616)|Baron Heinrich Zemo]];<br>(Second incarnation) the [[Skrulls]], the Freons, the [[Justine Hammer (Earth-616)|Crimson Cowl]], [[Wolfgang von Strucker (Earth-616)|Baron Strucker]], Marduck, and the Everlasting\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Ben Thompson\n| First                   = Comedy Comics Vol 1 9 \n| First2                  = {{g|original}}<br>{{cl|Thunderbolts Vol 1 38}}<br>{{g|reorganized}}\n| Last                    = \n\n| HistoryText             = In 1940, shortly after the British and French armies evacuated Dunkirk before the advance of the Nazis, the British hero known as Citizen V returned to occupied France and assembled the V-Battalion. Along with his girlfriend [[Paulette Brazee (Earth-616)|Paulette Brazee]], Watkins took them on many successful missions over occupied Europe and even in Germany. In 1943, Brazee infiltrated the inner circle of Nazi scientist known as [[Heinrich Zemo (Earth-616)|Baron Heinrich Zemo]], taking the codename She-Wolf and finally helped Citizen V, Captain America and Bucky to destroy the weapon Particle X-Zemo.{{Citation}}\n\nHeinrich vowed to get his revenge and sent an undercover operative to infiltrate the V Battalion. Heinrich killed Citizen V in Poznan, Poland by strangling him to death. Soon after the Nazis murdered most of the original members of the V Battalion.{{Citation}}\n\nLater the survivors of the V Battalion along with other WW2 superheroes ([[Roger Aubrey (Earth-616)|Destroyer]], [[Elizabeth Barstow (Earth-616)|Silver Scorpion]] and [[Helmut Gruler (Earth-616)|Iron Cross]] among others) and new members such as [[Dallas Riordan (Earth-616)|Dallas Riordan]]'s paternal grandfather (an American soldier who stayed in Europe after the war) reconstituted the V Battalion. The primary mission of this new V Battalion was to hunt down Nazi war criminals. They operated out of a base in Symkaria.{{Citation}}\n\n==Citizen V==\nThe V Battalion's primary field agent usually uses the codename Citizen V after the original Citizen V. The original Citizen V was killed by Heinrich Zemo. The second Citizen V was [[Paulette Brazee (Earth-616)|Paulette Brazee]] Watkins girlfriend who later gave birth to his son John Watkins Jr and married a soldier. Presumably [[John Watkins Jr. (Earth-616)|JJ Watkins (John Watkins Jr.)]] was the third Citizen V. Sometime later JJ's son [[John Watkins III (Earth-616)|John Watkins III]] was Citizen V and was somehow rendered comatose for five years.{{Citation}}\n\nYears later when Heinrich Zemo's son Helmut Zemo led the Masters of Evil he decided the group would pose as heroes to take the place of the missing Avengers and Fantastic Four who disappeared after a battle with Onslaught. The Masters of Evil became the Thunderbolts and Helmut took the name Citizen V (knowing full well his father murdered him) and falsely claimed to be the grandson of the original Citizen V. At this time Helmut did not know the V Battalion had been reconstituted nor did he know the original Citizen V had an actual grandson.{{Citation}}\n\nIn time Helmut's scam unraveled and he was a fugitive on the run after he nearly conquered the world. One of the people affected by the scam was the Thunderbolts liaison to the New York City's Mayor's office Dallas Riordan who lost her job. The V Battalion had been interested in approaching Dallas as the next Citizen V even before the Thunderbolts scam and had placed an operative in the mayor's office named Miles Warbeck (Miles Warton) to keep tabs on her and the Thunderbolts. When Helmut Zemo's Citizen V first arrived on the scene the V Battalion were suspicious of his claims to be the original's grandson but did not move against him. After Helmut's scam fell apart Roger Aubrey the Destroyer sought out Dallas Riordan and offered her a place in the V Battalion as their operative Citizen V. Dallas's grandfather had abandoned his family in America and given his life early on in the adventures of the reconstituted V Battalion. Dallas's father James Riordan was a police captain who had trained his daughter to be a fighter. He never joined the V Battalion and did not want his daughter to join either but he knew the possibility existed that she would be approached to join the group so he made sure she was prepared just in case.{{Citation}}\n\nFor months Dallas acted as Citizen V. First she worked to track down the Thunderbolts because she was furious at being fired and felt she was used by Atlas. She tracked down Helmut Zemo in Mexico and blew up his castle. Later she offered Hawkeye the chance to leave the Thunderbolts or risk her wrath. Hawkeye refused her offer and later Citizen V was knocked unconscious by a member of the Crimson Cowl's Masters of Evil who were plotting to hold the world for ransom with weather machines. When the Thunderbolts defeated the Masters of Evil, Justine Hammer the Crimson Cowl framed Dallas Riordan as the Crimson Cowl and she was sent to prison. Atlas later posed as a journalist to get into prison to see Dallas but she was broken out of jail by V Battalion operatives. Out of jail Dallas went back to being Citizen V in the hopes of tracking down the Crimson Cowl but instead ended up embroiled in a conflict with the Secret Empire an organization at that time (unknown to Dallas or the Thunderbolts) being funded by Helmut Zemo.{{Citation}}\n\nDallas at first blinded by her need for revenge against Zemo, The Thunderbolts and the Crimson Cowl refused to see how corrupt the V Battalion's leaders the Penance Council had become. Dallas finally chose to leave the organization when she was given orders to assassinate Henry Peter Gyrich a politician who ran the Commission on Superhuman Affairs. (The V Battalion wanted this done presumably because Gyrich at this time had been corrupted by nanites by Hydra and had used Nomad as Scourge to assassinate several people including Helmut Zemo). Dallas left to find the Thunderbolts but was abducted by the Crimson Cowl. The battle with the Cowl left Dallas Riordan crippled for many many months.{{Citation}}\n\nAlthough Scourge had beheaded Helmut Zemo neither knew that Helmut's ally Techno had placed a bio-modem in Helmut's body and that when he died Helmut's mind was sent into the comatose body of John Watkins III. For weeks Helmut pretended to be John Watkins III as Citizen V and with the V Battalion's help gathered together the Redeemers. The Redeemers and the Thunderbolts defeated Gyrich and Helmut soon learned his father's compatriot Baron Strucker was the mastermind behind the whole affair.{{Citation}}\n\nWhile in John Watkins III's body Helmut confronted Baron Strucker and killed his daughter Andrea. During a battle with Graviton many members of the Redeemers were killed and Citizen V gathered the original Thunderbolts together to defeat Graviton. Graviton was revealed to be the pawns of aliens who were using him to conquer earth. The Thunderbolts realized that some of them would have to collapse a gravity well. Many of the Thunderbolts were sent to Counter Earth while Songbird stayed behind. The V Battalion had tried teleporting Citizen V out during this melee and the result was that Helmut Zemo's mind ended up inside Fixer's tech pac and John Watkins III was in control of his own body again.{{Citation}}\n\nJohn Watkins would later fight the god Marduk. He also was involved in an adventure with Deadpool and Flag Smasher in Rumekistan. {{Citation}}\n\nThere was once a mention there were 7 people who have taken the name Citizen V. The identities of six are known (John Watkins Sr, John Watkins Jr, John Watkins III, Paulette Brazee, Helmut Zemo and Dallas Riordan).{{Citation}} \n\n==The Penance Council== \nThe V-Battalion is lead by the Penance Council. Roger Aubrey was the de facto leader of the council and while certainly not an evil man over the years some of his decisions were morally compromised, with him often nudging the group towards decisions wherein they chose expediency and protecting their secrecy over morality.{{Citation}}\n\nEventually Roger Aubrey decided to quit the V Battalion and left the group in the hands of the original Human Torch Jim Hammond.{{Citation}} \n\nTwo other important members of the Penance Council were Elizabeth Barstow and Helmut Grueler. Elizabeth Barstow had been the golden age hero the Silver Scorpion but in modern times her keen mind was addled by Alzheimer's Disease. Helmut Grueler was 102 before he died and had been a German who did not believe in Nazi ideology during WW2 but fought for the Fatherland nevertheless.{{Citation}}\n \n====The Original Penance Council (Late 1940s - 1950s)====\n* [[Thomas Halloway (Earth-616)|Angel]] - (Thomas Halloway)\n* [[Helmut Gruler (Earth-616)|Iron Cross]] - (Helmut Gruler)\n* [[Irene Martinez (Earth-616)|Irene Martinez]]\n* [[Roger Aubrey (Earth-616)|Destroyer]] - (Roger Aubrey)\n* [[Robert Ralston (Earth-616)|Robert \"Rebel\" Ralston]]\n* [[Hijiri Sabuki (Earth-616)|Dr. Sam Sabuki]]\n* [[Madeline Joyce (Earth-616)|Miss America]] - (Madeline Joyce)\n* [[Brian Falsworth (Earth-616)|Union Jack]] - (Brian Falsworth)\n* [[Robert Frank (Earth-616)|Whizzer]] - (Robert Frank)\n\n====Later Penance Council Members====\n* [[Fred Davis (Earth-616)|Bucky]] - (Fred Davis)\n* [[Gwendolyne Sabuki (Earth-616)|Golden Girl]] - (Gwenny Lou Sabuki)\n* [[Kenji Sabuki (Earth-616)|Golden Sun]] - (Kenji Sabuki)\n* [[David Mitchell (Earth-616)|Human Top]] - (David Mitchell)\n* [[Darren Mitchell (Earth-616)|Twister]] - (Darren Mitchell)\n\n====The Current Penance Council Members====\n* [[Roger Aubrey (Earth-616)|Destroyer]] - (Roger Aubrey)\n* [[Elizabeth Barstow (Earth-616)|Silver Scorpion]] - (Elizabeth Barstow)\n* [[Fred Davis (Earth-616)|Bucky]] - (Fred Davis)\n* [[Robert Frank Jr. (Earth-616)|Nuklo]] - (Robert Frank Jr.)\n* [[Helmut Gruler (Earth-616)|Iron Cross]] - (Helmut Gruler)\n* [[Isadora Martinez (Earth-616)|Isadora Martinez]]\n* [[Darren Mitchell (Earth-616)|Topspin]] - (Darren Mitchell)\n* [[Ameiko Sabuki (Earth-616)|Goldfire]] - (Ameiko Sabuki)\n\n==Operations==\n* Piers\n* Eammon\n* Vradec\n\n\n==Special Operatives==\n====Former Special Operatives====\n* [[John Watkins (Earth-616)|Citizen V]] - (John Watkins)\n* [[Nathaniel Richards (Earth-616)|Nathaniel Richards]]\n* [[Paulette Brazee (Earth-616)|She-Wolf]] - (Paulette Brazee)\n* [[Jacqueline Falsworth (Earth-616)|Spitfire]] - (Lady Jacqueline Falsworth)\n* [[Howard Stark (Earth-616)|Howard Stark]]\n* [[Dallas Riordan (Earth-616)|Citizen V (Dallas Riordan)]]\n\n====Current Special Operatives====\n* [[John Watkins III (Earth-616)|Citizen V (John Watkins III)]]\n* [[Miles Warton (Earth-616)|Miles Warton]]\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each teammates' arsenal\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Symkarian Organizations]]\n[[Category:Allied Organizations]]"
                }
            }
        }
    ],
    "page_id": "11124"
}