{
    "pageid": 477514,
    "ns": 0,
    "title": "Victory Boys (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Victory Boys (Earth-616) from U.S.A. Comics Vol 1 5 001.jpg\n| Name                    = Victory Boys\n| Aliases                 = V-Boys\n\n| Status                  = Defunct\n| Identity                = Known to Authorities\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Germany]], circa [[World War II]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Victor (last name unknown), [[Maxie Stein]], Kurt Erzberger, Gus Weber, Warren Zumwald, [[Piotr (Victory Boys) (Earth-616)|Piotr]] (last name unknown)\n| Allies                  = [[Specialized Unit, Enhanced Soldiers (Earth-616)|Crazy S.U.E.S.]]\n| Enemies                 = [[National Socialist German Workers Party (Earth-616)|Nazis]], [[Adolf Hitler (Earth-616)|Adolf Hitler]], [[Benito Mussolini (Earth-616)|Benito Mussolini]], [[Hirohito (Earth-616)|Emperor Hirohito]]\n\n| Origin                  = \n| PlaceOfFormation        = [[Germany]]\n| PlaceOfDissolution      = \n| Creators                = Ernest Hart\n| First                   = Comedy Comics #10\n| Last                    = All-Winners Squad: Band of Heroes #1\n\n| HistoryText             = ===Preface===\nThe Victory Boys were just some of many costumed operatives active during [[World War II]] who were recruited into the United States military. The purpose was to enlist such individuals in order to publish propaganda in the form of comic books that were commissioned by the United States military and published by [[Timely Comics]]. These comics were used to convince Americans to support the war, and increase enlistment. Like many heroes recruited in this fashion, the Victory Boys fictional exploits were few, as the characters were no longer used in comics after their real life deaths, as readers would not want to read about dead soldiers{{r|All-Winners Squad: Band of Heroes #2}}. \n\nPresumably, much like the [[Young Allies (WWII) (Earth-616)|Young Allies]]{{r|Young Allies Comics 70th Anniversary Special #1}}, the fictional exploits of the Victory Boys may be based on actual events. For the sake of clarity, however, this article differentiates between the two.\n\n===Fictional Exploits===\nThe Victory Boys were a group of youths that lived in Germany during World War II who banded together to fight the tyrannical [[National Socialist German Workers Party (Earth-616)|Nazi]] regime. In their first recorded appearance they assisted the young boy named Victor (who later joined the team) in rescuing his father from a Nazi concentration camp.{{r|Comedy Comics #10}}\n\nLater the group hid in the German Blackforest(Schwarzwald) near [[Adolf Hitler (Earth-616)|Adolf Hitler's]] castle. Victory Boy member Maxie Stein was sent out into the woods to hunt for deer to cook for dinner. Maxie was captured by Nazi soldiers who were sent into the woods by Hitler himself on the same task to prepare a meal for the visiting Axis leaders [[Benito Mussolini (Earth-616)|Benito Mussolini]] and [[Hirohito (Earth-616)|Emperor Hirohito]]. Discovering their comrade had been kidnapped, the other Victory Boys led an assault on Hitler's castle and freed their comrade. Freeing Maxie, the group sent Hitler, Mussolini and Hirohito fleeing in a hail of arrow and managed to escape into the Black Forest unscathed.{{r|U.S.A. Comics #5}}\n\n===Real Life Exploits===\n[[File:Victory Boys (Earth-616) from All-Winners Squad Band of Heroes Vol 1 1 001.jpg|thumb|left|As members of the Crazy Sues]]In real life, the Victory Boys were a group of three youths, only one member named Piotr was named. They spoke Polish and were first seen as members of the [[Specialized Unit, Enhanced Soldiers (Earth-616)|Crazy Sues]] as early as August 29, 1944 as they were seen with the unit following their part in the liberation of Nazi-occupied France. Under [[Steven Rogers (Earth-616)|Captain America's]] command, the Victory Boys joined the unit through the European countryside into Belgium where they clashed with Nazi forces. Penned in by enemy fire, the Victory Boys and the others were rescued by their teammate [[Frank Cortez (Earth-616)|Captain Flame]].{{r|All-Winners Squad: Band of Heroes #5}}\n\nOn December 6, 1944, the Victory Boys and the Crazy Sues entered Saarlautern, Germany and once more clashed with Nazi forces. The Victory Boys were caught in the blast of a shell fired from a Tiger Tank. Two of the Victory Boys were killed instantly, leaving Piotr mortally wounded. Fellow Crazy Sue members [[Archie the Gruesome (Earth-616)|Archie the Gruesome]], [[Merzah (Earth-616)|Merzah the Mystic]] and the [[William Bryon (Earth-616)|Young Avenger]] attempted to patch him up. Realizing how futile their struggles where, Young Avenger ordered Archie to pump Piotr full of morphine to make him feel no pain. Shot up full of the painkiller, Piotr then thanked the Young Avenger for putting him out of his misery before the hero used his own service pistol to shoot his teammate in the head.{{r|All-Winners Squad: Band of Heroes #1}}\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each of the Victory Boys is armed with a bow and arrow.\n\n| Notes                   = \n| Trivia                  = *Der Schwarzwald is the German name for The Black Forest.\n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "477514"
}