{
    "pageid": 793575,
    "ns": 0,
    "title": "Vishanti (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Plagiarism|[https://en.wikipedia.org/wiki/Vishanti Vishanti on Wikipedia]}}\n{{Marvel Database:Team Template\n<!-- | Quotation                 = We are '''aware''' of these facts, ye who were once [[Anthony Druid (Earth-616)|Anthony Druid]]. Are we not the '''Vishanti'''? '''All-wise...All-knowing?''' Thus, on '''Earth's''' behalf, we hereby '''accede''' to '''binding arbitration'''!\n| Speaker                 = [[Vishanti|Vishanti (as one)]] -->\n| Image                   = Vishanti (Earth-616) from Doctor Strange Vol 1 383 001.png\n| ImageSize               = 250px\n| Title                   = [[Vishanti]]\n| Name                    = [[Vishanti]], though stated to be nameless{{r|Doctor Strange, Sorcerer Supreme #3}}\n| EditorialNames          = \n| Aliases                 = [[Those Who Sit Above]]{{r|Doctor Strange, Sorcerer Supreme #3}}\n\n| Status                  = Active\n\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Unknown extradimensional realms\n\n| Leaders                 = \n| CurrentMembers          = [[Hoggoth (Earth-616)|Hoggoth]], [[Oshtur (Earth-616)|Oshtur]], [[Agamotto (Earth-616)|Agamotto]]\n| FormerMembers           = \n| Allies                  = [[Yao (Earth-616)|Ancient One]], [[Stephen Strange (Earth-616)|Doctor Strange]], [[Eternity (Earth-616)|Eternity]]\n| Enemies                 = [[Shuma-Gorath (Multiverse)|Shuma-Gorath]], [[Sligguth (Earth-616)|Sligguth]], [[Dormammu (Earth-616)|Dormammu]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Gardner Fox; Sam Kweskin\n| First                   = Strange Tales #115\n| First2                  = (Mentioned){{sld|Marvel Premiere #5}}\n| Last                    = \n\n| Overview                = The Vishanti are a trio of supernatural, god-like entities who act as patrons for the [[Sorcerer Supreme]] and defenders of the [[Earth]] realm.\n\n| HistoryText             = \n===Origins===\n[[Oshtur (Earth-616)|Oshtur]] was one of the [[Elder Gods of Earth|Elder Gods]] of Earth, the first lifeforms created when the planet's sentient bio-sphere, the [[Demiurge (Earth-616)|Demiurge]], breathed life into the world. Oshtur left Earth for the stars to explore, and as a result she was not present when [[Set (Earth-616)|Set]] and [[Chthon (Earth-616)|Chthon]] led the corruption of the Elder Gods into [[Demons]], or when the remaining pure Goddess [[Gaea (Earth-616)|Gaea]] mated with the Demiurge to produce [[Atum (Earth-616)|Demogorge]], the God-Eater, who slew most of the Elder Demons and drove Set and Chthon into exile.{{r|Thor Annual #10}}{{r|Marvel Tarot #1}}\n\nDuring her travels, Oshtur met [[Hoggoth (Earth-616)|Hoggoth]], last survivor of an ancient alien pantheon. Hoggoth and Oshtur learned a great deal from one another, and when Oshtur was ready to move on, Hoggoth offered to go with her. The two eventually traveled back to Earth, where Oshtur was disheartened to learn about the genocide of her brothers and sisters. She made contact with Gaea, Set, and Chthon, and they conceived a pact to avoid direct interference with each other's affairs. Oshtur came to care for the developing mankind of Earth, however, and felt trapped by her own promise not to interfere when Set's [[Serpent-Men]] and Chthon's [[N'Garai]] demons tormented the young race.{{r|Marvel Tarot #1}}\n\nOne day, Oshtur observed three children at play, and their joy caused her to shed a single tear. A child of her own emerged from that tear, and Oshtur named him [[Agamotto (Earth-616)|Agamotto]]. Agamotto loved to learn, and the two were quite happy together. Once Oshtur sent Agamotto on a great quest to find her, and in doing so he mastered the Three Forms of Magic, forging the three [[Eye of Agamotto|Eyes of Agamotto]] as he did so. Agamotto grew into a great teacher and sorcerer, who loved humanity as much as his mother. Through him, Oshtur could protect humanity from her Elder God brothers, for Agamotto (like the N'Garai or Serpent-Men) was not bound by their oath of non-interference. Furthermore, Oshtur and Agamotto joined with Hoggoth to become a mystical trinity known as the Vishanti, and Agamotto encouraged the study of magic in humanity through his writings in the Book of the Vishanti.{{r|Marvel Tarot #1}}{{r|Official Handbook of the Marvel Universe A to Z Vol 1 7}}\n\nIn this way, Agamotto became the first Sorcerer Supreme of the Earthly dimension. Agamotto was somewhat emotional and mercurial, however -- whenever humanity failed or disappointed him, or succumbed to the temptations provided by Chthon or Set, Agamotto would retreat from humanity disgust, only to forgive them decades or centuries later. Agamotto occasionally tried to chose a successor, but these mages either died or became corrupt, further anguishing Agamotto. Thousands of years ago, the human known only as Genghis sought out the Vishanti and asked them for knowledge and mystical power. In return, [[Aged Genghis (Earth-616)|Aged Genghis]] would gather the most powerful mages and sorcerers on Earth every century to test them. The strongest would become Earth's Sorcerer Supreme. The Sorcerer Supreme would protect Earth's dimension for the Vishanti and fight their enemies and in return could call upon the powers of the Vishanti. Agamotto and the Vishanti accepted this proposal, for Genghis was wise in humanity in ways Agamotto could never be, and so the role of Earth's defender and agent of the Vishanti officially became known as the Sorcerer Supreme.{{r|Official Handbook of the Marvel Universe A to Z Vol 1 7}}\n\n===[[Modern Age]]===\n<!-- Plagiarism: Wikipedia/Official Handbook of the Marvel Universe Mystic Arcana: The Book of Marvel Magic #1 -->\nNear the end of the 20th century, the Vishanti and various other magical entities went to war. This war was known as the [[War of the Seven Spheres]]. During this war the Vishanti were matched against their counterpart, the [[Trinity of Ashes (Earth-616)|Trinity of Ashes]]. The Vishanti expected [[Stephen Strange (Earth-616)|Doctor Strange]], Earth's Sorcerer Supreme to fight at their side, but when they mentioned that they expected the war to last for several millennia, Strange refused, not wanting Earth to remain unprotected for so long, and rejected the Vishanti's power.{{r|Doctor Strange, Sorcerer Supreme #48|49}}\n\n<!-- Plagiarism: Wikipedia/Official Handbook of the Marvel Universe Mystic Arcana: The Book of Marvel Magic #1 -->\nNearly powerless, Stephen Strange was driven from Earth by the ancient sorceress [[Salome (Hellfire Club) (Earth-616)|Salome]]. Salome offered her services to the Vishanti in exchange for power. The Vishanti found the amoral Salome repulsive, but accepted her offer in their need for soldiers. Still, Agamotto warned Strange about the deal Salome made with them. Shortly afterward, Strange found a new source of power: he tapped into the mystical power of the Earth itself. With this new power, Salome was defeated and the Vishanti approached Strange again and asked him to become their soldier, feeling that with this new source of power Strange was even more valuable and even threatened to kill him should he not comply. This time, Strange, feeling that he owed the Vishanti for all their support over the years, agreed under the condition that they would return him in time after the war ended to the moment he had left the Earth, so that the Earth would not remain unprotected.{{r|Doctor Strange, Sorcerer Supreme #80}}\n\nDuring the War, [[Anthony Druid (Earth-616)|Doctor Druid]] acted as the avatar of [[Slorioth (Earth-616)|Slorioth]]. Slorioth would take hold of Earth, as all other deities were preoccupied with the war. None would notice the attempt until it was too late. Fortunately, the Vishanti were alerted to Slorioth's actions by [[Gaea (Earth-616)|Gaea]]'s vassal, and aware that a conflict with Slorioth would destroy Earth and its plane of existence, The Vishanti summoned the [[Living Tribunal (Multiverse)|Living Tribunal]] to arbitrate the issue between gods. In the end, Slorioth was removed from earth \"for the nonce.\" According to Hoggoth and Oshtur, the first law of the Vishanti is that \"With great power there must also come great responsibility.\"{{r|Secret Defenders #23|25}}\n\n<!-- Plagiarism: Wikipedia -->\nFought in other dimensions, the war lasted for 5000 years, but only a nanosecond passed on Earth. The Vishanti, apparently on the winning side, returned Strange to Earth. Several months after his return, Strange could call upon the power of the Vishanti again. A short time after the War ended, one of the principal artifacts involved in it - the [[Sphere of Sara-Kath]] - lighted upon Earth once more, to be dabbled with by Technomages who had no idea of its power. In studying it, they accidentally released an entity called [[Buel (Earth-616)|Buel]], a 'Gremlin-Lord', who had been imprisoned in another dimension. Thankfully, Dr. Strange managed to destroy Buel and the Sphere with the aid of [[Peter Parker (Earth-616)|Spider-Man]].{{r|Sensational Spider-Man #21|23}}\n\nThe Vishanti also appeared to the entities [[Kubik (Earth-616)|Kubik]] and [[Maker (Earth-616)|Kosmos]] on their tour of the planes of existence, alongside various other deities, abstract concepts and cosmic entities.{{r|Fantastic Four Annual #23}}\n\nThe Vishanti was known to host an Interdimensional Tournament on Earth-616 once every few decades, with the victor being granted the title of the Sorcerer Supreme. Doctor Strange was the winner of the first two tournaments. He also won the third one, however, the Vishanti decided to grant the title to [[Loki Laufeyson (Ikol) (Earth-616)|Loki Laufeyson]] instead.{{r|Doctor Strange #383}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = * The Seal of the Vishanti predominantly featured in the [[Sanctum Sanctorum]]'s window and the [[Book of the Vishanti]] was designed by [[Steve Ditko]] as an homage to the design of a window present in Will Eisner's [[wikipedia:Spirit (comics|''The Spirit'']].<ref>{{cite web|url=http://www.cbr.com/comic-book-legends-we-almost-had-a-jlatransformers-crossover/|title=Comic Book Legends Revealed: We Almost Had a JLA/Transformers Crossover?|work=CBR.com|first=Brian|last=Cronin|date=11 November 2016|accessdate=11 November 2016}}</ref>\n| Links                   = \n}}\n==References==\n{{Reflist}}\n[[it:Vishanti (Terra-616)]]\n[[Category:Interdimensional Organizations]]\n[[Category:Mystical Organizations]]"
                }
            }
        }
    ],
    "page_id": "793575"
}