{
    "pageid": 1169885,
    "ns": 0,
    "title": "Vox (Super-Inhumans) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Death of Inhumans Vol 1 2 Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Vox]]\n| EditorialNames          = \n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = [[Vox Supreme (Earth-616)|Vox Supreme]]\n| CurrentMembers          = \n| FormerMembers           = [[Maximus Boltagon (Earth-616)|Maximus the Mad]], [[Crystalia Amaquelin (Earth-616)|Crystal]], [[Lockjaw (Earth-616)|Lockjaw]], [[Triton (Earth-616)|Triton]]\n| Allies                  = [[Kree Imperium]]\n| Enemies                 = [[Inhumans (Inhomo supremis)|Inhumans]]\n\n| Origin                  = Genetically-engineered [[Super-Inhumans|Super-Inhuman]] soldiers used to incite the [[Kree Civil War]]\n| PlaceOfFormation        = [[Hala (Planet)|Hala]]\n| PlaceOfDissolution      = \n| Creators                = Donny Cates; Ariel Olivetti\n| First                   = Death of Inhumans Vol 1 1\n| Last                    = \n\n| HistoryText             = The Vox were the next stage of [[Inhumans (Inhomo supremis)|Inhuman]] evolution called [[Super-Inhumans]] and created by the [[Kree Imperium]] to serve in their [[Kree Civil War|civil war]] against the [[Kree Empire]]. They were designed to have the powers of an Inhuman, but none of the humanity, which the [[Kree]] found problematic.{{r|Death of Inhumans Vol 1 1}} The Vox were simply the first in a program the Kree implemented to turn Inhumans into brainwashed agents of theirs.{{r|Death of Inhumans Vol 1 4}} The Vox began a campaign of terror in which they systematically killed thousands of Inhumans, including the [[Universal Inhuman Court (Earth-616)|Universal Inhuman Court]], in order to send a message from the Kree Imperium to the King of the Inhumans of [[Earth]], [[Blackagar Boltagon (Earth-616)|Black Bolt]]: join or die.{{r|Death of Inhumans Vol 1 1}}\n\nWhile the [[House of Agon (Earth-616)|Inhuman Royal Family]] were in shock over the massacre of the Inhuman Court, the Vox and the Kree launched an attack on the Inhuman city of [[New Arctilan]]. The Vox was confronted by Black Bolt's brother, [[Maximus Boltagon (Earth-616)|Maximus]], who fired an energy weapon at him. The Vox shrugged it off and fired a blast of energy that seemingly destroyed Maximus' right arm.{{r|Death of Inhumans Vol 1 1}}\n\nThe Vox told Maximus to give Black Bolt the message to join the Kree Imperium, but Maximus vehemently refused and would have been killed if [[Lockjaw (Earth-616)|Lockjaw]] hadn't appeared. Lockjaw chomped down on the Vox in his jaws before tossing him away; however, the Vox quickly recovered and seemingly killed both Maximus and Lockjaw with energy blasts,{{r|Death of Inhumans Vol 1 1}} though he had actually teleported the pair to an unknown location where they too were converted into agents of the Kree.{{r|Death of Inhumans Vol 1 4}}\n\nWhen [[Karnak Mander-Azur (Earth-616)|Karnak]] arrived on [[Hala (Planet)|Hala]] and stated that the Inhumans wouldn't surrender, the Vox was brought in by the Kree to subdue him. Then Black Bolt appeared to wipe out the Kree, but before Black Bolt could destroy the Vox with his voice, the Vox teleported behind him and slit his throat with a dagger.{{r|Death of Inhumans Vol 1 2}}\n\nDuring the Inhuman Royal Family's final assault on the Kree, the Vox sent an army of brainwashed Inhumans to confront Black Bolt as he entered the location responsible for maintaining the Kree's control over the brainwashed Inhumans. Black Bolt was forced to utilize his powerful voice to wipe out everyone there in order to stop the Kree's plans, and the Vox and his Kree masters were eventually forced to retreat.{{r|Death of Inhumans Vol 1 5}}\n\nIt is unknown what happened to the Vox following the merger of the Kree Imperium with the [[Skrull Empire]].\n\n==Powers==\n'''Super-Inhuman Physiology:''' The Vox possess the typical physical attributes of an Inhuman, but are greater due to forcibly-applied cybernetics.{{r|Death of Inhumans Vol 1 4}}\n* '''Superhuman Durability:''' The Vox possess a highly durable body. They had withstood being blasted by a powerful energy weapon and getting thrashed about while in Lockjaw's powerful jaws.{{r|Death of Inhumans Vol 1 1}}\n* '''Superhuman Reflexes:''' The Vox are extremely reactive, able to avoid an attack from Karnak and quickly subdue him.{{r|Death of Inhumans Vol 1 2}}\n* '''Energy Projection:''' The Vox are capable of projecting blasts of red-colored energy from both their hands and mouth that can easily blow away a target.{{r|Death of Inhumans Vol 1 1}}\n* '''Teleportation:''' The Vox are capable of teleporting unknown distances and are also able to teleport part of themselves to surprise opponents before they have time to react,{{r|Death of Inhumans Vol 1 2}} as well as teleporting others unknown distances using energy beams.{{r|Death of Inhumans Vol 1 2}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = The Vox wield scythes consisting of a handle and blade made of an unknown kind of red energy. It's capable of easily slicing through its victims.{{r|Death of Inhumans Vol 1 1}} They also wield a small, sharp dagger.{{r|Death of Inhumans Vol 1 2}}\n\n| Notes                   = \n| Trivia                  = * The Vox's costume design is similar to that of [[Ahura Boltagon (Earth-9997)|Ahura Boltagon]] of [[Earth-9997]].\n* The Vox's ghastly appearance and use of a scythe may be intended to invoke the perception of the [[Wikipedia:Grim Reaper|Grim Reaper]].\n| Links                   = * [[:Category:Vox (Super-Inhumans) (Earth-616)/Quotes|Quotations by or about Vox (Super-Inhumans) (Earth-616)]]\n}}\n[[Category:Kree Experiment]]\n[[Category:Super-Inhumans]]\n[[Category:Superhuman Durability]]\n[[Category:Energy Projection]]\n[[Category:Superhuman Reflexes]]\n[[Category:Teleporters]]"
                }
            }
        }
    ],
    "page_id": "1169885"
}