{
    "pageid": 262319,
    "ns": 0,
    "title": "Vulturions (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Civil War II Amazing Spider-Man Vol 1 1 Land Variant Textless.jpg\n| ImageSize               = 250px\n| Name                     = Vulturions\n| Aliases                 = \n| Status                  = Active\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Manhattan]], [[New York City]], [[New York (State)|New York]]\n\n| Leaders                 = [[Honcho (Vulturions) (Earth-616)|Honcho]]\n| CurrentMembers          = [[Honcho (Vulturions) (Earth-616)|Honcho]] and two other unnamed members.\n| FormerMembers           = [[Gripes (Vulturions) (Earth-616)|Gripes]], [[Pigeon (Vulturions) (Earth-616)|Pigeon]], [[Sugar Face (Vulturions) (Earth-616)|Sugar Face]].\n| Allies                  = [[Arthur Woodman (Earth-616)|Senator Woodman]]\n| Enemies                 = [[Wernher von Blitzschlag (Earth-616)|Baron von Blitzschlag]], [[Wilson Fisk (Earth-616)|Kingpin]], [[Scarlet Spiders (Team Red) (Earth-616)|Scarlet Spiders]], [[Miles Morales (Earth-1610)|Spider-Man (Morales)]], [[Peter Parker (Earth-616)|Spider-Man (Parker)]], [[Adrian Toomes (Earth-616)|Vulture]]\n\n| Origin                  = Four criminals with costumes and technology based off the Vulture.\n| PlaceOfFormation        = Ryker's Island Prison\n| PlaceOfDissolution      = Manhattan, New York\n| Creators                = Louise Simonson; Greg LaRocque\n| First                   = Web of Spider-Man #1\n| Last                    = \n\n| HistoryText             = After being imprisoned by [[Peter Parker (Earth-616)|Spider-Man]], [[Honcho (Vulturions) (Earth-616)|Honcho]] just happened to share the same cell with [[Adrian Toomes (Earth-616)|Adrian Toomes]]. Feigning ignorance, he learned the villain's secrets of flight and during his parole created four duplicate Vulture costumes. With his three partners in crime (also imprisoned by the wall crawler), this group of formerly common criminals could now take their revenge on Spider-Man.\n\n===First Flight===\nWhile out on a scouting mission, [[Gripes (Vulturions) (Earth-616)|Gripes]] observed Spider-Man fighting [[Venom (Symbiote) (Earth-616)|his costume]], which had taken on a life of its own. Not wanting to take advantage of the hero while he was at a disadvantage, the other Vulturions joined Gripes in battle against the web-head. Despite being preoccupied, Spider-Man fought off three of the Vulturions easily and forced the fourth to fly into the church bell in order to weaken his costume. This last Vulturion, dazed from being smashed into the bell gladly fled the church tower at Spider-Man's direction.{{r|Web of Spider-Man #1}}\n\nHoncho revealed new blow dart weapons to the group, which they used successfully in robbing an armoured car. They next contacted the [[Wilson Fisk (Earth-616)|Kingpin]] and told him of their plans to kill Spider-Man, hoping that he would hire them as assassins. They ambushed Spider-Man in full view of the Kingpin's tower but this agitated his wife, [[Vanessa Fisk (Earth-616)|Vanessa]], who was just beginning to recover from her psychological trauma. Coincidentally Spider-Man was carrying a birthday present for his [[Maybelle Parker (Earth-616)|Aunt May]] (a hat,) putting the hero at a severe disadvantage against his attackers since he could not allow it to be damaged. Regardless of this advantage the Vulturions were defeated one by one however they did manage nail the hero with several darts resulting in his loss of consciousness after the battle as the hat blew away. Kingpin was pleased with Spider-Man for ending the disturbance and restored/returned the hat good as new, the Vulturions earning the mobster's disdain.{{r|Web of Spider-Man #2}}\n\n[[File:Adrian Toomes (Earth-616) and Vulturions (Earth-616) from Web of Spider-Man Vol 1 3 0001.jpg|thumb]]\nAdrian Toomes, having read the newspaper reports of the Vulturion's exploits, was furious over their usurping of his identity. Designing a new costume and breaking free from prison, Toomes located and attacked the four Vulturions. Though outnumbered, the Vulture's superior experience and determination won out and he began to whittle down the group. Planning to finish off each member in sequence after their defeat, Spider-Man decided to get involved. Despite taking another dart to the arm, the hero webbed up the last of the Vulturions, passing out afterward leaving them at the mercy of the Vulture. The group was placed under police custody.{{r|Web of Spider-Man #3}}\n\n===Civil War===\n[[File:Vulturions (Earth-616) from Avengers The Initiative Vol 1 7 0001.jpg|thumb|left]]\nWith his old crew gone, Honcho found two new members for the Vulturions. Shortly after, the group was hired by [[Arthur Woodman (Earth-616)|Senator Woodman]], a [[Hydra (Earth-616)|Hydra]] agent, to steal Gamma-enhancement secrets from [[Wernher von Blitzschlag (Earth-616)|Baron von Blitzschlag]]. The Vulturions successfully stole the case from Blitzschlag, but an out of costume [[Peter Parker (Earth-616)|Peter Parker]] and the [[Scarlet Spiders (Team Red) (Earth-616)|Scarlet Spiders]] soon caught up with and defeated the group.{{r|Avengers: The Initiative #7}}\n\n===Civil War II===\nThe Vulturions later resurface with upgraded equipment and still using their moniker. They were in the middle of a heist where they end up fighting Spider-Man again.{{r|Civil War II: Amazing Spider-Man Vol 1 1}}\n\n==Equipment==\n[[File:Vulturions_(Earth-616)_and_Peter_Parker_(Earth-616)_from_Civil_War_II_Amazing_Spider-Man_Vol_1_1_001.jpg|thumb]]\n*'''[[Vulture's Wings|Electromagnetic Wing Harness]]:''' Each of the Vulturions wore near duplicates of the Vulture's costume, which granted peak to enhanced human strength and winged flight. Utilizing this harness the Vulturions are able to fly with a natural winged flight limit (95 miles per hour) and attain a maximum height of 11,000 feet.\n*'''Transportation:''' The Vulturions prefer Flight.\n*'''Weapons: Blow-dart Guns:''' The Vulturions used blow darts containing a derivative of curare, which causes total paralysis and is often fatal if a patient is not hospitalized and treated for respiratory paralysis immediately. Unfortunately for the group however, when used on Spider-Man it seems to work similarly to a powerful sedative.\n*'''Special Corrosive:'''They were also shown using a corrosive to melt through glass.\n| Notes                   =\n| Trivia                  =\n| Links                   =\n}}\n[[Category:Spider-Geddon participants]]"
                }
            }
        }
    ],
    "page_id": "262319"
}