{
    "pageid": 512292,
    "ns": 0,
    "title": "Walking Dead (Japanese) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Walking Dead (Japanese) (Earth-616) from Captain America Comics Vol 1 50 0001.jpg\n| Name                    = Walking Dead\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Peter Anzel\n| Allies                  = [[Imperial Japan (Earth-616)|Imperial Japan]]\n| Enemies                 = [[William Nasland (Earth-616)|Captain America]], [[Fred Davis Jr. (Earth-616)|Bucky]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Vince Alascia\n| First                   = Captain America Comics Vol 1 50\n| Last                    = Captain America Comics Vol 1 50\n\n| HistoryText             = The so-called Walking Dead were a group of [[Imperial Japan (Earth-616)|Japanese spies]] active during [[World War II]]. They were led by American traitor Peter Anzel, who owned Lawmere Cemetery. In 1945, they were spying on chemist John Porter and witnessed as he tested a new biological weapon on his cattle, killing them. John soon died of a fatal illness and instructed his sister to bury him in secrecy with the formula, making her promise to only recover it should the Allies needed an edge to win the war.\n\nSuspecting that John had his secret weapon buried with him but not knowing where his body was kept, Anzel and his Japanese allies dressed up as corpses and began searching the cemetery so that they could frighten the locals away. When news of the \"Walking Dead\" became wide spread, Anzel led a group of locals and the authorities to the cemetery and succeeded in frightening off any curious parties. That is, until, [[William Nasland (Earth-616)|Captain America]] and [[Fred Davis Jr. (Earth-616)|Bucky]] began investigating the strange happenings, suspecting that they were searching for Porter's weapon. \n\nCaptain America and Bucky failed to stop the Walking Dead from capturing John's sister Laura and forcing her to show them the hidden tomb where her brother was buried. As Cap and Bucky fought the spies, Anzel slipped into the secret tomb and attempted to abscond with the formula. However, clashing with Captain America, the formula was knocked into a furnace and destroyed. Anzel was soon defeated and unmasked, and he and his minions were turned over to the authorities.{{r|Captain America Comics Vol 1 50}}\n\nTheir subsequent fate is unknown.\n\n| Equipment               = The Walking Dead wore ghoulish masks and make up to appear as though they were zombies.\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "512292"
}