{
    "pageid": 506487,
    "ns": 0,
    "title": "Walking Dead (Criminals) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Walking Dead (Criminals) (Earth-616) from Mystic Comics Vol 2 4 0001.jpg\n| Name                    = Walking Dead\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = Killer Bane, Strangler Carson, Monk Kain, Lippy Dirk\n| Allies                  = \n| Enemies                 = [[Young Allies (WWII) (Earth-616)|Young Allies]]\n\n| Origin                  = A gang of criminals brought back from the dead\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Mystic Comics Vol 2 4\n| Last                    = Mystic Comics Vol 2 4\n\n| HistoryText             = In 1944, scientist and graveyard caretaker Professor Malous completed a formula that could bring the dead back to life. That summer, criminal Killer Bane was captured by the [[Young Allies (WWII) (Earth-616)|Young Allies]] and was sentenced to death by electric chair. On his execution date, Bane vowed to get revenge on those responsible for sending him to death row. After his execution, he was buried in the cemetery that was cared for by Malous. Professor Malous dug up the body of Killer Bane and used his formula on the corpse. It was a success. However, the reanimated Killer Bane murdered Malous and resumed his criminal career. Once more pursued by the Young Allies, Killer Bane managed to slip away through a secret passage in Malous' mansion. There Bane found the formula for Malous' reanimation compound and decided to use it to his advantage.\n\nHe dug up the bodies of notorious criminals Strangler Carson, Monk Kain, and Lippy Dirk and used the formula to resurrect them as well. The undead crooks then committed a series of crimes. Followed back to their hideout by the Young Allies, the heroes realized that the crooks were vulnerable to fire. [[Thomas Raymond (Earth-616)|Toro]] then set the mansion ablaze while his teammates fled. Inside, Killer Bane and his fellow walking dead were incinerated.{{r|Mystic Comics Vol 2 4}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = Each member had their own firearms.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "506487"
}