{
    "pageid": 62790,
    "ns": 0,
    "title": "Warbound (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Warbound (Earth-616) from World War Hulk Vol 1 2 0001.jpg\n| ImageSize               = 250px\n| Name                    = Warbound\n| Aliases                 = \n\n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Shadow People's stone starship; formerly [[Sakaar]]\n\n| Leaders                 = [[Katherine Waynesboro (Earth-616)|Katherine Waynesboro]], formerly [[Bruce Banner (Earth-616)|Hulk]]\n| CurrentMembers          = [[No-Name (Earth-616)|No-Name]], [[Elloe Kaifi (Earth-616)|Elloe Kaifi]], [[Korg (Earth-616)|Korg]] \n| FormerMembers           = [[Caiera (Earth-616)|Caiera Oldstrong]], [[Bruce Banner (Earth-616)|Hulk]], [[Arch-E-5912 (Earth-616)|Arch-E-5912]], [[Hiroim (Earth-616)|Hiroim]], [[Miek (Earth-616)|Miek]], [[Mung (Earth-616)|Mung]]\n| Allies                  = [[Incredible Hulks]]\n| Enemies                 = [[Heroes for Hire (Oracle Inc.) (Earth-616)|Heroes for Hire]], [[Illuminati (Earth-616)|Illuminati]], [[Samuel Sterns (Earth-616)|Leader]]\n\n| Origin                  = The Warbound were forged on the planet Sakaar to overthrow the reign of the Red King. \n| PlaceOfFormation        = [[Sakaar]]\n| PlaceOfDissolution      = \n| Creators                = Greg Pak\n| First                   = Incredible Hulk Vol 2 94\n\n| Quotation               = Let us be Warbound. In life and death, the oath that cannot be broken. He was Lavin Skee, protector of Elloe Kaifi and hero of our second trial. We who honor him speak our true names and bind to each other forever.\n| Speaker                 = [[Hiroim (Earth-616)|Hiroim]] \n| QuoteSource             = Incredible Hulk Vol 2 94\n\n| HistoryText             = The Warbound are a group of interplanetary refugees late of the planet Sakaar. Led by the exiled Earth champion, the Hulk, the Warbound agreed to assist the Hulk in his plan of revenge against those responsible for his exile, the Illuminati. Piloting an Earthen ship, the Warbound brought the Hulk from Sakaar to Earth's Moon, where he was able to extract revenge against the first of his chosen adversaries, Black Bolt. They then brought him to Earth, where they destroyed a squadron of remote-controlled Iron Man robots.\n\nEventually the Warbound helped to defeat some of the heroes, bringing them to Madison Square Gardens to witness the defeat of the Illuminati. However, when the final battle between the Hulk and the Sentry began to cause serious damage, the Warbound collaborated with the heroes to help the civilians evacuate, the Warbound being unwilling to witness another world die. Miek's treachery of genocidal negligence was then revealed, as he had merely observed and done nothing while loyalist followers of the Red King plant bombs which will trigger the destruction of Sakaar. He had not intervened because he believed that it was necessary to 'remind' the Hulk that he was a killer instead of a peacemaker. The Hulk and No-Name the Brood King nearly killed him upon learning of this, and the surviving Warbound subsequently surrender to the government with the Hulk's defeat. They are held in custody by S.H.I.E.L.D but subsequently escaped after Hiroim (with help from Korg and the Thing) prevented Manhattan from breaking in two.\n\nAfter the Warbound evade S.H.I.E.L.D. capture and only to be teleported to New Mexico by the [[Samuel Sterns (Earth-616)|Leader]], who used Hiroim's tectonic power to activate a Gamma-powered shield, over a large portion of the desert. They are being chased by S.H.I.E.L.D using information given by an incapacitated and incarcerated Miek to Shield Agent Kate Waynesboro. Trapped inside Gammaworld, the Warbound join forces with a local US Army company to save a nearby town from irradiated (and thus huge) insects, and begin to feel the effects of the gamma radiation themselves. Using Hiriom's Oldstrong power, the group manages to dispel some of the radiation, opening a gap in the Gammaworld dome for the civilians to escape through, but are interrupted by the arrival of a huge, gamma-powered gestalt being composed of numerous townsfolk and a dog fused together by the radiation. The creature, known as Horde, attempts to destroy everyone who tries to leave, but is fended off by Agent Waynesboro, and as the Warbound attacks the Leader, Hiroim tells Korg to kill him in order to destroy the dome. Korg shatters Hiroim and the dome dissipates; however Hiroim reforms, as does the dome. The group are then attacked by S.H.I.E.L.D. sentry robots, which have been placed under the Leader's control. In the ensuing battle, Elloe stabs the Leader in the chest. The Leader then absorbs the Dome's power, turning into a gray skinned giant. Hiroim stops him, killing himself in the process. Before dying he passes on his old power to Kate, who protects the remaining people from an attacking monster.\n\n| Equipment               = \n| Transportation          = Unnamed space vessel composed primarily of stone\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "62790"
}