{
    "pageid": 1070949,
    "ns": 0,
    "title": "Warriors (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Secret Warriors Vol 2 1 Nakayama Variant Textless.jpg\n| ImageSize               = 300px\n| Name                    = Warriors\n| EditorialNames          = [[Secret Warriors]]\n| Aliases                 = \n\n| Status                  = Defunct\n| Alignment               = \n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n\n| Leaders                 = formerly [[Daisy Johnson (Earth-616)|Quake]]\n| CurrentMembers          = \n| FormerMembers           = [[Karnak Mander-Azur (Earth-616)|Karnak]], [[Devil Dinosaur (Earth-78411)|Devil Dinosaur]], [[Dante Pertuz (Earth-616)|Inferno]], [[Lunella Lafayette (Earth-616)|Moon Girl]], [[Kamala Khan (Earth-616)|Ms. Marvel]], [[Daisy Johnson (Earth-616)|Quake]]\n| Allies                  = [[Underground (Secret Empire) (Earth-616)|The Underground]], [[Leer (Earth-616)|Leer]], [[Illyana Rasputina (Earth-616)|Magik]]\n| Enemies                 = [[Hydra (Earth-616)|Hydra]], [[Avengers (Hydra) (Earth-616)|Hydra's Avengers]], [[Calvin Zabo (Earth-616)|Mister Hyde]], [[Henry McCoy (Earth-295)|Dark Beast]], [[Nathaniel Essex (Earth-616)|Mister Sinister]]\n\n| Origin                  = When [[Secret Empire (Event)|Captain America took over America]], Daisy Johnson formed a team of [[Inhumans (Inhomo supremis)|Inhumans]] to find another [[Leer (Earth-616)|Inhuman]] who could help take him down. \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Matthew Rosenberg; Javier Garrón\n| First                    = Secret Warriors Vol 2 1\n\n| HistoryText             = The Warriors were an ad-hoc team created by [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] agent [[Daisy Johnson (Earth-616)|Quake]] to resist [[Hydra (Earth-616)|Hydra]] after it took over the [[United States of America|United States]]. Quake was forced to hide after her team the [[Moth Squadron (Earth-616)|Moth Squadron]] was wiped out by the [[Wrecking Crew (Earth-616)|Wrecking Crew]]. She sent out a call for help, but the only ones to respond to the call were [[Kamala Khan (Earth-616)|Ms. Marvel]], [[Lunella Lafayette (Earth-616)|Moon Girl]], and Moon Girl's partner [[Devil Dinosaur (Earth-78411)|Devil Dinosaur]].{{r|Secret Warriors Vol 2 1}}\n\nAfter busting up a Hydra caravan transporting Inhuman prisoners and recruiting the Inhuman [[Dante Pertuz (Earth-616)|Inferno]], the Warriors attacked an Inhuman prisoner camp in [[New Jersey (State)|New Jersey]] and rescued the Inhuman royal [[Karnak Mander-Azur (Earth-616)|Karnak]]. Karnak told the team that there was a certain Inhuman named [[Leer (Earth-616)|Leer]] that could help turn the tide against Hydra.{{r|Secret Warriors Vol 2 1}} So, the Warriors traveled west in search for this Inhuman. After fighting off the brainwashed [[Howling Commandos (S.H.I.E.L.D.) (Earth-616)|Howling Commandos]], the Warriors crashed through a gate on the border of the United States and the mutant nation of [[New Tian]].{{r|Secret Warriors Vol 2 2}}\n\nAfter ditching the mutant guards that were escorting them out of New Tian, the Warriors stumbled upon a laboratory run by the evil mutant scientist [[Henry McCoy (Earth-295)|Dark Beast]] where was experimenting on Inhumans. After a brutal interrogation by Quake and Karnak, Dark Beast admitted that he had Leer once but had turned him over to Hydra. After mutant forces of New Tian had arrived, Dark Beast was handed over to them who then ordered the Warriors to leave. However, the Warriors were intercepted by Hydra forces led by Quake's notorious father [[Calvin Zabo (Earth-616)|Mister Hyde]].{{r|Secret Warriors Vol 2 3}}\n\nBack by by [[Avengers (Hydra) (Earth-616)|Hydra's Avengers]], Hydra captured the Warriors and took them prisoner aboard a Hydra Helicarrier. The Warriors were able to stage an escape after Quake used her seismic powers to fatally disable the Helicarrier. The Warriors abandoned the Helicarrier with help from New Tian's mutants except for Moon Girl who stayed aboard to rescue her partner Devil Dinosaur. She unexpectedly encountered Leer before being captured by Mister Hyde.{{r|Secret Warriors Vol 2 4}}\n\nMoon Girl and Leer were taken by Mister Hyde to the Inhuman city of [[New Attilan]], which Hydra had turned into an internment camp for [[Terrigenesis#Humans|NuHumans]] and Inhumans like them. The Warriors learned where the two were being held from Moon Girl herself after transferring consciousness with Devil Dinosaur. Upon arriving in New Attilan, the Warriors found Moon Girl and Leer and learned that Dark Beast's experiments had activated powers within Leer, which allowed him to boost the powers of other Inhumans. Leer then used his powers to boost the powers of the Warriors so they could lead the Inhuman prisoners of New Attlian in an uprising against Hydra. With help from the [[Underground (Secret Empire) (Earth-616)|Underground]], Hydra was forced out of New Attilan. The Warriors then had to rescue Quake after she was taken by Mister Hyde. They knocked Hyde's ship out of the sky while Karnak struck Hyde's pressure points to stop him for good.{{r|Secret Warriors Vol 2 5}}\n\nThe Warriors disbanded soon after Hydra's fall but were forced to reunite to prevent Quake from killing [[Wade Wilson (Earth-616)|Deadpool]] in revenge for killing [[Phillip Coulson (Earth-616)|Agent Coulson]]. They were then forced to ban together after learning that Dark Beast had taken Inferno's niece [[Ariela Pertuz (Earth-616)|Ariela]] under orders from [[Nathaniel Essex (Earth-616)|Mister Sinister]] to get back at Karnak for ending their deal to recreate the Terrigenesis process.{{r|Secret Warriors Vol 2 6|8}}\n\nWith help from [[Illyana Rasputina (Earth-616)|Magik]], the Warriors located Mister Sinister's laboratory. They didn't find Ariela, but they did find other Inhuman children Sinister and Dark Beast had been experimenting on. While trying to get the children back to their homes, they were confronted by Sinister, Dark Beast, and a team of creatures under their command. Sinister decided to leave the Warriors alone but warned them he would only give back Ariela if Karnak allowed him to \"finish what they started.\" As the Warriors were returning the last child to his home, they discovered too late that the child was rigged to explode by Sinister.{{r|Secret Warriors Vol 2 8|9}}\n\nThe Warriors escaped injury thanks to Magik, but they were branded criminals and forced to stay in New Attilan until the situation was sorted out. After learning from Leer that Terrigen Crystals were hidden in the Inhuman throne room, Inferno broke into the throne room, stole the crystals, and took off in a stolen ship in a desperate attempt to rescue his niece.{{r|Secret Warriors Vol 2 10}} The Warriors were unable to stop Inferno from meeting up with Sinister, but they were able to rescue Ariela. The Warriors later met up with Karnak and confronted Sinister at Karnak's Tower of Wisdom where Sinister had set up a new laboratory. Magik later showed up with a large contingent of Inhumans to fight off Sinister's Inhuman soldiers. Sinister was about to use Inferno as a sacrifice in order to recreate the Terrigenesis process, but he was thwarted by Moon Girl when she smashed a vial containing Terrigen Mists that nearly poisoned Sinister to death.{{r|Secret Warriors Vol 2 11}}\n\nKarnak then revealed that he used the whole situation to take control of the [[Ennilux (Earth-616)|Ennilux Corp.]] so he could hand its control over to Moon Girl who he believed was the perfect person to lead the Inhumans and finish the recreation of the Terrigensis process. Moon Girl rebuked Karnak and returned control of Ennilux to [[Ahura Boltagon (Earth-616)|Ahura Boltagon]]. For their actions, interim Inhuman leader [[Xiaoyi Chen (Earth-616)|Iso]] banished Inferno and Karnak from New Attilan.{{r|Secret Warriors Vol 2 11}} The Warriors later disbanded again but on good terms.{{r|Secret Warriors Vol 2 12}}\n\n| Equipment               = Each member's respective equipment\n| Transportation          = Various stolen vehicles\n| Weapons                 = Each member's respective weapons\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:2017 Team Debuts]]"
                }
            }
        }
    ],
    "page_id": "1070949"
}