{
    "pageid": 44419,
    "ns": 0,
    "title": "Watchdogs (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Watchdogs (Earth-616) from Gamer's Handbook of the Marvel Universe Vol 5 001.jpg\n| Name                    = [[Watchdogs]]\n| Aliases                 = \n\n| Leaders                 = [[Johann Shmidt (Earth-616)|Red Skull]] (secret leader), Watchdog Prime (leader)\n| CurrentMembers          = [[Harold Simmons (Earth-616)|Harold Simmons]], [[Menkin (Watchdogs) (Earth-616)|Menkin]]\n| FormerMembers           = [[Jonathan Walker (Earth-616)|John Walker]] (undercover), [[Rainer (Watchdogs) (Earth-616)|Rainer]] (deceased)\n\n| Identity                = Secret\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Jonathan Walker (Earth-616)|Captain America (John Walker)]], [[Lemar Hoskins (Earth-616)|Battlestar]], [[Steven Rogers (Earth-616)|Captain America (Steve Rogers)]], [[Kaine Parker (Earth-616)|Scarlet Spider]], [[Wally Layton (Earth-616)|Officer Wally Layton]]\n\n| Origin                  = Terrorist Organization\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = 'Dogpounds' in various states across America\n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n\n| Creators                = Mark Gruenwald; Tom Morgan\n| First                   = Captain America #335\n\n| History                 = {{Quote|They're an extremist right-wing group, they hadn't been seen for a while. Organized, well funded, violent... They were known for attacking abortion clinics, pornographers, homosexuals... mostly moral issues. They got a lot of support, playing on people's fear.|[[Wally Layton (Earth-616)|Officer Wally Layton]]|Scarlet Spider Vol 2 5}}\n\n===Overview===\nThe Watchdogs were apparently an extreme right-wing terrorist group who claimed to be dedicated to upholding and restoring traditional American values, and sought to impose their moral views upon others using violence, terrorist attacks, and intimidation. They opposed pornography, obscene materials, homosexuality, abortion and sex education, among other subjects, and used arson, vandalism, assault, abduction and murder as their tactics.{{r|Captain America #335}}\n\n===Events===\nAs one of their first missions, [[Jonathan Walker (Earth-616)|John Walker]], who had recently taken over the role of Captain America, and his partner [[Lemar Hoskins (Earth-616)|Lemar Hoskins]] were sent to investigate the group. Walker inveigled his way into the group, while Hoskins posed as a pornographer. Walker felt somewhat conflicted, as many of the Watchdogs' views matched his own. The Watchdogs attempted to lynch Hoskins because of his supposed crimes, as Walker looked on, worried for his friend's safety. Due to his superhuman strength, however, Hoskins' neck muscles were strong enough for him to survive being hanged. Walker and Hoskins busted that particular local 'pack' or 'Dogpound,' though others continued to operate.{{r|Captain America #335}}\n\nSoon after this, two of Walker's disgruntled former partners, the [[Hector Lennox (Earth-616)|Left-Winger]] and the [[Jerome Johnson (Earth-616)|Right-Winger]] vindictively revealed Walker's secret identity on national television. To take revenge on Walker, the Watchdogs abducted Walker's parents to force Walker to turn himself in to them. When he did, they attempted to execute him. In the ensuing fight, Walker's parents were shot dead. Walker went berserk on seeing his parents' murder, and slaughtered those Watchdogs in attendance.{{r|Captain America #345}}\n\nUnknown to all but the Watchdogs' leader, Watchdog Prime (or 'Top Dog') and a few others, the group were actually funded by the Nazi criminal the [[Johann Shmidt (Earth-616)|Red Skull]]. The Red Skull sought to use the Watchdogs to undermine America from within.{{r|Captain America #350}} Watchdog Prime acted as one of the Red Skull's division chiefs.{{r|Captain America #394}}\n\nThe Red Skull lured Walker and the previous Captain America [[Steven Rogers (Earth-616)|Steve Rogers]] (then known simply as The Captain) to his headquarters, hoping they would kill each other. Also in attendance were representatives of various groups the Red Skull had a hand in - an [[Underground Liberated Totally Integrated Mobile Army To Unite Mankind (Earth-616)|U.L.T.I.M.A.T.U.M.]] agent, a member of the [[Mutant Force (Earth-616)|Resistants]], an unidentified [[Scourge|Scourge of the Underworld]], and a Watchdog among them.{{r|Captain America #350}}\n\nWhen Rogers was later reinstated as Captain America, the Watchdogs abducted his former girlfriend [[Bernadette Rosenthal (Earth-616)|Bernie Rosenthal]], and Rogers and Walker (by that time known as the USAgent) rescued her, smashing the Watchdogs' Vermont pack in the process.{{r|Captain America #385|386}}\n\nFollowing the defeat of the regime headed by the fascist [[Steven Rogers (Earth-61311)|Supreme Commander]], the Watchdogs took on new apparel, including masks based on the Confederate colors, and began attacking and kidnapping immigrants trying to cross the United States border. They used cloaking and teleporting technology supplied by [[Advanced Idea Mechanics (Earth-616)|A.I.M.]].{{r|Captain America Vol 9 13|14}}\n| Equipment               = The Watchdogs wore identical costumes similar to riot gear, including armored kevlar vests, and helmets with built-in visors.{{r|Captain America #335}}\n\nWatchdogs also carried walkie-talkies, and short-wave radios.{{r|Captain America #335}}\n\nThe Watchdogs customarily fitted their hostages with 'dog collars' that administered an electric shock.{{r|Captain America #345}}\n| Transportation          = Watchdogs used their own vehicles, usually pick-ups, vans, motorcycles, and RVs.{{r|Captain America #335}}\n| Weapons                 =  Watchdogs armed themselves with conventional American-manufactured handguns, shotguns, and rifles, and Army surplus explosives.{{r|Captain America #335}} The Red Skull specifically denied Watchdog Prime access to exotic weaponry so that they continued to look like a \"grassroots\" movement.{{r|Captain America #394}}\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]\n[[Category:Mark Gruenwald/Creator]]\n[[Category:Tom Morgan/Creator]]"
                }
            }
        }
    ],
    "page_id": "44419"
}