{
    "pageid": 542583,
    "ns": 0,
    "title": "Wild Bunch (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Wild Bunch (Earth-616) from Kid Colt Vol 1 2 0001.jpg\n| Name                    = Wild Bunch\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mogollon Range, [[New Mexico (State)|New Mexico]]\n\n| Leaders                 = Formerly Moseby\n| CurrentMembers          = \n| FormerMembers           = Moseby (Deceased), [[Blaine Colt (Earth-616)|Kid Colt]], Dick Darnell\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = \n| First                   = Kid Colt Vol 1 2\n| Last                    = Kid Colt Vol 1 2\n\n| HistoryText             = The Wild Bunch were a gang of outlaws that were active during the days of the American Frontier. Their leader was a man named Moseby and they ran along the Mogollon Range in New Mexico. The gang gained notoriety in the region prompting a cowboy named Dick Darnell to seek them out for membership after he was fired from the Chessnell Ranch and the ranchers' daughter Louise turned down his marriage proposal. Along the way, he ran into outlaw gunfighter [[Blaine Colt (Earth-616)|Kid Colt]] who agreed to accompany him and join the gang. Moseby was instantly impressed by Kid Colt's status as an outlaw and after Colt gunned down one of Moseby's men, both he and Darnell were welcomed into the gang.\n\nDarnell instantly got cold feet because Moseby decided to raid the Chessnell Ranch next. Kid Colt forced Dick to stick with the plan, hoping to teach the young man that outlaw living was not a nice way of living. The raid happened and the Chessnell ranch was quickly subdued. When Moseby attempted to have his way with Louise, Kid Colt shot out a lantern and he, Louise, and Dick fled into the dark. Moseby had Mr. Chessnell his prisoner and pushed him out into the open as Dick was happening by in the dark. Thinking Chessnell was really Moseby, he shot him dead. Soon the law arrived chasing the Wild Bunch away, leaving Kid Colt and Dick at the scene.\n\nLouise accused Dick of murdering her father in cold blood and the locals agreed that he should hang. Kid Colt however raced off to catch up with the Wild Bunch where he gunned down Moseby and most of the gang and fled back to town. There he shot Dick free of the noose that was about to hang him. Kid Colt then explained to those gathered that Dick had killed Moseby, but the gang tried to flee with the body so he would be blamed for the murder of Chessnell, then Kid Colt took claim of shooting Chessnell and soon fled town under a hail of bullets. Dick and Louise eventually married.{{r|Kid Colt Vol 1 2}}\n\nThe surviving members of the Wild Bunch likely disbanded shortly there after.\n\n| Equipment               = \n| Transportation          = Each member rode a horse.\n| Weapons                 = Members of the wild bunch carried six-shooters or rifles.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Western Teams]]\n[[Category:Shooting]]\n[[Category:Equestrianism]]"
                }
            }
        }
    ],
    "page_id": "542583"
}