{
    "pageid": 21794,
    "ns": 0,
    "title": "Witches (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = \n| Name                    = Witches\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]]\n\n| Leaders                 = [[Doctor Strange (Stephen Strange)|Doctor Strange]] \n| CurrentMembers          = \n| FormerMembers           = [[Jennifer Kale]], [[Satana]], [[Topaz (Earth-616)|Topaz]] \n\n| Allies                  = [[Glamour]] and [[Illusion]]; [[Wong]]\n| Enemies                 = [[Hellphyr]] \n\n| Origin                  = \n| PlaceOfFormation        = [[Sanctum Sanctorum]], [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Brian Patrick Walsh; Mike Deodato Jr.\n| First                   = Witches #1\n| Last                    = \n\n| HistoryText             = [[Andy Kale]], the younger brother of sorceress, Jennifer Kale, accepted a position working at the New York Public Library. He came into contact with an ancient mystical text known as the Tome of Zhered-Na. Ignorant of the fact that the book was bonded to the Kale family, Andy unwittingly used it to release a powerful demon known as Hellphyr. Hellphyr’s entrance into the Earth realm immediately triggered the mystic senses of sorcerer supreme, Doctor Strange. Recognizing the threat that Hellphyre represented, Strange set about forming a team of mystics to counter the demon. He first contacted his student and trusted friend, Topaz, and convinced her to join him in facing this new menace. Strange then traveled to Citrusville, Florida where he contacted Andy’s sister, Jennifer. Jennifer had little interest in cooperating with Strange, but soon changed her mind when she realized that her brother was responsible for bringing Hellphyr to Earth. The third and final member of the coven proved to be problematic. Working from the cellar of his Sanctum Sanctorum, Strange used dark magic to summon Satan's daughter, Satana, from the pits of Hell. \n\n| Equipment               = [[Tome of Zhered-Na]]\n| Transportation          = \n| Weapons                 = \n\n| Notes                   = * The Witches were created by Brian Patrick Walsh and Mike Deodato Jr. (individual team members were created by separate writers).\n| Trivia                  = * The Witches roster is comprised of characters who were formerly supporting cast members from older, defunct titles. Jennifer Kale was a recurring character from [[Fear Vol 1|Fear]], Satana was a spotlight character in [[Haunt of Horror Vol 2|Haunt of Horror]] magazine, and Topaz was a supporting cast member from [[Werewolf by Night Vol 1|Werewolf By Night]] and later, [[Doctor Strange Vol 2|Doctor Strange (Volume 2)]]. \n\n*Jennifer Kale jokingly referred to their group as ''Charlie's Angels'', a reference to a popular '70s television series featuring three female private detectives employed by an enigmatic boss known only as ''Charlie''. \n| Links                   = * [http://www.marveldirectory.com/individuals/k/kalejennifer.htm Jennifer Kale biography page at the Marvel Directory]\n* [http://www.marveldirectory.com/individuals/s/satana.htm Satana biography page at the Marvel Directory]\n* [http://www.marveldirectory.com/individuals/d/drstrange.htm Doctor Strange biography page at the Marvel Directory]\n* [http://www.marveldirectory.com/individuals/w/wong.htm Wong biography page at the Marvel Directory]\n}}\n[[Category:Mystical Organizations]]"
                }
            }
        }
    ],
    "page_id": "21794"
}