{
    "pageid": 469060,
    "ns": 0,
    "title": "Witches of Encore (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Witches of Encore (Earth-616) from Marvel Mystery Comics Vol 1 29 001.jpg\n| Name                    = Witches of Encore\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Nowhere]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = [[Jimmy Jupiter (Earth-616)|Jimmy Jupiter]], [[Ruffy Rabbit (Earth-616)|Ruffy Rabbit]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Ed Robbins\n| First                   = Marvel Mystery Comics Vol 1 29\n| Last                    = Marvel Mystery Comics Vol 1 29\n\n| HistoryText             = The Witches of Encore reside in the realm known as [[Nowhere]], which may or may not be a figment of [[Jimmy Jupiter (Earth-616)|Jimmy Jupiter's]] imagination. They were able to cast spells, although the exact limitations of their magical abilities are unknown. They at least appeared capable of creating a mystical barrier that could only be broken by a good luck charm. This was not limited to a lucky rabbit's foot, even if it was still attached to a very much alive rabbit.\n\nDuring Jimmy's second visit to Nowhere he and his new friend [[Ruffy Rabbit (Earth-616)|Ruffy Rabbit]] were captured by the Witches and taken back to their castle where the Witches intended to eat both the boy and hare. They trapped the two in a mystical circle while they prepared to cook the duo. \n\nWhen Jimmy and Ruffy escaped, one of the exit doors they took brought them right to the witches, who attempted to capture them. Jimmy quickly grabbed a pin from one of the Witches Sunday hats and poked her with it, causing her to deflate. At the sight of one of their fellow Witches being killed the remaining two witches fled from Jimmy and Ruffy as they escaped the castle.\n\nThe fate of the remaining two witches is unknown. \n| Equipment               = \n| Transportation          = The Witches traveled around Nowhere on flying broomsticks.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Nowhere]]"
                }
            }
        }
    ],
    "page_id": "469060"
}