{
    "pageid": 804963,
    "ns": 0,
    "title": "Wolverines (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Title                   = [[Wolverine]]s\n| Image                   = Wolverines Vol 1 1 Howard Variant Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[Wolverine]]s{{r|Wolverines Vol 1 1}}\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Croatia]], [[Changeling (Plane)|Changeling]]\n\n| Leaders                 = Formerly [[Raven Darkholme (Earth-616)|Mystique]]\n| CurrentMembers          = \n| FormerMembers           = [[Laura Kinney (Earth-616)|X-23]], [[Victor Creed (Earth-616)|Sabretooth]], [[Akihiro (Earth-616)|Daken]], [[Yuriko Oyama (Earth-616)|Lady Deathstrike]], [[Raven Darkholme (Earth-616)|Mystique]]\n| Allies                  = [[Eric Brooks (Earth-616)|Blade]], [[:Category:Abraham Cornelius Experiment|Weapon X]]\n| Enemies                 = Arcadia Group, [[Frost Giants]], [[Siphon (Earth-616)|Siphon]], [[Nathaniel Essex (Earth-616)|Mister Sinister]], [[Harold Stanch (Earth-616)|Neuro]], [[Vampires]], [[Wrecking Crew (Earth-616)|Wrecking Crew]], [[Fang (Imperial Guard) (Earth-616)|Fang]]\n\n| Origin                  = After the death of [[Wolverine]], [[Sharp (Earth-616)|Shogun]] had captured five individuals who had healing factors in order to find a cure for the experiments that Abraham Cornelius had done for [[:Category:Abraham Cornelius Experiment|his recent test subjects]].\n| PlaceOfFormation        = [[Croatia]]\n| PlaceOfDissolution      = [[Florida (State)|Florida]]\n| Creators                = Charles Soule; Peter Nguyen\n| First                   = Death of Wolverine: The Logan Legacy Vol 1 7\n| Last                    = Wolverines Vol 1 20\n\n| HistoryText             = After successfully finding and kidnapping the \"Wolverines\" ([[Raven Darkholme (Earth-616)|Mystique]], [[Akihiro (Earth-616)|Daken]], [[Victor Creed (Earth-616)|Sabretooth]], [[Yuriko Oyama (Earth-616)|Lady Deathstrike]] and [[Laura Kinney (Earth-616)|X-23]]), and threatening them with the \"control words\" (that manipulate, sedate or even kill each of them), [[Sharp (Earth-616)|Shogun]], [[Harold Stanch (Earth-616)|Neuro]], [[Meifeng (Earth-616)|Endo]], [[Skel (Simpson) (Earth-616)|Skel]], and [[Daniel Silva (Earth-616)|Junk]] team up with them to find the [[Adamantium]]-petrified body of [[James Howlett (Earth-616)|Wolverine]] in the burnt-down [[Paradise (Weapon X)|Paradise]] facility, where they encountered and fought the [[Wrecking Crew (Earth-616)|Wrecking Crew]], who were hired by [[Nathaniel Essex (Earth-616)|Mr. Sinister]] to find . When [[Laura Kinney (Earth-616)|X-23]] and [[Akihiro (Earth-616)|Daken]] found the body, [[Mister Sinister]] appeared and took [[Wolverine]]'s body with him, plus an eye and an arm from Daken, who lost his healing factor in a previous battle against [[Siphon (Earth-616)|Siphon]].{{r|Death of Wolverine: The Logan Legacy Vol 1 7}}{{r|Wolverines Vol 1 1}}\n\nOn the [[Changeling (Plane)|Changeling]] ship, Sharp used a [[Regen Serum]] made by [[Abraham Cornelius (Earth-616)|Dr. Cornelius]] that he found in the wreckage to stabilize and save Daken, much to [[Ogun (Ninja) (Earth-616)|Ogun]]'s dismay. When the team started planning how to retrieve Logan's body from Sinister, Neuro told Sharp that there was another [[Paradise (Weapon X)|Paradise]] subject who was the perfect thief and the only one able to help them penetrate [[Nathaniel Essex (Earth-616)|Mister Sinister]]'s nigh-impenetrable base and escape from it alive: [[Fantomelle (Earth-616)|Fantomelle]].{{r|Wolverines Vol 1 2}}\n\nThe team arrived at Fantomelle's place at the time she was being attacked by Siphon, the monster who stole Daken's healing factor. After a brutal fight along [[Skel (Simpson) (Earth-616)|Skel]] against the monster, Shogun threw a grenade at Siphon, seemingly killing it. At the Changeling, while Sharp, Neuro, Fantonelle and her fox [[Culpepper (Earth-616)|Culpepper]] made plans for the invasion, Fantonelle realized by body language lecture that Sharp was having an internal conversation with Ogun, and warned him that if he trust him over her inside Sinister's base, it would get him killed.{{r|Wolverines Vol 1 4}}\n\nThe team dropped for a surprise attack, when they were caught mid-air by Starky Gripes, a servant of Mr. Sinister who was expecting them and wanted to learn more about them, and refused them to leave. When Endo tried to escape, Starky activated some sort of hole where she fell in. Sharp killed Starky, but more \"Gripes\" showed up. Sinister then told them that many of his experiments needed field testing against unpredictable opponents as them, and if they survive, he might let them live. The team was suddenly separated, Shogun ending up with Neuro and Skel. They were attacked by Fin Fang Boom, a [[Fin Fang Foom (Earth-616)|Fin Fang Foom]] clone with half of a [[Thor Odinson (Earth-616)|Thor]] clone attached to the end of its tongue. Skel punched its guts and Shogun defeated it by cutting off and killing the Thor part. Neuro then analyzed the creature and told Sharp that Sinister could cure them and there was no need for Wolverine's body anymore, so he offered Mr. Sinister complete control over the \"Wolverines\" in exchange for curing them.{{r|Wolverines Vol 1 5}}\n\nWhen the [[X-Men (Earth-616)|X-Men]] appeared, demanding Logan's body, Sinister accepted Neuro's offer, so, much to Shogun's dismay, he used a control word on Lady Deathstrike and put her under Sinister's control, although the rest of the \"Wolverines\" blocked or damaged their ears. While Neuro thought of this action as insane, Shogun explained it was simply warfare. Then, Fantomelle, who had stolen Wolverine's body and bent herself through dimensions to escape from Sinister's vacuum trap, tried to escape with the body, but Nightcrawler appeared and teleported away with the Wolverine for the X-Men.{{r|Wolverines Vol 1 6}}\n\nWhile Endo, Neuro and Skel remained with Mr. Sinister, Sharp and Junk left with the Wolverines. Mystique then declared herself as the leader of the team, and made Sharp help her retrieve the ''zhulong'', or sun dragon, on [[Taipei]], and told him that Lady Deathstrike was interested on him, but Sharp thought she didn't because, as he held the control words, she wanted to kill him. Then, before they left, Mystique created a complex trap where she made him reveal her all the control words. Afterwards, while Ogun told him to return to Sinister, Deathstrike appeared and attacked him. After a short fight, they kissed. Suddenly, a [[Fang (Imperial Guard) (Earth-616)|mysterious figure]] appeared from a meteor crash and demanded to know who killed [[Logan]].{{r|Wolverines Vol 1 7}}\n\nThe mysterious figure was revealed to be Fang, an Imperial Guard member thought to be deceased. He accused the Wolverines of having killed Logan, attacked Sabretooth, and easily defeated Daken. The Wolverines, except Daken, along with their allies tried to assault Fang, but he released an omnidirectional blast at them. Fang then asked Daken if he was scared, to which Daken replied that he was not and stabbed him in the head with his claws. Fang survived the attack and again demanded to know who killed Logan. X-23 said that nobody there killed Logan and stated that everybody wanted to be there when Logan died. Meanwhile, Mystique located Fang's weakness and everybody started attacking Fang again, while Junk used the Changeling's cannons against Fang, apparently killing him. However, Fang again survived the attack and took Daken to [[Jotunheim]].{{r|Wolverines Vol 1 8}} \n\nIn Jotunheim, Fang took Daken to face a Frost Giant, but Daken said that he lost his healing factor. Fang retorted that his loss of his healing factor didn't seem to stop him and revealed that he had been seeing Logan every year and had talked about him and how Logan admired people like Beast, Iron Fist, and Daredevil. Daken then reminded him that they both had arms, while he didn't and said that he didn't want to face the Frost Giant, but Fang didn't listen and issued a challenge against him. Fang then went over to the Frost Giant and told him that Daken was his father, which enraged it and started attacking him. Later on, Daken was trapped within a cave and threatened to kill Fang. He then asked Fang why was he doing this if he knew that he didn't kill Logan, to which Fang replied that he already knew and told Daken to get himself out of the situation just like Logan would've done. Daken then engaged the Frost Giant in combat and gained the upper hand against the Frost Giant and almost killed it, until Fang interfered and saved its life. Fang asked why he wanted to kill him, to which Daken angrily replied that he was not his father. Fang handed him a beer and used his energy powers to restore Daken's lost arm temporarily because, according to Fang, he didn't believe in redemption and sent Daken back to the Changeling, while taking Sabretooth with him.{{r|Wolverines Vol 1 9}} \n\nFang took Sabretooth to a spaceship 65 light-years away from the Milky Way and explained about a species called the J'Graqq, who  mutilated, enslaved, and murdered trillions of other races, and used his cosmic power to infiltrate the ship. Sabretooth then fought the J'Graqq, but suddenly he was electrocuted by one of them. However, he shrugged this off and proceeded to kill them. One of the J'Graqq activated a translator and tried to negotiate with Sabretooth by saying that their race had changed their ways by resorting to planetary destruction, but Sabretooth choked and decapitated it. The other J'Graqq started to revere Sabretooth as a god and he started playing around. However, Fang arrived after an explosion and started lecturing Sabretooth and telling him what Logan thought about him, a boring person. He then asked Sabretooth if he wanted to wipe out the J'Graqq, but Sabretooth replied that he was no longer a killer. Fang then used the ship's computer to wipe out the J'Graqq, much to Sabretooth's shock. Sabretooth protested angrily, but Fang snapped back coldly by saying that he was not Logan and he would never take responsibility for other people's actions. He then set the ship to self-destruct and teleported himself, along with Sabretooth, back to the Wolverines. X-23 volunteered to join him, which Fang gladly accepted.{{r|Wolverines Vol 1 10}}  \n\n| Equipment               = [[Wolverine's Suit]]\n| Transportation          = [[Changeling (Plane)|Changeling]]\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "804963"
}