{
    "pageid": 5942,
    "ns": 0,
    "title": "X-Factor (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = X-Factor (Earth-616) from X-Factor Vol 1 65 cover.JPG\n| ImageSize               = 250px\n| Name                    = [[X-Factor]]\n| Aliases                 = X-Terminators\n| Distinguish1            = X-Factor\n| Distinguish2            = X-Terminators\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[Prosh (Earth-616)|Ship]]; [[X-Factor Complex]], [[New York City]], [[New York (State)|New York]] \n\n| Leaders                 = Formerly [[Scott Summers (Earth-616)|Cyclops]]\n| CurrentMembers          = \n| FormerMembers           = \n'''''Principal Members'''''<br>\n[[Warren Worthington III (Earth-616)|Angel]], [[Henry McCoy (Earth-616)|Beast]], [[Caliban (Earth-616)|Caliban]], [[Scott Summers (Earth-616)|Cyclops]], [[Robert Drake (Earth-616)|Iceman]], [[Jean Grey (Earth-616)|Marvel Girl]]\n'''''Trainees'''''<br>\n[[Tabitha Smith (Earth-616)|Boom-Boom]], [[Russell Collins (Earth-616)|Rusty Collins]], [[Leech (Earth-616)|Leech]], [[Arthur Maddicks (Earth-616)|Artie Maddicks]], [[Julio Richter (Earth-616)|Rictor]], [[Sally Blevins (Earth-616)|Skids]]\n| Allies                  = [[X-Men (Earth-616)|X-Men]], [[Power Pack (Earth-616)|Power Pack]], [[Morlocks (Earth-616)|Morlocks]], [[X-Terminators (Earth-616)|X-Terminators]], [[New Mutants (Earth-616)|New Mutants]]\n| Enemies                 = [[Roderick Campbell (Earth-811)|Ahab]], [[Alliance of Evil (Earth-616)|Alliance of Evil]], [[En Sabah Nur (Earth-616)|Apocalypse]], [[Attuma (Earth-616)|Attuma]], [[Caliban (Earth-616)|Caliban]], [[Cameron Hodge (Earth-616)|Cameron Hodge]], [[Carl Maddicks (Earth-616)|Carl Maddicks]], [[Crimson (Ravens) (Earth-616)|Crimson]], [[Dimitri Bukharin (Earth-616)|Crimson Dynamo]], [[Crotus (Earth-616)|Crotus]], [[Cyburai (Earth-616)|Cyburai]], [[Dark Riders (Earth-616)|Dark Riders]], [[Wolfgang Heinrich (Earth-616)|Doppelganger]], [[Fallen Angels (Earth-616)|Fallen Angels]], [[Sawalha Dahn (Earth-616)|Farnoq Dahn]], [[Freedom Force (Earth-616)|Freedom Force]], [[Joanna Cargill (Earth-616)|Frenzy]], [[David Moreau (Earth-616)|Genegineer]], [[Ghaur (Earth-616)|Ghaur]], [[Gideon (Earth-616)|Gideon]], [[Madelyne Pryor (Earth-616)|Goblin Queen]], [[Erika Benson (Earth-616)|Harness]], [[Herbert Wyndham (Earth-616)|High Evolutionary]], [[Horsemen of Apocalypse (Earth-616)|Horsemen of Apocalypse]], [[Infectia (Josephine) (Earth-616)|Infectia]], [[August Hopper (Earth-616)|Locust]], [[Loki Laufeyson (Earth-616)|Loki]], [[Lost Boys (And Girls) (Earth-616)|Lost Boys]], [[Madame Reneau (Earth-616)|Madame Reneau]], [[Magistrates (Earth-616)|Magistrates]], [[Marauders (Earth-616)|Marauders]], [[Masque (Earth-616)|Masque]], [[Master Mold (Earth-616)|Master Mold]], [[Maximus Boltagon (Earth-616)|Maximus]], [[Mesmero (Vincent) (Earth-616)|Mesmero]], [[Nathaniel Essex (Earth-616)|Mister Sinister]], [[Mys-Tech (Earth-616)|Mys-Tech]], [[N'astirh (Earth-616)|N'astirh]], [[Nanny (Mutant) (Earth-616)|Nanny]], [[Nasty Boys (Earth-616)|Nasty Boys]], [[Orphan-Maker (Peter) (Earth-616)|Orphan-Maker]], [[Palik (Earth-616)|Palik]], [[Purifiers (High Evolutionary) (Earth-616)|Purifiers]], [[Pietro Maximoff (Earth-616)|Quicksilver]], [[Rask (Earth-616)|Rask]], [[Ravens (Earth-616)|Ravens]], [[Right (Earth-616)|Right]], [[Victor Creed (Earth-616)|Sabretooth]], [[Savage Wolf Gang (Earth-616)|Savage Wolf Gang]], [[Sentinels Mk VI (Earth-616)|Sentinels]], [[Shadow King (Multiverse)|Shadow King]], [[Christopher Anderson (Earth-616)|Slab]],  [[Tatsu'o (Earth-616)|Tatsu'o]], [[Timeshadow (Earth-616)|Timeshadow]], [[Mortimer Toynbee (Earth-616)|Toad]], [[Edward Pasternak (Earth-616)|Tower]], [[Troll Associates (Earth-616)|Troll Associates]], [[Vanisher (Earth-616)|Vanisher]], [[Vic Chalker (Earth-616)|Vic Chalker]], [[Xartan Deviants]]\n\n| Origin                  = Formed by [[Scott Summers (Earth-616)|Cyclops]] to reunite the first team of [[X-Men (Earth-616)|X-Men]]. Posed as [[Homo superior|mutants]] hunters.\n| PlaceOfFormation        = [[New York City]]\n| PlaceOfDissolution      = \n| Creators                = Bob Layton; Jackson Guice; Stan Lee; Jack Kirby\n| First                   = X-Factor #1\n| Last                    = X-Factor #70\n\n| HistoryText             = The first team of mutant heroes to bear the name X-Factor was composed of the original five members of [[Charles Xavier (Earth-616)|Professor Charles Xavier's]] [[X-Men (Earth-616)|X-Men]]. After they had all left the X-Men at certain points, a series of complex events brought the group back together, the catalyst being the return of [[Jean Grey (Earth-616)|Jean Grey]].\n\n===Return of Jean Grey/Team Formation===\nJust prior to the formation of X-Factor, [[Scott Summers (Earth-616)|Cyclops]] had retired from the X-Men and moved to Anchorage, [[Alaska (State)|Alaska]] with his wife, [[Madelyne Pryor (Earth-616)|Madelyne Pryor-Summers]], and their newborn son, [[Nathan Summers (Earth-616)|Nathan]].{{r|Uncanny X-Men #201}} Meanwhile, [[Warren Worthington III (Earth-616)|Angel]], [[Robert Drake (Earth-616)|Iceman]], and [[Henry McCoy (Earth-616)|Beast]], as the sole survivors of the [[Defenders (Earth-616)|Defenders]], were attempting to find new directions to take in their lives;{{r|Defenders #125}} Beast unsuccessfully asked [[Alison Blaire (Earth-616)|Dazzler]] to join them.{{r|Marvel Heartbreakers Vol 1 1}} \n\nWhat finally brought the original X-Men together was the return of Jean Grey, who had been believed dead after the [[Phoenix Force (Earth-616)|Phoenix]], a cosmic being posing as her, had sacrificed its life on the moon years earlier.{{r|X-Men #137}} In reality, Jean had actually been placed in stasis beneath [[Jamaica Bay]] while she recovered from radiation poisoning. Jean's cocoon was recovered by the [[Avengers (Earth-616)|Avengers]],{{r|Avengers #262}} and she was revived by [[Reed Richards (Earth-616)|Reed Richards]].{{r|Fantastic Four #286}} Upon getting caught up on most of the events that happened in her absence, she contacted Warren and he in turn gathered the original X-Men. Beast joined after being rejected employment at Empire State University, and Bobby walked out on a dull accounting job to be reunited with Jean.{{r|X-Factor Vol 1 1}} \n\nScott took the return of the woman he had once loved the hardest. He was unable to make up his mind about his feelings towards Jean and his wife Madelyne, who were both identical in appearance for reason that were not known at the time. Scott was unable to tell the one about the other. Ultimately, Cyclops abandoned his wife and their son, Nathan. This seemingly caused Madelyne to pack up and leave Scott for abandoning her while Jean was left to wonder what was keeping Scott so distant.{{r|X-Factor Vol 1 1}} \n\nAfter being inspired by Jean's emotional suggestion that they should repair the strained relations between humans and mutants and continue Xavier's dream (which had seemingly been abandoned by the X-Men who were working with their old foe, Magneto) Warren used his business assets to create X-Factor. Setting up a [[X-Factor Complex]] out by New York Harbor and hiring his old university friend and lawyer [[Cameron Hodge (Earth-616)|Cameron Hodge]] as their public relations expert, X-Factor was born. They posed as mutant hunters who would take tips from the public to locate potentially dangerous mutants and take them into custody. The reality of their mission would be to secretly train mutants to control their powers so that they would not be a menace to society.{{r|X-Factor Vol 1 1}} In addition to this, the team would also operate under their former X-Men identities as a new team dubbed the \"X-Terminators\" and act in situations where their powers were required.{{r|X-Factor Vol 1 8}}\n\nUnknown to them at the time, Hodge was really a mutant hater who despised Worthington and sought to use X-Factor as a means of increasing anti-mutant sentiment, mostly through a heavy-handed advertising campaign.{{r|X-Factor Vol 1 17}} \n\n===Early Adventures===\nX-Factor's first mission was to collect the young mutant [[Russell Collins (Earth-616)|Rusty Collins]], a Naval officer whose powers had flared out of control and horribly burned the face of a prostitute. X-Factor succeeded in collecting Collins and convinced him come back with them for training.{{r|X-Factor #1}}\n\nEarly on the team experienced a major change when a former colleague of the Beast, Doctor [[Carl Maddicks (Earth-616)|Carl Maddicks]] hired the mutant named [[Edward Pasternak (Earth-616)|Tower]] to kidnap Beast and use him for an experiment to cure his son [[Arthur Maddicks (Earth-616)|Artie Maddicks]] of his mutation. Carl was killed by the security team at his hideout within the Ryan Bio-Chemical plant while X-Factor was saving Hank. In the aftermath of the battle they took the orphaned Artie and Beast back to their headquarters and found that the experiment had regressed Hank's mutation from his bestial form back to his original, more human appearance.{{r|X-Factor Vol 1 #2|#3}}\n\nDuring his time with the group, Rusty had a hard time fitting in. They attracted the attention of the [[Alliance of Evil (Earth-616)|Alliance of Evil]], a group whose employer sought to induct Rusty into their ranks. After answering a fake mutant report, X-Factor came to Rusty's rescue when his attempt to runaway landed him in a conflict with [[Joanna Cargill (Earth-616)|Frenzy]].{{r|X-Factor #4}}\n\nNext the team was drawn to Southern [[California (State)|California]] where came to the defense of mutant junky [[Michael Nowlan (Earth-616)|Mike Nowlan]], whose power boosting ability was being exploited by the Alliance. In coming to Mike's aid, X-Factor had their first of many encounters with the immortal mutant [[En Sabah Nur (Earth-616)|Apocalypse]]. In the aftermath of the battle, Apocalypse and the Alliance escaped, and Mike and his ex-wife Sue were killed in the battle.{{r|X-Factor Vol 1 #5|#6}}\n\nInternally, the tension between Scott and Jean began to get on Jean's nerves and she started to wonder what he was hiding from her. She forced the truth about Scott's marriage out of Warren and the others and confronted Scott with the truth.{{r|X-Factor Vol 1 7}}\n\nThe X-Terminators constant involvement in X-Factor's operations did not escape public notice, and the press -- especially reporter [[Patricia Tilby (Earth-616)|Trish Tilby]] -- began asking hard questions. X-Factor's activities were also helping to spread anti-mutant hysteria.  X-Factor's standing with mutants grew worse and two outcasts unfit for even the [[Morlocks (Earth-616)|Morlocks]], [[Glow Worm (Earth-616)|Glow Worm]] and [[Bulk (Earth-616)|Bulk]], attempted to attack the X-Factor compound. Splitting up into two teams, one as X-Factor (with ad hoc members Cameron Hodge, Rusty and [[Vera Cantor (Earth-616)|Vera Cantor]] covering for others) and the X-Terminators, they defused the threat. Realizing that Glow Worm was radioactive to a toxic level the team was forced to let the two mutants go free into the sewers.{{r|X-Factor #9}}\n\nHired on an international mission, X-Factor went undercover to free mutants that were being experimented on in [[Siberia]] by the mutant [[Wolfgang Heinrich (Earth-616)|Doppleganger]] and his minion, the [[Dimitri Bukharin (Earth-616)|Crimson Dynamo]], with the aid of the Russian mutant team [[Siberforce (Earth-616)|Siberforce]].{{r|X-Factor Annual #1}}\n\n===Mutant Massacre===\nWhen [[Raven Darkholme (Earth-616)|Mystique's]] [[Freedom Force (Earth-616)|Freedom Force]] identified one of the \"X-Factor\" members during the Glow Worm incident as Rusty Collins,  Freedom Force sought to arrest him for his crimes. This led to a clash between Freedom Force and X-Factor in [[Central Park]], forcing Rusty to flee into the Morlock Tunnels with the Morlock known as [[Sally Blevins (Earth-616)|Skids]].{{r|X-Factor #8}} Learning that Artie had gone after Rusty and Skids, X-Factor  went after them as the X-Terminators, leading to another clash with Freedom Force in the Morlock Tunnels. As the battle raged, Artie befriended the Morlocks [[Caliban (Earth-616)|Caliban]] and [[Leech (Earth-616)|Leech]].{{r|X-Factor #9}}\n\nThis came at a time when [[Nathaniel Essex (Earth-616)|Mr. Sinister's]] [[Marauders (Earth-616)|Marauders]] had been dispatched to the tunnels to eliminate the Morlocks. As Artie, Leech, and Caliban attempted to escape the clutches of [[Victor Creed (Earth-616)|Sabretooth]], X-Factor clashed with the Marauders and evacuated as many of the Morlocks as possible and saved Rusty and Skids. While Jean succeeded in killing the Marauder named [[Prism (Robbie) (Earth-616)|Prism]], Cyclops and Beast were injured. Angel sent Iceman and Marvel Girl back to get them medical aid while he continued to search for Artie. This led to Angel's undoing as the Marauder [[Michael Baer (Earth-616)|Blockbuster]] broke his wings and [[Kodiak Noatak (Earth-616)|Harpoon]] impaled them, pinning Angel to a wall of the tunnels, left to die.{{r|X-Factor #10}} Salvation came in the form of the thunder god [[Thor Odinson (Earth-616)|Thor]], who was attracted to the tunnels and find Angel.{{r|Thor #373}} Meanwhile, Cyclops and Marvel Girl went back into the tunnels and find the [[Power Pack (Earth-616)|Power Pack]] fighting the Marauders. Helping the young team fight off the Marauders, Scott and Jean were reunited with Artie and took both Caliban and Leech with them and convinced the Power children to return to their home where it was safe.{{r|Power Pack #27}} Thor was able to fight off the Marauders and reunited Angel with his comrades.{{r|Thor #374}}\n\nX-Factor fell under a number of legal woes. Warren Worthington III was outed as the financial backer for X-Factor leading to a lawsuit by the government against Worthington for fraud. Cameron Hodge seized all of Warren's assets and forced Worthington to have his wings amputated in order to save his life. Distraught at the loss of his wings, Worthington seemingly committed suicide. However, he was rescued by Apocalypse and converted into one of his Four Horsemen, known as Death.{{r|X-Factor Vol 1 14|16}}\n\nIn Alaska, Scott found almost all traces of his wife Madelyne and his son erased, and clashed with the demented Sentinel Master Mold.{{r|X-Factor Vol 1 13|14}} X-Factor recruited the young street thief known as Boom Boom into their ranks.{{r|X-Factor Vol 1 12}} Iceman was manipulated by Loki in a plot against Thor, causing him to lose control of his powers to, necessitating Bobby to wear a special belt to regulate his powers.{{r|Thor Vol 1 377|378}}\n\nCameron Hodge's true colors were finally shown when he funneled much of Worthington's money into his extremist anti-mutant group known as the Right. X-Factor and their charges were forced to battle for their very lives against the Right, ultimately defeating Cameron Hodge. During this time they also clashed with Apocalypse and his Four Horsemen, who vowed that they would strike soon.{{r|X-Factor Vol 1 17|23}}\n\n===Fall of the Mutants===\nPublicly outed as mutants disguised as bounty hunters in light of the recently passed [[Mutant Registration Act]], X-Factor  ultimately saved New York City from an attack by Apocalypse and his Four Horsemen. They freed Warren from the ranks of Apocalypse. Beast was infected by Pestilence. Every time Hank used his superhuman strength, his intelligence decreased. Hank grew increasingly child-like, but his strength continued to grow with every exertion. In the end, Apocalypse's forces were defeated and his Ship crashed on X-Factor's compound, destroying it. X-Factor took over the Ship as their new headquarters.{{r|X-Factor Vol 1 24|25}} They were hailed as heroes.{{r|X-Factor Vol 1 26}} X-Factor registered under the Mutant Registration Act, but under their aliases, refusing to submit their real names with the government. When hero [[Tandy Bowen (Earth-616)|Dagger]] became possessed by pure evil due to the schemes of [[Mister Jip (Earth-616)|Mr. Jip]], and attacked civilians in [[New York]], Jean, Beast and Iceman stepped in and subdued her with the help of her partner, [[Tyrone Johnson (Earth-616)|Cloak]].{{r|Mutant Misadventures of Cloak and Dagger Vol 1 1}}\n\nDuring an encounter with Infecta Beast had his mutations jumpstarted, restoring his intelligence and his blue-furred form. X-Factor also clashed with the Alliance of Evil again.{{r|X-Factor Vol 1 31|33}} While Scott and Jean rekindled their romance they attempted to find Nathan, only to find that he had been kidnapped by Nanny and her minion Orphan-Maker. Warren sought revenge against Cameron Hodge, who had gained immortality from the demon N'astrith, and murdered his long time girlfriend, Candy Southern.{{r|X-Factor Vol 1 34|35}}\n\n===Inferno===\nEventually Madelyne Pryor, that the woman who Scott had married while Jean had been in suspended animation, went mad, developed vast powers, and became known as the Goblin Queen. It was discovered Madelyne had been a clone of Jean Grey created by Mister Sinister. Madelyne had been a failed experiment until she was brought to life by the portion of Jean's consciousness that had been borrowed by the Phoenix Force and a spark of the Phoenix Force which had been rejected by Jean's body while in the cocoon.{{r|Uncanny X-Men Vol 1 241}} She attempted to sacrifice her and Cyclops' son Nathan atop the [[Empire State Building]] in order to permanently open a gateway between Earth and Otherplace. The Goblin Queen died in combat with Marvel Girl. As a result of a psychic link, Jean acquired the memories of both Madelyne Pryor and the Phoenix's duplicate of her.{{r|X-Factor Vol 1 36|39}}\n\n===Judgement War===\nX-Factor was kidnapped and brought to a planet where individuals are revered by how close their physical body is to perfection. Jean, who is flawless, was held in high reverence by the society. The Celestials were judging this world and its fate hanged in the balance. Jean, having acquired a spark of the Phoenix Force during the Inferno crisis, managed to keep it mostly suppressed until she was able to expel it while helping aliens fight off the Celestials. During this adventure Warren took on the name Archangel.{{r|X-Factor Vol 1 43|50}}\n\nBack on Earth, X-Factor clashed with foes such as Sabretooth, Apocalypse, Caliban, [[August Hopper (Earth-616)|Locust]],{{r|X-Factor Vol 1 51|53}} [[Crimson (Ravens) (Earth-616)|Crimson]],{{r|X-Factor Vol 1 54|58}} Mesmero, Infecta,{{r|X-Factor Vol 1 55}} the [[Ravens (Earth-616)|Ravens]], the Right.{{r|X-Factor Vol 1 59}} When the nation of Genosha attempted to push their anti-mutant mandates with the aid of Cameron Hodge, X-Factor joined the X-Men and New Mutants in opposing them. Although Hodge was seemingly destroyed in the battle, the X-Men family was still greatly effected by the episode.{{r|X-Factor Vol 1 60|62}}{{r|Uncanny X-Men Vol 1 270|272}}{{r|New Mutants Vol 1 95|96}}\n\n===End Game===\nBaby Nathan came to stay with X-Factor, but was later infected with a techno-organic virus by Apocalypse. As the virus spread through Nathan's body, threatening to turn Nathan into a body of liquid metal and organic steel, a member of the Clan Askani appeared from 2000 years in the future to Cyclops, saying Nathan would become a savior in their time, and that the Clan could cure him of the virus. Choosing to save his son's life, believing that he would never see him again, Cyclops agreed, and Nathan was taken 2000 years into an alternate future, where he would eventually become the man called Cable.{{r|X-Factor Vol 1 66|68}}\n\nX-Factor came to the aid of their former teacher Professor Xavier as he had recently returned to Earth to face the threat of the Shadow King, who had taken over Muir Island and possessed most of the X-Men.{{r|X-Factor Vol 1 68}} Ultimately, X-Factor aided Xavier in freeing their comrades and seemingly destroying the Shadow King, however Xavier was crippled in the process.{{r|X-Factor Vol 1 69}} X-Factor decided to disband and rejoined a reorganized X-Men team.{{r|X-Factor Vol 1 70}}\n\n===Legacy===\nWith the original team disbanded, the government organized its own [[X-Factor (Government) (Earth-616)|X-Factor]] that would operate for a number of years.{{r|X-Factor Vol 1 71}} It too would ultimately disband. The third incarnation of X-Factor evolved out of Jamie Madrox's [[X-Factor Investigations (Earth-616)|X-Factor Investigations]] following the events of [[M-Day]].{{Citation}} The latest version of X-Factor emerged from [[Jean-Paul Beaubier (Earth-616)|Northstar]]'s investigation into the apparent murder of his twin sister, [[Jeanne-Marie Beaubier (Earth-616)|Aurora]] and involved helping [[Five (Earth-616)|The Five]] with the resurrection process of dead mutants.{{r|X-Factor Vol 4 1}}\n\n| Equipment               = \n| Transportation          = [[Prosh (Earth-616)|Prosh]], the [[Celestials|Celestial]] Ship.\n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:X-Factor]]"
                }
            }
        }
    ],
    "page_id": "5942"
}