{
    "pageid": 876207,
    "ns": 0,
    "title": "X-Men (Magneto's) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Uncanny X-Men Vol 4 1 Lashley Variant Textless.jpg\n| ImageSize               = 250px\n| Name                    = [[X-Men]]\n| EditorialNames          = [[Uncanny X-Men Vol 4|Uncanny X-Men]]\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = Formerly [[War Room X]], [[Savage Land]], [[Antarctica]]\n\n| Leaders                 = Formerly [[Max Eisenhardt (Earth-616)|Magneto]]\n| CurrentMembers          = \n| FormerMembers           = [[Warren Worthington III (Clone) (Earth-616)|\"Archangel\"]], [[Warren Worthington III (Earth-616)|Archangel]], [[Charlie Cluster-7 (Earth-616)|Fantomex]], [[Monet St. Croix (Earth-616)|M]], [[Raven Darkholme (Earth-616)|Mystique]], [[Elizabeth Braddock (Earth-616)|Psylocke]], [[Victor Creed (Earth-616)|Sabretooth]]\n| Allies                  = [[Joshua Foley (Earth-616)|Elixir]], [[Ferris (Earth-616)|Ferris]], [[Hellfire Club (Earth-616)|Hellfire Club]], [[Rachel Summers (Earth-811)|Marvel Girl]], [[Morlocks (Earth-616)|Morlocks]], [[Kurt Wagner (Earth-616)|Nightcrawler]], [[Christopher Muse (Earth-616)|Triage]], [[X-Men (Earth-616)|X-Men]], [[Shen Xorn (Earth-616)|Shen Xorn]]\n| Enemies                 = [[Clan Akkaba (Earth-616)|Clan Akkaba]], [[Dark Riders (Earth-616)|Dark Riders]], [[Marius St. Croix (Earth-616)|Emplate]], [[Bennet du Paris (Earth-616)|Exodus]], [[Someday Enterprises (Earth-616)|Someday Enterprises]]\n| Origin                  = A group of mutants formed by Magneto to protect mutant kind from extinction.[[Category:Vigilantes]]\n| PlaceOfFormation        = [[Genosha]]{{r|Uncanny X-Men Vol 4 12}}\n| PlaceOfDissolution      = \n| Creators                = Cullen Bunn; Greg Land\n| First                   = Uncanny X-Men Vol 4 1\n| Last                    = Uncanny X-Men Vol 4 19\n\n| HistoryText             = \n{{Quote|[[Max Eisenhardt (Earth-616)|You]]'re a '''poison'''. You wanted us to be '''X-Men...''' but you also wanted us to be the '''Hellfire Club''' and '''X-Force''' and the blasted '''Brotherhood of Evil Mutants.''' You wanted it '''all,''' and it cost those around you everything.|[[Elizabeth Braddock (Earth-616)|Psylocke]]|Uncanny X-Men Vol 4 19}}\nIn the wake of the [[M-Pox]] crisis, Magneto became despondent. With the rage that had always driven him failing him, Magneto roamed the wilderness, desperately searching for a reason to fight. He found that reason when [[Warren Worthington III (Clone) (Earth-616)|Archangel]] suddenly fell from the sky. His last words before losing consciousness were \"ensure mutants survive.\" Magneto, being reminded of his purpose, found reason to live again, and vowed to find others to stand at their side.{{r|Uncanny X-Men Vol 4 7}} He gathered a team of X-Men willing to do whatever necessary to ensure the survival of the mutant species: [[Monet St. Croix (Earth-616)|M]], [[Elizabeth Braddock (Earth-616)|Psylocke]] and [[Victor Creed (Earth-616)|Sabretooth]].{{r|Uncanny X-Men Vol 4 1}} [[Charlie Cluster-7 (Earth-616)|Fantomex]] and [[Raven Darkholme (Earth-616)|Mystique]] were also Magneto's operatives, but worked in the shadows.{{r|Uncanny X-Men Vol 4 #8|9}}\n\n===Dark Riders===\nMagneto and his X-Men first began investigating [[Someday Enterprises (Earth-616)|Someday Enterprises]], a company that put mutants who were tired of living in a world that hated and feared them into suspended animation, waiting to be awakened in better times. Magneto suspected the company of being up to no good, and began attacking their transports, denying the mutants who wanted to escape reality their wish.{{r|Uncanny X-Men Vol 4 1}} The team was quickly side-tracked however by a conflict with the [[Dark Riders (Earth-616)|Dark Riders]], who had begun tracking down and killing mutant healers. The Riders believed that the extinction of mutants due to the Terrigen Mists was part of the natural order, and that mutants with the power to heal the ill were hindering natural selection.{{r|Uncanny X-Men Vol 4 2}}\n\nThe X-Men failed to protect [[Joshua Foley (Earth-616)|Elixir]], who was killed by the Riders, but succeeded in securing [[Christopher Muse (Earth-616)|Triage]], and set a trap for the Riders. The Riders were left dead or dying on [[Genosha]], which Magneto proceeded to detonate, sinking the island into the sea and killing the remaining Riders.{{r|Uncanny X-Men Vol 4 5}}\n\nBecuase of the nature of his powers, Elixir didn't remain dead for a long time, and was eventually found resurrected by Magneto's X-Men in the ruins of Genosha, but having become emotionally unstable. Elixir then accepted to be taken to [[Shen Xorn (Earth-616)|Xorn]]'s retreat in [[Tibet]].{{r|Uncanny X-Men Annual Vol 4 1}}\n\n===[[Apocalypse Wars]]===\nShortly after the X-Men moved to their new base, the [[War Room X]] in the [[Savage Land]], Archangel, who had mysteriously become a mindless drone when Magneto found him, alerted Pyslocke about an incoming catastrophe that would befall the town of [[Green Ridge]].{{r|Uncanny X-Men Vol 4 6}} While investigating Green Ridge, Magneto and Psylocke discovered the [[Clan Akkaba (Earth-616)|Clan Akkaba]] had the real Warren Worthington in their possession,{{r|Uncanny X-Men Vol 4 7}} and were periodically harvesting his wings to create an army of mindless drones named [[Death-Flight (Earth-616)|Death-Flight]], as it turned out, the Archangel member of Magneto's X-Men was one of these clones who had escaped. With the help of Mystique and Fantomex, Magneto and Psylocke broke free from [[William Rolfson (Earth-616)|Genocide]]'s grasp after having been captured.{{r|Uncanny X-Men Vol 4 8}} When Psylock summoned the Archangel on her team to their aid, she unwittingly triggered the Death-Flight.{{r|Uncanny X-Men Vol 4 9}} While the X-Men were fending off the Death-Flight, Warren willingly merged with the last remaining Archangel clone, having realized that his Archangel persona needed an anchor of humanity, and both became one once again.{{r|Uncanny X-Men Vol 4 10}}\n\nConcurrently, M and Sabretooth heeded a call for help from Callisto,{{r|Uncanny X-Men Vol 4 6}} who informed them the Morlocks were dying again of a mysterious illness different from the M-Pox.{{r|Uncanny X-Men Vol 4 7}} M discovered the ill Morlocks were actually under the influence of her brother [[Marius Boudreaux (Earth-616)|Emplate]].{{r|Uncanny X-Men Vol 4 8}} After tracking down Emplate, M tried to get him to stop endangering the Morlocks, initially proposing to exchange their freedom for hers.{{r|Uncanny X-Men Vol 4 9}} Before fading away, Emplate managed to possess M, forcing her to live with his curse.{{r|Uncanny X-Men Vol 4 10}}\n\n===Hellfire Club===\nAs part of his plan to ensure mutantkind's survival, Magneto joined forces with the Hellfire Club, becoming their White King once again.{{r|Uncanny X-Men Vol 4 12}} Their alliance was eventually revealed to Psylocke by M after noticing her disgruntlement over Erik keeping his involvement with Fantomex and Mystique from her.{{r|Uncanny X-Men Vol 4 11}} Together, the Hellfire and the X-Men continued investigating Someday Enterprises, and discovered some of the company's resources had been taken over by [[Bennet du Paris (Earth-616)|Exodus]], including a group of the mutant [[Sleepers (Earth-616)|Sleepers]], whom Exodus controlled telepathically.{{r|Uncanny X-Men Vol 4 #12|13}} Magneto tracked down Exodus and defeated him, stopping him from using the Sleepers to attack an anti-mutant rally as part of his plan to stoke the fires of the growing anti-mutant hysteria. The Sleepers, now freed from Exodus, were taken to Xorn.\n\nFollowing Exodus' defeat, Psylocke broke her partnership with Magneto, having become fed up with Erik's constant schemings and secret alliances. She vowed to kill Magneto if he ever did something she believed put at risk the lives of mutants, which included weaponizing the Sleepers under his protection.{{r|Uncanny X-Men Vol 4 14}}\n\n===Disbandment===\nMagneto's enterprise eventually fell apart. While keeping an eye on Psylocke, Mystique had her personality stabilized telepathically, dampening her and prompting her to leave Magneto's side.{{r|Uncanny X-Men Vol 4 15}} In the middle of a conflict between X-Men and Inhumans, Fantomex implanted himself in [[The World (Weapon Plus)|The World]]{{r|Uncanny X-Men Vol 4 16}} and Sabretooth ran away with M to help keep her condition a secret and find a way to cure her from Emplate's possession.{{r|Uncanny X-Men Vol 4 17}} After accidentally killing two Sleepers during a scuffle against Inhumans,{{r|Uncanny X-Men Vol 4 18}} Xorn exiled himself to the Moon, with Archangel taking his place as the Sleepers' shepherd.\n\nFollowing Magneto's involvement in the war against the Inhumans, which included working in secret with [[Emma Frost (Earth-616)|Emma Frost]], Psylocke returned to War Room X to fulfill her word. Following an arduous battle, she managed to fatally injury Erik and left him for dead. Before succumbing to his injuries, Magneto was found by Elixir and Exodus. The former used his powers on Erik and brought him back to life. Magneto subsequently refused Exodus' offer to join his side, and decided to continue his crusade alone.{{r|Uncanny X-Men Vol 4 19}}\n\n| Equipment               = \n| Transportation          = [[X-Men Blackbird|Blackbird]]\n| Weapons                 = \n\n| Notes                   = * While part of [[Ororo Munroe (Earth-616)|Storm]]'s [[X-Men (Earth-616)|X-Men]], [[James Howlett (Earth-21923)|Logan]] considered Magneto's X-Men to be akin to an [[X-Force (Strike Team) (Earth-616)|X-Force]] strike team.{{r|Civil War II: X-Men #1}}\n| Trivia                  = \n| Links                   = \n}}\n[[Category:Elizabeth Braddock (Earth-616)/Quotes]]\n[[Category:X-Men]]"
                }
            }
        }
    ],
    "page_id": "876207"
}