{
    "pageid": 7846,
    "ns": 0,
    "title": "Yancy Street Gang (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Yancy Street Gang hackers from FF Vol 2 6.jpg\n| Name                    = Yancy Street Gang\n| Aliases                 = \n| Status                  = Active\n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Yancy Street]], [[Lower East Side]], [[Manhattan]], [[New York City|New York]]\n\n| Leaders                 = \n| CurrentMembers          = Mouse\n| FormerMembers           = Moishe (40s era member), [[Daniel Grimm Jr. (Earth-616)|Daniel Grimm Jr]], [[Benjamin Grimm (Earth-616)|Benjamin J. Grimm]], [[Tommie Boyd (Earth-616)|Two-Fisted Tommie Boyd]], [[Larry Lee (Earth-616)|Little Larry Lee]], [[Manny Merengues (Earth-616)|Smooth Manny Meregues]], [[Dictionary Dawson (Earth-616)|Dictionary Dawson]], [[Lugwrench Lubowski (Earth-616)|Lugwrench Lubowski]], [[Rhythm Ruiz (Earth-616)|Rhythm Ruiz]], [[Character Index/C#Cee|Cee]] (deceased), [[Douglas Ray (Earth-616)|Douglas Ray]], [[Jason Carter (Earth-616)|Jason Carter]], [[Carlos Hernandez (Earth-616)|Carlos Hernandez]]\n\n| Allies                  = \n| Enemies                 = \n\n| Origin                  = \n| PlaceOfFormation        = [[Yancy Street]], [[Lower East Side]], [[Manhattan]], [[New York City|New York]]\n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four Vol 1 15\n| First2                  = {{g|1stFull}}<br>{{sld|Fantastic Four Vol 1 6}}{{g|Mentioned}}\n| Last                    = \n\n| HistoryText             = [[File:Yancy Street Gang circa the 1940s from Fantastic Four Vol 4 8.jpg|thumb|left|198px|The Yancy Street Gang circa the 1940s.{{r|Fantastic Four Vol 4 #8}}]]\n===20th Century===\nThe earliest incarnation of the Yancy Street Gang existed in the early 20th century. According to the accounts of [[Nicholas Fury (Earth-616)|Nick Fury]], in the 1920s the Yancy Street Gang was nothing more than a group of poor kids and they would regularly brawl with rival gangs.{{r|Strange Tales #159}} However the gang took a more organized and brutal turn in the early 1930s. The Yancy Street Gang were a group of mobsters that ran a protection racket. One day they were particularly focused on forcing Ira Rosenbaum, proprietor of the Yancy Street Apothecary, to pay into their racket. When he refused to do so, one of the gang members broke his nose. Later when they went to Rosenbaum's residence, the gang members were jumped by [[Benjamin Grimm (Earth-616)|Ben Grimm]]. Grimm was a time traveler from the future, better known as the monstrous Thing of the heroic [[Fantastic Four (Earth-616)|Fantastic Four]]. Grimm, during a period in which he reverted to human form, came to the past to try and change history. Instead of carrying out his appointed task, when Ben reverted back into the Thing he helped the people of [[Yancy Street]] defend themselves from the gang. He sent the gang members packing, before returning to his own time.{{r|Fantastic Four Vol 4 #8}}\n\n[[File:Yancy Street Gang under Ben Grimms leadership from Thing Vol 1 1.jpg|thumb|left|The Yancy Street Gang under Ben Grimm's leadership.{{r|Thing #1}}]]\n===The Grimms===\nDecades later the Yancy Street Gang underwent changes as the neighborhood itself became a slum. By the modern age the era of the gang of mobsters with tommy guns was long since replaced with a gang of street hoods engaged in petty robberies and clashes with rival street gangs. Incidentally at one point one of the members of the Yancy Street Gang was [[Daniel Grimm Jr. (Earth-616)|Daniel Grimm, Jr.]] the older brother of Ben. When Ben was a child, Daniel tried to provide for his family with ill-gotten gains from gang activity. This created much tension in the family, as the Grimm household struggled to make ends meet thanks to [[Daniel Grimm (Earth-616)|Daniel Grimm, Sr.]]'s alcoholism.{{r|Thing #1}} Many of the Yancy Street Gang's meetings under Daniel's leadership were done in the Grimm family kitchen, while Daniel and Ben's parents were out. {{r|Fantastic Four #355}} Daniel often brought Ben out on the gang's various rumbles.{{r|Thing Vol 2 #5}} \n\nOne night Daniel sneaked out of the house to join the gang in a fight against the Thompson Avenue Gang, unaware that Ben was following him. During the fight, Daniel was fatally stabbed. He died before the authorities arrived at the scene. Both gangs fled, leaving Ben to be picked up by the police.{{r|Thing #1}} Ben eventually sought to join the Yancy Street Gang. As part of his initiation, Ben stole a golden Star of David pendant from Hiram Sheckerberg, the owner of the local pawnshop.{{r|Fantastic Four Vol 3 #56}} \n\n10 years after his brother's murder, Ben was the leader of the gang. Ben was quickly pulled from the gang shortly thereafter, when his parents died and he was forced to live with his uncle [[Jacob Grimm (Earth-616)|Jake]] and aunt [[Alyce Grimm (Earth-616)|Alyce]].{{r|Thing #1}} When Ben attempted to call a meeting with the gang, they rejected him for \"abandoning\" them. They dumped a can of garbage of his head and called him a deserter, ending his leadership with the group.{{r|Fantastic Four Vol 3 #56}} Deciding to devote himself to his new life, Ben was given every opportunity available. Ben moved on from his former life, becoming a high school and college football champion and later a test pilot.{{r|Thing #1}} Many years later, Ben was involved in the rocket flight accident that caused the birth of the Fantastic Four, becoming the stone-skinned monster known as the Thing.{{r|Fantastic Four #1}}\n\n===Early Antagonisms===\nAt first, like the public at large, the members of the Yancy Street Gang were unaware that Ben Grimm had been transformed into the Thing. When Ben returned to his old neighborhood to have a drink at a local Irish pub, he walked away from an altercation with members of the gang who were upset that he was talking during a televised wrestling match.{{r|Fantastic Four: First Family #3}}\n\nWhen the identities of the Fantastic Four became public knowledge, the Yancy Street Gang decided to focus their energies on tormenting the Thing with various pranks. At first they started off with harassing letters that the Thing merely laughed off.{{r|Fantastic Four #6}} However these eventually morphed into packages containing booby-traps such as a spring loaded punching bag.{{r|Fantastic Four #11}} Over the years this would become pattern behaviour from the Yancy Street Gang. However one source states that Ben's teammate the [[Jonathan Storm (Earth-616)|Human Torch]] was responsible for some of the pranks that have been attributed to the Yancy Street Gang.{{r|Fantastic Four Vol 3 #61}} However there is presently no clarification as to which. \n\nThe gang angered the Thing into coming to Yancy Street after they sent him a drawing depicting him in a dress. However Ben had to stay his wrath when he spotted the Fantastic Four's signal flare calling him to action. As he left the members of the gang called him a chicken and pelted him with garbage and produce.{{r|Fantastic Four #15}} However, the group came to believe that only they had the right to torment the Thing, and later when the [[Owen Reece (Earth-616)|Molecule Man]] forced the people of New York to hunt down the Fantastic Four, the Yancy Street Gang assisted them into getting to safety. When the Four later defeated the Molecule Man the gang resumed their usual torments.{{r|Fantastic Four #20}} The Thing was drawn back to Yancy Street again after yet another harassing letter, but his hunt was once again cut short when he was attacked by [[Bull Brogin (Earth-616)|Bull Brogin]] of the [[Terrible Trio (Earth-616)|Terrible Trio]].{{r|Fantastic Four #23}} Later, after an escalation in crimes around Yancy Street, the Thing managed to convince his teammates in the Fantastic Four to investigate. However their investigation did not last long as they were chased out of the neighborhood by the Yancy Street Gang, and later pulled into a battle with the [[Ivan Kragoff (Earth-616)|Red Ghost]].{{r|Fantastic Four #29}} The group continued to send harassing letters and packages to the Thing, at one point mailing him a Beatles style \"mop-top\" wig to \"improve\" his looks.{{r|Fantastic Four #34}} When it was announced that the Fantastic Four's [[Reed Richards (Earth-616)|Mr. Fantastic]] and [[Susan Storm (Earth-616)|Invisible Girl]] were going to be married, the Gang sent congratulations in their own prankster fashion: With a bouquet of flowers that were hidden in a phony time bomb.{{r|Fantastic Four #36}} Not long after this, Ben returned to Yancy Street to mull over one of Reed's most recent attempts to restore his humanity. The Gang attempted to have fun at his expense by trying to knock his hat off his head with a rock, however they stopped when the sullen Thing did nothing in retaliation.{{r|Fantastic Four #68}}\n\n===Warming Relations===\nMonths later, Ben was called back to Yancy Street by Mrs. Coogan, to investigate a strange happening in the area. While Ben was inside listening to the testimony of Coogan's nephew, members of the Yancy Street Gang vandalized his [[Fantasti-Car]] writing slogans like \"Stamp Out Ugly People\" and \"Thing Go Home\" on the hood.{{r|Marvel Two-In-One #6}} Later, during a period in which the Fantastic Four had briefly broken up, Ben took a job working for [[National Aeronautics and Space Administration (Earth-616)|NASA]]. In a rare instance of genuine well wishing the Yancy Street Gang mailed Ben a pocket watch as a gift. Thinking it was a bomb, Ben dunked the package in water ruining the watch.{{r|Fantastic Four #192}}<ref group=\"note\">The [[Fantastic Four (Earth-616)|Fantastic Four]] briefly split up in {{cl|Fantastic Four #191}} but reunited in {{cl|Fantastic Four #196}}</ref> Sometime later the Yancy Street Gang was forced into working for the [[Corporation (Earth-616)|Corporation]] by the [[Samuel Saxon (Earth-616)|Machinesmith]] to create weapons to crush their enemies. This was on the day of the Thing's birthday, which the Gang took routinely mailed a prank gift to him. Hidden in the gag gift was a warning of danger on Yancy Street. Ben went to rescue his tormentors, but both the Yancy Street Gang and the Thing were incapacitated by the Machinesmith's robots and taken prisoner.{{r|Marvel Two-In-One #47}} The Machinesmith then used an alpha-wave headset that put the Thing under his thrall. The Thing was then used to battle the novice hero known as [[Jonathan Hart (Earth-616)|Jack of Hearts]] but he managed to free the Thing while the Yancy Streeters broke free and incapacitated the Machinesmith. In the aftermath of the battle, the Streeters played yet another prank on the Thing by giving him an exploding cigar.{{r|Marvel Two-In-One #48}}\n\nThings started to go back to the status quo not long after. When the Thing passed through Yancy Street to get to an art show being put on by his girlfriend [[Alicia Masters (Earth-616)|Alicia Masters]] the gang attempted another brick throwing incident. However this backfired as they were unaware that the alien [[Impossible Man (Earth-616)|Impossible Man]] was posing as the Thing's top hat and deflected the attack.{{r|Marvel Two-In-One #60}} Later when the Thing was moving Alicia out of her apartment, he was attacked by his old foes [[Rance Preston (Earth-616)|Live Wire]] and [[Gary Buser (Earth-616)|Shellshock]]. As the battle slipped into Yancy Street, the Yancy Streeters once again came to the Thing's defense, seeing themselves as the only ones allowed to torment the Thing. After the villains were defeated, the gang secretly painted \"The Thing is a butt-head\" on the back of the moving van.{{r|Marvel Two-In-One #70}} Sometime after this, Ben was contacted by a childhood friend who was concerned of his own son's involvement in the Yancy Street Gang. Ben tracked the gang down to the basement of the apartment he grew up in. After subduing the gang members he told them the story of his own involvement and left them with the hopes it would inspire them to leave the gang and rise above living on poverty stricken Yancy Street.{{r|Thing #1}} When it was publicly announced that his teammate the [[Jonathan Storm (Earth-616)|Human Torch]] was going to marry his ex-girlfriend [[Lyja (Earth-616)|Alicia Masters]], the Thing went to Yancy Street to pace around and sulk. Feeling at least partially sympathetic toward their old foe, the Yancy Streeters dumped garbage on his head and left out mannequins painted up to look like the Torch. In smashing the dummies, the Thing felt better and later went on to be the best man at the wedding.{{r|Fantastic Four #300}}<ref group=\"note\">{{cl|Fantastic Four #358}} revealed that this was not [[Alicia Masters (Earth-616)|Alicia Masters]] but a [[Skrulls|Skrull]] spy named [[Lyja (Earth-616)|Lyja]]. This happened behind the scenes during {{cl|Fantastic Four #265}}</ref> \n\n[[File:Yancy Street Gang from Fantastic Four Vol 1 361.jpg|thumb|Two-Fisted Tommie's Yancy Street Gang.{{r|Fantastic Four #361}}]]\n===Changing With the Times===\nThe Yancy Street Gang has ever been a gang that changed with the times and became more ethnically diverse. A new iteration of the gang consisted of female brawler \"Two-Fisted\" Tommie Boyd, the overweight \"Little\" Larry Lee, \"Smooth\" Manny Meregues a lock pick, the intelligent \"Dictionary\" Dawson, \"Lugwrench\" Lubowski a car hopper, and the percussionist \"Rhythm\" Ruiz. This iteration of the gang shared no less animosity toward the Thing than past incarnations of the gang, however they assisted the Thing in searching Jimmy Sokolowski a Yancy Street native who became addicted to drugs. They ultimately rescued the boy from long time Fantastic Four foe [[Victor von Doom (Earth-616)|Dr. Doom]] who was experimenting on drug addicts in order to find a means of curing their additions, although his experimentation to date were fatal. They managed to save Sokolowski, but Doom escaped.{{r|Fantastic Four #361}} This iteration of the group was later became prime suspects in the murder of a young runaway named Alison Gaulthing. The hero known as [[Vance Astrovik (Earth-616)|Justice]] was hired by the Childwatch Organization to apprehend the Yancy Street Gang and learn what they knew. Justice caught up with the Gang and demanded answers but he was convinced to stand down by the Thing. Ultimately the Gang was turned over to the authorities and when it was determined that they were only witnesses to the murder they were released from custody.{{r|Justice: Four Balance #1}} The gang later was involved in a brawl with the Nomads gang, but their rumble was interrupted by a damaged [[Doombot]] that appeared on Yancy Street, sending both gangs fleeing for their lives. This Doombot was eventually destroyed by the [[New York City Police Department (Earth-616)|NYPD]]'s [[Code: Blue (Earth-616)|Code: Blue]] division.{{r|Thunderstrike #13}} \"Two--Fisted\" Tommie Boyd's iteration of the Gang has not been seen since, their fates are unknown. Sometime later Ben returned to Yancy Street to get Mr. Sheckerberg's forgiveness, only to learn that the pawnshop owner was accusing the Yancy Street Gang of running a protection racked. When Ben confronted the group they humiliated him in their usual ways of humiliation: dumping garbage, firing paint-balls, and tossing stink bombs. Ben eventually learned that the real extortionist was a super-villain by the name of [[Frank Skorina (Earth-616)|Powderkeg]] whom the Thing easily trounced in battle.{{r|Fantastic Four Vol 3 #56}}\n\nBen then began atoning for his past life as a member of the Yancy Street Gang, working for Mr. Sheckerberg every Sunday until the debt he owed was paid off. Giving the Yancy Street Gang more opportunities to play pranks on the Thing, such as an evening where they sprayed him with a fire hose while he was waiting for a city bus. Having amassed a fortune Ben then decided to use his fortune to build a youth center on Yancy Street. The Yancy Streeters initially didn't like this and left a flaming bag of dog crap outside the construction site, tricking Ben into stamping it out. He was then attacked by the [[Peter Petruski (Earth-616)|Trapster]] and [[William Baker (Earth-616)|Sandman]] who were hired by the [[Maggia (Earth-616)|Maggia]] crime family to stop construction.{{r|Thing Vol 2 #5}} Ben stopped the two crooks with the help of [[Peter Parker (Earth-616)|Spider-Man]] and the youth center was eventually finished. When the gang saw that Ben had dedicated the center to his brother Daniel, the Yancy Street Gang declared the building off limits and under their protection.{{r|Thing Vol 2 #6}}\n\n[[File:Fantastic_Four_Vol_1_538_page_16_Yancy_Street_Gang_(Earth-616).jpg|thumb|left|Cee's Yancy Street Gang{{r|Fantastic Four #538}}]]\nLeadership over the Yancy Street Gang shifted over to a young man known only as [[Character Index/C#Cee|Cee]]. During the super-hero [[Civil War (Event)|Civil War]] that saw the government ordering the registration of super-heroes, the Yancy Street gang sided with [[Steven Rogers (Earth-616)|Captain America's]] anti-registration group dubbed the [[Secret Avengers (Civil War) (Earth-616)|Secret Avengers]]. When the Thing heard that a transport of prisoners was going to pass through Yancy Street, he called out the members of the gang and learned this. They refused to stand aside, despite Ben's instances that they might get hurt.{{r|Fantastic Four #538}} The Yancy Streeters were unknowingly provided information by the [[Mad Thinker (Julius) (Earth-616)|Mad Thinker]] and the [[Phillip Masters (Earth-616)|Puppet Master]] who were plotting trick pro and anti-registration heroes into a clash. When the attack happened Ben rushed to their rescue but he was too late to stop it. During the battle Cee was killed in the gunfire prompting the Thing to leave for Europe until the Civil War ended.{{r|Fantastic Four #539}}<ref group=\"note\">The [[Civil War (Event)|Civil War]] ended in {{cl|Civil War #7}}, the [[Benjamin Grimm (Earth-616)|Thing]] returned to America in {{cl|Fantastic Four #543}}.</ref>\n\n[[File:Yancy Street Gang from Fantastic Four Vol 1 584.jpg|thumb|302px|Blue collar Yancy Street Gang.{{r|Fantastic Four #584}}]]\nDuring a recent economic recession the Yancy Street Gang underwent yet another transformation. The gang soon became comprised of blue collar criminals who were former dot-com start-ups, ex-Wall Street traders, and failed hedge fund managers. This version of the Gang encountered Ben Grimm and the Human Torch during a period where Ben briefly reverted back to human form. Despite his lack of physical strength, Ben was still able to send the gang packing.{{r|Fantastic Four #584}} A more generic version of the Gang took over after this. Some of its members actually having a decent relationship with the Thing. Three of the gang ended up playing a poker game with the Thing and the [[X-Men (Earth-616)|X-Man]] known as [[Remy LeBeau (Earth-616)|Gambit]].{{r|A + X #6}} \n\n===Future Foundation===\nMore recently, the Thing discovered that the Yancy Street Gang was using his youth center as a meeting place for a late night fight club. When the Thing tried to break up the fight club he was bowled over by the fleeing youths. This all proved to be an elaborate prank to embarrass the Thing on video and post it online to further humiliate the hero.{{r|Fantastic Four Vol 4 #1}} When the Fantastic Four were about to embark on a mission through time and space, the Thing went to Yancy Street and demanded that the gang look after its people should anything go wrong and he not return.{{r|Fantastic Four Vol 4 #2}} Ben's words proved at least partially right, as the Fantastic Four's year long mission -- which was only supposed to last four seconds in 616 time -- ended up lasting longer as the team ended up getting lost.{{r|FF Vol 2 #2}} \n\nHowever prior to their disappearance, the Fantastic Four put together a replacement team to watch over the [[Future Foundation (Earth-616)|Future Foundation]] in the event things went wrong.{{r|FF Vol 2 #1}} This \"FF\" also consisted of pop-star [[Darla Deering (Earth-616)|Darla Deering]] who took to wearing a robotic exoskeleton resembling the body of the Thing.{{r|FF Vol 2 #1}} By this time the Gang had become more tech-savvy and incorporated hackers Douglas Ray, Jason Carter, and Carlos Hernandez into their group.{{r|FF Vol 2 #6}} [[File:Yancy Street Gang hackers from FF Vol 2 6.jpg|thumb|left|Yancy Street hackers.{{r|FF Vol 2 #6}}]] The Yancy Street Gang took offense to Darla Deering \"posing\" as the Thing and sent one of their typical boobie-trapped parcels to her hotel room after a musical performance. She and her teammate [[Scott Lang (Earth-616)|Ant-Man]] were covered in whipped cream and sparkles while Yancy Streeters -- wearing Thing masks -- snapped photos of the pair before fleeing to [[Times Square]]. They were able to get away thanks to the New Year's Eve celebrations going on at the time, and managed to post the embarrassing photos online.{{r|FF Vol 2 #3}} \n\nThe Gang struck at Darla again during a private acoustic performance by hacking into the contest and ensuring that Yancy Street members were in attendance. During Darla's performance they pelted her with fruit and vegetables forcing her to flee. However Ant-Man stowed away on their bodies and learned the passwords to all their social media accounts and emailed all the information to their rivals in order to force them to stop harassing Deering.{{r|FF Vol 2 #6}} Humbled by this experience the Yancy Street hackers agreed to help hack into Dr. Doom's computer database foiling his plans to destroy the FF along with [[Nathaniel Richards (Kid Immortus) (Earth-6311)|Kid Immortus]] and [[Annihilus (Earth-616)|Annihilus]].{{r|FF Vol 2 #16}}\n\n===[[All-New, All-Different Marvel]]===\nLater, [[Lunella Lafayette (Earth-616)|Lunella \"Moon Girl\" Lafayette]] built a device designed to uncover [[Kree]] technology and used it to find an [[Omni-Wave Projector]] hidden beneath the [[Brooklyn Bridge]] in the [[Financial District]] of [[Manhattan]]. Elsewhere, in the distant past of [[Earth-78411]], a [[New Folk]] named [[Thorn-Teeth (Earth-78411)|Thorn-Teeth]] had also came into possession of an Omni-Wave Projector they called the Nightstone. When [[Coach Hrbek (Earth-616)|Coach Hrbek]] accidentally activated Lunella's device, it opened a portal across space and time from [[Earth|Dinosaur World]] to [[Earth-616]], allowing the [[Killer-Folk (Earth-78411)|Killer-Folk]] to cross over into present day [[New York City]].{{r|Moon Girl and Devil Dinosaur Vol 1 1}} There Thorn-Teeth's tribe engaged in a turf war with the Yancy Street Gang, viciously beating several of them into submission, before claiming Yancy Street as their own territory.{{r|Moon Girl and Devil Dinosaur Vol 1 4}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = <references group=\"note\" />\n\n==Recommended Readings==\n* {{cl|Fantastic Four Vol 1 6}} - BTS; Sent a harassing letter to the Thing.\n* {{cl|Fantastic Four Vol 1 11}} - BTS; Sent a package to the Thing containing a jack-in-box type mechanism that punched him in the face when he opened it.\n* {{cl|Fantastic Four Vol 1 15}} - First Appearance; Pinned a drawing of the Thing wearing a dress to a street sign.\n* {{cl|Fantastic Four Vol 1 20}} - Helped the Fantastic Four evade the [[Owen Reece (Earth-616)|Molecule Man]].\n* {{cl|Marvel Two-In-One Vol 1 6}} - Defaced the [[Fantasti-Car MK II|Fantasti-Car]]. One sign says \"Stamp Out Ugly People\"!\n* {{cl|Fantastic Four Vol 1 244}} - Sent Ben Grimm a Rubik's Cube for his birthday.\n\n| Trivia                  = * In the Silver and Bronze Age, Yancy Street Gang members' faces were rarely shown or they were depicted in shadows.\n* The professional wrestler [[Fatal Finnegan (Earth-616)|Fatal Finnegan]] was once the idol of the Yancy Street Gang.{{r|Fantastic Four Vol 1 15}}\n\n| Links                   = * [http://en.wikipedia.org/wiki/Yancy_Street_Gang Yancy Street Gang on Wikipedia]\n}}\n[[Category:Criminal Organizations]]\n[[Category:Gangs]]"
                }
            }
        }
    ],
    "page_id": "7846"
}