{
    "pageid": 452692,
    "ns": 0,
    "title": "Yellowshirts (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Yellowshirts (Earth-616) from Human Torch Vol 1 4 0001.jpg\n| Name                    = Yellowshirts\n| Aliases                 = \n\n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = [[New York City]], [[Chicago (Illinois)|Chicago]], [[Washington, D.C.]], other locations across the [[United States]]\n\n| Leaders                 = \n| CurrentMembers          = \n| FormerMembers           = \n| Allies                  = \n| Enemies                 = The [[Jeffrey Mace (Earth-616)|Patriot]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Ray Gill; Sid Greene\n| First                   = Human Torch #4\n| Last                    = Human Torch #4\n\n| HistoryText             = The Yellowshirts are a militia that were active in the 1940's that sought to dismantle the United States government and install a totalitarian regime in it's place. The group had a deep hatred of democracy and the rights and freedoms that were the inalienably rights of all Americans. Because they believed Americans considered their type cowardly, they adopted yellow as their color to turn it from a symbol of cowardice to on that was feared. \n\nThe organization apparently had cells all over the United States, including Chicago, Washington D.C., and their primary operations being in New York City. They would prepare a sudden attack on major American cities, planting bombs in buildings and on the day of their invasion would set them off. In the ensuing confusion, the Yellowshirts would take over the cities, starting with taking over the newspaper offices in order to control the media and proliferate propaganda. \n\nOn the day of their attack, New York City would be decimated with a number of bombs placed in various buildings to explode. Soon New York was quickly captured, and the Yellowshirts had taken over the Consolidated News office to spread their message.\n\nThe Yellowshirts were almost successful if not for the costumed hero known as the [[Jeffrey Mace (Earth-616)|Patriot]] who would fight his way and free the Consolidated News from Yellowshirt control. Using the media outlet as a means to rally the people, the Patriot would lead police and military officials to retake their city. Catching up with the Yellowshirt leader, the Patriot would beat him into submission before all. Without their leader, the Yellowshirts crumbled and they were defeated in each city that had attacked.\n\n| Equipment               = The Yellowshirts had communications equipment that allowed them to communicate with each other across the country.\n| Transportation          = The group utilized various trucks and cars to transport themselves. \n| Weapons                 = The Yellowshirts had an arsenal of fire arms as well as access to explosives that could severely damage buildings.\n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}"
                }
            }
        }
    ],
    "page_id": "452692"
}