{
    "pageid": 6697,
    "ns": 0,
    "title": "Young Gods (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Young Gods (Earth-616) from Official Handbook of the Marvel Universe Vol 3 8 0001.jpg\n| ImageSize               = 250px\n| Name                    = Young Gods\n| Aliases                 = \n\n| Status                  = \n| Identity                = Secret\n| Reality                 = Earth-616\n| BaseOfOperations        = [[Madripoor]]; formerly The Celestials' Mothership\n\n| Leaders                 = Formerly [[Mira (Earth-616)|Varua]] (spiritual leader){{r|Avengers #371}}\n| CurrentMembers          = [[Carter Dyam (Earth-616)|Brightsword]], [[Mark Cadmon (Earth-616)|Caduceus]], [[Jahaharel Patel (Earth-616)|Calculus]], [[Catherine Moranis (Earth-616)|Daydreamer]], [[Jason Kimball (Earth-616)|Genii]], [[Chi Lo (Earth-616)|Harvest]], [[Raoul Hernandez (Earth-616)|Highnote]], [[Gregor Buhkarov (Earth-616)|Mindsinger]], [[Kiana (Earth-616)|Moonstalker]], [[Bridget O'Hare (Earth-616)|Sea Witch]], [[Chandra Ku (Earth-616)|Splice]]\n| FormerMembers           = [[Mira (Earth-616)|Varua]]\n| Allies                  = \n| Enemies                 = Fafnir, Gatherers, [[Herbert Wyndham (Earth-616)|High Evolutionary]], [[Nuada (Host) (Earth-616)|Nauda of the Silver Hand]], Quint\n\n| Origin                  = \n| PlaceOfFormation        = Cloud Nine\n| PlaceOfDissolution      = \n| Creators                = Mark Gruenwald; Keith Pollard; Ralph Macchio\n| First                   = Thor #300\n| Last                    = \n\n| HistoryText             = \n===Origins===\nIn 1000 AD, the [[Third Host]] of the [[Celestials]] occurred, during which the Space Gods informed they would return 1,000 years later to judge Earth's right to continue existing. While the pantheons prepared for war, [[Gaea (Earth-616)|Gaea]] planned a peaceful solution to the problem with many goddesses, among them [[Aman Sinaya (Earth-616)|Aman Sinaya]] for the [[Diwatas]]/[[Filippino gods]], [[Amaterasu (Earth-616)|Amaterasu]] of the [[Amatsu-Kami]]/[[Shinto gods]], [[Ameretat (Earth-616)|Ameretat]] of the [[Yazatas]]/[[Zoroastrian gods]], [[Ay (Earth-616)|Ay]] of the [[Tenger]]/[[Mongolian gods]], [[Chalchiuhtlique (Earth-616)|Chalchiuhtlique]] of the [[Teteoh]]/[[Aztec gods]], [[Haumea (Earth-616)|Haumea]] of the [[Akua]]/[[Oceanic gods]], [[Hera Argeia (Earth-616)|Hera]] of the [[Olympians]]/[[Graeco-Roman gods]], [[Isis (Deity) (Earth-616)|Isis]] of the [[Ennead]]/[[Heliopolitans]]/[[Egyptian gods]], [[Ixchel (Ahau) (Earth-616)|Ixchel]] of the [[Ahau]]/[[Mayan gods]], [[Julunggul (Earth-616)|Julunggul]] of the [[Aboriginal gods]], [[Lada (Earth-616)|Lada]] of the [[Dievas]]/[[Slavic gods|Slavic]]/[[Russian gods]], [[Lahamu (Earth-616)|Lahamu]] of the [[Annunaki]]/[[Mesopotamian gods]], [[Mahu (Earth-616)|Mahu]] of the [[Vodū|African gods]], [[Mama Cocha (Earth-616)|Mama Cocha]] of the [[Apu]]/[[Incan gods]], [[Mielikki (Earth-616)|Mielikki]] of the [[Jumala]]/[[Finnish gods]], [[Morrigan (Earth-616)|Morrigan]] of the [[Tuatha de Danaan]]/[[Celtic gods]], [[Nelvanna (Earth-616)|Nelvanna]] of the [[Inua]]/[[Northern gods]], [[Wiininwaa (Earth-616)|Wiininwaa]] of the [[Manidoog]]/[[Native American gods]], [[Xi Wangmu (Earth-616)|Xi Wangmu]] of the [[Xian]]/[[Taoist gods|Taoist]]/[[Chinese gods]], [[Ungnyeo (Earth-616)|Ungnyeo]] of the [[Shin (Korean Gods)|Shin]]/[[Korean gods]], [[Freyja Freyrdottir (Earth-616)|Frigga]] and [[Sigyn (Earth-616)|Sigyn]] of the [[Asgardians]]/[[Norse gods]], and [[Saraswati (Daeva) (Earth-616)|Saraswati]], [[Parvati (Earth-616)|Parvati]] and [[Lakshmi (Earth-616)|Lakshmi]] of the [[Daevas]]/[[Hindu gods|Hindu]]/[[Vedic gods]].<!-- {{r|Official Handbook of the Marvel Universe A-Z Update #1|; [[Young Gods (Earth-616)|Young Gods]]' entry}} -->\n\nFor the next thousand years, they searched for humans representing mankind's highest ideals, to be offered to the Celestials as an offering. The goddesses placed the candidates in suspended animation, with their superhuman potential (legacy of the [[First Host]]) awakened.{{r|Official Handbook of the Marvel Universe A-Z Update #1|; [[Young Gods (Earth-616)|Young Gods]]' entry}}\n\nThe candidates were Kiana from Alaska (11th century), Bridget O'Hare from Ireland (12th century), Mira from Ruk Island (15th century), Gregor Buhkarov from Russia (18th century), Chandra Ku from Africa (also 18th century), Catherine Moranis from Ottawa (19th century), Raoul Hernando from Colombia (also 19th century), Mark Cadmon from Chicago (1919), and Jawaharel Patel from India (1948). These 9 \"Young Gods\" were kept in suspended animation and kept watch over by the goddesses until the Fourth Host's arrival.\n\n[[Heimdall (Earth-616)|Heimdall]] and [[Kamorr (Earth-616)|Kamorr]] were charged by [[Odin]] to gather the last three of the Young Gods, and found two thirds in Carter Dyam, an Israeli soldier, and Chi Lo, a Japanese fisherwoman. They brought them to New York while they sought out the last of the Young Gods.{{r|Thor #203}}\n\nHeimdall and Kamorr met Jason Kimball, and saved him from Baker, a man he owed money to. They brought Kimball away with them.{{r|Thor #202}}\n\nHeimdall and Kamorr brought Kimball, Dyam and Lo to the scene of a battle between Thor and Ego-Prime. When Ego-Prime attempted to destroy Thor and his comrades with a blast of energy, its energies were instead drained into Kimball, Dyam and Lo, unlocking their godly potential. They were then brought up into Asgard by Odin to prepare them for the coming of the Fourth Host.{{r|Thor #203}}\n\nKimball, Dyam and Lo were sought out in Asgard by the Warriors Three, as the time for them to join the other Young Gods had arrived. Fafnir confronted the Warriors Three during their mission, but the three Young Gods saved them.{{r|Thor #291}}\n\nEach of the Young Gods were chosen among billions as the finest examples to embody the noblest of humanity’s achievements according to the perceptions of the Gods of Earth and the highest ideals humans can aspire to. These included Philosophy (Daydreamer), Spiritual Consciousness (Varua), Music (Highnote), Sailing (Sea Witch), Warriorship (Brightsword), Artistry (Genii), Medicine/Physicianship (Caduceus), Farming (Harvest), Science (Calculus), Hunting (Moonstalker), Poetry (Mindsinger), and Craftsmanship (Splice). The 12 assembled Young Gods were presented to the Celestials by Gaea, and Arishem the Judge determined that, based on them, humanity should endure. The Young Gods were all taken aboard the Celestial Mothership with the Fourth Host to be mentored in the lessons of godhood.{{r|Thor #300}} The Young Gods were placed into the charges of Juniper and Katos. Juniper taught Sea Witch, Highnote, Daydreamer, Mindsinger, Brightsword, and Splice in the ways of offense, while Katos trained Varua, Genii, Moonstalker, Calculus, Harvest, and Caduceus in defense.{{r|Spectacular Spider-Man Annual #8}}\n\nWhile the Young Gods were training aboard the mothership, they were spied upon by the High Evolutionary and Daydreamer became convinced that they should become involved to protect humanity from his intentions. Mindsinger, Daydreamer, Brightsword, Splice, Sea Witch, and Highnote all set off to Earth and fought Quint and the Gatherers alongside Spider-Man, until Calculus, Varua, Genii, Harvest, Moonstalker, and Caduceus came after them and the two sides fought each other, until Daydreamer accidentally harmed Calculus with her powers. After Caduceus healed Calculus, the Young Gods all stood down and returned to the mothership.{{r|Spectacular Spider-Man Annual #8}}\n\nMindsinger, Daydreamer, Harvest, Varua, Genii and Brightsword visited Jerusalem, Israel, to investigate a psychic presence Daydreamer had detected. They discovered an artificial creature powered by the emotions of the people there, but Varua, Harvest and Mindsinger were able to form a Uni-Mind and cut it off from the emotional energies, forcing it to consume itself and die. Daydreamer examined the creature's remains and determined that it had been sent by one of the gods from Earth's pantheons.{{r|Spectacular Spider-Man Annual #8}}\n\nCalculus manipulated the Space Phantom, Avengers and Spider-Man into removing the threat of the \"black cloud\" (black insect swarm) from Earth, using mathematical probabilities to manipulate the outcome. Only Spider-Man was aware of Calculus' involvement.{{r|Spectacular Spider-Man #168|170}}\n\nWhen Sea Witch had a prophetic dream, Daydreamer and Varua determined that it was related to the encounter they had had in Israel before, and the Celestials permitted them to return to Earth and investigate. They split into three teams, visiting Sri Lanka, Ireland, and Central Bend, Wisconsin. The rogue god Nauda proved to have been the creature's master, and was seeking 3 mystical stones, two of which were found by the Young Gods in Central Bend and Ireland. Nauda captured the Sri Lanka team and forced the others to surrender themselves and the stones to him, but Daydreamer created illusionary stones instead. They were able to destroy Nauda by becoming a Uni-Mind, and Caduceus destroyed his stones.{{r|Marvel Comics Presents #101|109}}\n\nVarua was captured by the Deviants and forced by a brain-mine to create a Uni-Mind to power Ghaur, but the Black Knight set her free from their control.{{r|Avengers #370|371}}\n\n===Return to Earth===\nThe Young Gods eventually went mad due to the Celestials' ambivalence towards them, and Varua led them back to Earth to force all of humanity into a single [[Panhuman Uni-Mind (Earth-616)|Panhuman Uni-Mind]]. Varua had convinced herself that the Celestials wanted the Young Gods to create a new Celestial (named Terran) by building a Celestial armor and housing humanity's collective consciousness inside it, while killing the human bodies left behind. Their crazed scheme was opposed by the Eternals, and [[Legba (Eternal) (Earth-616)|Legba]] managed to make Varua doubt herself long enough for her to become vulnerable and then killed her, rendering the rest of the Young Gods catatonic and immobile. Their current status is unknown, but the Eternals discussed on whether to break the Young Gods down to their component atoms and take them back to Olympia for study or toss their bodies into the sea.{{r|Eternals Annual Vol 4 1}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n*[http://marveldirectory.com/groupsandteams/younggods.htm Young Gods at Marvel Directory] \n*[http://www.marvunapp.com/Appendix2/younggods.htm Young Gods at the Marvel Appendix]\n}}"
                }
            }
        }
    ],
    "page_id": "6697"
}