{
    "pageid": 67088,
    "ns": 0,
    "title": "Young Allies (WWII) (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Quotation               = We fight together through stormy weather/We're out to lick crooks and spies!/We won't be topped and we can't be stopped/We are the Young Allies! YAHOO!\n| Speaker                 = [[Young Allies (WWII) (Earth-616)|Battle cry of the Young Allies]]<ref>First chanted in {{cl|Young Allies #2}}</ref>\n| Image                   = Captain America Forever Allies Vol 1 2 Textless.jpg\n| Name                    = [[Young Allies]]\n| Aliases                 = \n| Status                  = Defunct\n| Identity                = Public\n\n| Reality                 = Earth-616\n| BaseOfOperations        = Mobile\n| Leaders                 = Formerly [[James Buchanan Barnes (Earth-616)|Bucky]], [[Thomas Raymond (Earth-616)|Toro]]\n| CurrentMembers          = \n| FormerMembers           = \n[[James Buchanan Barnes (Earth-616)|Bucky (James Barnes)]], [[Thomas Raymond (Earth-616)|Toro]], [[Patrick O'Toole (Earth-616)|Knuckles]], [[Geoffrey Vandergill (Earth-616)|Jeff]], [[Henry Tinkelbaum (Earth-616)|Tubby]], [[Washington Jones (Earth-616)|Whitewash Jones]], [[Fred Davis Jr. (Earth-616)|Bucky (Fred Davis)]]\n| Allies                  = [[Steven Rogers (Earth-616)|Captain America (Steve Rogers)]], [[Jim Hammond (Earth-616)|Human Torch]], [[Namor McKenzie (Earth-616)|Sub-Mariner]]\n| Enemies                 = [[Johann Shmidt (Earth-616)|Red Skull]], [[Lady Lotus (Earth-616)|Lady Lotus]], [[Walking Dead (Criminals) (Earth-616)|Walking Dead]], [[Big Boy Bates (Earth-616)|Big Boy Bates]], [[National Socialist German Workers Party (Earth-616)|Nazis]]\n| Origin                  = The Young Allies were a group of patriotic young Americans banded together as part of [[Steven Rogers (Earth-616)|Captain America's]] [[Glossary:Sentinels of Liberty|Sentinels of Liberty]]. Eventually a formal group was gathered by [[James Buchanan Barnes (Earth-616)|\"Bucky\" Barnes]] which included [[Patrick O'Toole (Earth-616)|Patrick \"Knuckles\" O'Toole]], [[Washington Jones (Earth-616)|Washington \"Wash\" Jones]], [[Geoffrey Vandergill (Earth-616)|Geoffry \"Jeff\" Vandergill]], [[Henry Tinkelbaum (Earth-616)|Henry \"Tubby\" Tinklebaum]], and [[Thomas Raymond (Earth-616)|Toro]]{{r|Young Allies Comics 70th Anniversary Special #1}}.\n| PlaceOfFormation        = [[New York City]], [[New York (State)|New York]]\n| PlaceOfDissolution      = \n| Creators                = Stan Lee; Charles Nicholas\n| First                    = Young Allies Vol 1 1\n| First2                    ={{g|Fictional Story}}<br>{{sld|Young Allies Comics 70th Anniversary Special #1}}{{g|First real apparence}}\n\n| HistoryText             =\n=== Preface: Truth and Fiction ===\nIt has been revealed that a lot of the Young Allies wartime adventures were made into a comic book as propaganda for the United States to earn support in the war effort, especially among young impressionable people. The comic book, while based on true events where often times embellished, and sensationalized.\n\nFurther, to \"protect\" the identities of the Young Allies (however, in later years, Bucky would suspect it was to avoid having to pay out royalties for the use of their likenesses) were all portrayed as caricatures of themselves, and were all portrayed as being young adolescents around the age of 12 while in real life they were in their late teens to early adult hood and eventually became old enough to enlist in the military and see action in the battle field{{r|Young Allies Comics 70th Anniversary Special #1}}.\n\nWhile Bucky and Toro were portrayed not unlike their true selves, they were childish in their demeanor and would constantly feud over [[Steven Rogers (Earth-616)|Captain America]] or the [[Jim Hammond (Earth-616)|Human Torch]] being the better super-hero to be the sidekick far. The most moderate parody of the groups membership was that of Geoffry Vandergill, dubbed \"Jeff\" in the comic book he was a verbose young man who was the brains of the group. Next was Henry Tinklebaum who was dubbed \"Tubby\", and his weight and desire to eat over exaggerated. Percival O'Toole's, dubbed \"Knuckles\" had his Irish-American, Lower Class New Yorker background played up to the point of stereotype. The most unfair interpretation of any of the Young Allies in their comic book adaptation was that of Washington Jones. Dubbed \"Whitewash Jones\" his character was a racial stereotype on the same key of a minstrel show, while socially acceptable at the time of publication, this depiction is considered highly racist by todays standards. \n\nThe fictional accounts of the Young Allies are the most complete record of their activities during World War II, however how much of these tales are fiction and how much are truth have yet to be completely chronicled. For the purposes of clarity between what is known to be fully factual and what is regarded as sensationalized fiction, both will be addressed separately in this profile.\n\n=== Real Life History ===\nFollowing the formation of the Young Allies, one of their first adventures involved a battle against the forces of the Red Skull. Before the most feared Nazi soldier could capture them they would be aided by the timely arrival of Captain America and the Human Torch{{r|Young Allies Comics 70th Anniversary Special #1}}.\n\nThe group later assisted Captain America in locating a secret German Bund in the United States that was intimidating German-American immigrants into supporting the Nazi cause. Thanks to the group's assistance, Captain America was able to shut the operation down{{r|Captain America Comics #5}}.\n\nIn 1943, the Young Allies were sent to Hollywood California for a war bond drive. The rally was soon marred by an panic caused by Bucky and Toro's foe [[Lady Lotus (Earth-616)|Lady Lotus]], and they soon broke up the panic{{r|Captain America: Forever Allies #1}}. The Allies were then ordered by the military to report to Democracy Pictures to participate in a film that was in support of the war. They were once more targeted by Lady Lotus who hypnotized actors to attack them, and then took Toro under her control{{r|Captain America: Forever Allies #2}}. Capturing the team, Lady Lotus hypnotized the rest of the group and as part of her plan to take over the American west coast sent the group in a B-17 and P-40 to attack Muroc Army Airfield. However, Washington Jones snapped out of Lady Lotus' control and managed to help the others break free from her mind control{{r|Captain America: Forever Allies #3}}. They would get the air fields participation in a ruse that made it appear their attack was a success. Pretending to still be under the control of Lady Lotus, the Young Allies got close enough to attack her. During the battle, Toro managed to knock a crystal that Lotus was using to boost her powers and it was subsequently swallowed up in the Earth. Lady Lotus then fled, vowing to get revenge against the Young Allies someday{{r|Captain America: Forever Allies #4}}.\n\nBy 1944, the Young Allies had mostly split up. Bucky and Toro would be busy working with Captain America and the Human Torch, O'Toole and Jones would enlist in the military and serve in action, while Geoffrey and Henry would join the OSS and operate as spies trying to root out [[National Socialist German Workers Party (Earth-616)|Nazi]] operatives still active in France following it's liberation by Allied Forces. \n\nMeeting each other in Paris, they would go into action one more time when Geoffrey would spot Hauptman Kleinschmidt and they would attempt to capture him. Easily gunning down his men, the Young Allies would chase the fleeing Kleinschmidt. When Bucky would hop aboard his speeding truck causing it to crash, killing Kleinschmidt. That was the last time the group would be together{{r|Young Allies Comics 70th Anniversary Special #1}}.\n\n=== Fictional History ===\nThe Fictional exploits of the Young Allies are lengthy; as such, to learn more about them, see the [[Young Allies (WWII) (Earth-616)/Fictional History|Fictional History of the Young Allies]].\n\n=== After the War ===\nAfter the war the Young Allies drifted apart but always stayed in touch. Geoffry would go on to work for Naval intelligence after the war, and then ultimately join the government agency which became the CIA. Official records state that he died heroically serving his country in Indochina (modern day Vietnam). The details of his death are unrevealed. Hank would leave government service and get into business and would live a successful life until one day in 1984 he was tragically struck by a bus{{r|Young Allies Comics 70th Anniversary Special #1}}.\n\nToro would survive well into the modern age, he would be put under the control of the [[Mad Thinker (Julius) (Earth-616)|Mad Thinker]] and set to attack his old wartime ally the [[Namor McKenzie (Earth-616)|Sub-Mariner]]. Toro would snap out of the Mad Thinker's control and would sacrifice his life to stop the Thinker{{r|Sub-Mariner #14}}.\n\nBucky would seemingly perish attempting to stop a drone plane launched by [[Heinrich Zemo (Earth-616)|Baron Zemo]] on April 18, 1945. However, Bucky would be recovered by the Russians and converted into their assassin the Winter Soldier. He would be placed in suspended animation over the ensuing decades. Ultimately, Bucky would have his memories restored and would take on the title of Captain America following the seeming death of Steve Rogers.\n\nSurviving well into the modern era would be both Washington and Patrick, both would marry and have children and grandchildren. After the was Washington would reenlist into the Air-Force and see action in the Korean War. He would be retired at the rank of Colonel. O'Toole would continue in the army and make the rank of Sergeant ultimately becoming a drill instructor until he retired. In his retirement O'Toole would open a bar which he would run until he was too ill to do so and would leave his grandson to operate it.\n\nLearning that Washington and Patrick were still alive, James would track them down to the hospital room where Percival were spending his final days. After reminiscing about the old days and catching up on lost time, the three surviving Young Allies would drink from a bottle of brandy that was being saved for the sole survivor of the group to enjoy. After their one drink Patrick would die peacefully in his sleep. Shortly thereafter Washington would die following a march at an military inaugural.\n\nAll the Young Allies have been put to rest in the [[Arlington National Cemetery]] in [[Arlington County|Arlington]], [[Virginia (State)|Virginia]]. It would be visited by James -- as Captain America -- who would dump out the remainder of the bottle of brandy on their grave in honor of his old friends. The grave also marks Bucky's supposed death in 1945, which James has chosen not to have correct as he feels that the Bucky he was during the war died a long time ago{{r|Young Allies Comics 70th Anniversary Special #1}}.\n\n=== Legacy ===\nThe [[Young Allies (Modern) (Earth-616)|Young Allies]] name would be used again when a group of youthful modern heroes would band together to fight the [[Bastards of Evil (Earth-616)|Bastards of Evil]], a youthful gang of super-villains. After they succeeded in defeating the Bastards, Namor himself would suggest that the group name themselves after the old wartime youths{{r|Young Allies Vol 2 #1}}. \n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n* http://www.internationalhero.co.uk/y/youngallies.htm\n* http://www.toonopedia.com/ynallies.htm\n* http://en.wikipedia.org/wiki/Young_Allies_(Marvel_Comics)#Golden_Age\n}}\n\n==References==\n{{Reflist}}\n[[Category:Allied Organizations]]"
                }
            }
        }
    ],
    "page_id": "67088"
}