{
    "pageid": 826165,
    "ns": 0,
    "title": "Zefiro Clan (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Organization Template\n| Image                   = Victor von Doom (Earth-616) from Books of Doom Vol 1 6 0001.jpg\n| Name                    = Zefiro Clan\n| EditorialNames          = \n| Aliases                 = \n\n| Leaders                 = [[Victor von Doom (Earth-616)|Victor von Doom]]\n| CurrentMembers          = [[Boris Karela (Earth-616)|Boris]]\n| FormerMembers           = [[Werner von Doom (Earth-616)|Werner von Doom]], [[Cynthia von Doom (Earth-616)|Cynthia von Doom]], [[Valeria (Latverian) (Earth-616)|Valeria]] (deceased)\n\n| Identity                = Public\n| Affiliation             =\n| Allies                  = \n| Enemies                 = [[Fantastic Four (Earth-616)|Fantastic Four]], [[Vladimir Fortunov (Earth-616)|King Vladimir Fortunov]], [[Rudolfo Haasen (Earth-616)|Prince Rudolfo Haasen]], [[Zorba Fortunov (Earth-616)|King Zorba Fortunov]], [[Dimitri Fortunov (Earth-616)|Dimitri Fortunov]]\n\n| Origin                  = A Romani tribe native to the nation of Latveria\n| Reality                 = Earth-616\n| Status                  = Active\n| BaseOfOperations        = [[Doomstadt]], [[Latveria]]\n| PlaceOfFormation        = [[Latveria]]\n| PlaceOfDissolution      = \n\n| Creators                = Stan Lee; Jack Kirby\n| First                   = Fantastic Four Annual #2\n\n| History                 = The Zefiro are a band of Romani that are native to the nation of [[Latveria]]. For years they were persecuted and marginalized by Latverian ruler [[Vladimir Fortunov (Earth-616)|King Vladimir Fortunov]].{{r|Fantastic Four Annual #2}} Notable Zefiro during this period were healer [[Werner von Doom (Earth-616)|Werner von Doom]] and his wife [[Cynthia von Doom (Earth-616)|Cynthia]] a practitioner of magic. The gave birth to their son [[Victor von Doom (Earth-616)|Victor von Doom]] shortly before Cynthia's death.{{r|Fantastic Four Annual #2}} Cynthia became fed up with the constant persecution of her people and made a pact with the demon [[Mephisto (Earth-616)|Mephisto]] for more power in exchange for her soul. The spell gave her power and she wiped out an entire town, including its women and children, something that horrified Cynthia. She later fell by one of the King's soldiers.{{r|Doctor Strange and Doctor Doom: Triumph and Torment Vol 1 1}} Other prominent Zefiro's were Werner's best friend [[Boris Karela (Earth-616)|Boris]]{{r|Fantastic Four Annual #2}} and his granddaughter [[Valeria (Latverian) (Earth-616)|Valeria]],{{r|Marvel Super-Heroes #20}} whom was friends and later the lover of Victor. Years later, Werner was asked by the King to try and cure his wife of cancer. When he failed he took himself and Victor into the Latverian Alps to flee retribution. While they escaped imprisonment, by the time Boris and the others found them, Werner had suffered severe frostbite and later died of exposure. Before his death, Werner had Boris promise to look after Victor. Furious over the death of his parents, Victor found his mothers trunk of arcane objects and began studying both magic and science. He became a thorn in the king's side for years until he was asked to study at [[State University (Hegeman)|State University]] in America. \n\nThere Victor became obsessed with contacting the afterlife resulting in an accident that scared his face. He later returned to Latveria in an iron suit and calling himself Doctor Doom.{{r|Fantastic Four Annual #2}} With his advanced skills in science and sorcery he gathered his people together and overthrew the King, slaying him and taking over Latveria for his own.{{r|Books of Doom #6}} During Doom's long rule of the country,the Zefiro were no longer persecuted and likely disbursed among the general population. To this day Boris remains ever faithful to Doom. While Valeria was recently killed by Doom and her skin fashioned into a suit of enchanted armor.{{r|Fantastic Four Vol 3 67}}\n| Equipment               = \n| Transportation          = Prior to Doom taking over Latveria, the Zefiro traveled by horse drawn wagons.\n| Weapons                 = Prior to Doom taking over Latveria, the Zefiro were armed with knives, pitchforks, small fire arms and hunting rifles.\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Latverian Organizations]]\n[[Category:Romani]]"
                }
            }
        }
    ],
    "page_id": "826165"
}