{
    "pageid": 905813,
    "ns": 0,
    "title": "Zodiac (Jacobs') (Earth-616)",
    "revisions": [
        {
            "slots": {
                "main": {
                    "contentmodel": "wikitext",
                    "contentformat": "text/x-wiki",
                    "*": "{{Marvel Database:Team Template\n| Image                   = Zodiac (Jacobs') (Earth-616) from Amazing Spider-Man Vol 4 5 001.jpg\n| ImageSize               = 250px\n| Name                    = Zodiac\n| EditorialNames          = \n| Aliases                 = Lords of the Zodiac{{r|Amazing Spider-Man Vol 4 1}}\n\n| Status                  = Defunct\n| Identity                = Public\n| Reality                 = Earth-616\n| BaseOfOperations        = \n\n| Leaders                 = Formely [[Vernon Fury (Earth-616)|Scorpio]]\n| CurrentMembers          = \n| FormerMembers           = '''First version:''' [[Aquarius (Jacobs' Zodiac) (Earth-616)|Aquarius]], [[Aries (Jacobs' Zodiac) (Earth-616)|Aries]], [[Cancer (Jacobs' Zodiac) (Earth-616)|Cancer]], [[Capricorn (Jacobs' Zodiac) (Earth-616)|Capricorn]], [[Gemini (Sarah) (Earth-616)|Gemini]], [[Leo (Jacobs' Zodiac) (Earth-616)|Leo]], [[Libra (Jacobs' Zodiac) (Earth-616)|Libra]], [[Pisces (Jacobs' Zodiac) (Earth-616)|Pisces]], [[Sagittarius (Jacobs' Zodiac) (Earth-616)|Sagittarius]], [[Taurus (Jacobs' Zodiac) (Earth-616)|Taurus]], [[Virgo (Jacobs' Zodiac) (Earth-616)|Virgo]]\n'''Second version:''' [[Cancer (Terry) (Earth-616)|Cancer]], [[Gemini (Jacobs' Zodiac, second) (Earth-616)|Gemini]], [[Burt Richardson (Earth-616)|Leo]], [[Pisces (Jacob's Zodiac, second) (Earth-616)|Pisces]], [[Taurus (Jacob's Zodiac, second) (Earth-616)|Taurus]]\n| Allies                  = [[Lian Tang (Earth-616)|Lian Tang]]\n| Enemies                 = [[Peter Parker (Earth-616)|Spider-Man]], [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]]\n\n| Origin                  = \n| PlaceOfFormation        = \n| PlaceOfDissolution      = \n| Creators                = Dan Slott; Giuseppe Camuncoli\n| First                   = Amazing Spider-Man Vol 4 1\n| Last                    = Amazing Spider-Man Vol 4 11\n\n| Quotation               = <big>'''We are the Zodiac! We are the future!'''</big>\n| Speaker                 = [[Pisces (Jacobs' Zodiac) (Earth-616)|Pisces]]\n| QuoteSource             = Amazing Spider-Man Vol 4 1\n\n| HistoryText             = This new iteration of the [[Zodiac]] was assembled by [[Vernon Fury (Earth-616)|Vernon Jacob Fury]], best known as the businessman Vernon Jacobs, the biggest share-holder and investor of [[Parker Industries (Earth-616)|Parker Industries]]. Using resources and money from the company, Jacobs funded his operations in the Zodiac, with his sights set on world domination. Vernon used [[Gemini (Sarah) (Earth-616)|Gemini]], who could see one day ahead into the future, to stay ahead of [[Strategic Homeland Intervention, Enforcement and Logistics Division (Earth-616)|S.H.I.E.L.D.]] and obtain his fortune.{{r|Amazing Spider-Man Vol 4 10}}\n\nAfter four failed attempts from the Leo Sect to steal Parker Industries' secure servers, which were linked to every [[Webware]] account across the globe, from their [[Shanghai]] branch, the Pisces Sect attacked [[Peter Parker (Earth-616)|Peter Parker]] directly when he was at a wedding to get his personal Webware, which included special privileges and access to restricted data caches. In order to protect innocent lives, Parker gave [[Pisces (Jacobs' Zodiac) (Earth-616)|Pisces]] what he was looking for. However, with its data encrypted, Parker hoped that would buy him enough time to track the device down.{{r|Amazing Spider-Man Vol 4 1}}\n\nParker's Webware was taken to the Aquarius Base, where [[Cancer (Jacobs' Zodiac) (Earth-616)|Cancer]] started to decrypt it, with [[Aquarius (Jacobs' Zodiac) (Earth-616)|Aquarius]]' oversight. Spider-Man and the [[Hobie Brown (Earth-616)|Prowler]] inflitrated the base to recover the Webware. When they were discovered, Aquarius sent all of its stored data, which was still encrypted, to every Zodiac base around the globe. While Zodiac got the data, the transfer allowed S.H.I.E.L.D. to pin point the locations of the other bases.{{r|Amazing Spider-Man Vol 4 2}}\n\nS.H.I.E.L.D. got ready to launch a coordinated global strike on the bases, but Gemini's premonitions allowed Scorpio to know of this. With the data decrypted, Scorpio managed to shut down the Parker-tech on the [[S.H.I.E.L.D. Helicarrier]] and take them by surprise together with [[Taurus (Jacobs' Zodiac) (Earth-616)|Taurus]], [[Aries (Jacobs' Zodiac) (Earth-616)|Aries]], and several minions. During the assault, Scorpio disintegrated [[Leo (Jacobs' Zodiac) (Earth-616)|Leo]], who had been captured by S.H.I.E.L.D. after his final failed attempt early on.{{r|Amazing Spider-Man Vol 4 3}}\n\nEvery Zodiac base in the world was then attacked by S.H.I.E.L.D., but several of them were found out to be phonies.{{r|Amazing Spider-Man Vol 4 4}} The distribution of the fake bases allowed the Zodiac to piggyback from S.H.I.E.L.D.'s global scan, as they had managed to hack into S.H.I.E.L.D.'s defenses. Using the scans, the Zodiac found the location of an item they were looking for, the [[Zodiac Grand Orrery]] inside the [[Rosetta Stone (Item)|Rosetta Stone]] in the British Museum. Investigating the Zodiac's move, Spider-Man managed to track them down, but he failed to prevent Scorpio from fulfilling his goal. As part of a contingency plan to escape, Scorpio triggered a kill switch inside the other members of the Zodiac. Using an antitoxin derived from the Zodiac's past uses of suicide by poison, Spider-Man saved them all, but at the cost of letting Scorpio escape.{{r|Amazing Spider-Man Vol 4 4}}\n\nWhen Spider-Man flew to space to hack S.H.I.E.L.D.'s satellites in hopes of finding the search program Scorpio used for the Orrery, which could be used against Scorpio this time, Jacobs reprogrammed the satellites and changed their trajectory to hit the hero, but he failed as the satellites were ultimately destroyed. After having learned the location of the Orrery, Spider-Man landed from space into Paris. During that time, the planets in the Orrery aligned, revealing a new constellation in the sky, the thirteenth sign of the spider.\n\nScorpio followed Spider-Man to the crash site where he had landed, and tried to kill him, but the Parisians stood in his way. Scorpio left Spider-Man and caught the Channel Tunnel to England with the new [[Gemini (Jacobs' Zodiac, second) (Earth-616)|Gemini]], and used special headwear to transform two staff members into the new [[Cancer (Terry) (Earth-616)|Cancer]] and [[Burt Richardson (Earth-616)|Leo]]. Spider-Man followed Scorpio, but he managed to get the Wall-Crawler off his back.\n\nWith Scorpio out of his reach, Spider-Man focused on investigating the results from hacking the S.H.I.E.L.D. satellites, and discovered Scorpio's true identity. Scorpio then intercepted a holographic call between Spider-Man and his allies, and threatened to use the influence he had over Parker Industries to sink the company to the ground if they tried to stop him.{{r|Amazing Spider-Man Vol 4 10}}\n\nJacobs and his group made their way to the Royal Observatory in Greenwich, recruiting a new [[Taurus (Jacobs' Zodiac, second) (Earth-616)|Taurus]] and [[Pisces (Jacobs' Zodiac, second) (Earth-616)|Pisces]] along the way. There, he put the Orrery right in the Prime Meridian. This caused all 12 Zodiacal constellations to form in the sky and to burn in the ground. This revealed a cave that contained a door that led to a whole year worth of future knowledge. Scorpio planned to use all this knowledge to take over the world, the way he used only one day to outsmart S.H.I.E.L.D.<!-- {{r|Amazing Spider-Man Vol 4 11}} -->\n\nSpider-Man and his allies arrived to stop him, but Scorpio used the Key to knock out everyone in the battle, even the other Zodiac members. Scorpio went into the cave and started to absorb the next year of knowledge, but Spider-Man went behind his back and pushed him to the other side, then closed it with the Key, presumably sending him a year into the future. After he disappeared, the Zodiac members were freed from the mind control masks, causing them to abandon Scorpio's cause.{{r|Amazing Spider-Man Vol 4 11}}\n\n| Equipment               = \n| Transportation          = \n| Weapons                 = \n\n| Notes                   = \n| Trivia                  = \n| Links                   = \n}}\n[[Category:Terrorist Organizations]]"
                }
            }
        }
    ],
    "page_id": "905813"
}